{
    "ingredients": {
        "Pizza Toast": "bell pepper,capsicum,onion,tomato,",
        "Pizza Burger": "aloo,capsicum,carrot,coriander,corn,cornflour,flour,garlic,ginger,onion,potato,tomato,tomato sauce,"
    },
    "recipe_url": {
        "Pizza Toast": "https://www.indianhealthyrecipes.com/bread-pizza-recipe/",
        "Pizza Burger": "https://hebbarskitchen.com/pizza-burger-recipe-burger-pizza/"
    },
    "Recipe": {
        "Pizza Toast": "Ingredients: , For more pizza recipes, you can check, Pizza recipe, , , , More, Bread snacks recipes, Bread upma, Bread pakora, Besan bread toast, , , Photo Guide, , How to Make Bread Pizza (Stepwise photos), , Make sauce or skip to use store bought, , 1.Skip this section if you have already have the sauce. Pour 1 tablespoon oil to a pot or pan and heat it. Add 2 to 3 chopped garlic and saute for 30 to 60 seconds until aromatic. If using onions (optional), add 1 small chopped onion and saute until golden. Next stir in ¼ to ½ teaspoon red chilli flakes., , , , 2. Saute for 20 seconds., , , , 3. Add 3 medium tomatoes (250 grams) finely chopped or pureed., , , , 4. Stir ¼ teaspoon salt & 1 teaspoon sugar., , , , 5. Cover the pot partially. Cook on a medium flame until most of the moisture in tomatoes evaporates and turns thick., , , , 6. Then add ½ to ¾ teaspoon mixed Italian herbs and ¼ teaspoon crushed black pepper., , , , 7. Mix well and taste test. Add more salt and herbs if needed. Turn off when the sauce turns thick. Cool this slightly., , , , Bake pizza bread in oven, , If making in oven prepare a baking tray with a parchment paper or foil. Preheat the oven to 430 F or 220 C for 15 mins. Place the bread slices in the tray., , Spread pizza sauce as much as you desire. Place the veggies of your choice and then layer the cheese. Sprinkle herbs. Keep the tray in a preheated oven in the middle rack. Bake/ grill for 8 mins at 430 F or 220 C., , Adjust the grill time as needed. The veggies get grilled partially and the cheese melts and turns golden. Serve bread pizza hot as a snack or breakfast., , Make bread pizza on griddle, , 1. Grease a pan lightly with few drops of oil or little butter., , , , 2. Toast the bread slices slightly on one side. This is optional but prevents the bread from getting soggy., , 3. Flip them to the other side. Turn off the stove and remove them to a tray or board. If you leave them on the pan, they will begin to toast now., , , , 4. Smear pizza sauce as desired. You can also use ketchup, pesto or any of your favorite sauce. Layer onions, bell peppers, tomatoes and olives as desired., , , , 5. Next spread grated cheese as much as you like. You can use mozzarella cheese or a combination of any 2 or more., , 6. Sprinkle herbs and red chili flakes as desired. Place them on the pan., , , , 7. Cover the pan and cook on a low heat until the cheese melts., , , , 8. Make sure you don’t burn the bread at the bottom. Remove it when the cheese melts., , , , Serve bread pizza hot as a snack. Serve it with, Corn soup, or, Tomato soup, ., , , , Here are some tried & tested variations, , Variations, , , You can also make a spinach bread pizza. On a medium high flame saute some fine chopped spinach in 1 tsp oil until it wilts. Spread the pizza sauce over the bread and then layer the spinach, followed by cheese., , You can also make a egg bread pizza. Just stir in an egg with grated cheese and spread it over the bread. You have to bake the pizza bread in the oven and not on the griddle., , Grill or saute some chicken until cooked through and place them over the bread. Then layer the cheese., , Instead of pizza sauce you can also spread pesto, tomato ketch or any other hot sauce., , , , Related Recipes, , 25 Bread Recipes ..., , , Bread Upma Recipe..., , , Bread Pakora Reci..., , , Besan bread toast..., , , Pizza recipe | Ho..., , , , , Recipe Card, , , , , , Bread Pizza Recipe, , , 4.99, from, 79, votes, , , , Bread pizza is a yummy snack made using bread as the pizza base. This easy recipe will help you make bread pizza on stove top or oven. This can be enjoyed as a evening snack or a party starter., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 5, minutes, , minutes, Cook Time, 10, minutes, , minutes, Total Time, 15, minutes, , minutes, , Servings, 4, , Author, Swasthi, , , , ▢, 4, , slices, , bread, ▢, 1, , teaspoon, , oil, , for greasing the pan, Toppings, ▢, 2, , tablespoon, , pizza sauce, , (or tomato sauce) as needed, ▢, ½ to ¾, , cup, , cheese, , grated (mozzarella or pizza cheese), ▢, ½, , teaspoon, , Italian herbs, , or oregano, ▢, ¼ to ½, , teaspoon, , red chili flakes, ▢, 1, , medium, , onion, , cubed and layers separated, ▢, ½, , cup, , bell pepper, , (capsicum) cubed, ▢, 1, , small, , tomato, , Firm ,deseeded and cubed (optional), ▢, 10, , Olives, , as desired (optional), , If you do not have pizza sauce Instructions: Preparation, ▢, Cube the onions and separate the layers., ▢, Deseed the tomatoes and bell pepper. Cube them as well., ▢, Grate the cheese and keep it ready., How to make Bread Pizza on Stovetop, ▢, Grease a pan/ griddle with 1 tsp oil. Toast the bread lightly on one side. Switch off the heat., ▢, Remove the bread to a board or tray, so the crisp side is on top. This step is optional but helps to keep the bread firm., ▢, Smear pizza sauce thinly as desired., ▢, Layer onions, bell pepper and tomatoes. Next grate and layer cheese and then the herbs and chili flakes. If you have olives, place them as well., ▢, Place the bread on the griddle. Cover the pan & begin to toast on a low to medium heat., ▢, Toast until the cheese melts. Keep checking to avoid burning the bread., Make bread pizza in oven, ▢, Arrange the bread slices on a baking tray & preheat the oven at 430 F or 220 C., ▢, Meanwhile, arrange the bread slices on a baking tray., ▢, Spread pizza sauce over the bread. Layer onions, capsicum and tomatoes. Next grate and layer cheese. Sprinkle herbs and chili flakes.  Place olives as well., ▢, Keep the tray in a preheated oven in the middle rack. Bake/ grill for 8 mins at 430 F or 220 C. Adjust the grill time as needed.  The veggies get grilled partially and the cheese melts and turns golden. Serve bread pizza hot as a snack or breakfast., In the Air fryer, ▢, Smear some sauce over the bread and place it in the air fryer basket. Spread all your topping along with cheese. Air fry at 180 C or 350 F for 5 to 6 mins or until golden and crisp. Without preheating it takes up to 7 to 8 mins., , , Notes, , , 250 grams tomatoes (3 medium) pureed or deseeded & chopped, , ¼ to ½ teaspoon red chilli flakes (adjust to taste), , 2 to 3 garlic cloves fine chopped, , ¼ teaspoon black pepper crushed, , 1 tablespoon oil (preferably olive oil), , 1 small onion (optional, fine chopped), , ¼ teaspoon salt (adjust to taste), , 1 teaspoon sugar, , ½ to ¾ teaspoon mixed Italian herbs, , , , Video, , , NUTRITION INFO (estimation only), , Nutrition Facts, , Bread Pizza Recipe, , , Amount Per Serving, , , Calories, 152, , Calories from Fat 45, , , , , % Daily Value*, , , Fat, 5g, 8%, Saturated Fat 3g, 19%, Cholesterol, 14mg, 5%, Sodium, 276mg, 12%, Potassium, 169mg, 5%, Carbohydrates, 18g, 6%, Fiber 2g, 8%, Sugar 4g, 4%, Protein, 7g, 14%, , , Vitamin A, 795IU, 16%, Vitamin C, 26.3mg, 32%, Calcium, 150mg, 15%, Iron, 1.4mg, 8%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 11.1K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 4.99 from 79 votes (, 71 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 24, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Radhika, , , , , , March 19, 2024 3:40 am, , , , , , I came here for a bread pizza but learnt a lot including making the sauce. Thank you. It was amazing and the pizza came out good., , , , , , Reply, , , , , , , , , , , Gozek, , , , , , June 6, 2021 2:34 pm, , , , , , Thanks for the recipe, though my cheese refused to melt. I don’t know what the problem was. I also baked for over 18mins waiting for it to melt but did not., Please what exactly went wrong. I used mozzarella processed chesse by the way., , Awaiting your response., Thanks, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Gozek, , , , June 7, 2021 1:47 pm, , , , , , Hi Gozek,, Don’t know why? May be the oven was not hot enough, , , , , , Reply, , , , , , , , , , , Pranavi, , , , , , June 6, 2020 4:19 am, , , , , , Thank u ma’am?,I haveto make a healthy recipe and tasty too for my holiday homwork and writes it’s recipe too ?,so I found your page video and recipe written ?both  and in this lockdown I have to do something so thanks ?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Pranavi, , , , June 6, 2020 9:23 am, , , , , , Hi Pranavi, You are welcome! Glad to know the recipe helped you., 🙂, I have moderated your comment to protect your details. I advice you not to leave your personal details/info on any website., , , , , , Reply, , , , , , , , , , , Shubhratodkar, , , , , , Reply to, Pranavi, , , , February 1, 2021 11:45 am, , , , , , Ohh ya really ☺️, , , , , , Reply, , , , , , , , , , , Harshini, , , , , , May 16, 2020 6:13 am, , , , , , Instead of toasting the breads shall we bake them mam?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Harshini, , , , May 16, 2020 6:18 am, , , , , , Yes Harshini, , , , , , Reply, , , , , , , , , , , Archana Solanki, , , , , , January 30, 2020 12:38 pm, , , , , , Madam your bread recipes are very good, seen many videos of it. I have a question about the small frying pan, sauce with lid of LODGE, i had searched at many places for such small size one, but could not get, may i know where online can i get it, please provide the link if you have., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Archana Solanki, , , , January 30, 2020 1:35 pm, , , , , , Thanks Archana, I bought it locally here in Singapore. So I don’t have the link., , , , , , Reply, , , , , , , , , , , Shashi Bhushan Malik, , , , , , August 25, 2019 6:08 am, , , , , , Very nice recipes., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shashi Bhushan Malik, , , , August 26, 2019 2:17 am, , , , , , You are welcome., , , , , , Reply, , , , , , , , , , , Supriya, , , , , , July 16, 2019 10:32 am, , , , , , Nice receipe !! My son liked it a lot . Thank you., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Supriya, , , , July 16, 2019 1:30 pm, , , , , , Welcome Supriya, , , , , , Reply, , , , , , , , , , , tanu, , , , , , July 3, 2019 2:47 am, , , , , , simple bt delicious too! i made it for my grand maa nd she really loved it!! so tq swasti for posting this, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, tanu, , , , July 3, 2019 10:18 am, , , , , , Welcome Tanu,, Glad your grandma liked the bread pizza., 🙂, , , , , , Reply, , , , , , , , , , , Harini, , , , , , September 25, 2018 11:41 pm, , , , , , Yummy recipe. My kids were very happy and enjoyed the bread pizza. Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Harini, , , , September 26, 2018 12:00 am, , , , , , Welcome Harini,, Thanks for trying, , , , , , Reply, , , , , , , , , , , Aanand, , , , , , April 5, 2018 1:36 pm, , , , , , quite simple, very easy steps.I made it yesterday and everybody enjoyed it.So,thanks for posting it., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Aanand, , , , April 5, 2018 2:13 pm, , , , , , Thanks for trying, , , , , , Reply, , , , , , , , , , , Kruti, , , , , , March 29, 2017 9:46 pm, , , , , , Simple and delicious! I and my husband enjoyed it thoroughly. Thanks for sharing Swasthi ☺, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Kruti, , , , March 31, 2017 2:02 pm, , , , , , welcome Kruti, Glad to know you liked it., , , , , , Reply, , , , , , , , , , , Apeksha, , , , , , January 23, 2017 11:31 am, , , , , , Wonderful! I understood all steps so detailed in your recipe post. Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Apeksha, , , , January 25, 2017 8:00 am, , , , , , welcome Apeksha, , , , , , Reply, , , , , , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Pizza Burger": "Ingredients: , , , , 4, , how to make pizza burger with step by step photo:, , , , , 5, , pizza topping preparation:, , , , , 6, , aloo patties preparation:, , , , , 7, , pizza burger assembling:, , , , , 8, , notes:, , , , , , pizza burger recipe | burger pizza in kadai | pizza cheeseburger, with step by step photo and video recipe. burger and pizza recipes have always been one of the popular choices of young age groups. however, these recipes have to be innovative so that it does not become monotonous with its audience group. hence it has to lead to fusion recipes and one of the popular fusion recipe introduced by fast food joints is pizza burger recipe., , as i was explaining earlier, the recipe was introduced by dominos, but there has been a lot of variations to the original recipe. when it was introduced, it was made with burger buns stuffed with pizza sauce and cheese stuffed between 2 burger slices. in addition, the burger buns are freshly made and the stuffing is stuffed inside the dough before the baking. however, this can be complicated if you are attempting at home. hence i have improvised the recipe by using the store-bought burger buns. moreover, i have used the pizza sauce made for the pizza pockets from macdonalds. basically, the pizza sauce is not just sauce and contains finely chopped and diced veggies in it. i felt this combination would be ideal for my variation of, pizza cheeseburger, ., , , furthermore, i would like to add more tips, suggestions and variations to burger pizza recipe in kadai. firstly, i have prepared the pizza sauce recipe from scratch by adding veggies to it. you can use store-bought pizza sauce, but it may not contain veggies in it. hence you may have to separately steam the veggies before using in this recipe. secondly, i have topped the burger with pizza sauce and cheese to have the pizza flavour in each bite. you may skip it, as the traditional burger pizza does not have this additional step. lastly, i would heavily recommend using, mozzarella, cheese for this recipe. however, you may also use cheddar cheese, especially for the topping on a top burger bun., , finally, i request you to check my other related, sandwich recipes collection, with this post of, pizza burger recipe, . it includes my other related recipes like, grilled cheese pizza sandwich – in kadai, , , pizza sandwich, , , veggie burger, , , aloo tikki burger, , , roti sandwich, , , pin wheel sandwich, , , club sandwich, , , finger sandwiches, , , spinach corn sandwich, , , chapati roll, . further to these i would also like to mention my other recipe categories, like, , , international recipes, , street food recipes, , snacks recipes, , , pizza burger video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for burger pizza in kadai recipe:, , , , , pizza burger recipe | burger pizza in kadai | pizza cheeseburger, , , HEBBARS KITCHEN, , , easy pizza burger recipe | burger pizza in kadai | pizza cheeseburger, , , 5, from, 18, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 30, minutes, , mins, Total Time, 40, minutes, , mins, , , , , , , Course, burger, Cuisine, international, , , , , , Servings, 3, , burger, Calories, 458, , kcal, , , , , , , 1x, 2x, 3x, for pizza toppings:, ▢, 3, , tsp, , oil, ▢, 2, , clove, , garlic, , , finely chopped, ▢, ½, , onion, , , finely chopped, ▢, 2, , tbsp, , carrot, , , chopped, ▢, 2, , tbsp, , sweet corn, ▢, 2, , tbsp, , capsicum, , , chopped, ▢, 2, , tbsp, , tomato sauce, ▢, 2, , tbsp, , chilli sauce, ▢, ½, , tsp, , chilli flakes, ▢, ½, , tsp, , mixed herbs, ▢, ½, , tsp, , salt, for aloo patties:, ▢, 2, , potato, , , boiled & mashed, ▢, ½, , tsp, , ginger paste, ▢, 1, , chilli, , , finely chopped, ▢, ½, , tsp, , chilli powder, ▢, ½, , tsp, , cumin powder, ▢, ½, , tsp, , garam masala, ▢, ½, , tsp, , aamchur, ▢, ¼, , cup, , cornflour, ▢, 2, , tbsp, , coriander, , , chopped, ▢, ½, , tsp, , salt, ▢, oil, , , for shallow frying, ▢, 3, , burger bun, ▢, 1, , cup, , cheese, , , grated, ▢, few jalapeño & olives, ▢, 3, , tbsp, , tomato sauce, ▢, 3, , tbsp, , mayonnaise, , , eggless,  Instructions: , pizza topping preparation:, firstly, in a pan heat 3 tsp oil and saute 2 clove garlic., add ½ onion and saute slightly., now add 2 tbsp carrot, 2 tbsp sweet corn and 2 tbsp capsicum., saute for a minute without overcooking vegetables., now add 2 tbsp tomato sauce, 2 tbsp chilli sauce, ½ tsp chilli flakes, ½ tsp mixed herbs and ½ tsp salt., mix well and cook for a minute. you can alternatively use 3 tbsp pizza sauce instead., finally, pizza toppings are ready., aloo patties preparation:, firstly, in a large bowl take 2 boiled and mashed potato, ½ tsp ginger paste and 1 chilli., also, add ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala and ½ tsp aamchur., add ¼ cup cornflour, 2 tbsp coriander and ½ tsp salt., mix well making sure all the spices are well combined., form a soft dough. if there is a lot of moisture, then add 1 tsp cornflour and mix., now grease hands with oil and prepare a ball sized patties., shallow fry in hot oil keeping the flame on medium., fry on both the sides until the patties turn golden brown and crisp., drain off over kitchen towel and aloo patties is ready. keep aside., pizza burger assembling:, firstly, take a large burger bun and slice half at the centre., spread 1 tbsp of prepared pizza toppings., now add few jalapeño, olives and grate a generous amount of cheese over it., place prepared aloo patties and garnish with 1 tbsp tomato sauce., on another half slice of the bun, spread 1 tbsp mayonnaise., cover the bun and press gently., on top of burger bun, spread 1 tbsp pizza toppings and 1 tbsp cheese., to bake the burger pizza in oven or kadai, make sure to preheat for 5 to 10 minutes., place the burger pizza in the kadai and cover., cook for 10 minutes, on medium flame. or you can bake at 180-degree celcius for 10 minutes., finally, enjoy burger pizza with chips., , , , , Nutrition, Calories:, 458, kcal, Carbohydrates:, 49, g, Protein:, 16, g, Fat:, 22, g, Saturated Fat:, 9, g, Cholesterol:, 42, mg, Sodium:, 1600, mg, Potassium:, 369, mg, Fiber:, 3, g, Sugar:, 13, g, Vitamin A:, 2822, IU, Vitamin C:, 42, mg, Calcium:, 369, mg, Iron:, 3, mg, , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make pizza burger with step by step photo:, , pizza topping preparation:, , , firstly, in a pan heat 3 tsp oil and saute 2 clove garlic., , , add ½ onion and saute slightly., , , now add 2 tbsp carrot, 2 tbsp sweet corn and 2 tbsp capsicum., , , saute for a minute without overcooking vegetables., , , now add 2 tbsp tomato sauce, 2 tbsp chilli sauce, ½ tsp chilli flakes, ½ tsp mixed herbs and ½ tsp salt., , , mix well and cook for a minute. you can alternatively use 3 tbsp pizza sauce instead., , , finally, pizza toppings are ready., , , , aloo patties preparation:, , , firstly, in a large bowl take 2 boiled and mashed potato, ½ tsp ginger paste and 1 chilli., , , also, add ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala and ½ tsp aamchur., , , add ¼ cup cornflour, 2 tbsp coriander and ½ tsp salt., , , mix well making sure all the spices are well combined., , , form a soft dough. if there is a lot of moisture, then add 1 tsp cornflour and mix., , , now grease hands with oil and prepare a ball sized patties., , , shallow fry in hot oil keeping the flame on medium., , , fry on both the sides until the patties turn golden brown and crisp. drain off over kitchen towel and aloo patties is ready. keep aside., , , , pizza burger assembling:, , , firstly, take a large burger bun and slice half at the centre., , , spread 1 tbsp of prepared pizza toppings., , , now add few jalapeño, olives and grate a generous amount of cheese over it., , , place prepared aloo patties and garnish with 1 tbsp tomato sauce., , , on another half slice of the bun, spread 1 tbsp mayonnaise., , , cover the bun and press gently., , , on top of burger bun, spread 1 tbsp pizza toppings and 1 tbsp cheese., , , to bake the burger pizza in oven or kadai, make sure to preheat for 5 to 10 minutes., , , place the burger pizza in the kadai and cover., , , cook for 10 minutes, on medium flame. or you can bake at 180-degree celcius for 10 minutes., , , finally, enjoy, burger pizza, with chips., , , , notes:, , , firstly, if you are having access to pizza sauce then you can use that., , also, add a generous amount of cheese if you are not diet conscious., , additionally, you can add vegetables of your choice., , finally,, burger pizza recipe, tastes great when served hot and cheesy., , , , , , , , , Related Recipes, , , , , , , , , , sandwich recipes, , , Cream Cheese Sandwich Recipe – Kids Lunch Box..., , , , Hebbars Kitchen, , -, , , February 27, 2025, , , , , , , , , , , , breakfast recipes, , , Aloo Cheese Toast Sandwich Recipe | Potato Cheese..., , , , Hebbars Kitchen, , -, , , July 29, 2024, , , , , , , , , , , , , 00:01:17, , , , breakfast recipes, , Pizza Sandwich Recipe | Grilled Veg Pizza Sandwiches, , , , Hebbars Kitchen, , -, , , March 25, 2024, , , , , , , , , , , , , indian street food, , Masala Pav Recipe | Mumbai Street Style Bhaji..., , , , Hebbars Kitchen, , -, , , January 22, 2024, , , , , , , , , , , , , indian street food, , Veg Grill Sandwich Recipe | Cheese Vegetable Sandwich..., , , , Hebbars Kitchen, , -, , , November 1, 2023, , , , , , , , , , , 00:01:28, , , , breakfast recipes, , Chilli Cheese Sandwich Recipe 2 Ways – Toast..., , , , Hebbars Kitchen, , -, , , September 29, 2023, , , , , , , , , , , , , breakfast recipes, , Roti Wrap Recipe 2 Ways | Leftover Chapati..., , , , Hebbars Kitchen, , -, , , June 1, 2023, , , , , , , , , , , , , sandwich recipes, , Hung Curd Sandwich Recipe, , , , Hebbars Kitchen, , -, , , February 24, 2023, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 5 from 18 votes (, 18 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , appetizer, , , 00:02:05, , , , Chilli Mushroom Recipe | Mushroom Chilli..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dessert, , Badam Burfi Recipe | Almond Burfi with Tips & Tricks, , , , , , , , What's New, , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli – Healthy & Tasty, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,"
    }
}