{
    "ingredients": {
        "Chickpea Frittatas": "besan,yeast,basil dried,red bell pepper,jalapeno,onion,spinach",
        "Zesty Chickpea Meatballs": "chickpeas,pistachios,onion,bread crumbs,brown rice"
    },
    "recipe_url": {
        "Chickpea Frittatas": "https://simple-veganista.com/mini-chickpea-flour-frittatas/",
        "Zesty Chickpea Meatballs": "https://www.thissavoryvegan.com/zesty-vegan-chickpea-meatballs/"
    },
    "Recipe": {
        "Chickpea Frittatas": "Ingredients: , 30 Minutes or Less, , Budget Friendly, , Comfort Food, , Easy Weeknight Dinners, , Instant Pot, , Kid Friendly, , One Bowl, , Slow Cooker, , , , My Vegan Pantry, Expand, , , , Plant Based Diet Beginner’s Guide (V + WFPB), , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu, , , , , , , , , , , , , , , , , , , , , , , , , Home, », Course, », Breakfast + Brunch, », Mini Chickpea Flour Frittatas (Vegan), Mini Chickpea Flour Frittatas (Vegan), , , , Jump to Recipe, , , , Mini Chickpea Flour Frittatas feature gluten-free chickpea flour, bell pepper, corn, baby spinach, onion, and herbs for an easy and delicious, healthy vegan breakfast or snack!, , , These vegan, mini chickpea flour frittata muffins have been my obsession lately!, , You may also know them as – mini crustless chickpea quiche, chickpea omelet muffins, vegan egg muffins, or savory chickpea flour muffins. Whatever you want to call them, I call them easy, healthy, and delicious!, , In place of eggs traditionally used in frittatas, this vegan frittata muffin recipe will use the ever-wonderful chickpea flour as the base., , Of course, this veganized version will not be exactly the same, but they do bake up light and tender and are filled with wholesome goodness. You may have to taste test it with my other, Vegetable Frittata, using tofu as the base!, , A few other reasons these savory chickpea muffins are pretty awesome!, , , gluten-free, , grain-free, , eggless, , low-fat, , non-dairy, , oil-free, , high fiber & protein, , , This chickpea flour frittata recipe is a perfect meal prep idea for healthy to-go meals throughout the week. They are small, pack well, and can be reheated in the toaster oven or microwave., , , Ingredient Notes, , In this recipe, a batter is made with chickpea flour, an assortment of vegetables, and herbs then baked until tender, creating a delicious savory chickpea muffin frittata that’s perfect any time of day., , Here is everything you will need:, , , Chickpea flour, – This flour is made from white garbanzo beans and can be found in local grocery stores or ordered, online, (affiliate link)., , Red bell pepper, , Corn, – fresh, frozen, or canned (I used frozen)., , Jalapeno, , Baby kale or spinach, – I used baby kale., , Dried basil, – thyme or tarragon would be great too!, , Garlic powder, , Mineral salt or black salt, (don’t skimp on the salt) –, black salt, (affiliate link), aka, kala namak, will add the distinctive sulfur flavor eggs are known for., , freshly, cracked pepper, , nutritional yeast, , optional for an extra savory, cheesy flavor., , , Feel free to change up the veggies, using at least 3 cups. Use an assortment of diced zucchini, mushrooms, peas, green bell peppers, finely chopped broccoli, or carrots. Fresh herbs would be great too!, , , , How To Make Chickpea Flour Muffins, , , In a medium bowl, mix together the chickpea flour, nutritional yeast, garlic powder, basil, and salt., , Add the water and whisk until combined. The batter will be runny, not thick., , Add the veggies and mix again., , Using a 1/4 measuring cup, scoop the batter and fill each of the 12 holes in the muffin tin., , Bake for 30 – 35 minutes., , Pull from the oven, turn the muffins out, and let them rest on a cooling rack., , , , Top Tips + FAQs, , To grease the muffin pan or not., If not using a non-stick muffin tin, lightly grease each muffin hole or use muffin liners. If using a non-stick tin, you don’t need to oil the tin as the frittatas will fall out when turned over. You may need to gently tap the tin on a hard surface to release them. I didn’t use any oil for these., , What If my muffins don’t cook all the way through?, There have been a few comments regarding the muffins being soggy in the center. If this is your experience, let them cool completely before eating or cook for up to 50 minutes (depending on the veggies used). The center will thicken, and your muffins will be perfect. I’ve personally never had an issue with a soggy center at 35 minutes, but ovens do vary!, , , , , , How To Store Leftovers, , Cooled chickpea muffins can be stored in an airtight container in the refrigerator for up to 5 – 7 days. They will also keep well in freezer-safe containers or baggies for up to 2 – 3 months. Let thaw before reheating. Reheated muffins are fantastic and can be warmed up in the toaster oven or microwave., , Serving Suggestions, , These savory chickpea flour frittatas are great alone but are even better with a little something on the side. Here are a few of my favorite options:, , , Serve with, Breakfast Potatoes, or, Yukon Gold & Sweet Potato Home Fries, for a hearty breakfast., , Serve with this hearty, Potato + Chickpea + Sweet Potato Breakfast Hash, ., , Pair with sliced avocado and a drizzle of sriracha., , Serve with, Savory Sauteed Kale, , , Vegan Collard Greens, , or, Skillet Asparagus + Tomato Medley, ., , , , More Chickpea Flour Recipes!, , Chickpea flour is so versatile and easy to work with. For a variation, try these other recipes using chickpea flour., , , Socca (Farinata), , Savory Chickpea Pancake, , See all, Chickpea Flour, recipes on TSV!, , , If you try this chickpea flour recipe, please let me know!, Leave a comment and rate it below. I love to hear what you think, or any changes you make., , , , , , , , , Print, , Mini Chickpea Flour Frittatas (Vegan), , , , , , , , , Print Recipe, , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 5, from, 74, reviews, , , , Veggie filled and super easy to make, these chickpea flour frittatas are great anytime of day. Great for meal prep!, , , , , Author:, , Julie | The Simple Veganista, , Prep Time:, , 10 min, , Cook Time:, , 35 min, , Total Time:, , 45 minutes, , Yield:, , 1, 2, 1, x, , Category:, , Breakfast, Snack, , , , , , Units, , US, M, , , , Scale, , 1x, 2x, 3x, , , , , , , 1 3/4, , cups, , chickpea flour, (aka, white garbanzo bean flour), , 1/4, , cup, , nutritional yeast, , optional, , 1 teaspoon, , baking powder, , 1 teaspoon, , garlic powder, , 1 teaspoon, , dried basil, , 3/4 teaspoon, , mineral salt or black salt, (see notes), , 2, , cups, , water, , 1, , cup, , corn, (frozen, fresh, or canned), , 1, large, red bell pepper, (, 1 cup, ), finely diced, , 1, , jalapeno, , finely diced, , 1/4, red onion or medium, shallot, , finely diced, , handful of, baby kale or spinach, , roughly chopped, , chives, , to garnish (optional), , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , ,  Instructions: Expand, , , , , Bake, , Cuisine:, , Vegan, , , , , , , , , , Preheat, oven to 375 degrees F. If not using a non-stick muffin tin, lightly grease with oil (see notes) or use muffin liners., , Mix:, In a large mixing bowl, combine the chickpea flour, optional nutritional yeast, baking powder, salt, garlic powder, and basil. Whisk in the water (batter will be runny, but that’s normal). Add the corn, bell pepper, jalapeno, onion, and baby greens, mix to combine., , Scoop:, Using a 1/4 measuring cup, scoop the batter into the muffin tin, filling all 12 holes. Top with a sprinkle of chives., , Bake:, Place in the oven, on the center rack, and bake for 35 – 45 minutes (depending on the veggies used). Do the toothpick test by sticking it in the center of a muffin, if it comes clean, frittatas are ready. If cooking for 35 minutes and the center seems soggy, let them cool, and they will stiffen up nicely., , Remove from oven, turn out frittatas, and place on a cooling rack to cool., , Store:, Leftovers can be stored, covered, in the refrigerator, or on the counter. Reheat in a toaster oven or microwave., , Makes 12, , , , , Notes, , , If using black salt, use about 1/2 teaspoon, and the other 1/2 teaspoon regular mineral salt. Too much black salt may be overpowering., , Feel free to change up the veggies, using at least 3 cups. Use an assortment of diced zucchini, mushrooms, peas, green bell peppers, finely chopped broccoli or carrots. Fresh herbs would be great too!, , Muffin tin, . If not using a non-stick muffin tin, lightly grease each muffin hole. If using non-stick, the frittatas will fall out when turned over. You may need to gently tap the tin, upside down, gently on a hard surface to release them., , What If my muffins don’t cook all the way through?, There have been a few comments regarding the muffins being soggy in the center. If this is your experience, let them cool completely before eating. The center will thicken and your muffins will be perfect. I’ve personally never had an issue with a soggy center, but I know from experience from my other baked goods that letting it cool will do the trick, , Nutritional facts include the optional 1/4 cup nutritional yeast., , , , , , , , , Did you make this recipe?, , Be sure to leave a star rating and comment below!, , Tag your photos, @thesimpleveganista, on Instagram and hashtag it, #thesimpleveganista, , , , , FOLLOW TSV, on, Facebook, ,, Instagram, ,, Pinterest, ,, Youtube, , , Subscribe, (email), or, RSS, for more recipes and inspiration!, , , , , , , Share, , , , , Pin, , , , , , , Post navigation, , Previous, , Previous, Vegan Blueberry Banana Oat Bread, Next, Continue, , Vegan Cornbread Muffins, , , , 148 Comments, , , Comments navigation, , Older comments, , , , , , , , lauren, , says:, , , , at, , , , , I make a batch of these every week and freeze them, and my husband microwaves them for a quick breakfast before work. I use whatever veggies I have on hand, but otherwise follow the recipe exactly. We love them! They are healthy and filling and they make breakfast super easy., , , , Reply, , , , , , , , Carly, , says:, , , , at, , , , , Can the baking powder be left out?, , , Reply, , , , , , , , Julie | The Simple Veganista, , says:, , , , at, , , , , I wouldn’t leave it out as it is helpful for leavening. If you want to experiment, by all means you can try. I hope that helps., , , Reply, , , , , , , , , , Colleen, , says:, , , , at, , , , , I made this for a breakfast for lunch type of meal at church; I almost didn’t take them because of how they turned out. I was anticipating that they would look similar to the picture but they definitely did not. I doubled the recipe to ensure everyone would have one or two each but they was quite soggy in the middle even after letting them sit. They tasted great but they did not look good. They were very dark and I thought it was because of the type of veggies I used. I used eggplant and zucchini beside the corn, etc. So maybe that is why they came out so dark. Otherwise, this recipe was great. I won’t be using left over dark veggies for this again! Lol., , , Reply, , , , , , , , Michael S, , says:, , , , at, , , , , This has been a favorite of mine, with all kinds of veggies.  Today, I  left out your herbs and black salt, substituting cardamom and cinnamon and some sweetener, to make apple/nut muffins., , , , Reply, , , , , , , , Julie | The Simple Veganista, , says:, , , , at, , , , , Love it! Thanks for sharing, Michael. :), , , Reply, , , , , , , , Patricia, , says:, , , , at, , , , , I love this recipe and have made it many times. The veggies change with whatever I have in the fridge and freezer. Thank you 💕, , , , Reply, , , , , , , , , , , , Theodore, , says:, , , , at, , , , , Great base recipe I add more seasonings and veggies whenever I make them as meal prep, I don’t know if it’s because I’m closer to sea level where I live now but 375 for 35 minutes would definitely burn them, I’ve made them twice now and they come out well cooked just shy of 30 minutes or so. Comes out delicious though!, , , , Reply, , , , , , , , Bethany, , says:, , , , at, , , , , Made these for the first time following the recipe exactly. They were delicious. I will definitely be making them again. Love this for holiday cooking to have something ready for breakfast!, , , Reply, , , , , , , , Shaynecia, , says:, , , , at, , , , , Delicious! I will be making this for a second time. If I wanted to make it not so vegan & add shrimp do you think it will get cooked all the way? Thanks!, , , , Reply, , , , , , , , Steve, , says:, , , , at, , , , , Been making these on and off as a side dish to my broccoli heavy stir fry . These also have been side dished for my ‘vegan chilli’ honestly tho i just call it ‘the mega bean soup’ i love these so much. I used to wonder how much tastier they could be if i actually used yeast (for some reason it was really hard to find) . I used the yeast for the first time last night (after making this on and off for a year)  and it really was a game changer! I was so blown away by how good i managed to make them that i had to come here to leave this comment. Lol. Great recipe! The non vegans in my household also gobbled these down at light speed. 10/10.  Good as a side dish, dipping into soup, top it with a “cheese” or dip of choice. It has the same flexibility and number of opportunities as a plain loaf of bread.  Will be a staple side dish in most of my future cooking. Please do your selves a favour and dont skip the yeast., , , , Reply, , , , , , , , Etrechia, , says:, , , , at, , , , , How much yeast did you put in?, , , Reply, , , , , , , , , , Julie, , says:, , , , at, , , , , I made this as fritters rather than muffins- delicious flavour! Thanks for the recipe., , , , Reply, , , , , , , , Julie | The Simple Veganista, , says:, , , , at, , , , , That sounds wonderful, Julie! Thanks for sharing :), , , Reply, , , , , , , , , , Lori, , says:, , , , at, , , , , I may have missed it, but at what temp are we baking??, , , Reply, , , , , , , , Julie | The Simple Veganista, , says:, , , , at, , , , , Bake at 375 degrees. Enjoy!, , , Reply, , , , , , , , Comments navigation, , Older comments, , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, Name, *, , Email, *, , Website, , , , , Notify me of followup comments via e-mail., Δ, , , , , , , , , , Hi, and welcome to The Simple Veganista where you'll find healthy, affordable, EASY VEGAN RECIPES everyone will love!, Learn more about TSV →, Facebook, Instagram, Pinterest, , Reader Favorites, , , Vegan Banana Bread (Healthy + Easy), Lemon Chickpea Orzo Soup (Vegan Avgolemono), Chickpea & Sweet Potato Breakfast Hash, 1 Bowl Vegan Peanut Butter Cookies, , , , , , , , , , , , , , , , , , , , , , , , , , , , Get new recipes in your inbox!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Info, , , Privacy Policy, Disclaimers, Web Accessibility, About TSV, Contact, Vegan Pantry, , , , , , , , , , Follow, , , Instagram, Facebook, Pinterest, Youtube, Subscribe, by email, RSS, , , , , , , , , , Recipes, , , Breakfast, Snack, Entree, Side, Soup, Salad, , , , , , , , , , Easy Basics, , , Almond Parmesan, Almond Butter, Homemade Tahini, Cashew Ricotta, Vegan Mayo, Vegan Sour Cream, , , , , , , , , , , , , , , , , , , © 2025 THE SIMPLE VEGANISTA • A Plant Based Vegan Recipe Blog, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Recipes, , Breakfast, , Salad, , Soup, , Dinner, , , , , , , Facebook, , X, , Instagram, , , , Subscribe, , , , About TSV, , , , , , Search, , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , ,",
        "Zesty Chickpea Meatballs": "Ingredients: », Zesty Vegan Chickpea Meatballs, , Zesty Vegan Chickpea Meatballs, , , by, Rene, on, Aug 4, 2020, (updated, Apr 22, 2021, ), , Jump to Recipe, , 5, from 1 rating, , , , This post may contain affiliate links, please see our, privacy policy, for details., , These Zesty Vegan Chickpea Meatballs are crispy, hearty and healthy. Made with chickpeas, pistachios, brown rice, herbs and spices. Serve with pasta, salads or bowls., , , If you follow me on, Instagram, then you know I have been making these Zesty Vegan Chickpea Meatballs on repeat! Not only do they make a big batch that you can eat over a few days, they are so delicious that you will want to make them again and again., , These chickpea meatballs are so hearty – made with chickpeas, (obvi), , pistachios, brown rice and panko breadcrumbs. To season them we are adding smoked paprika, garlic, red onion and a chipotle pepper. It is the perfect combo to make the ultimate vegan meatballs., , , How to Make Zesty Vegan Chickpea Meatballs, , food processor, then stir in the breadcrumbs and rice. Form the mixture into balls and place on a, baking sheet, ., , Bake them for 25-30 minutes and you are in business. It is seriously one of the easiest recipes!, , , How to Serve Zesty Vegan Chickpea Meatballs, , You have LOTS of options when it comes to serving these meatballs. Eat them on their own with a great dipping sauce or add them to your favorite pasta dish. You can also eat them in salads or bowls., , If you have leftovers, I also like to crumble a couple meatballs in a pan with some oil and cook them until super crunchy. Then eat them for breakfast as a hash brown alternative!, , Again, so many options!, , , Need more chickpea recipe inspo? Check out these recipes:, , BBQ Chickpea Lettuce Wraps, Mediterranean Braised Chickpea Rice Bowls, Roasted Chickpea Quinoa Bowls with Sesame Ginger Dressing, , SHOP THE POST, , , , , , Turn on your JavaScript to view content, , , , , , , , , , , , , Zesty Vegan Chickpea Meatballs, , , Servings:, 8, , large meatballs, , Prep Time:, 10, minutes, , mins, Cook Time:, 30, minutes, , mins, Total Time:, 40, minutes, , mins, , , These Zesty Vegan Chickpea Meatballs are crispy, hearty and healthy. Made with chickpeas, pistachios, brown rice, herbs and spices. Serve with pasta, salads or bowls., , 5, from 1 rating, , , Print Recipe, , Pin Recipe, , Leave Review, , , , , , ▢, 1, , 15-ounce can, , chickpeas, , drained and rinsed, ▢, 1/2, , cup, , pistachios, , shelled, ▢, 1/2, , red onion, , roughly chopped, ▢, 1, , chipotle pepper, , from a can of chipotle peppers in adobo sauce, ▢, 3, , cloves, , garlic, , peeled, ▢, 2, , tbsp, , cilantro, , roughly chopped, ▢, 1, , tbsp, , tomato paste, ▢, 2, , tbsp, , olive oil, ▢, 1, , tsp, , smoked paprika, ▢, 1, , tsp, , garlic powder, ▢, 1, , tsp, , salt, ▢, pepper, , to taste, ▢, 1/2, , cup, , panko breadcrumbs, , or breadcrumbs of choice, ▢, 1/2, , cup, , cooked brown rice, , scraping down the sides as needed. You can leave the mixture as chunky or smooth as you like – I personally like a few chunks in there., Transfer the chickpea mixture to a bowl and stir in the breadcrumbs and rice until combined., Roll the mixture into 8 balls (you can make them smaller and do 12 instead) and place them on the baking sheet. Place in the oven for 15 minutes. Gently flip and cook them for an additional 10-15 minutes. You want them to be crispy on the outside, Serve these meatballs with your favorite pasta, bowl or salad., , Video, , Notes, *You can add the breadcrumbs and rice to the food processor with everything else if you want to – I just wanted a chunkier texture., , **These will last in the fridge for 2-3 days or in the freezer for 2 months. If freezing, cook them completely, then transfer to a freezer-safe container once cooled., , SHOP THE POST, , , , , , Turn on your JavaScript to view content, , , , Calories:, 163, kcal, , , Carbohydrates:, 18, g, , , Protein:, 6, g, , , Fat:, 8, g, , , Cuisine:, American, Course:, Appetizer, Main Course, , , , , , , Did you make this recipe?, Leave a review below or take a photo and share it on Instagram, @thissavoryvegan, with, #thissavoryvegan, ., , This post may contain affiliate links. If you click on one and make a purchase I will receive a small percentage of the sale. Please know I would never link a product unless I have personally used it and loved it!, , If you make any of these recipes be sure to snap a photo + post it + and tag, #thissavoryvegan, and, @thissavoryvegan, !, , , , , , Chickpeas, , Entrees, , Fall Recipes, , , Winter Recipes, , , , originally published on, Aug 4, 2020, (last updated, Apr 22, 2021, ), , , , 0 comments, , , Leave a comment », , , , , , , , , « Previous Post, , Weekly Vegan Dinner Plan #112, , Next Post », , Chipotle Ginger Cashew Dressing, , , , , , , 5 from 1 vote (, 1 rating without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , , , , , , , , , , , Nice to Meet You!, , I’m Rene! So-cal native, dog mom and lover of all things spicy., Learn more., , , More About Me, , , , , Follow Me:, , , , , , , , , , , , Cozy & Comforting Vegan Cookbook, , Shop my newest ebook!, , , Get Yours Today, , , , , , , , , , , , ^ Back to Top, , Home, , About me, , Contact Me, , Recipe Index, , Privacy Policy, , , , , , , , , ©2025 This Savory Vegan, . All Rights Reserved., , Design by, Purr, ., , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: , Preheat oven to 375 degrees and line a baking sheet with parchment paper."
    }
}