{
    "ingredients": {
        "Creamy Quinoa Porridge": "red quinoa,almond milk,honey,cardamom,cinnamon,nutmeg,ginger,corn starch ,strawberries, blueberries,almonds,shredded coconut,raisins",
        "Baked Oats": "chocolate chips, rolled oats, cocoa powder, baking powder, maple syrup, eggs, banana",
        "Puffed Cocoa Amaranth": "amaranth,almond milk,maple syrup,cocoa powder,blueberries",
        "Pumpkin Pie Amaranth Porridge": "almond milk,maple syrup,cinnamon,ginger,nutmeg,cloves,amaranth,pumpkin puree,vanilla extract,pumpkin seeds",
        "Gluten free cinnamon crunch cereal": "gluten free all purpose flour,sugar, coconut oil,cinnamon,baking powder,vanilla extract",
        "Carrot Cake Baked Oatmeal": "coconut milk,eggs,maple syrup,vanilla extract,carrots,pineapple,rolled oats,baking powder,cinnamon,ginger,nutmeg,sour cream,sugar powdered",
        "Vanilla Yogurt": "greek yogurt,honey,vanilla extract",
        "Swiss Oatmeal": "rolled oats,almond milk,greek yogurt,vanilla extract,cinnamon,strawberries,banana,almonds",
        "Baked apple oatmeal cups": "rolled oats,almond milk,eggs,apple"
    },
    "recipe_url": {
        "Creamy Quinoa Porridge": "fixate_recipes\\Breakfast\\FXR_Creamy_Quinoa_Porridge_R_03.19.18.pdf",
        "Baked Oats": "https://www.pinterest.com/pin/496592296423953826/",
        "Puffed Cocoa Amaranth": "fixate_recipes\\Breakfast\\FXR_Puffed_Cocoa_Amaranth_R_03.19.18.pdf",
        "Pumpkin Pie Amaranth Porridge": "fixate_recipes\\Breakfast\\FXR_Pumpkin_Pie_Amaranth_Porridge_R_03.19.18.pdf",
        "Gluten free cinnamon crunch cereal": "fixate_recipes\\Breakfast\\FXR-EN-Gluten_Free_Cinnamon_Crunch_Cereal-11.24.20-Recipe.pdf",
        "Carrot Cake Baked Oatmeal": "fixate_recipes\\Breakfast\\FXR-EN-Carrot_Cake_Baked_Oatmeal-10.19.20-Recipe.pdf",
        "Vanilla Yogurt": null,
        "Swiss Oatmeal": "fixate_recipes\\Breakfast\\FXR_Swiss_Oatmeal_R_03.19.18.pdf",
        "Baked apple oatmeal cups": "https://www.livewellbakeoften.com/apple-cinnamon-baked-oatmeal-cups/"
    },
    "Recipe": {
        "Creamy Quinoa Porridge": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., CREAMY QUINOA PORRIDGE, SERVES: 6 (approx. ½ cup quinoa plus toppings)    Prep Time: 15 min.    Cooking Time: 43 min., CONTAINER EQUIVALENTS (per serving):, 1, ½, 1, NUTRITIONAL INFORMATION (per serving): Calories: 240   Total Fat: 7 g   Saturated Fat: 2 g   Cholesterol: 0 mg   Sodium: 231 mg   Carbohydrates: 41 g, Fiber: 4 g   Sugars: 17 g   Protein: 5 g, 1 cup, dry red quinoa, 2 cups, water, 1 cup, unsweetened almond milk, 2 Tbsp., raw honey, 3 pods, green cardamom (or ½ tsp. ground, cardamom), ½ stick, cinnamon (or ¾ tsp. ground, cinnamon), ¼ tsp., ground nutmeg, 4 to 6 slices\t raw ginger (or ¼ tsp. ground ginger), ¼ tsp., sea salt (or Himalayan salt), ½ tsp., cornstarch (preferably GMO-free), + 1 tsp. water (combine to make a, slurry), 1½ cups, sliced strawberries, 1½ cups, fresh blueberries, ¼ cup, sliced almonds (toasted, if desired), ¼ cup, unsweetened shredded coconut, (toasted, if desired), ¼ cup, raisins, 1.\t Rinse quinoa thoroughly in fine mesh strainer; place in medium saucepan., 2.\t Add water. Bring to a boil over medium-high heat. Reduce heat to, medium-low. Gently boil, covered, for 18 to 20 minutes, or until liquid has, absorbed and quinoa germ has released. Quinoa should be soft with just a, little bite. Remove from heat. Allow quinoa to rest, covered, for 5 minutes., 3.\t While quinoa is cooking, heat almond milk, honey, cardamom, cinnamon, , nutmeg, ginger, and salt in small saucepan over medium-high heat. Bring, to a boil. Reduce heat to low; gently boil for 10 minutes., 4.\t Add cornstarch slurry; cook, stirring frequently, for 2 to 3 minutes, or until, thickened. Remove whole spices from mixture., 5.\t Add almond milk infusion to cooked quinoa; mix well., 6.\t Place ½ cup quinoa into each of six bowls. Top each bowl evenly with, strawberries, blueberries, almonds, coconut, and raisins. Serve warm and, enjoy!, TIPS:, •\t Measure out ½ a, with a mixture of strawberries and blueberries and, top your serving of quinoa with it., •\t You can also combine the sliced almonds, shredded coconut, and raisins, and use your, to top your serving of quinoa with it., •\t To toast almonds and coconut, place them on a baking sheet in a 375º F, oven for approx. 10 minutes, or until golden brown and fragrant., GF, VG, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Baked Oats": "Ingredients:  Instructions: ",
        "Puffed Cocoa Amaranth": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PUFFED COCOA AMARANTH, SERVES: 1 Prep Time: 10 min. Cooking Time: 2 min., CONTAINER EQUIVALENTS (per serving):, 1, 1, ½, 2 Tbsp., dry amaranth, ½ cup, unsweetened almond milk, 1 tsp., pure maple syrup, ½ tsp., unsweetened cocoa powder, ¼ tsp., ground cinnamon, 1 cup, fresh blueberries, 1. \t Heat the deepest soup pot you have over high heat until a grain of, amaranth dropped in the pan pops within 2 to 3 seconds., 2.\t\t Wearing oven mitts, drop 1 Tbsp. amaranth into pot; cook, stirring, continuously with a wooden spoon, for approx. 10 seconds, or until most of, amaranth is popped (not all will pop). Immediately place popped amaranth, in a small bowl., 3.\t\t Repeat with remaining amaranth., 4.\t\t Combine almond milk, maple syrup, cocoa powder, and cinnamon in a, small bowl; whisk to blend., 5.\t\t Pour almond milk mixture over popped amaranth; top with blueberries., Enjoy!, , RECIPE NOTES:, •\t You’ll know you’ve reached maximum “poppage” when the unpopped, amaranth in the pan begins to turn dark brown. Remove immediately at, this point or it will burn., •\t This will make for a porridge-like cereal consistency, which we enjoy. If, you would like yours thinner, add a little more almond milk., •\t You can pop your amaranth ahead of time and store it in an airtight, container at room temperature. It will keep just like ordinary, breakfast cereal., •\t You can substitute any fruit that you choose for blueberries. Just make, sure amount equals 1, ., NUTRITIONAL INFORMATION (per serving): Calories: 215  Total Fat: 4 g  Saturated Fat: 0 g  Cholesterol: 0 mg  Sodium: 93 mg  Carbohydrates: 43 g  Fiber: 6 g, Sugars: 19 g  Protein: 5 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Pumpkin Pie Amaranth Porridge": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PUMPKIN PIE AMARANTH PORRIDGE, SERVES: 4 (approx. ¾ cup each)  Prep Time: 10 min.  Cooking Time: 25 min., CONTAINER EQUIVALENTS (per serving):, ½, 2, ½, Here’s a great meal-prep recipe for fall, when everything is turning pumpkins and spice. The earthy taste of amaranth matches perfectly with, the warm spices of pumpkin pie. What a treat to start the morning off right!, 2½ cups, , unsweetened almond milk, 3 Tbsp., , pure maple syrup, ¼ tsp., , sea salt (or Himalayan salt), ¼ tsp., , ground cinnamon, ¼ tsp., , ground ginger, 1 dash, , ground nutmeg, 1 dash, , ground cloves, 1 cup, , dry amaranth, 1 cup, , 100% pure pumpkin puree, ½ tsp., , pure vanilla extract, 2 tsp., , \u0007raw pumpkin seeds, (for garnish; optional), 1. \t Bring almond milk, maple syrup, salt, cinnamon, ginger, nutmeg, and, cloves to a boil in large saucepan over medium-high heat., 2. \t Add amaranth; gently boil, covered, for 15 minutes., 3. \t Add pumpkin. Whisk to blend; cook, covered, for 4 to 5 minutes, or until, amaranth is tender and you have a nice porridge consistency. (If porridge, becomes too thick, add a little water to achieve desired consistency.), 4. \t Remove from heat. Add extract; mix well., 5. \t Evenly divide between four serving bowls. Top each with, ½ tsp. pumpkin seeds (if desired)., RECIPE NOTE:, Refrigerate leftover porridge in an airtight container for up to 4 to 5 days., You may need to thin it out with 1 to 2 Tbsp. unsweetened almond milk, when serving., NUTRITIONAL INFORMATION (per serving): Calories: 276  Total Fat: 6 g  Saturated Fat: 1 g   Cholesterol: 0 mg  Sodium: 262 mg  Carbohydrates: 48 g  Fiber: 7 g, Sugars: 13 g  Protein: 9 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Gluten free cinnamon crunch cereal": "Ingredients: gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., GLUTEN-FREE CINNAMON CRUNCH CEREAL, Serves: 10 (approx. ½ cup each), GF, V, VG, Total Time: 1 hr. 15 min., Prep Time: 15 min. + 30 min. chilling time, Cooking Time: 30 min., 2 cups, , gluten-free all-purpose flour (preferably Bob’s Red Mill® All-Purpose Baking Flour, red label), ¼ cup + 2 Tbsp.\t coconut sugar, divided use, 3 Tbsp., , extra-virgin organic coconut oil, divided use, 2 tsp., , ground cinnamon, divided use, 1 tsp., , baking powder, gluten-free, 2 tsp., , pure vanilla extract, ¼ cup + 2 Tbsp. \tcold water, SPECIAL EQUIPMENT: Parchment paper, Bob’s Red Mill is a trademark of Bob’s Red Mill Natural Foods, Inc., 1., Preheat oven to 350° F., 2., \u0007Add flour, ¼ cup + 1 Tbsp. coconut sugar, 2 Tbsp. coconut oil, 1½ tsp. cinnamon, and baking powder to a food, processor; pulse to combine., 3.\t With food processor running, add extract and water, scraping down sides as needed, until a shaggy dough forms., 4.\t \u0007Lightly flour countertop or work surface; turn out dough. Knead until smooth; wrap in plastic wrap. Refrigerate for, 30 minutes., 5.\t \u0007Unwrap dough; place on top of a 16 x 12-inch sheet of parchment paper. Place another equally sized parchment, paper sheet on top. Roll dough out to 1⁄8-inch thickness; remove top sheet. Pierce all over with a fork., 6.\t \u0007Melt remaining 1 Tbsp. coconut oil; brush over top of dough. Sprinkle with remaining 1 Tbsp. coconut sugar and, remaining ½ tsp. cinnamon., 7., \u0007Using a pizza cutter or bench scraper, cut dough into ½-inch squares, being careful not to cut through parchment paper., 8.\t \u0007Lift parchment paper and transfer dough squares to a baking sheet. Bake for 25 to 30 minutes, or until crunchy., Let cool completely before storing in an airtight container., Instructions: ",
        "Carrot Cake Baked Oatmeal": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., CARROT CAKE BAKED OATMEAL, SERVES: 12 (approx. 1 muffin cup each) Prep Time: 15 min.  Cooking Time: 30 min., CONTAINER EQUIVALENTS (per serving):, 1, FOR MUFFINS:, 1 cup, \u0007unsweetened coconut milk, beverage, 2, large eggs, lightly beaten, ¼ cup, pure maple syrup, 1 tsp., pure vanilla extract, ¾ cup, \u0007grated carrots, (approx. 1¼ medium), ¼ cup, \u0007crushed pineapple, in 100%, pineapple juice, drained, 2 cups, dry old-fashioned rolled oats, 1 tsp., baking powder, gluten-free, ½ tsp., ground cinnamon, ¼ tsp., ground ginger, ¼ tsp., ground nutmeg, ¼ tsp., sea salt (or Himalayan salt), FOR ICING:, 3 Tbsp. + ½ tsp.\t reduced-fat sour cream, 3 Tbsp. + ½ tsp.\t powdered sugar, SPECIAL EQUIPMENT:, Muffin papers/cupcake liners, 1., Preheat oven to 350º F., 2., Prepare twelve muffin cups by lining with muffin papers. Set aside., 3., To make muffins, combine coconut milk, eggs, maple syrup, extract,, carrots, and pineapple in a medium bowl; mix well. Set aside., 4., Combine oats, baking powder, cinnamon, ginger, nutmeg, and salt in a, large bowl; mix well., 5., Fold coconut milk mixture into oat mixture; mix well., 6., Evenly divide batter between prepared muffin cups, mixing frequently to, ensure there are both oats and liquid in each cup., 7., Bake for 30 minutes, rotating pan after 15 minutes., 8., While oatmeal cups are baking, make icing. Combine sour cream and, powdered sugar in a small bowl; mix well. Set aside., 9., Let oatmeal cups cool in pan until you can handle them. Remove to a, cooling rack., 10.\t Drizzle each oatmeal cup with approximately 1 tsp. icing before serving;, serve warm., RECIPE NOTE:, As soon as oatmeal cups are cool, place in an airtight container and store, in the refrigerator for up to 4 days. If storing longer, place in the freezer for, up to 3 months., NUTRITIONAL INFORMATION (per serving): Calories: 105  Total Fat: 2 g  Saturated Fat: 1 g  Cholesterol: 32 mg  Sodium: 73 mg  Carbohydrates: 18 g  Fiber: 2 g, Sugars: 8 g  Protein: 3 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 3, Instructions: ",
        "Swiss Oatmeal": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., SWISS OATMEAL, SERVES: 1   Prep Time: 10 min. + 4 hours (or overnight)   Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, 1, 2, 1, ½ cup, , dry old-fashioned rolled oats, , , gluten-free, ¾ cup, , unsweetened almond milk, ¾ cup, , reduced-fat (2%) plain, , Greek yogurt, ½ tsp., , pure vanilla extract, ½ tsp., , ground cinnamon, ½ cup, , chopped strawberries, ¼, , large banana, chopped, 2 Tbsp., , sliced raw almonds, 1. \t Place oats, almond milk, yogurt, extract, cinnamon, strawberries, , banana, and almonds in a medium bowl; mix well. Soak, covered, in, the refrigerator overnight., RECIPE NOTE:, If you don’t have sliced almonds, you can chop 12 raw almonds., NUTRITIONAL INFORMATION (per serving): Calories: 445  Total Fat: 14 g  Saturated Fat: 4 g  Cholesterol: 9 mg  Sodium: 195 mg  Carbohydrates: 54 g  Fiber: 9 g, Sugars: 16 g  Protein: 27 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Baked apple oatmeal cups": "Ingredients: , These apple cinnamon baked oatmeal cups have a fairly short ingredient list. Here’s what you’ll need for this recipe:, , , Old-fashioned oats:, I recommend using old-fashioned (rolled) oats for this recipe. Instant or quick cook oats won’t provide the same texture., , Baking powder:, Gives the healthy baked oatmeal cups a slight lift in the oven., , Cinnamon:, Feel free to add extra spices, if desired., , Salt:, Enhances the apple-cinnamon flavor., , Milk:, Regular dairy milk or almond milk works well here., , Eggs:, Helps bind the baked apple oatmeal together., , Maple syrup:, I wanted to avoid adding any refined sugar, so I experimented with different sweeteners in this recipe. I found that 1/2 cup of pure maple syrup was the perfect amount to sweeten these oatmeal cups., , Vanilla extract:, Use pure vanilla extract for the best flavor., , Apple:, I prefer to use a Granny Smith apple, but if you have another kind on hand you can use that instead., , , How to Make Baked Apple Oatmeal Cups, , To make these baked oatmeal cups, you’ll mix together the old-fashioned rolled oats, baking powder, ground cinnamon, and a little salt. Then, you’ll whisk together the milk, eggs, pure maple syrup, , These apple cinnamon oatmeal cups only take about 15 to 20 minutes to mix up and another 25 minutes to bake. Which means you can have a week’s worth of breakfasts finished in less than an hour., , My favorite way to enjoy these healthy oatmeal cups is topped with a little pure maple syrup or crumbled up over a bowl of Greek yogurt., , , Can I Freeze Baked Oatmeal Cups?, , Yes! These freeze really well for up to 3 months. When you’re ready to enjoy them, just pop one or two in the microwave for 30 to 45 seconds and breakfast is ready!, , , Baking Tips, , , You can take out the apple and use another fruit you love in these oatmeal cups too!, , If you don’t have maple syrup on hand, you can substitute an equal amount of honey., , Make sure to spray the muffin pan liberally with non-stick spray, otherwise your baked apple oatmeal cups may stick to the pan., , , , More Easy Breakfast Recipes to Try!, , , Blueberry Banana Baked Oatmeal, , Banana Baked Oatmeal Cups, , Blueberry Oatmeal Cups, , Apple Muffins, , Apple Cinnamon Scones, , , , , , , Apple Cinnamon Baked Oatmeal Cups, , 4.71, from, 27, ratings, , Prep Time:, 20, minutes, , mins, Cook Time:, 25, minutes, , mins, Total Time:, 45, minutes, , mins, , These easy Baked Apple Oatmeal Cups are perfect for an easy and healthy breakfast throughout the week!, , , , Print Recipe, , Pin Recipe, , , Save, Saved!, , Leave a Review, , , , , Servings:, 12, , oatmeal cups, , ▢, 3, , cups, , (300 grams) old-fashioned rolled oats, ▢, 1, , teaspoon, , baking powder, ▢, 1, , and 1/2 teaspoons ground cinnamon, ▢, 1/4, , teaspoon, , salt, ▢, 1, , cup, , (240 ml) milk, , (almond or regular dairy milk work well), ▢, 2, , large eggs, ▢, 1/2, , cup, , pure maple syrup, ▢, 1, , teaspoon, , vanilla extract, ▢, 1, , medium, , Granny Smith apple, , , peeled, cored, and chopped (about 1 cup), , Cook Mode, Prevent your screen from going dark, , Evenly distribute the mixture between all 12 cavities in the prepared muffin pan. Bake at 350°F for 25 to 27 minutes, or until the tops of the oatmeal cups are lightly golden brown and firm., Remove from the oven and allow to cool in the pan for about 5 to 10 minutes, then remove the oatmeal cups and transfer to a wire rack to finish cooling., , Notes Instructions: , Preheat the oven to 350°F (177°C). Spray a 12-count muffin pan very well with non-stick cooking spray and set aside., Add the oats, baking powder, cinnamon, and salt to a large mixing bowl and mix until well combined., In a separate mixing bowl, whisk together the milk, eggs, maple syrup, Oatmeal cups may be stored in an airtight container in the refrigerator for up to one week. These may also be frozen for up to 3 months, thaw overnight in the refrigerator, then reheat in the microwave., , Oats:, I recommend using old-fashioned rolled oats for the best texture., , Maple Syrup:, If you don't have maple syrup on hand, you can substitute an equal amount of honey., , , Cuisine:, American, Course:, Breakfast, Author:, Danielle Rye, , , , , , , Did you make this recipe?, Mention, @livewellbakeoften, on Instagram or tag, #livewellbakeoften, ., , , , , , , , , , , , , , , , , , This site contains affiliate links, if you make a purchase through them, we receive a small commission., , , , Breakfast, , Fall, , Healthier Options, , , , originally published on, Jan 2, 2017, (last updated, Jan 6, 2021, ), , , , 84 comments, , , Leave a comment », , , , , , , , , , , 5, Secrets, to Baking Like a Pro, , Don't be intimidated by baking: learn my secrets that make baking from scratch easy!, , , , Yes I Want It, , , , , , , « Previous Post, Chocolate Turtle Cookies, , Next Post », , Mini Oreo Cheesecakes, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , 84 comments on “Apple Cinnamon Baked Oatmeal Cups”, , , , , , , Christina Lee, —, October 20, 2024 @ 9:32 pm, , Reply, , , , , , Not very sweet which for me is perfect for breakfast. Easy to make too!, , , , , , , , Laura, —, January 1, 2024 @ 5:17 pm, , Reply, , , Made these yesterday with blueberries, yummy., Made them today with the apples., I also added some vanilla protein powder to them., Baked them in an 8×8 pan, cut them up & froze most of them., , , , , , , , LouAnn, —, November 11, 2023 @ 8:05 am, , Reply, , , Will date paste or date syrup work in place of the maple syrup??, , , , , , , , Danielle, —, November 13, 2023 @ 2:35 pm, , Reply, , , I think date syrup would be fine!, , , , , , , , , , Sherry, —, June 5, 2023 @ 8:40 am, , Reply, , , , , , Delicious. Tastes healthy and I appreciate that. I followed your recipe as stated. I added raisins., Thank you for the recipe., , , , , , , , Melody Wilkerson, —, March 19, 2023 @ 7:15 pm, , Reply, , , , , , I love these Apple Oatmeal Breakfast cupcakes. Not to sweet, Healthy & satisfying, It’s a nice breakfast change, they travel well & freeze nicely., I added 3/4 cup of Walnuts to mine., I got 15 muffins. 😊❤️, , , , , , , , Mariah, —, March 1, 2023 @ 6:59 pm, , Reply, , , , , , I LOVE this recipe so much– I never have an appetite in the morning but these always sound good- they are great heated up for 10 seconds or so in the microwave. I also love these to cure a sweet tooth craving! Very filling. They are somewhat dry- I added a bit more maple syrup this time around and they were perfect. I scoop then into a well sprayed muffin tin and top with a little more cinnamon. 25 minutes at 350 comes out perfect each time! Thank you!, , , , , , , , Sue Gough, —, January 17, 2023 @ 9:04 pm, , Reply, , , Healthy, filling and nutritious.  A great weight loss substitute to cake or biscuits.  Oh, and full of fibre also., , , , , , , , Jennifer Edwards, —, June 21, 2022 @ 9:15 am, , Reply, , , , , , My husband liked them and he’s a picky eater! Do you have the nutritional breakdown of this recipe?, , , , , , , , Danielle, —, June 23, 2022 @ 6:32 pm, , Reply, , , I’m not sure about the nutritional information, but you can plug everything into an online calculator like My Fitness Pal to get an estimate., , , , , , , , , , Cali, —, April 10, 2022 @ 9:49 am, , Reply, , , Can I add bananas to this recipe?, , , , , , , , Danielle, —, April 11, 2022 @ 8:45 am, , Reply, , , Yes! You could slice some up and stir them into the mixture. Or you could try my baked banana oatmeal cup recipe, here, ., , , , , , , , , , Janice Scott, —, January 30, 2022 @ 11:31 am, , Reply, , , , , , Absolutely love these, so easy and taste great! Used honey 8nstead of maple syrup. Baked in my pampered chef brownie pan. Will be making them again., , , , , , , , Cassie, —, January 11, 2022 @ 1:17 pm, , Reply, , , , , , Very easy to make and taste divine but feedback overall is that the texture is quite odd as there’s no flour to bind with the eggs and milk., , , , , , , , Lisa, —, November 5, 2021 @ 12:05 pm, , Reply, , , Could I make this without the muffin tins, and maybe use a 8×8 pan? Or would you suggest a different size? Thank you!, , , , , , , , Danielle, —, November 5, 2021 @ 1:00 pm, , Reply, , , Yes, absolutely! An 8-inch or 9-inch square pan would work good!, , , , , , , , , , Mary, —, August 15, 2021 @ 9:39 am, , Reply, , , Can you use muffin liners, , , , , , , , Danielle, —, August 16, 2021 @ 8:46 am, , Reply, , , Since this recipe doesn’t have much fat in it, they tend to stick to the liners. You can use them, but I’d recommend spraying them really well with nonstick cooking spray., , , , , , , , Janell, —, January 17, 2022 @ 8:09 pm, , Reply, , , I used liners and just let them cool on a run to room temp then placed in a ziplock bag in the fridge overnight. Microwaved for 15 seconds and they came off the paper pretty easily. I did try one while still warm from the oven and they stick to the liner. Silicone cupcake liners may be better, I’ll try those next time!, , , , , , , , , , , , Cathy Jamieson, —, February 7, 2021 @ 10:26 am, , Reply, , , , , , Made these yesterday. So easy! Very delicious., , , , , , , , Viva Penny, —, December 31, 2020 @ 9:29 pm, , Reply, , , , , , Great recipe!  I Have made this a few times in the past  month.  Makes a very tasty quick and healthy breakfast or snack.  I also added raisins, dates and pecans for a little extra goodness.  This recipe is a keeper!, , , , , , , , Shelley Martinez, —, December 22, 2020 @ 9:59 am, , Reply, , , , , , Just made these this morning – super easy and tastes great! Is their nutrition / calorie info available on this?  Thank you!, , , , , , , , Danielle, —, December 23, 2020 @ 2:17 pm, , Reply, , , So glad you enjoyed the oatmeal cups, Shelley! I’m not sure about the nutritional information, but you can plug everything into an online calculator to get an estimate., , , , , , , , , « Older Comments, , 1, , 2, , , , , , , , , , , , , , Hello & Welcome, Hi, I’m Danielle!, , I believe that anyone, even beginners, can bake amazing desserts!, , More About Me, , , Search Recipes, , , , Submit, , , , , Popular Posts, , , , , , , How To Make Buttercream Frosting, , , , , , , The BEST Carrot Cake Recipe, , , , , , , Classic No-Bake Cookies, , , , , , , Soft and Chewy Oatmeal Raisin Cookies, , , , , , , The BEST Red Velvet Cake, , , , , , , Soft Peanut Butter Cookies, , , , , , , What's Trending, , , , , , , The BEST Scone Recipe, , , , , , , Mini Cheesecakes, , , , , , , Easy Fudge Recipe, , , , , , , Grandma’s Bread Pudding, , , , , , , Red Velvet Cupcakes, , , , , , , Homemade Pumpkin Pie Spice, , , , , , , , , 5, Secrets, to Baking Like a Pro, , Don't be intimidated by baking: learn my secrets that make baking from scratch easy!, , , , Yes I Want It, , , , , , , , , , , , As Seen On, As Seen On, , , Top, , , , , , , , , my cookbook, Live Well Bake Cookies, , 75 classic cookie recipes for every occasion!, , Buy Yours Today, , , , , , , Don't Miss a Recipe, , , , Subscribe, , , , Info, Home, , About, , Contact, , Cookbook, , Recipes, Recipe Index, , Breakfast, , Cookies, , Cakes, , Follow, Facebook, , Instagram, , Pinterest, , YouTube, , , , ©2025 Live Well Bake Often, .\n\t\t \t—, , Privacy Policy, , Privacy Tools, , Sitemap, , , Design by, , Purr, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,"
    }
}