{
    "ingredients": {
        "Spinach, apple, pineapple, banana smoothie": "apple juice,spinach,apple,pineapple,banana",
        "Chocolate peanut butter smoothie": "peanut butter,banana,almond milk,greek yogurt,cocoa powder",
        "Carrot Cake Smoothie": "carrot,walnut,dates,almond milk",
        "Coconut Matcha Smoothie": "almond milk, matcha powder, banana, shredded coconut, flaxseed powder, vanilla extract",
        "Apple peanut butter smoothie": "almond milk,apple,peanut butter",
        "Pear Ginger Smoothie": "almond milk, spinach, frozen pears, greek yogurt, almond butter, honey, ginger, vanilla extract",
        "Anti Bloat Smoothie": "coconut water, banana, cucumber, ginger",
        "Vegan apple pie smoothie": "apple,chia seeds,walnuts,almond milk,dates",
        "Coffee Smoothie": "coffee, banana, rolled oats, cocoa powder, flaxseed powder, cinnamon, almond milk, honey",
        "Chocolate overnight oatmeal smoothie": "rolled oats, chia seeds, almond butter, cocoa powder, vanilla almond milk, maple syrup, vanilla extract",
        "Mocha Banana Breakfast Smoothie": "rolled oats, almond milk, banana, yogurt, cocoa powder, espresso powder",
        "Chocolate Peanut Butter Oatmeal Smoothie": "rolled oats, almond milk, peanut butter, cocoa powder, honey, vanilla extract",
        "Vanilla mint overnight oats smoothie": "rolled oats, almond milk, vanilla extract, spinach, banana, avocado, mint extract, sweetener",
        "Pumpkin Apple Smoothie": "oats, pumpkin puree, greek yogurt, apple, banana, almond milk, pumpkin pie spice",
        "Breakfast Pumpkin Pie Smoothie": "milk, banana, pumpkin puree, instant oatmeal, greek yogurt, maple syrup, pumpkin pie spice, cinnamon, nutmeg",
        "Peach and Oat Breakfast Smoothie": "peach chunks, almond milk, greek yogurt peach or coconut flavor, oats"
    },
    "recipe_url": {
        "Spinach, apple, pineapple, banana smoothie": "https://www.yellowblissroad.com/apple-smoothie/",
        "Chocolate peanut butter smoothie": "https://lmld.org/chocolate-peanut-butter-banana-smoothie/",
        "Carrot Cake Smoothie": "http://wallflowerkitchen.com/carrot-cake-smoothie/",
        "Coconut Matcha Smoothie": "http://thefrostedvegan.com/2016/01/05/coconut-matcha-green-tea-smoothie-vitamix-giveaway/",
        "Apple peanut butter smoothie": "https://www.eatingwell.com/recipe/255705/apple-peanut-butter-smoothie/",
        "Pear Ginger Smoothie": "http://reciperunner.com/pear-ginger-smoothie/",
        "Anti Bloat Smoothie": "http://happyhealthymama.com/2015/07/the-anti-bloat-smoothie.html?utm_content=buffer1950a&amp;utm_medium=social&amp;utm_source=pinterest.com&amp;utm_campaign=WNMbuffer#_a5y_p=4138410",
        "Vegan apple pie smoothie": "https://thatgirlcookshealthy.com/apple-and-cinnamon-smoothie/",
        "Coffee Smoothie": "https://diethood.com/coffee-smoothie/",
        "Chocolate overnight oatmeal smoothie": "https://www.runningwithspoons.com/chocolate-overnight-oatmeal-smoothie/",
        "Mocha Banana Breakfast Smoothie": "http://foxeslovelemons.com/mocha-banana-breakfast-smoothie",
        "Chocolate Peanut Butter Oatmeal Smoothie": "http://www.whattheforkfoodblog.com/2016/01/08/chocolate-peanut-butter-oatmeal-smoothies/",
        "Vanilla mint overnight oats smoothie": "https://www.runningwithspoons.com/vanilla-mint-overnight-oatmeal-smoothie/",
        "Pumpkin Apple Smoothie": "https://kristineskitchenblog.com/pumpkin-smoothie/",
        "Breakfast Pumpkin Pie Smoothie": "https://www.dishingdelish.com/breakfast-pumpkin-pie-smoothie/",
        "Peach and Oat Breakfast Smoothie": "http://www.cookingclassy.com/2014/04/peach-oat-breakfast-smoothie"
    },
    "Recipe": {
        "Spinach, apple, pineapple, banana smoothie": "Ingredients: , Freezer friendly –, Pop the leftovers in the freezer for a refreshing drink any time you like., , , , , What you need, , , , Apple juice –, Feel free to choose your favorite brand, but I recommend a low sugar or 100% juice option., , Water, , Fresh baby spinach, , Apples –, You will need about 1 medium-sized apple and you can again use your favorite variety. I like Gala or Honeycrisp, or green apples for something more tart., , Frozen pineapple –, Freeze from fresh or buy in the freezer section., , Frozen banana –, Chop up some bananas and freeze them for smoothies anytime., , Ice cubes –, optional, but gives a more slushy texture to your apple smoothie., , Chia seeds –, Optional, but adds some additional fiber., , , , , , , How To Make An Apple Smoothie, , See the recipe card below for full, liquids first, then solids and blend until smooth. If it appears too thick, add a splash of water or apple juice and blend it again., , , , , Frequently Asked Questions, , Do You Have to Peel Apples for a Smoothie?, , As long as you’re using a high-powered blender, peeling the apples is optional. Simply core and cut the apple into large chunks and your blender will do the rest of the work. If you don’t have a high-powered blender, you can peel your apples before adding them to the blender., , , Can You Freeze Apples?, , Yes! If you want to plan ahead, you can store cored and roughly chopped apples in the freezer. Pop them into the blender straight from the freezer. You most likely will not need to add ice if your apples are frozen, as the smoothie should be plenty thick., , , , Variations, , , Add a scoop of peanut butter or almond butter to your smoothie., , Use almond milk instead of water., , Add a scoop of Greek yogurt or even protein powder., , , , Recipe Tips, , , Always add the liquid to your blender first., , Keep pulsing until the smoothie is blended well and the ice is broken down., , Make it a sweet dessert by adding a scoop of vanilla ice cream., , If it’s not sweet enough for you, try adding honey or maple syrup., , , , Serving Suggestions, , Smoothies are great for an on-the-go breakfast or midday snack. Really, you can enjoy them any time of the day! Add some, Apple Cinnamon Muffins, or, Make Ahead Freezer Breakfast Burritos, for a complete meal and hearty breakfast., , , Storage Tips, , The Best Way to Store Leftovers, , Refrigerating –, You can place a smoothie in the fridge for 1-2 days in a sealed container. It may separate, but give it a good shake and you should be fine., , Freezing –, Pour smoothie into individually portioned, resealable glasses or plastic storage containers. Make sure to leave a couple of inches at the top for expansion. Thaw in the fridge (not on the counter) for 8-12 hours., , , , More Smoothie Recipes, , Smoothies are a great way to get some vitamins and fiber, and they’re quite tasty to boot!, , , Skinny Berry Smoothie, , Mango Smoothie, , Banana Peach Smoothie, , Easy Cherry Smoothie, , , More Apple Recipes, , Apples are a great snack, but they’re even better in a yummy dessert. Try one of our favorites:, , , Easy Homemade Apple Butter, , Apple Crumble Recipe, , Pumpkin Apple Bread, , Instant Pot Applesauce, , , Recipe, , , , Apple Smoothie, , 5, from, 3, votes, , This nutritious Apple Smoothie is flavorful and refreshing. Packed with fruit and a serving of greens, it's a perfect way to start your day!, , Prep Time, 10, minutes, , mins, Cook Time, 0, minutes, , mins, Total Time, 10, minutes, , mins, , , Servings, 2, , smoothies, , , , , Print Recipe, Pin Recipe, Review Recipe, , , 1x, 2x, 3x, 1/2, , cup, , Apple juice, 1, , cup, , Water, 1, , heaping cup, , Fresh baby spinach, 1, , cup, , Chopped apple (sweet or tart), , about 1 medium-sized apple, 1, , cup, , Frozen pineapple, 1, , Small frozen banana, Handful of ice, , optional, Chia seeds, , to garnish, optional, , Save this recipe, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Email, *, Save, , , , Cook Mode, Prevent your screen from going dark, , liquid first, then solids. Process until smooth and combined., Pour into a glass and sprinkle with chia seeds, if desired. Enjoy immediately., , , , Notes, Stir with a spoon or straw if the smoothie separates a bit., , , Refrigerating –, You can place a smoothie in the fridge for 1-2 days in a sealed container. It may separate, but give it a good shake and you should be fine., , , , Freezing –, Pour smoothie into individually portioned, resealable glasses or plastic storage containers. Make sure to leave a couple of inches at the top for expansion. Thaw in the fridge (not on the counter) for 8-12 hours., , , Keyword, Apple Smoothie, , Nutrition, Calories:, 155, kcal, Carbohydrates:, 40, g, Protein:, 1, g, Fat:, 1, g, Saturated Fat:, 1, g, Sodium:, 11, mg, Potassium:, 431, mg, Fiber:, 4, g, Sugar:, 28, g, Vitamin A:, 166, IU, Vitamin C:, 48, mg, Calcium:, 11, mg, Iron:, 1, mg, , Nutritional Disclaimer, Kristin Maxwell of “Yellow Bliss Road” is not a dietician or nutritionist, and any nutritional information shared is an estimate. For accurate calorie counts and other nutritional values, , , , , , Have you tried this recipe?, , , Let us know how it was by leaving a review or sharing on Instagram with the tag #yellowblissroad, , , , , , Facebook, Pin, Allison Mattina, Allison is a busy wife and mom living in sunny Arizona. She is the sweet fanatic and recipe creator behind, Celebrating Sweets, . She enjoys celebrating life with family, friends and delicious food. Allison’s favorite things include: traveling, warm weather, wine country, chocolate, salted butter and carbs., , Read More About Allison, Free Email Series, , 5 Secrets to Dinnertime Sanity, , Free email series with tested, tasted & terrific dinner recipes!, , Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Subscribe, , You Might Also Like, , Smoothie Recipes, Watermelon Smoothie, , Smoothie Recipes, Orange Banana Smoothie, , Recipes, Strawberry Banana Smoothie, , Recipes, Mango Smoothie, , , , , , 5 from 3 votes (, 3 ratings without comment, ), , , , Leave a Comment, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , Notify me via e-mail if anyone answers my comment., , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , Comments, , , , , , , Viktoriia, , says:, , , , June 2, 2020 at 12:29 pm, , , , , Thanks for the apple smoothie recipe! And you also have so much delicious and interesting on your blog. Everything wants to try to cook:), , , Reply, , , , , , , , Kristin, , says:, , , , June 4, 2020 at 7:45 pm, , , , , You are so welcome Viktoriia! Thanks for stopping by., , , Reply, , , , , , , , , , , Hi, I’m Kristin!, , Welcome to, Yellow Bliss Road, , where we make cooking blissfully simple, with easy, family-friendly and approachable recipes for any home cook. Find delicious dinner ideas, flavorful appetizers and snacks and delightful desserts for any occasion., , Learn more about me, , , , , , , , , , Search for, , , , , , , Game Day Snacks, View all Game Day, Crispy Baked BBQ Chicken Wings, Easy Roast Beef Sliders, Spinach Artichoke Dip, Fried Pickles, 7 Layer Dip, Everything Bagel Pigs in a Blanket, View all Game Day, , Reader Favorites, See all recipes, Easy Hamburger Soup Recipe, Tortellini Soup with Italian Sausage & Spinach, Perfect Slow Cooker Pot Roast, Air Fryer Tortilla Chips, Albondigas Soup Recipe, Healthy Ground Turkey Teriyaki Rice Bowl, See all recipes, Recipes, , , Breakfast, , Lunch Recipes, , Dinner Recipes, , Side Dishes, , Appetizers & Snacks, , Salad Recipes, , Sandwiches, , Soups & Stews, , Dips & Sauces, , Bread, , Drink Recipes, , , , Printables, , , Christmas Printables, , Thanksgiving, , Halloween, , Easter, , Valentine’s Day, , Fourth of July, , School, , Birthdays, , , , About, , , About Kristin, , Contact, , Collaborate, , , , Crafts & DIY, , , Crafts & DIY, , Gift Ideas, , Home Decor, , Photography Tips, , , , Family, , , Travel, , Birthdays, , Adoption, , , , Yellow Bliss Road, , , , Copyright © 2025, Yellow Bliss Road, Privacy & Copyright, An Elite CafeMedia Food Publisher, , , , , , , , , , , , , , , , , , , , , , , , , , 5 Secrets to Dinnertime Sanity, , Quick & Easy Dinners The Whole Family Will Love!, , free email series, , , , , , , YES, I WANT THIS, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , , Air Fryer Recipes, , Recipes for the Grill, , Instant Pot Recipes, , Slow Cooker Recipes, , Sheet Pan Recipes, , , , By Season, , , Fall, , Spring, , Summer, , , , , , Easy Dinners, , , 30 Minutes or Less, , Casseroles, , One Pot Meals, , Sheet Pan Recipes, , , , Game Day Snacks, , Holidays, , , Valentine’s Day, , St. Patrick’s Day, , Fourth of July Recipes, , Halloween, , Thanksgiving, , , Thanksgiving Recipes, , 101+ Thanksgiving Side Dishes, , Foolproof Thanksgiving Turkey Recipe, , , , Christmas, , Seasonal Recipes, , , , About, , , About Kristin, , Adoption, , Contact, , , , Home, », Recipes, », Drink Recipes, », Smoothie Recipes, Green Apple Smoothie Recipe, Allison Mattina, Published on September 4, 2024, 5, 2, Facebook, Pin, Jump to recipe, This post may contain affiliate links. Please read our, disclosure policy, ., , , This nutritious, Apple Smoothie, is flavorful and refreshing. Packed with fruit and a full serving of greens, this fresh Green Apple Smoothie is the perfect way to start your day!, , If your family loves smoothies as much as mine you have to try some of our other, smoothie recipes, . We especially love, Strawberry Banana Smoothies, and, Pineapple Smoothies, ., , , Pin this recipe for later!, Pin This, , , Why We Love This Recipe, , , Healthy –, Lots of fruit and veggies make this apple smoothie a healthy snack or breakfast., , Tastes great –, This smoothie tastes sweet and refreshing – kids absolutely love it, and grown-ups, too!, , Quick and easy –, It whips up fast, and uses simple, , , Liquid:, The liquid is a combination of apple juice and water. The apple juice imparts a sweet apple flavor throughout the smoothie., , Fruit:, This smoothie contains a combination of apples, frozen pineapple and frozen banana. You can use sweet or tart apples. I’ve made it both ways and they’re equally delicious., , Greens:, My favorite leafy green to add to smoothies is fresh baby spinach. The flavor is mild and does not come through at all. Spinach adds a beautiful shade of green and an extra boost of nutrients to this smoothie. You can also swap the spinach for another leafy green of your choice (like kale), just be aware that some greens have a strong flavor., , To make this smoothie:, ",
        "Chocolate peanut butter smoothie": "Ingredients: , It’s honestly not too bad for you, with about 8.5-12.5g of protein per serving (depending if you split it into 2 or 3 servings) because its loaded with bananas, , peanut butter, , and, Greek yogurt, ., , , , creamy peanut butter – to add a nice peanut butter flavor, , bananas – frozen is best if you have them, , milk – to help everything blend up, you can use cow milk, or other non-dairy milks like almond milk, coconut milk, or oat milk, etc., , vanilla greek yogurt – an unflavored Greek yogurt won’t be very sweet, so I recommend something with a little sugar or sugar substitute, , cocoa powder – unsweetened cocoa powder to give it a nice chocolatey taste, , ice cubes – depending how thick you want your smoothie, , , How to make Chocolate Peanut Butter Banana Smoothie?, , To make this smoothie you’ll need a, blender, , I have a, Blendtec, , but any blender should work! Add your, creamy peanut butter, , bananas, milk, , yogurt, , , cocoa powder, and ice into the blender., , Blend it all up until the smoothie is mixed well, and nice and creamy., , Top your glasses with warmed peanut butter, banana slices, and chocolate syrup, if desired., , Tips and Tricks:, , , I suggest using a frozen banana if you have them. I like to take any of my bananas that are starting to get too ripe to just eat, this means they’re a little spotty and overripe, but not soft yet. Peel the bananas and cut them in half and toss them into freezer. Now they’re ready to use whenever you need frozen bananas for smoothies. Frozen bananas help to add thickness to your smoothie, without losing the flavor. Too much ice and your smoothie will be watered down., , You can use any, vanilla yogurt, that you like., , Plain yogurt, will not have any sugar so you may want to add some sugar, or some honey, or maple syrup, to your smoothie if it’s not sweet enough for you this way. I like using, vanilla greek yogurt, because it’s usually lower in added sugar than other yogurts, but has a lot of protein. Plus I think it’s so delicious 😉, , Try adding a scoop, or half a scoop of vanilla or chocolate protein powder to make this smoothie even more filling, and protein packed., , , , Smoothie Bowl Toppings:, , This creamy chocolate peanut butter banana smoothie is so delicious! It’s one of my favorite smoothies to drink, and it would also be delicious as a smoothie bowl! If you want to make this smoothie into a bowl, some yummy topping ideas for your smoothie bowl are:, , , Sliced Bananas, , Granola, , Chia Seeds, , Sliced Strawberries, , Drizzled, Peanut Butter, or Cashew Butter, , Shredded or Shaved Coconut, , Chocolate Shavings, or Nibs, , Hemp Seeds, , Cacao Nibs, , , Frequently Asked Questions:, , Are Chocolate Peanut Butter Banana smoothies healthy?, , This smoothie is a good healthier option for breakfast, or a snack. The smoothie is loaded with fiber, potassium, protein, and other vitamins that are good for our bodies. It’s not a low calorie breakfast or drink, but is filling, so it’s a good option to have occasionally, but not every day., , How to freeze bananas?, , Peel the bananas and cut them into halves, then flash freeze them by placing them on a lined baking sheet and putting it in the freezer until frozen solid. Then transfer the bananas to a freezer safe air tight container, or freezer safe bag for up to 5 or 6 months., , This is a great healthy smoothie, and is a great way to start the new year off right, especially if you’re like me and pretty much addicted to candy and cookies after all the Christmas goodies. This is a delicious breakfast option, or a healthier alternative that will still completely satisfy your sweet tooth., , Looking for more smoothie recipes?, , , Peanut Butter Banana Smoothie, , Green Peanut Butter Banana Smoothie, , Tropical Green Smoothie, , Blueberry Smoothie, , Peach Smoothie, , , Connect w, ith Like Mother, Like Daughter, , Be sure to follow us on social media, so you never miss a single post!, , Facebook, |, Instagram, |, Pinterest, |, Email, , , , , , , , , , , Chocolate Peanut Butter Banana Smoothie, , , Created By:, Aimee, , , Servings, 2, , , , Course, Drinks, , Cuisine, American, , , Chocolate peanut butter banana smoothie is the perfect creamy smoothie for a sweet breakfast or lighter dessert!, , , , , , Prep Time, 5, minutes, , mins, , Total Time, 5, minutes, , mins, , , , , Print Recipe, , Pin Recipe, , Share Recipe, , , , , , 1x, 2x, 3x, ▢, 1/4, , cup, , creamy peanut butter, ▢, 2, , bananas, , (frozen is best if you have it), ▢, 1/2, , cup, , milk, , (add another 1/4 cup if you have a lower powered blender), ▢, 1/2, , cup, , low fat vanilla greek yogurt, ▢, 2, , TBS, , cocoa powder, ▢, 3/4, , cup, , ice, , Blend on high until smooth., Pour into glasses and serve., , Video, , , , Nutrition, Calories:, 368, kcal, Carbohydrates:, 46, g, Protein:, 17, g, Fat:, 20, g, Saturated Fat:, 5, g, Polyunsaturated Fat:, 4, g, Monounsaturated Fat:, 9, g, Cholesterol:, 11, mg, Sodium:, 185, mg, Potassium:, 772, mg, Fiber:, 7, g, Sugar:, 25, g, Vitamin A:, 212, IU, Vitamin C:, 10, mg, Calcium:, 163, mg, Iron:, 2, mg, , , , , , , Made this recipe?, Tag me and share! Mention, @LMLDFood, or tag, #LMLDFood, !, , , , , , Related Posts, , , , , , , Peanut Butter Banana Smoothie, , , , , , , Peanut Butter and Jelly Smoothie, , , , , , , Strawberry Pineapple Breakfast Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , , , Drinks, Reader Interactions, Comments, , , , , , Kaelynn Robinson, , says, , , November 13, 2024 at 8:02 AM, , , , LOVE this smoothie! It’s been my go to breakfast for weeks now. I use vanilla organic whole milk yogurt and omit the cocoa powder. So delicious! I look forward to this smoothie every day!, , , Reply, , , , , , , , Aimee, , says, , , November 13, 2024 at 10:57 AM, , , , So glad you love it!!, , , , , , , , , , , Kay, , says, , , October 25, 2024 at 12:07 PM, , , , I made this followed the recipe used the vanilla Greek yogurt and this was gross ! Taste nasty, , , Reply, , , , , , , , Aimee, , says, , , November 4, 2024 at 10:17 AM, , , , Are you sure you didn’t use unsweetened greek yogurt? It should be very sweet and taste like peanut butter and banana, , , , , , , , , , , Kristen, , says, , , April 21, 2024 at 12:20 PM, , , , Is the calorie total per serving or for the entire thing?, , , Reply, , , , , , , , Aimee, , says, , , April 22, 2024 at 2:44 PM, , , , Per serving. If you want it to be less, I’d probably add some protein powder and a little more liquid to make it into 4 servings 🙂, , , , , , , , , , , Carla Nations, , says, , , January 26, 2024 at 7:42 PM, , , , This sounds so good.  Can you make it without the ice? Just wondering if that’s an option., , , Reply, , , , , , , , Aimee, , says, , , February 2, 2024 at 3:08 PM, , , , Yeah, if you’re okay with a thinner smoothie 🙂, , , , , , , , , , , riley, , says, , , July 9, 2023 at 4:31 PM, , , , i followed the recipe exactly and it had a gross after taste. would not recommend., , , Reply, , , , , , , , Aimee, , says, , , July 9, 2023 at 5:01 PM, , , , Did you make it with plain Greek yogurt instead of vanilla flavored that is sweetened?, , , , , , , , , , , Renee, , says, , , September 13, 2022 at 3:42 PM, , , , I’ve been on a real smoothie kick as of late and this recipe is one of my favorites! Thanks from my peanut butter loving heart!, , , Reply, , , , , , , , Aimee, , says, , , September 13, 2022 at 8:49 PM, , , , So glad you loved it!!, , , , , , , , , , , Justine, , says, , , September 13, 2022 at 1:48 PM, , , , This is my favorite  smoothie! You just can’t go wrong with peanut butter and chocolate., , , Reply, , , , , , , , Emily Boyle, , says, , , February 8, 2022 at 9:06 AM, , , , I cut it in half and added a little extra milk (I used frozen banana) so that it would work in my Nutri Bullet. It was delicious! I love just using cocoa powder for the chocolate flavor., , , Reply, , , , , , , , Alli Leah, , says, , , February 4, 2022 at 3:03 PM, , , , This was a fun treat for my kids and healthy too! The only thing I would do is add some vanilla and a sweetener like dates or honey for some sweetness. But great recipe!, , , Reply, , , , , , , , Glo, , says, , , January 17, 2022 at 12:03 AM, , , , So delicious!, , I add ground cinnamon for a wonderful fall/winter  (or any time of year 🙂 ) variety and whip cream on top ( my children’s favorite)., Blessings, , , Reply, , , , , , , , Miriam, , says, , , September 27, 2021 at 6:42 PM, , , , So good! It’s so creamy I had to eat it with a spoon. My only thing is I added some dates for sweetness., , , Reply, , , , , , , , Aimee, , says, , , September 27, 2021 at 8:13 PM, , , , Yay! Great idea! So glad you loved it, , , , , , , , , , , sarah, , says, , , April 22, 2021 at 6:57 PM, , , , whenever I am craving chocolate this is my go to. so so good and creamy! I cut everything in half to make it for one., , , Reply, , , , , , , , Casey, , says, , , April 19, 2021 at 7:20 AM, , , , Can you use water instead of milk?, , , Reply, , , , , , , , Aimee, , says, , , April 19, 2021 at 9:35 AM, , , , You definitely can, but the smoothy won’t be as rich and creamy., , , , , , , , , , , Heather Y Hansen, , says, , , February 25, 2021 at 11:17 AM, , , , Instead of cocoa powder and regular peanut butter, I used Peanut Butter & Co dark chocolately dreams spread, and it was delicious!  I’m not a banana fan, but luckily it only had a hint of banana (I used very ripe frozen ones). I topped it with walnuts and a cherry! My whole family loved this one!!!, , , Reply, , , , « Older Comments, , , , 4.77 from 76 votes (, 46 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , Primary Sidebar, , , , , , , Welcome!, , Hi! We are Ellen and Aimee, the mother & daughter duo behind this blog! Here we share our favorite recipes that will quickly become favorites for your family as well., Read More, , , , , Get our New Recipes, , in your inbox!, , , , , , , Thank you! You have successfully subscribed to our newsletter., , , , Subscribe, , , , function ml_webform_success_5405019() {\r\n                var $ = ml_jQuery || jQuery;\r\n\r\n                $('.ml-subscribe-form-5405019 .ml-block-success').show();\r\n                $('.ml-subscribe-form-5405019 .ml-block-form').hide();\r\n            };, , , , , Find Recipes:, , Search Recipes..., , , , , , , , , , Check Out Our New Christmas Cookbook!, , Check out or LMLD shop with new books added regularly, , Buy Our Christmas Cookbook, , , , , , , , Get our New Recipes, , in your inbox!, , , , , , , , , Thank you! You have successfully subscribed to our newsletter., , , , Subscribe, , , , function ml_webform_success_5405019() {\r\n                var $ = ml_jQuery || jQuery;\r\n\r\n                $('.ml-subscribe-form-5405019 .ml-block-success').show();\r\n                $('.ml-subscribe-form-5405019 .ml-block-form').hide();\r\n            };, , , , , , , ©2025, Like Mother, Like Daughter., Privacy Policy, , About, , Contact, , , Design by, Pixel Me Designs, , , This blog contains affiliate links. We include these links to help you find products that we love and use in our recipes. If you purchase an item from the link on Like Mother Like Daughter, we will receive a small percentage of the purchase at no extra cost to you.  Like Mother Like Daughter is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com, , , , , , , , , , , Pinterest, , , , , , , Facebook, , , , , , , Twitter, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: ",
        "Carrot Cake Smoothie": "Ingredients: resulting in a thick, smooth, just like, carrot cake., , , , Carrot, - Obviously!, Walnut halves, - Preferably soaked overnight so they're easier to blend and digest. These are a classic carrot cake ingredient and what's more is that they give a wonderful creamy, thick texture to the smoothie., Spices, - I use ground cinnamon and ground mixed spice. If you're outside of the UK, pumpkin pie spice works in place of mixed spice., Dates, - For natural sweetness. I recommend Mejool but any dates are fine., Unsweetened dairy-free milk, - Almond or coconut milk are great choices., Vanilla extract, - Really helps give it that \"cake\" flavour!, , , , More Banana-free Vegan Smoothies, , Blueberry Muffin Smoothie, , Pineapple Matcha Smoothie, , Hormone-Balancing Smoothie with Almond, Maca & Cinnamon, , , , , , , Continue to Content, , , , 📖 Recipe, , , , , Carrot Cake Smoothie (No Banana), , , , Yield:, , 2, , , , Prep Time:, , 5 minutes, , , , , Total Time:, , 5 minutes, , , , , , A healthy, delicious carrot cake-inspired smoothie. This recipe is made, without, bananas (for those with intolerances) and will quickly become one of your favourite breakfasts!, , , , , , Print, , , , , , , , 1 large carrot, peeled and grated, , 8 walnut halves, preferably soaked overnight, , 1 tsp ground cinnamon, , ½ tsp ground mixed spice, or pumpkin pie spice mix, , 4 dates, chopped and pitted, , 120 ml / ½ cup almond milk or more, if needed, , optional 1 tsp vanilla extract, , , , , , adding more almond milk if needed., Pour into 2 glasses and serve straight away!, , , , , Nutrition Information, , Yield, 2, , Serving Size, 1, , Amount Per Serving, , Calories, 127, Total Fat, 6g, Saturated Fat, 1g, Trans Fat, 0g, Unsaturated Fat, 5g, Cholesterol, 0mg, Sodium, 17mg, Carbohydrates, 18g, Fiber, 3g, Sugar, 12g, Protein, 2g, , , , , , , , , , , , Did you make this recipe?, , Please leave a comment, rate and share!, , , , , , , © Aimee, , , Category:, Smoothies, , , , , , , , , More Smoothies, Rainbow Smoothie Bowl, Super Immune-Boost Juice with Carrot, Ginger & Turmeric, Green Protein Smoothie, Hormone Balancing Smoothie with Almond, Maca & Cinnamon, , , , 23.2K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , , Nancy Whelan, , says, , , August 23, 2020 at 6:15 pm, , , , OMG this is sooooo good!! Carrot cake is my husband's favorite dessert, and we love smoothies - so this was a big hit!  I doubled the recipe for two servings, used more than 8 walnut halves and about six dates per serving, more than a cup of almond milk per serving, used 1/2 t. nutmeg and 1/2 t. cloves in addition to the t. cinnamon, and instead of ice I used frozen zucchini. This is definitely going to become a favorite!  :), , , Reply, , , , , , , , Aimee, , says, , , August 26, 2020 at 2:55 pm, , , , So glad you enjoyed it! Frozen courgette sounds interesting..., , , Reply, , , , , , , , , , Stephanie Roark, , says, , , October 01, 2016 at 4:45 pm, , , , The smoothie sounded good, but 4 dates seemed a bit much, so I only added 2 and replaced the omitted with a teaspoon of maple syrup. It was amazing and tasted a little more authentic to carrot cake. Thank you for making a great recipe without bananas. :), , , Reply, , , , , , , , Aimee, , says, , , October 02, 2016 at 12:47 am, , , , I'm so glad you enjoyed it, Stephanie! Thanks for the note about it working well with maple syrup :-), , , Reply, , , , , , , , , , Ashley, , says, , , July 07, 2016 at 8:58 pm, , , , Oooh I haven't tried a carrot cake smoothie yet. I have done pumpkin and sweet potato though. Both are great. I love the walnuts idea but I might try it with pecans instead. :), , , Reply, , , , , , , , Aimee, , says, , , July 10, 2016 at 1:03 am, , , , Pecans would be awesome too! Let me know if you try it :-), , , Reply, , , , , , , , , , Sarah | Well and Full, , says, , , January 05, 2016 at 9:35 pm, , , , This smoothie looks amazing Aimee!! Carrot cake is one of my faves :D, , , Reply, , , , , , , , Aimee, , says, , , January 05, 2016 at 10:21 pm, , , , Thanks Sarah, you have to try it!! It totally curbed my carrot cake cravings..., , , Reply, , , , , , , , , , Laura, , says, , , January 05, 2016 at 8:13 pm, , , , At last! I'm exactly the same when it comes to nanas and I have real trouble finding recipes without them so thank you! :) I'm bed bound and need carers while Mum's at work so she makes me a smoothie every morning and puts it in the fridge for the carers to give me at lunch, we've been looking for new recipes for her to try (she's usually just a shove it all in woman) so she'll want to give this a go! Do you do many banana free smoothie recipes? Love your blog and your ice cream book :) xx, , , Reply, , , , , , , , Aimee, , says, , , January 05, 2016 at 10:20 pm, , , , Thanks Laura! Yes, all my smoothies are banana-free :-) I usually use chia seeds to thicken them but sometimes nuts too. Here are my smoothie recipes so far:, http://wallflowerkitchen.com/?s=smoothie, Sorry to hear you are bed-bound. What other things do you tend to eat, do you have any recipe requests for easy-to-make meals? x, , , Reply, , , , , , , , Laura, , says, , , January 09, 2016 at 2:05 pm, , , , Thank you, those will definitely come in handy! :) Mum's still learning how to cook gluten free, vegan and refined sugar free whilst I also have an allergic reaction to rice flour! Bless her. It's so lovely of you to ask! Anything high in protein would be much appreciated and if you could make it sweet then even better, major sweet tooth in this house :D keep doing what you're doing, I love your blog and you seem lovely <3, , , Reply, , , , , , , , Aimee, , says, , , January 11, 2016 at 2:43 pm, , , , thank you lovely! I will keep that in mind for my future recipes then :-) I too was once bedbound for a long stretch and it was near impossible to eat healthy. My mum's a good cook but like yours, was not familiar with \"healthier\" cooking (which is really what you need when you're unwell) so it was frustrating not being able to make things for myself! anyway, keep well and keep an eye out for sugar-free sweet things coming soon x, , , Reply, , , , , , , , , , Primary Sidebar, , , , I'm Aimee, , the author behind the Wallflower Kitchen blog and 'Great British Vegan' cookbook, , More about me →, , , Trending recipes, , Baked Bubble & Squeak Cakes, Creamy Vegan Mushroom Risotto, Easy Vegan French Toast, Footer, , ↑ back to top, , , , About, , , Privacy Policy, , About, , , , , Contact, , , Contact me, , , , Pinterest, , RSS Feed, , YouTube, , , , , As an Amazon Associate I earn from qualifying purchases. This blog earns income from ads., , Copyright © 2024, Wallflower Kitchen, , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 23.2K, , shares, , , , , , , , , , , , , , Instructions: ",
        "Coconut Matcha Smoothie": "Ingredients:  Instructions: ",
        "Apple peanut butter smoothie": "Ingredients: , , , , , , , , Cook Mode, (Keep screen awake), , , , , , , 1, , cup, , unsweetened almond milk, , , , 1, , , small apple, chopped, , , , 2, , tablespoons, , natural peanut butter, , , , 2, , teaspoons, , honey (Optional), , , , 1, , teaspoon, , vanilla extract, , , , ¼, , teaspoon, , ground cinnamon, , , , , , 4-6 ice cubes, , , ,  Instructions: , , , Combine almond milk, apple, peanut butter, honey (if using), vanilla, cinnamon and ice cubes in a blender. Puree until smooth., , , , , , , , , , , , , , , , Equipment, , , Blender, , Originally appeared: EatingWell.com October 2016, , Rate It, , , , , , Print, , , , , , , , , Nutrition Facts, (per serving), , , , , 317, , Calories, , , , 19g, , Fat, , , , 25g, , Carbs, , , , 8g, , Protein, , , , , , , , , Show Full Nutrition Label, , Hide Full Nutrition Label, , , , , , , , Nutrition Facts, , , , , Servings Per Recipe, , 1, , , , , , Serving Size, , 2 1/2 cups, , , , , , Calories, , 317, , , , , , , % Daily Value *, , , , , Total Carbohydrate, 25g, , 9%, , , , , Dietary Fiber, 5g, , 18%, , , , , Total Sugars, 15g, , , , , Protein, 8g, , 17%, , , , , Total Fat, 19g, , 24%, , , , , Saturated Fat, 3g, , 13%, , , , , Vitamin A, 522IU, , 10%, , , , , Vitamin C, 5mg, , 6%, , , , , Sodium, 278mg, , 12%, , , , , Calcium, 466mg, , 36%, , , , , Iron, 1mg, , 5%, , , , , Magnesium, 7mg, , 2%, , , , , Potassium, 164mg, , 3%, , , , , Nutrition information is calculated by a registered dietitian using an ingredient database but should be considered an estimate., , * Daily Values (DVs) are the recommended amounts of nutrients to consume each day. Percent Daily Value (%DV) found on nutrition labels tells you how much a serving of a particular food or recipe contributes to each of those total recommended amounts. Per the Food and Drug Administration (FDA), the daily value is based on a standard 2,000 calorie diet. Depending on your calorie needs or if you have a health condition, you may need more or less of particular nutrients. (For example, it’s recommended that people following a heart-healthy diet eat less sodium on a daily basis compared to those following a standard diet.), , (-) Information is not currently available for this nutrient. If you are following a special diet for medical reasons, be sure to consult with your primary care provider or a registered dietitian to better understand your personal nutrition needs., , , , , , Additional reporting by, , , Jan Valdez, , , , , Jan Valdez, , , , Jan Valdez has years of experience working in test kitchens, primarily in research and development and product development. Her experience in the Good Housekeeping test kitchen in New York City launched a career in professional test kitchens., , , , , EatingWell's Editorial Guidelines, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Related Articles, , , , , , , , , , , , , , , , , , , , , Strawberry-Pineapple Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Peanut Butter-Strawberry-Kale Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Strawberry-Blueberry-Banana Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Peanut Butter & Chocolate Banana Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Strawberry-Mango-Banana Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Mermaid Smoothie Bowl, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Vegan Smoothie Bowl, , , , , , , , , , , , , , , , , , , , , , , , , 10 mins, , , , , , , , , , , , , , , , , , , , , , , , , Cherry Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , , , , Strawberry-Chocolate Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Berry-Banana Cauliflower Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 10 mins, , , , , , , , , , , , , , , , , , , , , , , , , Peanut Butter & Jelly Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , , , , , , , , , , , , Green Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 10 mins, , , , , , , , , , , , , , , , , , , , , , , , , Berry-Almond Smoothie Bowl, , , , , , , , , , , , , , , , , , , , , , , , , 10 mins, , , , , , , , , , , , , , , , , , , , , , , , , Make-Ahead Smoothie Freezer Packs, , , , , , , , , , , , , , , , , , , , , , , , , 15 mins, , , , , , , , , , , , , , , , , , , , , , , , , Cranberry-Apple Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 6 mins, , , , , , , , , , , , , , , , , , , , , , , , , Really Green Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , 5 mins, , , , , , , , , , , , , , EatingWell, , , , , , Newsletters, , , , , Follow Us, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Healthy Recipes, , Meal Plans, , Healthy Eating, , Healthy Cooking, , Healthy Lifestyle, , Special Diets, , Diabetes, , News, , , About Us, , , , Nutrition Guidelines, , , , Privacy Policy, , , , Product Reviews, , , , Advertise, , , , Terms of Service, , , , Careers, , , , , Your Privacy Choices, , , , , , , , , , Contact, , , , , , , , , , , , , , , , , , EatingWell\nis part of the, Dotdash Meredith, publishing family., , , , , , , , , Dialog Heading, , , , , , , , , , , , , , , , , Newsletter Sign Up, , , , , , , , , , , , , , , , Newsletter Sign Up, , , , , , , , , , , , , , , , , , , , , , By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts., Cookies Settings, , Accept All Cookies, ,",
        "Pear Ginger Smoothie": "Ingredients: but I really wanted something different this time. Usually it’s all about frozen bananas and berries, but that gets old after a while, plus it’s more summery and Colorado is so far from those warm summer months I don’t even want to think about it. Case and point, it was 8 degrees out on my long run Saturday morning., , It turns out if you dice up a couple of pears and freeze them, they make an excellent addition, not to mention one that’s full of fiber to this green smoothie. The fresh grated ginger is perfect if your stomach is all sorts of angry with you from the not so healthy foods you’ve been indulging in. Not only does that freshness give you a cleansing feeling, but it can also help soothe that bloated, grumbling, upset stomach. To give the smoothie a healthy dose of protein to keep me full until lunch, I added Greek yogurt and almond butter, works like a charm every time. Let’s ditch the cookies for breakfast and the chocolates for snacking and replace them with this pear ginger smoothie instead!, , , , 4.46, from, 35, votes, , Pear Ginger Smoothie, , By, Danae Halliday, , Prep:, 5, minutes, , mins, Total:, 5, minutes, , mins, Servings:, 2, , smoothies, , , , , , Save, Saved, , Pin, , Print, , , , This pear ginger smoothie is full of fiber, protein and greens!, , , , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , 1x, 2x, 3x, ▢, 1, , cup, , unsweetened almond milk, , , or milk of choice, ▢, 1, , cup, , spinach, ▢, 1, , heaping cup diced frozen pears, ▢, 1/2, , cup, , plain Greek yogurt, ▢, 1, , tablespoon, , almond butter, ▢, 1, , tablespoon, , honey or to taste, ▢, 1/2, , teaspoon, , fresh grated ginger, ▢, 1/2, , teaspoon, , vanilla extract, , , , Nutrition, Calories:, 292, kcal, Carbohydrates:, 36, g, Protein:, 21, g, Fat:, 9, g, Saturated Fat:, 2, g, Polyunsaturated Fat:, 6, g, Cholesterol:, 15, mg, Sodium:, 171, mg, Fiber:, 6, g, Sugar:, 21, g, Nutrition information is automatically calculated, so should only be used as an approximation., , , , Tried this? Leave a comment below!, , More Smoothie Recipes, , Orange Creamsicle Smoothie, , Raspberry Green Tea Smoothie, , Snickerdoodle Smoothie, , , , , , , , 73552, , shares, , , , , , , Facebook, , , , , Twitter, , , , , Pinterest, , , , , Email, , , , , Yummly, , , , You May Also Like..., , GF, Gluten Free, LC, low carb, Southwest Chicken Salad, VG, Vegetarian, Greek Yogurt Cheesecake Bars, VG, Vegetarian, Blueberry Lemon Coffee Cake, GF, Gluten Free, Sloppy Joe Bowls, , , , Get new recipes sent to your inbox!, Subscribe to get new recipes first!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Subscribe, , , , , , 4.46 from 35 votes (, 35 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , 24 Comments, , , , , , CAROL POPE, , says:, , , , February 10, 2020 at 11:42 am, , , , , Thank you for sharing this post. It is yummy and refreshing! I didn’t process it long enough will do better next time. But there certainly will be a next time., , , Reply, , , , , , , , Danae, , says:, , , , February 10, 2020 at 3:39 pm, , , , , Happy to hear you liked the smoothie Carol!, , , Reply, , , , , , , , , , Phyllis, , says:, , , , April 4, 2018 at 10:08 pm, , , , , This is my favorite smoothie recipe! I always buy peRs when they’re on sale and freeze for this smoothie! Wonderful combination of flavors!, , , Reply, , , , , , , , Danae, , says:, , , , April 6, 2018 at 11:25 am, , , , , Thanks Phyllis, It’s one of my favorite smoothie recipes as well. :-), , , Reply, , , , , , , , , , Sandra, , says:, , , , January 12, 2017 at 3:09 pm, , , , , I just wanted to say that adding a spoonful of chia seeds might be good, especially for those who feel that a smoothie might not be enough to see them through to their next meal., , I’m brand new to this site (after checking out a pin for this pear smoothie) and am going to take some time to look at some of your other posts. BTW, nice photos of the smoothies… the staging really makes them look extra delicious!!, , , Reply, , , , , , , , Danae, , says:, , , , January 12, 2017 at 3:11 pm, , , , , Hi Sandra,, , Thanks for stopping by and for the suggestion about the chia seeds. They would be an excellent addition for some extra protein and fiber., , , Reply, , , , , , Comment navigation, Older Comments, , , , Welcome!, , Hi, I’m Danae! Blogger, photographer, and avid runner! My mission is to create delicious, mostly healthy, easy, to colorful salads, comforting pasta recipes, the occasional treat, and more., , , About, , Work With Me, , Contact, , , , , , , , , , Spring Favorites, , , , GF, Gluten Free, Grilled Chicken and Asparagus Pesto Pasta, V, Vegan, VG, Vegetarian, GF, Gluten Free, DF, Dairy Free, Berry Fruit Salad, VG, Vegetarian, GF, Gluten Free, Lemon Blueberry Baked Oatmeal, One Pot Creamy Chicken and Asparagus, , , , Popular, , GF, Gluten Free, Chicken Gyro Bowls, GF, Gluten Free, DF, Dairy Free, Honey Chipotle Chicken Rice Bowls, GF, Gluten Free, Southwest Ground Beef and Sweet Potato Skillet, VG, Vegetarian, GF, Gluten Free, Southwest Sweet Potato, Black Bean and Rice Skillet, As Seen In, Back to top, Recipe Runner, Recipes, , One Pan, , Bowls, , Salads, , About, , Work With Me, , Contact, , , , , , ©2025 Recipe Runner. All rights reserved., , Privacy & Disclosure Policy, •, Accessibility Statement, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , Instructions: ",
        "Anti Bloat Smoothie": "Ingredients: it also tastes delicious!, , , , Save This Recipe!, , Enter your email and I'll send it straight to your inbox. Plus you'll get new recipes from me every week!, , , Save Recipe, Δ, Email, SAVE!, , , By submitting this form, you consent to receive emails from Happy Healthy Mama., , , Let’s face it.  Some of the healthiest foods on the planet can cause some serious bloat.  I’m looking at you, broccoli.  Sorry lentils, I love you, but you aren’t doing my stomach any favors., , Now, I would never cut those healthy foods out of my diet just because they cause me to get bloated.  I just am careful not to eat them before I’m going out on a date night with my hubby.  Or any time I want to wear something that isn’t loose., , The good news is, just as there are foods that can cause bloating, there are also some foods that can fight the bloat.  I stuffed a whole bunch of anti-bloating foods into a smoothie.  Why?  For those times when you need something to eat, but, really, don’t want a bloated stomach., , Saturday night Tim and I had a date night planned.  Our dinner reservations were for 8 o-clock, which is a super late dinner for us.  I knew my noon lunch wouldn’t be enough to sustain me until dinner time, so I made this Anti-Bloat Smoothie.  It was filling enough to tide me over until dinner, and kept my stomach from getting the food baby look., , What’s in the Anti-Bloat Smoothie and how does it work?, , Cucumbers, :  They are loaded with water, which helps fight bloating., , Banana, :  Bananas are high in potassium.  Potassium helps regulate sodium levels, which prevents water retention.  Too much sodium is a big cause of bloating, so that’s why bananas (and other foods high in potassium) help with bloating., , Coconut Water, :  Like bananas, coconut water is high in potassium., , Ginger:, Ginger is a natural anti-inflammatory food as well as a digestive aid.  It soothes the digestive system and relaxes the muscles of the digestive tract, which keeps you from getting bloated.  You know I love my ginger.  Take a look at that huge hunk of fresh ginger in the picture below.  I eat one of those per week., , Apple Cider Vinegar, :  I list this one as optional in the smoothie recipe because the smoothie absolutely tastes better without it.  Apple cider vinegar, however, is a rock star for reducing gas and bloating.  So if you are super serious about reducing your bloat, add this to your smoothie., , The taste of this anti-bloating smoothie is fresh.  I love the cucumber and ginger together, and the banana sweetens it up just enough.  The coconut water flavor is subtle, not overpowering.  I really don’t love coconut water on its own, but do love it in my smoothies.  It’s filled with electrolytes, so it’s a great naturally hydrating beverage choice.  If you choose to add the, apple cider vinegar, it muddles the flavor a bit, but is still good., , May your days be bloat-free, friends!, , I love how smooth and creamy my, Vitamix blender, makes this Anti-Bloat Smoothie!, , How to Make the Anti-Bloat Smoothie, , , , , , , , , , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , The Anti-Bloat Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.8, from, 11, reviews, , , , , Author:, , Happy Healthy Mama, , , , Total Time:, , 5 mins, , , , Yield:, , 1, , 1, x, , , , , , , , , , Print Recipe, , , , , Print Recipe, , , , , Description, , , This Anti-Bloat Smoothie fights bloating and tastes delicious!, , , , , , , , , , Copy to clipboard, , Copy to clipboard, , , , , , , , Scale, , 1x, 2x, 3x, , , , , , , 1/2 cup, coconut water, , 1, banana, , 1, large cucumber, sliced, , 1, inch piece of fresh ginger, peeled and sliced, , handful of ice, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , , Hardcore Version: Add 1 tablespoon apple cider vinegar to the mix., , , , , , , Prep Time:, , 5 mins, Cook Time:, , 0 minutes, Category:, , smoothie, Cuisine:, , American, , , , , Nutrition, , , Serving Size:, , 1, , Calories:, , 180, , Sugar:, , 9g, , Sodium:, , 31mg, , Fat:, , 0g, , Carbohydrates:, , 43g, , Protein:, , 2g, , , , , , , , Did you make this recipe?, , Tag, @happyhealthymama, on Instagram and hashtag it, #happyhealthymama, , , , , , , , Smoothies are a great way to get ultimate nutrition into your diet quickly! If you’d like to get a wide variety of fruits and vegetables into your diet every week, focus on NOT overeating, fight inflammation, and gain more energy, take the, 31 Day Smoothie Challenge, ! Subscribe to my newsletter below and you’ll get FREE access to all the recipes and grocery lists you need to get started., , Click Here to Subscribe, Join the Challenge, and Get the Smoothie Recipes, , , , , , 275039, , shares, , , , , , , , , Pinterest, , , , , , , Facebook, , , , , , , Twitter, , , Filed Under:, Anti-inflammatory Diet, Previous Post:, « Healthy Chocolate Rice Crispy Treats, Next Post:, What I Ate Wednesday (And Thoughts on Calorie Counting) », Reader Interactions, Comments, , , , , , Jennifer M Keeler, , says, , , July 11, 2023 at 1:09 pm, , , , I just started this and it taste delicious.  Will this make me gain weight??, , , Reply, , , , , , , , Maryea, , says, , , July 12, 2023 at 11:14 am, , , , One smoothie will not make you gain weight. 😉, , , Reply, , , , , , , , , , Stephanie, , says, , , March 14, 2023 at 10:33 pm, , , , Need to keep this on hand!, , , Reply, , , , « Older Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Notify me of follow-up comments by email., , Notify me of new posts by email., , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Footer, , , Privacy, , , , Copyright © 2025 ·, Cookd Pro Theme, on, Genesis Framework, ·, WordPress, ·, Log in, , , , , , , , , , , , , , , , , , , , , , Instructions: , , , ",
        "Vegan apple pie smoothie": "Ingredients: , , The steps (with pictures), , , , Other adaptations, , , Use another vegan milk:, Don't like almond milk? No problem! I get it...You are more than welcome to use, Cashew Milk, , instead. If you like milk with a strong nutty taste to it then, Pistachio Milk, or, Brazil Nut Milk, will most likely be your thing., , Yield thickness:, Oats, banana, coconut yoghurt and ice cubes are some great ways to achieve a thicker smoothie to the point of making a smoothie bowl., , Protein powder:, Want to turn this awesome smoothie into a protein powerhouse? Then peanut, almond or cashew butter are your thing or even add a scoop of your favourite post workout powder., , More spices:, Feel free to add some mace, ginger, nutmeg or even cloves, , Go gree: yup! Wanna turn this into a green monster smoothie, add some spinach, kale or greens., , , Notes and tips, , , Freeze down your apples., That's right, be ahead of the smoothie game by freezing some chopped up apples. Buy a bunch of them and stick them straight in the freezer so you are fully prepared., , before whipping up your smoothie., , I don't recommend preparing this overnight,, it works best on the day, at the same time., , If you don't want to include dates,, leave them out or add a splash of maple syrup instead., , Don't forget to check out this article on, How to Keep Your Apples From Turning Brown., , , , Other smoothie recipes you may like, , , Blueberry Banana Smoothie, , Apple Spinach Smoothie, , Peanut Butter Banana Breakfast Smoothie, , Orange Mango Green Smoothie, , Tropical Fruit Smoothie, , Persimmon Pineapple Orange Smoothie, , , **Don't forget to comment below and star rate if you have tried my recipes. Let's be friends, and engage on, Facebook, , and, Instagram, I also like to pin on, Pinterest, , where you can find more amazing recipes.**, , , , , Vegan Apple Pie Smoothie, , , Start the day with this delicious apple pie smoothie - vegan, gluten free, paleo friendly, , , No ratings yet, , , Print, , Pin, , Rate, , , Course:, Drinks, Cuisine:, American, , Prep Time:, 2, minutes, , minutes, Cook Time:, 1, minute, , minute, Total Time:, 3, minutes, , minutes, , Servings:, 2, , servings, , Calories:, 248, kcal, , Author:, Charla, , , ▢, 1, , Frozen apple, , cored and chopped, ▢, ¼, , teaspoon, , of cinnamon, ▢, 1, , teaspoon, , of flaxseed, ▢, 1, , tablespoon, , of chia seeds, ▢, ¼, , cup, , of walnuts, , almonds or other nuts work too, ▢, 1, , cup, , of almond milk, ▢, 5, , pitted  dates, , medjool or otherwise, , , , Notes, , Freeze down your apples., That's right, be ahead of the smoothie game by freezing some chopped up apples. Buy a bunch of them and stick them straight in the freezer so you are fully prepared., , to before whipping up your smoothie., , I don't recommend preparing this overnight,, it works best on the day at the same time., , If you don't want to include dates,, leave them out or add a splash of maple syrup instead., , Don't forget to check out this article on, How to Keep Your Apples From Turning Brown., , , Nutrition, Calories:, 248, kcal, |, Carbohydrates:, 31, g, |, Protein:, 5, g, |, Fat:, 14, g, |, Saturated Fat:, 1, g, |, Sodium:, 165, mg, |, Potassium:, 301, mg, |, Fiber:, 8, g, |, Sugar:, 21, g, |, Vitamin A:, 49, IU, |, Vitamin C:, 4, mg, |, Calcium:, 214, mg, |, Iron:, 1, mg, , , , , Tried this Recipe? Tag me Today!, Mention, @ThatGirlCooksHealthy, or tag, #ThatGirlCooksHealthy, !, , , , More Smoothies and Drinks, Tropical Bliss Smoothie, Christmas Holiday Punch, Persimmon Smoothie (Vegan), Vegan Pumpkin Spice Hot Chocolate, About, Charla, I'm Charla. Caribbean foodie & Certified Health Coach. Welcome to the heaven of gluten and dairy free recipes as well as modernised healthier alternatives to some of your favourite Caribbean recipes., , Comments, , , , , , Allyson, , says, , , April 20, 2015 at 2:32 am, , , , This looks perfect for breakfast!  nice photos 🙂, , , Reply, , , , , , , , Charla, , says, , , April 20, 2015 at 7:46 am, , , , Thank you! it certainly is....., , , Reply, , , , , , , , , , Sharon @ Savormania, , says, , , April 19, 2015 at 8:55 pm, , , , Looks delicious! Such a healthy way to start the day!, , , Reply, , , , , , , , Charla, , says, , , April 19, 2015 at 9:01 pm, , , , Thanks Sharon, it's one of my favourite breakfast smoothies., , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , you MUST enable javascript to be able to comment, , Δ, , , , , Hey, I'm Charla!, , Caribbean foodie & Certified Health Coach. Welcome to the heaven of gluten and dairy free recipes as well as modernised healthier alternatives to some of your favourite Caribbean recipes., , About me, Popular, Chocolate Crumble Pudding, Baked Snapper (Mojo Style), Avocado Chocolate Ice Cream, Carrot Cake Porridge, Sea Bream Recipe (Air Fried), No Bake Chocolate Cheesecake Recipe (Gluten  Free, Vegan), Vegan Carrot Pudding, Chicken Foot Souse, Beef and Broccolini Stir Fry, Smoked Herring Recipe, As Featured In, , , , , Footer, ↑ back to top, Featured In, About, , Privacy Policy, , , Contact, , Contact, , FAQ, Copyright © 2025, That Girl Cooks Healthy, , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , Instructions: ",
        "Coffee Smoothie": "Ingredients: flaxseeds, and bananas, this easy-to-make beverage is a godsend for those busy mornings. The caffeine from the coffee will wake you up, while the complex carbs from the oats will keep you energized throughout the morning., , With its creamy texture and rich flavors, this coffee smoothie feels like an indulgent treat but is actually good for you. It’s the perfect solution for when you’re craving something sweet but still want to stick to your health goals., , A Coffee Smoothie isn’t just a beverage; oh no! It’s an excellent choice for those who prioritize their health but refuse to compromise on flavor. I advise you to enjoy this creamy goodness of a coffee smoothie and start your day on a high note! You won’t be disappointed., , Why You’ll Love Our Coffee Smoothie, , Rich, creamy, with a subtle hint of mocha., , oats, and fruits., , Packed with protein and beneficial fats for satiety., , Adaptable to decaffeinated coffee for those who prefer less caffeine., , Can use plant-based milk for those that follow a vegan diet., , How To Make Coffee Smoothie, , Pour your brewed coffee into an ice cube tray and let it freeze for several hours or overnight., , The following morning, including your now-frozen coffee cubes. Blend until silky smooth., , Do a quick taste test and sweeten as desired., , Pour into a glass and serve. Voila! Your nutritious breakfast drink is ready., , Fun Add-Ins, , Want to mix things up? Add a spoonful of almond butter or peanut butter for extra creaminess, a scoop of protein powder for muscle recovery, or even a dash of vanilla extract for a flavor boost., , Smoothie Making Tips, , For a thicker smoothie, add a handful of ice cubes or use frozen bananas., , Remember to blend your oats and flaxseeds completely for a smoother texture., , Lastly, if you’re using a less powerful blender, chop your banana and coffee ice cubes into smaller pieces to make blending easier., , Variations, , The beauty of a coffee smoothie is its versatility. You can adjust the recipe according to your personal preferences or dietary needs. Prefer a vegan version? Opt for plant-based milk and a sweetener like agave nectar. Need a gluten-free option? Use certified gluten-free oats. The possibilities are nearly endless!, , , Enrich this coffee smoothie with healthy fats and achieve a creamy consistency by adding half of a small ripe avocado., , More Smoothies Recipes, , Blueberry Pomegranate Smoothie, , Banana Kiwi Kale Smoothie, , Coffee Protein Smoothie, , ENJOY!, , Pin this now to find it later, Pin It, , , , , , Save, Saved, , Pin, , Print, , , , , 4.92, from, 12, votes, , Coffee Smoothie, , by, Katerina | Diethood, , This easy, Coffee Smoothie, recipe is the perfect way to start your morning! Made with coffee, oats, flaxseeds and bananas, it's a healthy recipe for people on the go., , Prep Time:, 5, minutes, , minutes, Freezing Time:, 3, hours, , hours, Total Time:, 3, hours, , hours, , 5, minutes, , minutes, Servings:, 2, , Servings, , , , , 1x, 2x, 3x, ▢, 1, , cup, , strong brewed coffee, ▢, 1, , banana, ▢, ¼, , cup, , rolled oats, ▢, 1, , tablespoon, , cocoa powder, ▢, 1, , tablespoon, , flaxseeds meal, ▢, ⅛, , teaspoon, , ground cinnamon, ▢, 1, , cup, , milk,, , , soy milk or almond milk, ▢, 1, , teaspoon, , honey, , Want to save this recipe?, Enter your email below and we’ll send the recipe straight to your inbox!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , , including the coffee ice cubes, and blend until smooth., Taste for sweetness and adjust accordingly., Serve., , Video, , Notes, Blend in stages, : To get a smoother texture, , Use a ripe banana, : Ripe bananas are naturally sweeter and blend better, giving your smoothie a sweeter and creamier texture., , Freeze your coffee in advance, : Frozen coffee cubes not only chill your smoothie but they also keep it from becoming watered down. Be sure to freeze your coffee the night before., , Customize the sweetness, : Depending on the ripeness of your banana and your personal preference, you might not need any additional sweetener., , Add protein, : Consider adding a scoop of your favorite protein powder for an even more satiating smoothie., , Toppings, : Consider topping your coffee smoothie with a sprinkle of cacao nibs, granola, chia seeds, or a drizzle of nut butter for added texture and flavor., , , , Nutrition, Calories:, 201, kcal, |, Carbohydrates:, 31, g, |, Protein:, 7, g, |, Fat:, 7, g, |, Saturated Fat:, 3, g, |, Polyunsaturated Fat:, 1, g, |, Monounsaturated Fat:, 1, g, |, Cholesterol:, 15, mg, |, Sodium:, 52, mg, |, Potassium:, 558, mg, |, Fiber:, 5, g, |, Sugar:, 16, g, |, Vitamin A:, 236, IU, |, Vitamin C:, 5, mg, |, Calcium:, 174, mg, |, Iron:, 1, mg, , , , , , , Did you make a recipe?, Leave a rating, , , , , , , , , , , , , , , , , , , , , , , 4.92 from 12 votes (, 2 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating:, , , , Recipe Rating:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , 66 Comments, , , , , , Andrea, , says:, , , , May 26, 2021 at 7:15 AM, , , , , , , , I absolutely love this recipe! I needed something to get me back into smoothies, especially in the morning. In mine, I add about 1/2 TBSP of maca powder and sometimes some peppermint leaves from my herb garden. This is my favorite coffee smoothie recipe, and I share it with everyone!, , , Reply, , , , , , , , Katerina Petrovska, , says:, , , , May 26, 2021 at 9:31 AM, , , , , That’s great! I am very glad you enjoyed it! Thank YOU! 🙂, , , Reply, , , , , , , , , , cayetana, , says:, , , , Jun 2, 2020 at 10:49 PM, , , , , Hi, can I replace the rolled oats with instant oats? Can’t wait to try this smoothie!, , , Reply, , , , , , , , Steph, , says:, , , , May 27, 2021 at 4:45 PM, , , , , Since  I’m lactose sensitive, can I use my lactose free milk?, , , Reply, , , , , , , , Katerina Petrovska, , says:, , , , May 27, 2021 at 5:31 PM, , , , , Yes, that will definitely work., , , Reply, , , , , , , , , , , , Jordyn, , says:, , , , Apr 22, 2020 at 11:36 AM, , , , , , , , This was very yummy!!, , , Reply, , , , , , , , Katerina Petrovska, , says:, , , , Apr 24, 2020 at 9:32 AM, , , , , I am very happy you enjoyed it! Thank YOU! 🙂, , , Reply, , , , , , , , LL, , says:, , , , Sep 13, 2020 at 3:26 PM, , , , , , , , This was good. I used hot cocoa powder instead of cocoa powder., , , Reply, , , , , , , , , , Danny wells, , says:, , , , Aug 17, 2019 at 3:41 AM, , , , , Wow, this is so wonderful, thank you so much for this, Love the recipe, , , Reply, , , , , , , , Kathleen Seitz, , says:, , , , Aug 21, 2019 at 2:25 PM, , , , , You have the best recipes and I’ve been following you for years and pin so many, but how come when I copy a recipe it never has the picture on it like you show??, Also leaving  up that sad lady’s comment shows what a wonderful person you are and you know it takes all kinds…..one time {on a blog I wasn’t all that into anyway] I told the gal there was an entire part of her recipe missing as I really wanted it and thought she would be happy to have it brought to her attention. OMG I received the most filthy nasty email I could not believe it and i replied and said I am sorry for being kind and trying to help you out, please remove my name from this list and the Best of everything to you! What else can you do., , , Reply, , , , , , , , , , Diana Banks, , says:, , , , Apr 27, 2018 at 7:38 PM, , , , , I cannot ha e rolled oats can I use instant, , , Reply, , , , , , , , Eve, , says:, , , , Mar 31, 2018 at 9:24 AM, , , , , , , , Very good! I’ve been making this for my husband and I every morning for a few weeks now. We have been changing it up day by day to meet our needs.  Like adding honey flavored yogurt to ours for the probiotics and extra protein., , , Reply, , , , , , , , Christina, , says:, , , , Mar 1, 2018 at 9:02 AM, , , , , , , , Not bad at all! A different flavor combination than what I’m used to but it’s really not a bad one. I love that I can have a frozen coffee drink without feeling the guilt that comes along with drinking the syrupy sugary concoctions from coffee shops. Also, I didn’t have frozen coffee but I did have cold brew so I used that and added ice. In the end, it turned out fine just thinner than your recipe. Thank you for sharing!!!, , , Reply, , , , Comment navigation, Older Comments, , , , Hi! I’m Katerina!, , I’m so happy you stopped by!, , For me, cooking and eating go beyond just having a meal—they’re treasured opportunities to connect and savor moments with loved ones. I was taught how to cook delicious meals from scratch using simple, , , Read more about me, , , , , , , , , , Reader Favorites, , Tender and Juicy Pork Loin Roast Recipe, Garlic Butter Oven Baked Tilapia, Oven Baked Bone-In Pork Chops, Crack Chicken, Juicy Stove Top Chicken Breasts Recipe, Moo Shu Chicken, As Seen In, Back to top, Diethood, , , , , Course, , , Breakfast, , Lunch, , Dinner, , Desserts, , ,  Instructions: , , Air Fryer, , Instant Pot, , Slow Cooker/Crock Pot, , , , Shop, , About, , Search, , , Home, , •, , Recipe Finder, , •, , Snacks, Coffee Smoothie, by, Katerina, 4.92, from, 12, votes, Feb 08, 2016, Updated Jun 14, 2023, Pin Recipe, Jump to Recipe, Comments, This post may contain affiliate links. Please read our, disclosure policy, ., , , , , This easy, Coffee Smoothie, recipe is the perfect way to start your morning! Made with coffee, oats, flaxseeds, and bananas, it’s a healthy coffee recipe for people on the go., , , Start Your Day With A Coffee Smoothie, , Shake up your morning routine with our revitalizing, Coffee Smoothie, Pour brewed coffee into an ice cube tray and freeze for several hours or overnight., , , Air Fryer, , Instant Pot, , Slow Cooker, , , , About, , , About Me, , Work With Me, , Shop, , , , Connect, , , Instagram, , Pinterest, , Facebook, , Twitter, , Tik Tok, , , , ©2025 Diethood. All rights reserved., , Privacy Policy, •, Accessibility Statement, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Chocolate overnight oatmeal smoothie": "Ingredients: , , , , Scale, , 1x, 2x, 3x, , , , , , , 1/2 cup, (, 40 g, ) rolled oats**, , 1 Tbsp, (, 7 g, ) chia seeds, , 1 Tbsp, (, 16 g, ) natural almond butter***, , 2 Tbsp, (, 10 g, ) unsweetened cocoa powder, , 1 cup, (, 240, ml) unsweetened vanilla almond milk****, , 1 Tbsp, (, 15, ml) maple syrup, , 1/2 tsp, vanilla extract, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , preferably overnight., , The next morning, blend until a smooth and creamy consistency is reached, adding more milk if smoothie is too thick. Transfer back to a bowl or glass, add desired toppings, and enjoy!, , , , , , Notes, , , * Cook time refers to chilling time. ** Be sure to use certified gluten-free oats if you need this to be gluten-free. You can also reduce the oats to ⅓ cup and add a scoop of your favourite protein powder. *** I used almond because it has a sweet and mild taste. Feel free to use your favourite nut/seed butter, but the flavour might shine through a little. **** If smoothie is too thick, add a few extra splashes of milk to the blender., , , , , , Prep Time:, , 5 mins, Cook Time:, , 3 hours, , , , , , , , , , , , Did you make this recipe?, , Tag, @runwithspoons, on Instagram and hashtag it, #runningwithspoons, , , , , , , , Looking for more, thick and creamy, , oatmeal breakfasts, ? Try one of these!, , Almond Joy Overnight Oatmeal Smoothie, Frozen Hot Chocolate Breakfast Smoothie, Strawberry Coconut Overnight Oat Parfait, Oatmeal Cookie Dough Smoothie, Hot Chocolate Breakfast Smoothie, , , Filed Under:, Breakfast, , , Gluten Free, , , Recipe, , , Smoothies & Drinks, , , Vegan, , Tagged With:, breakfast, , , chocolate, , , gluten-free, , , healthy, , , overnight oats, , , recipe, , , smoothie, , , vegan, Previous Post:, « . currently – august 2015 ., Next Post:, . thinking out loud #142 . », Reader Interactions, Comments, , , , , , Jay, , , February 26, 2024 at 7:30 am, , , , I love this recipe! It feels fancy and it’s filling and delicious. My blender isn’t strong enough to be able to add oats directly into a smoothie but it turns out soaking them overnight works! I make little adjustments like adding Greek yogurt sometimes or a half a frozen banana to make it extra cold. Thank you!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , Rachel, , , January 18, 2021 at 7:23 am, , , , I’m going to soak my chia seeds separately, mine stayed crunchy I’m guessing the oats soaked up all the milk., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , Season C, , , November 7, 2020 at 6:51 pm, , , , Thank you for the recipe. i made it the night before and had it warm the next morning. It was very good! Next time I’m going to try it with Mexican chocolate., , , Reply, , , , , , , , Hina, , , August 1, 2020 at 9:35 pm, , , , Hi, I am breastfeeding and just love love this smoothie. I recently realized it has cocoa which has caffeine in it can I still have it? Would it affect breastfeeding?, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , Patricia, , , July 1, 2018 at 10:24 pm, , , , Hello just want to say I have made this a few weeks in a row and it has really saved my life after quitting coffee. It is a great morning pick me up and I usually eat a bit of it before I work out in the morning. I do have to say that I only add one tablespoon of cocoa powder because I found two to be too strong. I make it in my food processor because I have no blender. Thank you for the recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , D. Linder, , , January 5, 2018 at 12:21 pm, , , , This sounds awesome, and I am ready to try it.  Has anyone calculated the nutrition?  I need to count calories, carbs, cholesterol, etc., , , Reply, , , , , , , , Amanda @ .running with spoons., , , January 5, 2018 at 2:43 pm, , , , I haven’t had a chance to go back and calculate all my older recipes yet, https://recipes.sparkpeople.com/recipe-calculator.asp, , , Reply, , , , , , , , , , O, , , November 15, 2016 at 6:37 am, , , , I have made this every day this week. I substitute the chia seeds for ground flax and I mix in some Silk dark chocolate almond milk. Keeps me full all morning. Thank you for this!!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , « Older Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, Hi & Welcome to Spoons!, , , I'm Amanda - health coach, cookbook author, recipe developer, photographer, makeup junkie, and the blogger behind Running with Spoons - a blog dedicated to proving that healthy snacking doesn't have to be tasteless or boring, one delicious recipe at a time., More about Amanda →, , , Facebook, Instagram, Pinterest, Twitter, , Subscribe to get new recipes straight in your inbox, , , , , , , Delicious Gluten-free Recipes, , , Tasty Vegan Recipes, , , Search, , Footer, , , , Looking for more healthy recipes? Try one of these!, , , , , , , , , Search, , Privacy Policy, , Copyright © 2025 . running with spoons . on the, Foodie Pro Theme, , , , , Instructions: , , , , The night before",
        "Mocha Banana Breakfast Smoothie": "Ingredients: , , old-fashioned rolled oats, – adds a hearty fiber-rich component to the smoothie., , almond milk, – the liquid base of the smoothie, that also contributes a creamy texture., , banana, – acts as a natural sweetener, and adds potassium and other vitamins., , yogurt, – enhances the creaminess of the smoothie and introduces probiotics., , cocoa powder, – adds a rich chocolate flavor, creating a mocha profile., , espresso powder, – adds a robust coffee flavor and caffeinated kick., , ice, – thickens and chills the smoothie., , , , , How to make a Breakfast Smoothie with Oats, , , 1. SOAK., In a small bowl or jar, stir together the oats and 1 cup of the almond milk. Refrigerate overnight so that the oats can soften., , , 2. BLEND., In a blender, whir together the oat mixture, the remaining almond millk, banana, yogurt, cocoa powder and espresso powder., , , 3. ICE., Add the ice and blend until smooth., , , , , Oatmeal Breakfast Smoothie variations, , , SWEETENER., For added sweetness, add a bit of honey, agave nectar or maple syrup to the smoothie., , MILK., I’ve used plain almond milk here, but any flavor of almond milk, or another nut milk, or regular dairy milk all work great!, , PEANUT BUTTER., For extra creaminess and protein, add a spoonful of peanut butter., , PROTEIN / FLAX / CHIA., Feel free to add your favorite, protein powder, , flax seeds, or chia seeds to the mix., , , , , Banana Breakfast Smoothie Home Chef Tip, , To make this smoothie without soaking the oats overnight, , then proceed with the recipe., , , , , , WANT TO SAVE THIS RECIPE?, , Enter your email below and we'll send it to your inbox., , , , , I agree to getting emails from you., , , , , , , , How to serve an Oatmeal Breakfast Smoothie, , Pour your smoothie in a glass or mason jar (if taking it on the go)., Top it with a sprinkle of cocoa powder, , add a straw, and enjoy the velvety goodness!, , , , , Breakfast Smoothie storage, , Smoothies are best enjoyed right away, but this breakfast smoothie recipe, can be prepared and refrigerated overnight, . Store it in a mason jar with a lid, and give it a good shake in the morning before serving., , You can also freeze this coffee breakfast smoothie with oats. Place smoothie in a, freezer food storage container, with a tight fitting lid, leaving at least a half-inch clearance at the top of the container to allow for expansion. Or, freeze in freezer zip top bags., , Freeze for up to two months, . Thaw overnight in the fridge before serving., , , , , Banana Breakfast Smoothie FAQs, , What can I put in a smoothie to make it filling?, , For a filling smoothie, yogurt and nut butters., , , Is it good to have a smoothie for breakfast?, , Absolutely! Breakfast smoothies are a convenient and nutritious option, providing essential nutrients to start your day., , , Is it OK to put raw oats in a smoothie?, , Yes, especially if you soak them in liquid beforehand to achieve a smoother consistency., , , , , , , More Foxes Love Lemons Favorites, , , , , Lemon Smoothie, , Rigatoni Bolognese, , Fajita Veggies, , Recipe for Shrimp Ceviche, , Honey Mustard Pork Chop, , Easy Crab Rangoon Dip Recipe, , , , , , Carrot Cake Smoothie, , Pineapple Mango Smoothie, , Breakfast Board, , Blueberry Lemon Smoothie, , Best Beef Barley Soup Recipe, , Football Cookie, , , , , , Making Seasoned Rice, , Lasagna Recipe with Cottage Cheese, , Sockeye Salmon Recipe, , Mexican Pasta Dish, , Squash Spaghetti Noodles, , Christmas Salad, , , , , , , , Breakfast Smoothie with Oats, , , Author:, Lori Yates, , Yield:, 2, , servings, , Prep:, 10, minutes, , minutes, Total:, 10, minutes, , minutes, , , This Breakfast Smoothie is made with oats, yogurt and banana to keep you full all morning, along with espresso powder and cocoa to give you a mocha-flavored energy boost!, , 4.6, from, 8, ratings, , , Print Recipe, , Pin, Recipe, , Leave a, Review, , , , , ▢, 1 ½, , cups, , almond milk, , divided, ▢, 1, , cup, , old-fashioned rolled oats, ▢, 1, , banana, , cut into chunks, ▢, ¼, , cup, , vanilla or plain yogurt, ▢, 1 ½, , tablespoons, , cocoa powder, ▢, 1, , tablespoon, , espresso powder, ▢, 1, , cup, , ice, , , , , , Did you make this recipe?, Leave a Review, below or share a photo and tag me on Instagram, @foxeslovelemons, with the hashtag, #foxeslovelemons, ., , , © Foxes Love Lemons LLC. Images registered with U.S. Copyright Office., , , , , , , , , , , , , , , , , , , , , , , , Beverages, , Breakfast & Brunch, , Freezer Friendly, , Gluten Free, , , , , , , , Lori Yates, —, August 15, 2022 @ 9:50 am, , Reply, , , Hi Carol – it’s cocoa like you would use for baking., , , , , , , , , Kit, —, March 4, 2019 @ 10:55 pm, , Reply, , , Im sure they’ll be happy to have this for breakfast this week., , , , , , , Heather Smith, —, February 13, 2019 @ 8:28 pm, , Reply, , , I so love smoothies! Thanks for sharing this recipe! Definitely going to make this tomorrow!, , , , , , , Yang, —, February 12, 2019 @ 9:49 pm, , Reply, , , Mocha banana sounds delicious! This recipe can also be an early morning wake-up beverage during a hot summer morning, or maybe already even a two-in-one combo of breakfast and coffee added with other protein-rich fruits., , , , , , , Caitlin, —, August 14, 2015 @ 11:36 am, , Reply, , , Hi, do you know how many calories this is per serving? Thanks!, , , , , , , Lori Yates, —, August 18, 2015 @ 6:37 pm, , Reply, , , Hi Caitlin – I would suggest plugging the recipe into an online nutrition calculator such a My Fitness Pal 🙂, , , , , , , , , Shawn, —, June 18, 2015 @ 8:04 am, , Reply, , , Hi. Can this be done without the ice?, , , , , , , Lori Yates, —, June 18, 2015 @ 10:23 am, , Reply, , , Hi Shawn! You could certainly try it, but to be totally honest, I think it does need the ice. As I was developing the recipe, I took a few tastes without the ice, and thought it was too warm and thick 🙁, , , , , , , Shawn, —, June 18, 2015 @ 7:46 pm, , , Thank you Lori. I don’t think my blender can handle the ice. Perhaps I’ll try adding some cold water., , , , , , , Lori Yates, —, June 18, 2015 @ 7:49 pm, , , OH, I know – how about freezing the bananas first? Although, if your blender can’t handle ice, frozen bananas probably wouldn’t work, either. But yes, give it a try without the ice, and then if you need to add some cold water to thin it out, you can. Good luck 🙂, , , , , , , , , , , Jazz, —, April 12, 2015 @ 11:11 am, , Reply, , , I don’t like coffee too much but need an energy boost in the morning is there anyway that could work ??? xx, , , , , , , Lori, —, January 9, 2015 @ 8:13 pm, , Reply, , , I am having trouble finding espresso powder. I’ve never heard of it before. Where did you find? Any replacement ideas? I really want the coffee taste., Thanks!, , , , , , , Lori Yates, —, January 10, 2015 @ 12:27 am, , Reply, , , Hi Lori! I actially found it in my grocery store in the coffee section. Since it’s most often used for baking, some stores may stock it in the baking aisle with the extracts. This link has a bit more info:, http://www.thekitchn.com/pantry-basics-what-is-espresso-41586, . Unfortunately, it doesn’t look like there’s a great substitute for it. I hope you can find it!, , , , , , , , , Heather, —, January 4, 2015 @ 9:33 am, , Reply, , , My son has a severe nut allergy so no almond milk for us so will this work just as well with regular milk?, , , , , , , Lori Yates, —, January 4, 2015 @ 10:41 am, , Reply, , , Sure Heather, I think that would be just great!, , , , , , , , , Lori | Foxes Love Lemons, —, June 3, 2014 @ 1:46 pm, , Reply, , , I hope he enjoys it, Rosie!, , , , , , , Rosie, —, June 3, 2014 @ 4:14 am, , Reply, , , I am converting my boyfriend to having something for breakfast, this will be perfect!, , , , , , , Lori | Foxes Love Lemons, —, February 17, 2014 @ 6:22 pm, , Reply, , , Thanks Lydia. Good luck with your oat milk experiments 🙂, , , , , , , Consuelo - Honey & Figs, —, February 17, 2014 @ 4:33 pm, , Reply, , , What a perfect breakfast! Mocha banana sounds like a perfect combo! 😉, , , , , , , Lori | Foxes Love Lemons, —, February 17, 2014 @ 6:23 pm, , Reply, , , Thanks Consuelo!, , , , , , , , , lydiaf1963, —, February 17, 2014 @ 3:09 pm, , Reply, , , I’m not a big coffee drinker but I love mocha anything (and coffee ice cream go figure). This sounds really good! I’m experimenting with oat milk this week. I wanted it for smoothies as well., , , , , , , 4.63 from 8 votes (, 8 ratings without comment, ), , , , Leave a Reply, Cancel reply, Thank you for your comments! Please allow 1-2 business days for a reply. Our business hours are Monday through Friday, 9:00 am to 5:00 pm EST, excluding holidays. Comments are moderated to prevent spam and profanity., Your email address will not be published. Required fields are marked *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , , , , , , Hi, I’m Lori, a culinary school graduate in the Midwest who loves making restaurant-quality meals at home. I share reliable recipes for home chefs, , , More about me », , , , , reader favorites, Most Popular Recipes, , , , , , The Best Creamy Salmon Pasta, , , , , , , How to Cook Turkey Bacon in the Oven, , , , , , , The Best Chicken Pizza Recipe, , , , , , , BEST Recipe for Salmon Patties from Canned Salmon, , , , , , Looking for Something?, , , , Submit, , , , , , , , , , , , As Seen On..., , , get new posts via email, don’t miss a recipe!, , , , , , , , Back to Top, , Home, , About Me, , Recipe Index, , Work With Me, , Contact, , Privacy Policy, , , , ©2025 Foxes Love Lemons LLC, . All Rights Reserved., All images are registered with the United States Copyright Office., , Design by, Purr, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , , , , , 30 Minutes or Less, , One Pot/Pan, , Grilling, , Slow Cooker, , , , By Season, , , , , , Spring, , Summer, , Fall, , Winter, , , , , , famous salmon pasta, , About, , , , , , About Me, , Culinary School, , Work With Me, , Contact, , , , Subscribe, , , , , , , , , , Submit, , , , , , , , , , , , , Recipes, , , Recipe Index, , Savory, , Sweet, , Appetizers & Snacks, , Beverages, , Special Diets, , , Gluten Free, , Dairy Free, , Low Fat, , Vegan, , Vegetarian, , , , By Cuisine, , , Asian, , Italian, , Mediterranean, , Mexican & Tex-Mex, , Middle Eastern, , , , By Holiday, , , Valentine’s Day, , St. Patrick’s Day, , Easter, , Mother’s Day, , Fourth of July – Memorial Day – Labor Day, , Game Day, , Halloween, , Thanksgiving, , Christmas, , New Year’s, , , , , , 30 Minutes or Less, , One Pot/Pan, , Grilling, , Slow Cooker, , , , By Season, , , Spring, , Summer, , Fall, , Winter, , , , , , famous salmon pasta, , About, , , About Me, , Culinary School, , Work With Me, , Contact, , , , Subscribe, , , , , , , , , Search, , , , , , , , , , , Home, », Recipes, », Beverages, », Smoothies, », Oatmeal Breakfast Smoothie, , Oatmeal Breakfast Smoothie, , , Jump to Recipe, , by, Lori Yates, , January 16, 2024, , 27 comments, , , , , , , , , , , , , , , , , , , , , , , , , , This Breakfast Smoothie is made with oats, yogurt and banana to keep you full all morning, along with espresso powder and cocoa to give you a mocha-flavored energy boost!, , , Mocha Banana Breakfast Smoothie Recipe, , If you’ve ever started your day with, both a smoothie and a coffee, , but have struggled to decide which one you should make first, this Coffee Breakfast Smoothie recipe might just be a, game changer, for you., , It’s a fiber-rich smoothie made with oats, almond milk, yogurt and banana, but with an added kick of espresso powder and cocoa powder to make it mocha-style., , , Why you’ll love this Breakfast Smoothie, , , Lots of fiber, , to keep you full and energized all morning!, , While it can vary a bit by brand, the espresso powder in one serving of this smoothie should be, roughly similar in caffeine content to one shot of espresso, , meaning it’s a smoothie and coffee all in one!, , , , , , , , using the almond milk. Once oats are fully cooked, In medium bowl or jar, stir together 1 cup almond milk and oats. Cover and refrigerate overnight., Add banana, yogurt, cocoa powder, espresso powder, oat mixture and remaining 1/2 cup almond milk and blend until smooth., Add ice and blend until smooth. This is a pretty thick smoothie – if you prefer a thinner consistency, just add a bit more almond milk and blend until smooth., , , Notes, , For added sweetness, add 1 – 2 tablespoons honey, agave nectar or maple syrup to the smoothie., , , , Calories:, 276, kcal, , , Carbohydrates:, 49, g, , , Protein:, 11, g, , , Fat:, 6, g, , , Saturated Fat:, 1, g, , , Polyunsaturated Fat:, 2, g, , , Monounsaturated Fat:, 2, g, , , Cholesterol:, 2, mg, , , Sodium:, 263, mg, , , Potassium:, 503, mg, , , Fiber:, 8, g, , , Sugar:, 10, g, , , Vitamin A:, 57, IU, , , Vitamin C:, 5, mg, , , Calcium:, 289, mg, , , Iron:, 3, mg, , , No Cook, , Recipes, , Savory, , Smoothies, , Special Diets, , Vegetarian, , , , posted by, Lori Yates, on, January 16, 2024, (updated February 3, 2025), , , , 27 comments, , , Leave a comment », , , , , , , , , get new posts via email, don’t miss a recipe!, , , , , « Previous Post, Asian Chicken Cabbage Salad, , Next Post », , Creamy Spinach Mushroom Pasta, , , , , 27 comments on “Oatmeal Breakfast Smoothie”, , Leave a comment », , , , , , Susan, —, February 3, 2024 @ 11:17 am, , Reply, , , Hi Lori, I tried this today for breakfast as a warm smoothie, and will have to play with it because it came out too thick.  I used 2 cups of soy milk, ½ cup oats, 2T almond butter, and 2 scoops of chocolate protein powder.   The rest was as the recipe was written.  In the future I would omit the nut butter and make sure the oat measure was scant.  I ran my high speed blender on the soup cycle for 4 minutes.  Apart from being too thick, It was very nice.  I’ll definitely try it again.  I would also probably omit the yogurt when I do., , , , , , , Lori Yates, —, February 5, 2024 @ 10:12 am, , Reply, , , Hi Susan! Thanks for the update! Perhaps warm smoothies need more liquid?, , , , , , , , , Susan, —, January 19, 2024 @ 7:05 pm, , Reply, , , If I omit the banana (which I can’t digest and which is too high carb for me), this sounds like a wonderful smoothie.   I’ve been making warm smoothies for winter breakfasts and I think that this would be an excellent warm smoothie (I would use the soup cycle on my blender).  Adding nut butter would probably thicken it nicely – I would probably choose almond butter.  I love the idea of having another warm smoothie recipe., , , , , , , Lori Yates, —, January 22, 2024 @ 7:05 pm, , Reply, , , I don’t think I’ve ever had a warm smoothie, but I’m intrigued!, , , , , , , Susan, —, January 22, 2024 @ 7:45 pm, , , Omit the banana, add 2 tablespoons of almond butter, and use the blender soup cycle (on my blender that runs for 3 minutes, to which I add one more minute).  You might want to add another half cup of milk.    I have this on my menu for when I get back to cooking next week, and I’ll let you know what I do and how it turns out., , , , , , , , , , , Carol G, —, August 13, 2022 @ 8:29 am, , Reply, , ",
        "Chocolate Peanut Butter Oatmeal Smoothie": "Ingredients: This post is sponsored by Quaker Oats but all opinions are 100% my own. As always, thank you for supporting brands that support What The Fork Food Blog, ♥, Chocolate Peanut Butter Oatmeal Smoothies, You guys totally love your oatmeal smoothies. My, Strawberry Banana Oatmeal Smoothies, were my fourth most popular recipe on the blog in 2015 and my, Peanut Butter Banana Oatmeal Smoothies, just missed the list of, Top 10 Recipes from 2015, ., I’m sure these Chocolate Peanut Butter Oatmeal Smoothies will be just as popular. Because really, who could resist a little chocolate peanut butter combination in the morning? Especially when it’s for something that’s not going to cause you to cheat on your 2016 healthier eating goals. You’re more than welcome ☺️☺️, I’m a really big fan of oatmeal smoothies in the morning. The oatmeal really makes the smoothies filling so they truly keep you satisfied until lunch. I often find that if I have a regular smoothie for breakfast, I’m hungry shortly after., That’s not the case with these chocolate peanut butter oatmeal smoothies. They consist of 1% milk, oats, and peanut butter, to help keep you fueled, and are sweetened with just enough honey., I used, Quake, r, Gluten Free Oats for this smoothie and they worked out really, really well. I actually prefer these quick oats in smoothies over the old fashioned oats that I had previously been using., Quaker Gluten Free oats are rolling out and will be readily available nationwide this month. With nearly 140 years of oat expertise and as leaders in oat milling, Quaker has confidently been able to provide gluten free oats to those who need them. And don’t worry, the gluten free oats have the same great taste and texture as traditional Quaker Oats., The gluten free varieties will include the Quaker Quick 1-Minute Oats (which I used in this recipe) and Quaker Instant Oatmeal single-serve pouches in Original and Maple & Brown Sugar flavors. You can read more about their oats and the process on my, Quaker Summit Re-Cap, post., I’m also giving away a Gluten Free Recipe Inspiration Kit. One lucky winner (from the US) will receive a chic tote, a custom ‘Love Oatmeal’ spoon, an apron, a portable microwavable oatmeal bowl, and the three varieties of Quaker Gluten Free Oats (Quick 1-Minute Oats 18 oz. canister, Original Instant Oatmeal single-serve pouches, and Maple & Brown Sugar Instant Oatmeal single-serve pouches)., You guys, I have the spoon and it is Ah-dorable. It’s pictured here covered in peanut butter but it’s the cutest little stamped spoon. <LOVE>, You can enter via the giveaway form below. Good luck and enjoy!, Quaker Gluten Free Recipe Inspiration Kit, Disclaimer: I advise each person to use their best judgment when deciding whether or not to try Quaker’s gluten-free products. I have presented the facts as they were presented to me, and I hope they help you make the right decision for yourself and your family., be sure to follow me on, instagram, and hashtag #whattheforkfoodblog or tag @whattheforkfoodblog – i love seeing what you make!, if you love this recipe for chocolate peanut butter oatmeal smoothies, be sure to follow me on social media so you never miss a post:, |, facebook, |, twitter, |, pinterest, |, instagram, |, youtube, |, Chocolate Peanut Butter Oatmeal Smoothies, 4.62, from, 271, ratings, Prep Time:, 5, minutes, , minutes, Total Time:, 5, minutes, , minutes, Servings:, 16, , oz smoothie, By:, Sharon Lachendro, , Print, , Rate, , Pin, 1/2, , C, , Quaker Gluten Free Quick 1-Minute Oats, 1, , C, , ice cubes, 1, , C, , 1% milk or unsweetened coconut milk**, 2, , Tbsp, , natural peanut butter or peanut butter powder*, 1, , Tbsp, , cocoa powder, 1, , Tbsp, , honey, , to taste, 1, , tsp, , vanilla extract, Recommended Products, All-Clad Measuring Cups, All Clad Measuring Spoons, Jarden 12 Ball Mason Jar with Lid - Regular Mouth - 16 oz, Blendtec D625A2827B2B-AMAZON Designer 625 Countertop Blender, Wildside+, Sea Foam Green, Nutrition Information, Serving:, 16, oz, |, Calories:, 5, kcal, |, Carbohydrates:, 1, g, |, Protein:, 0.1, g, |, Fat:, 0.04, g, |, Saturated Fat:, 0.03, g, |, Polyunsaturated Fat:, 0.001, g, |, Monounsaturated Fat:, 0.01, g, |, Sodium:, 1, mg, |, Potassium:, 6, mg, |, Fiber:, 0.1, g, |, Sugar:, 1, g, |, Vitamin C:, 0.01, mg, |, Calcium:, 1, mg, |, Iron:, 0.05, mg, Disclaimers, As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., Nutrition Facts are estimated and aren't always accurate. Please consult a doctor or nutritionist if you have special dietary needs., , , , Did you make this?, Mention, @whattheforkfoodblog, or leave a comment rating below!, , , , 57.2K, , shares, , , , Share, , , , Tweet, , , , Pin, , , , Flipboard, Categories, Breakfast, , , Chocolate, , , Dairy-Free, , , Naturally Sweetened, , , Smoothies, , , Special Dietary Needs, , , Vegetarian, Post navigation, Easy Avocado Truffles, Cranberry Orange Moscow Mule, 4.62 from 271 votes (, 267 ratings without comment, ), Leave a comment, Cancel reply, If you made this recipe, please consider giving it a star rating when you post a comment. Star ratings help people discover my recipes online., Sincerely,, Shay, Your email address will not be published., , Required fields are marked, *, Comment, *, , Recipe Rating, , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , Email, *, , Notify me if there is a reply to my comment, , , Δ, , Joanna Teigen, , says:, , April 1, 2024 at 6:43 pm, So yummy! I added a half scoop of protein powder and subbed half the milk with greek yogurt just to boost the protein, but the recipe is great just as it is., Reply, , Jennifer Hannaberry, , says:, , February 9, 2024 at 8:36 am, Finally found the perfect recipe that my son loves, Reply, , Sharon Lachendro, , says:, , May 29, 2024 at 6:35 am, Thanks Jennifer!, Reply, , Adele, , says:, , June 12, 2022 at 11:14 am, Can you use unsweetened vanilla almond milk in this recipe, Reply, , Shay, , says:, , June 23, 2022 at 10:19 am, Yes, you can use any milk you’d like., Reply, , Asra, , says:, , March 15, 2022 at 7:46 am, This is the best healthy smoothie I’ve tried ever! It’s like the only one I look forward to having! Xxx, Reply, , Dara, , says:, , August 20, 2021 at 4:13 pm, My son likes this, also I added a little flax and he said it was VERY filling. it’s a lot of oats! He hates banana so he never has any with us., Reply, , Shay, , says:, , August 29, 2021 at 1:02 pm, I’m glad your son enjoyed this smoothie 🙂, Reply, , Julie Z., , says:, , June 17, 2021 at 2:11 pm, This is delicious! I’m gluten free and dairy free and this is just what I needed. It tastes like a candy bar, but it’s a healthier version! Thanks so much for the recipe., Reply, , Shay, , says:, , June 22, 2021 at 9:49 am, You’re welcome!, Reply, , Kristin, , says:, , March 20, 2021 at 1:24 pm, Delicious!  I used dark cocoa powder and almond milk since that is what I had on hand.  SOOOO GOOD!  I just bought a blender and looking for smoothie recipes to make for breakfast., Reply, , Lana, , says:, , February 26, 2021 at 12:16 pm, So good. I added chia seeds and used unsweeten vanilla almond milk! This is a keeper!, Reply, , Missy, , says:, , February 24, 2021 at 9:46 pm, This was delicious!! Thank you, Reply, , Shay, , says:, , February 26, 2021 at 8:59 am, You’re welcome!, Reply, , Joshua Jensen, , says:, , February 13, 2021 at 11:45 am, Could you substitute normal rolled outs for the quick oats in this recipe? If so, would I have to change anything?, Reply, , Shay, , says:, , February 13, 2021 at 2:13 pm, Yes, just blend the oats first before adding anything to grind them up finer., Reply, , Caitlin, , says:, , January 30, 2021 at 1:11 pm, I just found this recipe and loved it! I have honey collagen protein powder so I added that instead of actual honey and a large handful of spinach. This is a new go-to for me, especially since we never seem to have any bananas., Reply, , Jeff O, , says:, , April 17, 2020 at 8:59 pm, 10/10 would recommend., Reply, , Bonnie, , says:, , June 7, 2019 at 7:53 am, Just made this this morning.  I used lactaid skim milk. It was delicious but think I’ll need to share it with my daughter.  Too much for me to drink. Even hubby tasted it and liked it. Thank you for sharing., Reply, , Molly, , says:, , May 28, 2019 at 3:30 pm, From a 12-year-old’s perspective ( I am 12 years old ), it was really good! I didn’t grind the oats first and the smoothie turned out slightly grainy. Otherwise, the smoothie tasted great! ( I was also out of bananas XD ), Reply, , Deborah Fox, , says:, , March 3, 2019 at 10:52 am, Possibly a foolish question but is the measure of oatmeal before or after grinding in the blender?, Reply, , Shay, , says:, , March 3, 2019 at 11:02 am, I measure it before grinding in the blender 🙂, Reply, , Katie, , says:, , January 15, 2019 at 10:54 am, So I just want to say THANK YOU!  I am allergic to strawberries and despise bananas so most breakfast smoothies are out for me.  This is super yummy, I added coffee to it and  it is exactly what I was looking for!, Reply, , Sharon, , says:, , January 18, 2019 at 12:04 pm, Glad you enjoyed it!, Reply, , Emma Donatantonio, , says:, , April 12, 2018 at 5:27 am, One of the tastiest smoothies I’ve had! I substituted the honey for 1 banana and a couple of dates for sweetness and added fibre. I also added a shot of coffee for that extra morning boost!, Simply delicious – thanks for a great recipe., Reply, , Sharon, , says:, , April 13, 2018 at 10:03 am, Thanks Emma!, Reply, , Bobbi Convery, , says:, , February 27, 2018 at 6:27 pm, I made this this morning, it is so delicious and filling. I didn’t even get hungry until 4:00 p.m.!, Reply, , Sharon, , says:, , February 27, 2018 at 8:19 pm, That’s great Bobbi! So glad you liked it!, Reply, , Michelle, , says:, , September 17, 2016 at 3:08 am, Do you know how many calories this smoothie would be with using soy milk? I really need to keep track of my calorie intake and I love this smoothie, Reply, , Holli, , says:, , March 6, 2016 at 9:15 pm, Do you think this would be okay if it was made the night before then refrigerated?, Reply, , Tracey Hewison, , says:, , March 24, 2017 at 8:32 pm, Hi Holli,, Did you give this a try, keeping it overnight? Would be very interested to hear how it turned out. I was hoping to make these for my son’s hockey team for their bus trip, we’ll keep them in the cooler., Thanks!, Tracey, Reply, , Sharon, , says:, , March 6, 2016 at 9:19 pm, I haven’t tried it but I think it would get very thick. The smoothie thickens up as it sits (due to the oatmeal). You could try it and let me know how it works out for you. And if it does get too thick overnight, you could always add more milk in the morning to thin it out., Reply, , Holli, , says:, , March 3, 2016 at 2:40 pm, Do you use just regular cocoa powder or does it need to be all natural?, Reply, , Sharon, , says:, , March 3, 2016 at 8:54 pm, I use just regular cocoa powder 🙂, Reply, , , Heyyy, I'm Sharon but my friends call me Shay! I'm a gluten free recipe developer and author of, The Gluten Free Quick Breads Cookbook, . I will teach you how to make & bake THE BEST gluten free treats, baked goods & breads that are so good, your gluten-eating friends will be jealous. Let's making something great together! Read more, about me!, Recent Posts, , Buttery Gluten Free Garlic Knots, , Moist and Fluffy Gluten Free Strawberry Filled Cupcakes, , Buttery Pretzel Biscuits with Gluten Free Flour, , Rich & Fudgy Gluten Free Bourbon Brownies, , Gluten Free Baileys Cheesecake with Oreo Crust, Privacy policy, Editorial Policy, Webstories, Unless otherwise noted, all content and photography is © 2014-2025 What The Fork Food Blog™. All rights reserved. Please do not reproduce any text or photographs without my prior written consent.  If I have linked a post up to your website then consider that consent to use my photographs for features or sharing on social media with a link back to my original post.  | Birch on Trellis Framework by, Mediavine, , , , , , , , , , , , , , , , , 57216, , shares, , , , , , , , , , , , , , , , , Rate This Recipe, Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , Email *, , , Rate and Review Recipe, A rating is required, A name is required, An email is required, Recipe Ratings without Comment, Something went wrong. Please try again., , , , , , Instructions: Add the oats to the blender canister and blend until they become a fine powder., Add the ice, milk, peanut butter, cocoa powder, honey, and vanilla extract and blend until smooth. Pour into a glass and enjoy!, Video, Notes, Using peanut butter powder will significantly reduce the amount of fat and calories in this smoothie but I prefer the taste that the natural peanut butter gives to the smoothie., *Using unsweetened coconut milk (from the carton) will reduce the amount of protein in the recipe but it will also cut down on calories and carbs. When following a gluten free diet",
        "Vanilla mint overnight oats smoothie": "Ingredients: instead of, fifty-four, ., , Fifty-four, . In one shake. Like… how is that even possible? Granted, it’s [only] 33 unique ones, chemicals, and/or preservatives?! Did you know that a large Shamrock Shake contains 115g of sugar? 115!!! Cut back to a medium and you’re looking at 93g. You guys know I have a huge sweet tooth, but that sounds like insanity… even to me., , We’re not here to bash Shamrock Shakes, though… We’re here to make our own, healthier version, that’s just as delicious, but made with good quality, whole foods, and, natural sugars, ., , , We start with the basic overnight oatmeal smoothie base. This just means soaking a serving of oats (, and a few add-ins, ) in the fridge overnight so that they can absorb the liquid and get suuuuuuuuper, creamy, . You guys… this step has completely revolutionized my smoothie-making process, and I’m not sure I could ever go back to drinking oat-less smoothies again. Try it out and thank me later., , Post-soaking, we take the smoothie base out of the fridge, toss in the remaining add-ins that we didn’t want to turn brown overnight, whirl it around in the blender for a handful of seconds, transfer it to a glass, toss on a few mini chocolate chips (, <– MUST!!!, ), and dig in!, , I realize that sounds like a tonne of steps when it’s all written out like that, but it literally takes all of, 5 minutes, to do. And the best part is that you’re left with a, creamy overnight oatmeal green smoothie, that’s vegan, gluten-free, packed with plenty of vitamins and minerals, and tastes pretty freaking fantastic., , I’m sure we can all drink to that., , , I’d love to know if you make this recipe! Leave a comment and rating down below to let me know what you think, and, subscribe, to our mailing list to receive new recipes in your inbox!, , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , Vanilla Mint Overnight Oatmeal Smoothie, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , 4.5, from, 2, reviews, , , , , Author:, , Amanda @ Running with Spoons, , , , Total Time:, , 3 hours 5 mins, , , , Yield:, , 1, serving, 1, x, , , , , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , , , Scale, , 1x, 2x, 3x, , , , , , , 1/2 cup, (, 40 g, ) rolled oats**, , 3/4 cup, (, 180, ml) unsweetened vanilla almond milk, , 1/2 tsp, vanilla extract, , pinch of salt (optional, but recommended), , 1/2 cup, (, 15, –, 20, g) baby spinach***, , 1, medium-size (100 g) ripe banana, frozen, , 2 Tbsp, (, 25 g, ) avocado (optional), , a few drops of mint extract****, , 1/2, –, 1, Tbsp (, 7, –, 15, ml) sweetener, to taste (optional), , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , , , Reply, , , , , , , , Erin @ Erin's Inside Job, , , March 16, 2016 at 3:29 pm, , , , , , Reply, , , , , , , , erindruga, , , March 16, 2016 at 2:27 pm, , , , Yay for GREEN recipes and for putting mint in smoothies–sounds so, so good!, , , Reply, , , , , , , , Lauren @ The Bikini Experiment, , , March 16, 2016 at 1:10 pm, , , , What a healthy way to celebrate St. Patty’s Day!  Great idea to add the mint., , , Reply, , , , , , , , Shannon, , , March 16, 2016 at 1:05 pm, , , , , , Reply, , , , , , , , hungryforbalance, , , March 16, 2016 at 12:52 pm, , , , That pour shot is perfect! Seriously, you are the queen of the pouring money shot!, Even though I half Irish, I’ve never really celebrated St. Patty’s day. This smoothie looks like a good way to start though!, , , Reply, , , , , , , , Joyce @ The Hungry Caterpillar, , , March 16, 2016 at 10:30 am, , , , Nom! Looks delicious! Thanks for including a lower-oats option, as well. Happy St. Pat’s!, , , Reply, , , , , , , , Megan @ Skinny Fitalicious, , , March 16, 2016 at 10:00 am, , , , I always have a warm glass of water with apple cider vinegar in the morning. Last green thing I had was a green juice I made yesterday. I love how creamy and green this is!, , , Reply, , , , , , , , Miss Polkadot, , , March 16, 2016 at 10:00 am, , , , How do you cram that much crap in one cup? <- good question indeed! Why not shoot McDonald's a mail to inquire 😉 ??, Truth be told, I forget about St. Patrick's Day every year because it's just not known over here. I'm all for everything green – alcohol aside 😀 – though so maybe I'll eat an extra plate of greens tomorrow. Your smoothie looks awesome, too, though. Take a leaf from this book, McDonald's!, , , Reply, , , , , , , , Polyglot Jot, , , March 16, 2016 at 9:43 am, , , , yum this looks amazing!! 🙂, , , Reply, , , , , , , , Strength and Sunshine, , , March 16, 2016 at 8:27 am, , , , Water! I chug 24 ounces!, , , Reply, , , , , , , , Ellen, , , March 16, 2016 at 8:01 am, , , , This is so pretty and sounds delicious! Vanilla-mint is the perfect way to describe the Shamrock Shake flavor and this looks like a much healthier take 😀 Love it. And I drink lots of water first thing in the morning!, , , Reply, , , , , , , , The Cookie ChRUNicles, , , March 16, 2016 at 7:38 am, , , , I’ve been drinking the water with acv for a few years now every morning. I have no idea that t does a thing for me but I’m so used to drinking it that I keep on doing so lol, , , Reply, , , , , , , , foodiecology, , , March 16, 2016 at 7:15 am, , , , We must be on the same wavelength because I have a vanilla mint smoothie scheduled for a guest post I’m doing tomorrow! No oats in mine, though. This looks great – I’ll have to give it a try!, , , Reply, , , , , , , , shashi at runninsrilankan, , , March 16, 2016 at 6:43 am, , , , Oooh – what a way to get your drank on for St. Pattys! This smoothie looks insanely wonderful – like all your smoothie concoctions and that pinch of salt maybe optional but so so necessary! The last green thing I ate were some Green Smoothie Cookies – do those count? Think I might post them tomorrow – in typical Shashi fashion – they almost missed the Green holiday! 🙂, , , Reply, , , , , , , , Michele @ PaleoRunningMomma, , , March 16, 2016 at 6:09 am, , , , Nowadays it’s lemon and apple cider vinegar laced in my water. I haven’t celebrated St. Patty’s say since college and of course those times are tough to remember!  Such a pretty smoothie 🙂, , , Reply, , , , , , , , Alysia at Slim Sanity, , , March 16, 2016 at 5:46 am, , , , I’ll join you in a smoothie cheers to St Patty’s Day! 🙂 I’ve never had a Shamrock Shake from McDonald’s. Mint is my favorite dessert flavor, but I guess I’ve always known there had to be something wrong with green food from Mickey D’s haha, , , Reply, , , , , , , , Kelly @ Kelly Runs For Food, , , March 16, 2016 at 5:40 am, , , , Ooh I might need to make this when I get home tonight! And that whole 50+ ingredient thing is insanity! Years ago, , , Reply, , , , , , , , lsproull232014, , , March 16, 2016 at 5:15 am, , , , talk about fake/phony food., , , Reply, , , , , , , , Aubrey, , , March 16, 2016 at 4:40 am, , , , This sounds so good! Wayyy better than chocolate mint 😉, , , Reply, , , , , , , , Meghan@CleanEatsFastFeets, , , March 16, 2016 at 4:34 am, , , , This will be the first birthday in years where I didn’t start drinking very early, although I will say smoothies were always the base for my day followed by a great big breakfast so I could have something to absorb all the booze. Or at least help absorb all the booze., , I’m thinking your Vanilla Mint smoothie will take the sting out of my traditional celebrating. Cheers friend., , , Reply, , , , , , , , lindsay Cotter, , , March 16, 2016 at 11:43 am, , , , I’ll drink for you. Mmm k? as long as i can have this after. Amanda, this is so yum! but it’s almost to pretty to drink. That color is SPOT ON!, , , Reply, , , , , , , , lindsay Cotter, , , March 16, 2016 at 11:44 am, , , , p.s that 54 ingredient shake scares me!, , , Reply, , , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, Hi & Welcome to Spoons!, , , I'm Amanda - health coach, cookbook author, recipe developer, photographer, makeup junkie, and the blogger behind Running with Spoons - a blog dedicated to proving that healthy snacking doesn't have to be tasteless or boring, one delicious recipe at a time., More about Amanda →, , , Facebook, Instagram, Pinterest, Twitter, , Subscribe to get new recipes straight in your inbox, , , , , , , Delicious Gluten-free Recipes, , , Tasty Vegan Recipes, , , Search, , Footer, , , , Looking for more healthy recipes? Try one of these!, , , , , , , , , Search, , Privacy Policy, , Copyright © 2025 . running with spoons . on the, Foodie Pro Theme, , , , , Instructions: , , , , The night before, , add the oats, almond milk, and vanilla to the bowl of your blender and give it a stir to ensure that everything is well combined. Cover and place in the fridge for at least 3 hours, preferably overnight., , The next morning, , remove your blender bowl from the fridge and add the spinach, frozen banana, and avocado (if using). Blend on high until a smooth and creamy consistency is reached, adding more milk if the smoothie is too thick for your liking. Add a few drops of mint and blend for a couple more seconds. Take a small sip and add extra mint and/or sweetener, if desired., , Transfer it to a bowl or glass, add desired toppings, and enjoy!, , , , , , Notes, , , * Cook time refers to chilling time. ** Be sure to use certified gluten-free oats if you need this to be gluten-free. You can also reduce the oats to 1/4 cup (20 g) and add a scoop of your favourite protein powder. *** Feel free to sub the spinach out for another leafy green. I like using baby spinach because of it’s mild taste. **** Start with a few drops of of mint and gradually add more to taste. Mint can get overpowering super fast, so always err on the side of caution., , , , , , Prep Time:, , 5 mins, Cook Time:, , 3 hours, , , , , , , , , , , , Did you make this recipe?, , Tag, @runwithspoons, on Instagram and hashtag it, #runningwithspoons, , , , , , , , Looking for more, healthy overnight oatmeal smoothie recipes, ? Try one of these!, , Strawberry Shortcake Overnight Oatmeal Smoothie, Chocolate Overnight Oatmeal Smoothie, Caramel Apple Overnight Oatmeal Smoothie, Pumpkin Spice Overnight Oatmeal Smoothie, Caramel Apple Overnight Oatmeal Smoothie, , , Filed Under:, Breakfast, , , Gluten Free, , , Recipe, , , Smoothies & Drinks, , , Vegan, , Tagged With:, breakfast, , , gluten-free, , , green smoothie, , , healthy, , , healthy shamrock shake, , , mint, , , overnight oatmeal smoothie, , , recipe, , , shamrock shake, , , snack, , , vanilla, , , vegan, Previous Post:, « currently – march 2016, Next Post:, a special someone, my OCD tendencies, and hoodie popcorn (ToL#174) », Reader Interactions, Comments, , , , , , Diana, , , July 23, 2017 at 8:47 am, , , , I added 1 packet of Truvia to the overnight mixture. The following morning, I added an additional Truvia packet after tasting. I did not use avocado. I loved the creaminess of the smoothie and its beautiful green color. I used very little peppermint extract because I know it can be overpowering, but if I make this again, I will probably add a little more. I think I used less than 1/8 tsp, but a full 1/8 tsp (or maybe even a bit more) would probably be fine., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , Erin, , , February 8, 2017 at 11:09 am, , , , Can the mint extract be replaced with peppermint oil?, , , Reply, , , , , , , , Amanda @ .running with spoons., , , February 10, 2017 at 11:47 am, , , , You should be able to, Erin. But I think it’s a lot more concentrated than the extract, so I’d start with a drop or two and adjust to taste., , , Reply, , , , , , , , , , Jessica, , , April 27, 2016 at 5:18 am, , , , Have you ever tried fresh mint instead of mint essence? Do you think it would be ok? Thank you for your recipe., , , Reply, , , , , , , , Amanda @ .running with spoons., , , April 28, 2016 at 5:54 pm, , , , I’ve never tried it personally, Jessica, but it would definitely work! I can’t say for sure how much, so I’d just add it gradually and adjust to taste., , , Reply, , , , , , , , , , Alaina @ A Not So Quiet Kitchen, , , April 12, 2016 at 1:23 pm, , , , This looks super delish! I love over night oats but I’ve never thought of putting them in a smoothie!! I can’t wait to try it!, , , Reply, , , , , , , , Amanda @ .running with spoons., , , April 13, 2016 at 3:46 pm, , , , I hope you like it, Alaina! I have such a hard time going back to smoothies without oats now!, , , Reply, , , , , , , , , , cleo, , , April 7, 2016 at 12:38 pm, , , , lorve it!, , fer meh who do not like breakfast!, , , Reply, , , , , , , , Kathryn, , , March 20, 2016 at 2:35 pm, , , , I pretty much live off of your overnight oatmeal smoothies these days. I had this mint one this morning, and it was so light, creamy, and refreshing! I might be my favorite so far. Thanks for the recipe!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , Alison @ Daily Moves and Grooves, , , March 18, 2016 at 7:59 pm, , , , This will definitely beat my Shamrock Shake from yesterday! It was, like, supersaturated syrup. I had about 1/4 of it and then I just had to chuck it (I HATE wasting food, but this was ridiculous). But I still loved the vanilla mint flavor. So grateful for smoothie geniuses like you 🙂, Hope you had a fun St. Patrick’s Day!, , , Reply, , , , , , , , Ginger Wroot, , , March 17, 2016 at 4:22 pm, , , , Oh, your smoothie looks so lish, so healthy, so pretty! I pinned this one, and can’t wait to try it! Thanks!, –G, gingerwroot.com, , , Reply, , , , , , , , Sarah @ Making Thyme for Health, , , March 17, 2016 at 12:38 pm, , , , I much rather have this green smoothie than green beer. Mint chocolate chip is my favorite! And of course these pics are GORG., , , Reply, , , , , , , , theblissfulbalance, , , March 17, 2016 at 6:58 am, , , , holy moly I have never seen a creamier looking smoothie!! gorgeous! love this idea. thanks for sharing!, , , Reply, , , , , , , , Hilary, , , March 17, 2016 at 6:28 am, , , , I love that these recipes have way more staying power that your typical frozen fruit and almond milk! I find myself almost never making them because I’m hungry 5 minutes after drinking them haha I might have to try some soaked oats next time, , , Reply, , , , , , , , Natasha, , , March 16, 2016 at 8:28 pm, , , , I want to try this 🙂, , , Reply, , , , , , , , Jade, , , March 16, 2016 at 5:18 pm, , , ",
        "Pumpkin Apple Smoothie": "Ingredients: making it the perfect breakfast for yourself and your kids. My three absolutely love this pumpkin smoothie, and I can blend it up in less than 5 minutes – a must for busy school mornings., , Canned pumpkin gives the smoothie its lovely orange color, and I added a whole apple, skin and all. If you look closely you can see the pretty red flecks of apple in the photos. Both the apple and some oats add lots of fiber. Greek yogurt provides filling protein for even more staying power., , , I love my Vitamix blender, for making smoothies, but don’t worry if you don’t have a Vitamix or other high-powered blender. When I first made this pumpkin smoothie I didn’t, and my regular blender created a smooth consistency just the same, even with the apple in this smoothie. Try my other great smoothies, , Strawberry Banana Smoothie, and, Chocolate Protein Shake, ., , So I have a question for those of you reading who are also food bloggers. Do you ever get to the end of a photo shoot and realize that you totally forgot to add in something that you really wanted as a prop in your photo? When I first started taking the photos of this pumpkin smoothie I forgot to sprinkle the oats around the smoothie. I had even brought the container of oats into the living/dining room (where I take my photos) and set them next to me. I do things like this all.the.time and it is SO frustrating. I really should write down my plan for my photo set-ups and checking my list before I start, but I’m always in a hurry and just want to get it done!, , Go ahead, try this Pumpkin Apple Breakfast Smoothie this week! Whether it’s warm or cool where you are, this smoothie is a great way to start your day. It will leave you feeling ready for fall! 🙂, , , Why is pumpkin good for you?, , , Pumpkin is rich in beta-carotene, an antioxidant which your body can convert into vitamin A., , One cup of pumpkin has about 500mg of potassium, which is more potassium than a banana., , A quarter cup of pumpkin in this recipe has only 20-25 calories and is low in fat., , , Tips for making this pumpkin smoothie:, , , Be sure to use canned pumpkin puree, not pumpkin pie filling. Pumpkin pie filling is sweetened and has added spices., , , My quick, pumpkin pie spice recipe, is a great alternative to store bought pumpkin pie spice., , Try substituting pear in place of the apple for another delicious pumpkin smoothie., , While a high powered blender is not required for this smoothie, I’m so glad I invested in mine. I use it almost every day!, , , , , , , Rate this Recipe!, , Pumpkin Smoothie, , , Servings:, 2, , servings, , Prep Time:, 5, minutes, , mins, Total Time:, 5, minutes, , mins, , Author:, Kristine Rosenblatt, , , Pumpkin and apple are the perfect pairing in this fall breakfast pumpkin smoothie. This healthy pumpkin smoothie is made with a pinch of pumpkin pie spice, oats and apple and will keep you full for hours!, , , Print Recipe, , Leave a Review, , Pin Recipe, , , , , , Cook Mode, Prevent your screen from going dark, , ▢, ¼, , cup, , , , plus 2 tablespoons old-fashioned oats, ▢, ¼, , cup, , , , canned pumpkin puree, ▢, ¾, , cup, , , , plain Greek yogurt, ▢, 1, , , , medium apple, , , cut into pieces (I used honeycrisp and left the skin on), ▢, ½, , , , small banana, , , sliced and frozen, ▢, ½, , cup, , , , milk, , , almond, soy, dairy, etc. – whatever you prefer, ▢, 1/8, , teaspoon, , , , pumpkin pie spice, ▢, ½, , cup, , , , ice cubes, , , , , Serving:, 1, /2 recipe, , , Calories:, 187, kcal, , , Carbohydrates:, 32, g, , , Protein:, 11, g, , , Fat:, 2, g, , , Cholesterol:, 6, mg, , , Sodium:, 58, mg, , , Fiber:, 6, g, , , Sugar:, 15, g, , Nutrition information is an estimate., , , , Cuisine:, American, Course:, Drinks, Snack, Author:, Kristine Rosenblatt, , , , , , , Tried this recipe?, Mention, @kristines_kitchen, on Instagram or tag, #kristineskitchen, ., , , , This site contains affiliate links. If you make a purchase through these links, I may receive a small commission, at no extra cost to you. Thank you for supporting Kristine's Kitchen!, , , , , Breakfast Recipes, , Gluten Free, , Snacks, , , , posted by, , Kristine Rosenblatt, , on, Oct 23, 2017, (last updated, Apr 10, 2025, ), , , , 48 comments, , , Leave a comment », , , , , , More Breakfast Recipes, , , , , Brown Butter Banana Bread, , , , , , , Peanut Butter Overnight Oats, , , , , , , Easy Overnight Oats, , , , , More Pumpkin Recipes, , , , , Pumpkin Pie Spice, , , , , , , Pumpkin Pancakes, , , , , , , Pumpkin Waffles, , , , , , , Pumpkin Spice Granola (One Bowl), , , , All Pumpkin Recipes, , , , Save time. Eat well., , , Subscribe and receive, FREE family meal plans, , right to your inbox, plus exclusive subscriber-only content!, , , , , , , , , , , , , , , , , , , Leave a Comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating (Click Stars), , , , Recipe Rating (Click Stars), , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , All submissions are moderated and not all submissions are approved., Name, *, , , Email, *, , , , , , , , , , Sign me up for Kristine's Kitchen FREE Recipe Emails and eBook Downloads, , , , , , 48 comments on “Pumpkin Smoothie”, , , , , , , , , , Shelley @ Two Healthy Kitchens, —, September 18, 2014 @ 6:41 am, , Reply, , , Oh, yes! This is a brilliant way to combine the two TOTALLY fall flavors of apple and pumpkin! Amazing! And you know I just love that it’s jam-crammed with nutrition and all that keep-you-full staying power from the oats and Greek yogurt! Definitely pinning this! Oh – and yes, my friend, I totally feel your I-forgot-to-include-it-in-my-photo-shoot pain! Just a couple of weeks ago, Gretchen and I forgot to include a really important key garnish after spending a lot of time getting great shots all afternoon. Gahhhhh! 😀, , , , , , , Natalie @ Tastes Lovely, —, September 18, 2014 @ 7:41 am, , Reply, , , The best flavors of fall all wrapped into 1! I bet this tastes amazing. I just bought SO many honeycrisp apples while they’re in season, and don’t know how I’m going to go thru them all. This smoothie will be perfect! Can’t wait to try it., , , , , , , Gayle @ Pumpkin 'N Spice, —, September 18, 2014 @ 8:52 am, , Reply, , , This smoothie sounds incredible, Kristine! I love that you combined both apple and pumpkin flavors. So perfect for the fall! And gorgeous pictures, too!, , , , , , , Mary Frances, —, September 18, 2014 @ 6:46 pm, , Reply, , , Ugh, all the time!  I’m glad you caught it before you drank the smoothie (not that I’m speaking from experience or anything … 🙂 )  Or when I’m editing, I’ll be like, a sprinkle of chocolate chips would look really nice right there!  I think your photos are gorgeous.  The lighting, the props, the oats 🙂 it all looks amazing.  And I love how you combined the two iconic fall flavors into one healthy breakfast smoothie!  Pinning!, , , , , , , Ashley @ ashleymarieskitchen, —, September 18, 2014 @ 7:02 pm, , Reply, , , Yum!Two of my favorite fall flavors combined. Pinned 🙂, , , , , , , Kelly // The Pretty Bee: Cooking & Creating, —, September 19, 2014 @ 10:53 am, , Reply, , , What a pretty smoothie! It looks delicious. What a perfect fall breakfast., , , , , , , Thalia @ butter and brioche, —, September 19, 2014 @ 11:57 pm, , Reply, , , This is basically fall in a smoothie! Great recipe.. my morning breakfasts usually consist of a smoothie so this recipe is perfect for me. Thanks for sharing it!, , , , , , , Erin | The Law Student's Wife, —, September 20, 2014 @ 4:09 pm, , Reply, , , Fall flavor and it will keep me full? Sign me up! And yes, I have definitely forgotten props before. It’s so frustrating!, , , , , , , Lindsey @ American Heritage Cooking, —, September 29, 2014 @ 6:10 am, , Reply, , , Fall-ish! That is definitely how I feel…why is it not cool yet in Atlanta. I want to shake the weather man until he produces cooler temperatures. {yes, I am aware this is ridiculous and illogical!} This smoothie looks delicious and perfect for the still warm temperatures down here!, , , , , , , , Kristine, —, September 30, 2014 @ 2:46 pm, , Reply, , , While you’re at it, can you talk to my weather man too?  We haven’t had much fall weather, and it’s supposed to be in the 90’s the end of this week/this weekend.  I’m ready for soup and chili weather!  At least this smoothie is a great solution for the meantime!, , , , , , , , , Valya @ Valya's Taste of Home says, —, September 29, 2014 @ 5:19 pm, , Reply, , , Yummy!, , , , , , , Mir, —, October 1, 2014 @ 10:07 am, , Reply, , , Ha! I forget the props all the time. It’s such a problem! Because I’m often too lazy to go back and reshoot. Or I’ve eaten whatever I’m photographing., Love the smoothie! No wonder your kids are into it. Perfect for fall!, , , , , , , , Kristine, —, October 2, 2014 @ 8:37 pm, , Reply, , , I’m usually too lazy to reshoot, too.  I always remember right when I’m going to clean up – so frustrating!  Yes, we really love this smoothie around here!, , , , , , , , , Jill, —, October 6, 2014 @ 3:41 pm, , Reply, , , You could leave out the canned pumpkin and pumpkin pie spice and instead add a scoop of pumpkin spice protein powder.  It would seriously amp up the protein factor of the smoothie and it could be used almost as a meal replacement.  GNC used to carry it on a seasonal basis.  But I’d think there are other brands out there., , , , , , , Sacha, —, October 9, 2014 @ 5:17 pm, , Reply, , , Tasty – I didn’t have greek yogurt, so I used cottage cheese, added vanilla protein powder and it turned out decently. Looking forward to trying the real thing! Definitely a keeper!, , , , , , , Michelle, —, October 12, 2014 @ 4:04 pm, , Reply, , , How many calories is in this smoothie?, , , , , , , , Kristine, —, October 12, 2014 @ 8:27 pm, , Reply, , , I don’t count calories or calculate them for my recipes, but there are many online calorie calculators that can give you the count if you are interested., , , , , , , , , Kate // Vegukate, —, October 13, 2014 @ 12:04 pm, , Reply, , , Mmmm sounds like autumn in a glass. I live in Arizona, where it’s still a bit on the warm side, so I’ve been diving into every fall-like smoothie that I can find. This one sounds amazing! 🙂, , , , , , , , Kristine, —, October 13, 2014 @ 7:45 pm, , Reply, , , It’s been so hot here in California too.  We’re supposed to get some cooler weather later this week and I can’t wait.  In the meantime, smoothies like this one are a great way to enjoy fall flavors!, , , , , , , , , Dorothy @ Crazy for Crust, —, October 14, 2014 @ 7:52 am, , Reply, , , A smoothie that tastes like dessert…I’m in!, , , , , , , , Kristine, —, October 14, 2014 @ 7:56 pm, , Reply, , , Tastes like dessert but it’s healthy!  Double win!, , , , , , , , , Stacey, —, November 5, 2014 @ 11:00 pm, , Reply, , , This looks amazing!!!!  I am definitely making this!!!, , , , , , , , Kristine, —, November 9, 2014 @ 8:47 pm, , Reply, , , Thanks, Stacey!  I hope you love it!, , , , , , , , , Agnes, —, September 9, 2015 @ 7:08 pm, , Reply, , , I love the pumpkin smoothie remains, Me of fall. Yummmmmy!, , , , , , , , Kristine, —, September 14, 2015 @ 9:35 pm, , Reply, , , Thanks, Agnes!  This is the perfect fall smoothie!, , , , , , , , , Rebecca, —, October 4, 2015 @ 1:55 am, , Reply, , , Hi..I will give this try real soon…As soon as I get some canned pumpkin..Sounds great…., , , , , , , , Kristine, —, October 4, 2015 @ 10:08 pm, , Reply, , , Hi Rebecca, I hope you enjoy this smoothie!  Thank you!, , , , , , , , , Carla hoyle, —, October 4, 2015 @ 5:11 am, , Reply, , , What to use instead if Greek yogurt? I can’t use dairy…, , , , , , , , Kristine, —, October 4, 2015 @ 10:11 pm, , Reply, , , Can you use a dairy-free yogurt alternative, such as the one made by Silk?  I haven’t tested this recipe without the yogurt, but it would probably work if you added a little extra frozen banana and non-dairy milk.  If you try it, let me know how it turns out!, , , , , , , , , Silvia (Ribas with Love), —, October 12, 2015 @ 6:41 am, , Reply, , , Kristine this smoothie looks amazing! I struggle to think outside of the box and this recipe just game some great inspiration. I bet it tastes out of this world !!!, , , , , , , , Kristine, —, October 13, 2015 @ 9:08 pm, , Reply, , , Thank you, Silvia!  It’s hard to keep the creativity going, isn’t it?  😉, , , , , , , , , Faith, —, October 14, 2015 @ 8:45 am, , Reply, , , this will probably be my first smoothie attempt after buying a new blender – but, how do you store the pumpkin and do you buy yogurt in small containers?  It sounds great!!, , , , , , , , Kristine, —, October 18, 2015 @ 9:07 pm, , Reply, , , If I have leftover canned pumpkin after making a recipe, I store it in a sealed container in my refrigerator for up to 3 days.  I buy a big container of plain Greek yogurt every week.  We go through a lot of it in my house!  I hope you enjoy the smoothie!, , , , , , , , , Stef @ Pumpkin soups in 30 minutes (Dutch Language), —, August 12, 2016 @ 8:45 pm, , Reply, , , Hi Kristine,, , Thanks for the recipe inspiration 🙂, , isn’t working., , Warm regards,, , Stef, , , , , , , , Kristine, —, August 14, 2016 @ 5:56 am, , Reply, , , Thanks for letting me know, Stef! I think it’s fixed now. 🙂, , , , , , , , , Nicole, —, September 19, 2016 @ 6:54 pm, , Reply, , , I just made this and it was sooo good!, , , , , , , , Kristine, —, September 20, 2016 @ 9:38 am, , Reply, , , I’m so glad you like it, Nicole! Have a nice day!, , , , , , , , , Jill Roberts, —, July 28, 2017 @ 1:19 am, , Reply, , , This Pumpkin-Apple Breakfast Smoothie looks increadible! Seriously so inspired right now, Kristine! I’ve never tried anything like that before! Thx for sharing!, , , , , , , , Kristine, —, July 28, 2017 @ 2:33 pm, , Reply, , , Thank you, Jill! I hope you like it!, , , , , , , , , D Z, —, September 27, 2017 @ 8:32 am, , Reply, , , Can I use a spiced pumpkin yogurt instead of the plain greek yogurt and pumpkin puree?, , , , , , , , Kristine, —, September 27, 2017 @ 7:51 pm, , Reply, , , I haven’t tried it but I think that would work fine. Enjoy!, , , , , , , , , Brian Elderkin, —, October 7, 2017 @ 8:52 am, , Reply, , , Okay,go ahead and laugh. Get it out of the way. This is my very first soothie ever and I’m 55 years old., , I just had an appt. with my Dr. and, although I’m just a little overweight, tests results show me on the edge of Diabetes and my Triglycerides are off the chart. She suggested smoothies to get my fruit, veggies, protein and fiber knowing that I live alone and it’s against the law for a man to cook for himself., , I made this smoothie but added flaxseed for the Omega 3’s. I cannot stop drinking this. I want to down it but I am sipping it, feeling good as I know there is another cup of it in the fridge. All I can say is thank you. I believe this will help me shed those few pounds and lower my Triglycerides., , P.S. I read a comment about adding protein powder instead of pumpkin. I bodybuilt for five straight years in my 30’s. Very close to competition form. I have read tons of books on the subject. Unless something has changed in the last 20 years, our kidneys can only process 30 mg of protein every three hours. Anything over that puts a lot of strain on our kidneys as they are overworked. I used to eat a can of tuna by itself every three hours. One can is exactly 30 mg’s., , , , , , , Donna, —, October 31, 2017 @ 4:17 am, , Reply, , , Hi..Kristine,, thanks for the amazing smoothie recipe. I’m sure it would be yummy. I’ve never used oats in my smoothie before. But I will definitely try at this time. It seems to me a versatile smoothie. So I think it would be great also if I add frozen mango or berries. What do you think?, , , , , , , , Kristine, —, November 1, 2017 @ 11:02 am, , Reply, , , Thanks, Donna! I think frozen mango would be a nice addition. I’m not sure about the berries and how their flavor would go with the pumpkin. If you try it, let us know how it is., , , , , , , , , Carla Patterson, —, November 1, 2017 @ 6:59 am, , Reply, , , Wow, looks so beautiful and on top of that it’s extremely healthy and my guess is.. also very tasty! Thanks a lot 🙂, , , , , , , Julia Stearns @ Healthirony, —, February 25, 2019 @ 1:43 pm, , Reply, , , This pumpkin-apple breakfast smoothie looks so zesty and tasty! Absolutely love your creative idea! Thanks, Kristine for sharing!, , , , , , , Lori, —, December 1, 2019 @ 12:48 pm, , Reply, , , Can you use something as replacement for the banana? I have an allergy., , , , , , , , Kristine, —, December 2, 2019 @ 4:03 pm, , Reply, , , You can replace the banana with ice cubes or frozen cauliflower florets., , , , , , , Leave a comment », , , , , , , , , , , , , Hi, I'm Kristine!, , I’m the food lover and creator of Kristine’s Kitchen, a website dedicated to family-friendly, from scratch recipes. My goal is to make feeding your family a little easier and a lot more delicious!, , More About Me, , , , , , , Popular, , , , Baked Pork Chops, , , , Best Ever Baked Salmon, , , , BEST Stir Fry Sauce, , , , Instant Pot Pot Roast, , , , BEST Homemade Biscuits, , , , Baked Chicken Thighs, , , , Taco Seasoning Recipe, , , , Healthy Banana Muffins, , , , , , , , , Save time. Eat well., , , Subscribe and receive, FREE family meal plans, , right to your inbox, plus exclusive subscriber-only content!, , , , , , , , , , , , , , , , , , , Favorite Recipes, , , Best Instant Pot Recipes, , Best Air Fryer Recipes, , Best Slow Cooker Recipes, , Soup Recipes, , , , How-To, , , How to Use an Instant Pot, , How to Use an Air Fryer, , How to Cook Rice, , How to Make Scrambled Eggs, , , , Easy Recipes, , , Baked Chicken Breast, , Baked Chicken Thighs, , Baked Pork Chops, , Grilled Chicken, , , , , , , , , , , ^ Back to Top, , Home, , About, , Recipe Collections, , Contact, , Privacy & Terms, , , , , , , , , , , ©2025, All rights reserved., Kristine's Kitchen®, Design by, , Purr, ., , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , Instructions: ",
        "Breakfast Pumpkin Pie Smoothie": "Ingredients: , 1x, 2x, 3x, ▢, 1, , cup, , 2% milk, ▢, 1, , medium, , banana, ▢, 1, , cup, , ice, ▢, 3/4, , cup, , pumpkin puree, , , unsweetened, ▢, 1/2, , cup, , instant oatmeal, , , certified gluten free, ▢, 1/2, , cup, , vanilla greek yogurt, ▢, 3, , tbsp, , maple syrup, ▢, 1 1/2, , tsp, , pumpkin pie spice, ▢, 1/2, , tsp, , cinnamon, ▢, 1/4, , tsp, , nutmeg, , Cook Mode, Prevent your screen from going dark, , Equipment, Blender, , depending on how strong your blender is)., Pour into a glass and serve immediately., , , Nutrition, Calories:, 350, kcal, (18%), Carbohydrates:, 69, g, (23%), Protein:, 13, g, (26%), Fat:, 4, g, (6%), Saturated Fat:, 2, g, (13%), Trans Fat:, 1, g, Cholesterol:, 11, mg, (4%), Sodium:, 88, mg, (4%), Potassium:, 767, mg, (22%), Fiber:, 7, g, (29%), Sugar:, 41, g, (46%), Vitamin A:, 14462, IU, (289%), Vitamin C:, 10, mg, (12%), Calcium:, 231, mg, (23%), Iron:, 3, mg, (17%), , , , , Did you make this recipe?, Share it on Instagram, @Jacqui_DishingDelish, and tag, #dishingdelish, !, , , , We are a participant in both the RewardStyle and Amazon Services LLC Associates Program, which are affiliate advertising programs designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com and through RewardStyle., , , , , originally published, October 3, 2015 —, last updated, June 1, 2024, //, , , 66, Comments, , , Posted in:, , Breakfast, , , Fall 1, , , Recipes, , , Smoothies, , , Vegetarian, , , , , , , , , , , 4.92 from 45 votes (, 24 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , 66 Comments on “Breakfast Pumpkin Pie Smoothie”, , , , , , , Kate, —, , October 16, 2015 @ 12:34 pm, , , Reply, , , Just bought a pumpkin, can’t wait to try myself!, , , , , , , , , Jacqui, —, , October 16, 2015 @ 6:24 pm, , , Reply, , , Let me know how it goes! I’ve always done it with canned pumpkin, but I totally want to try it from scratch with a pumpkin I roast myself!, , , , , , , , , , , Jacqui, —, , October 16, 2015 @ 6:18 pm, , , Reply, , , Thanks! I definitely have pumpkin-fever right now 🙂, , , , , , , , , Tina Jui | The Worktop, —, , October 20, 2015 @ 7:22 am, , , Reply, , , Yum, this looks great! Yogurt sounds great in it, though… I might go for the ice cream 😉, , , , , , , , , Jacqui, —, , October 20, 2015 @ 5:36 pm, , , Reply, , , Thank you Tina! I definitely approve of the ice cream substitution 🙂, , , , , , , , , Falicia Hollaway, —, , November 13, 2023 @ 3:32 am, , , Reply, , , Made this smoothie and it is  actually pretty good !! Was afraid it would send my sugar count way high but it stayed under 150 !!!! Was pretty full all morning from it. I bought the vanilla Greek yogurt but also bought a pumpkin flavor Greek yogurt too. I used it instead of the vanilla one. Will try the vanilla one in the mornin to see if there is a big difference of not., Thanks Jacqui for this great smoothie recipe 😊, , , , , , , , , Jacqui, —, , November 14, 2023 @ 3:18 am, , , Reply, , , Let me know how the pumpkin flavored yogurt turns out, I’m going to try it, too! 🙂, , , , , , , , , , , , , Oana @AdoreFoods, —, , October 20, 2015 @ 12:22 pm, , , Reply, , , You totally had me at pumpkin pie ! Love pumpkin pie everything 🙂 but never thought of a smoothie recipe. Looks fantastic. Thanks for sharing it!, , , , , , , , , Jacqui, —, , October 20, 2015 @ 5:38 pm, , , Reply, , , I’m also on team Pumpkin Pie! Also, team Pumpkin Everything! Thanks for stopping by! 🙂, , , , , , , , , , , Heather, —, , October 22, 2015 @ 1:40 am, , , Reply, , , There is NOTHING about this I dont love!! Thanks for a great recipe and I can’t wait to try this!!!!, , , , , , , , , Amanda Long, —, , November 2, 2015 @ 6:57 am, , , Reply, , , This one too !!! We love all things pumpkin {and your blog is amazing}., , , , , , , , , Rachael, —, , November 7, 2015 @ 11:44 am, , , Reply, , , Usually I don’t like pumpkin but this one looks delicious as it also has my favorite banana… The procedure also seems simple and so I am going to try it once., , , , , , , , , Pat Lebert, —, , December 9, 2021 @ 7:40 pm, , , Reply, , , Pretty tasty. I added more pumpkin pie spice for taste. Will make again., , , , , , , , , Cindy Shipley, —, , October 31, 2022 @ 1:33 am, , , Reply, , , When you say “instant oatmeal”, are we talking Quick Oats? Can you also use Old Fashioned Oats?  Thank you!, , , , , , , , , Jacqui, —, , November 4, 2022 @ 2:29 am, , , Reply, , , Yes I usually use quick oats. I’ve used old fashioned oats before, but you’ll get some slightly bigger oat pieces (which isn’t bad, but not as smooth)., , , , , , , , , , , Leslie Sharp, —, , July 19, 2023 @ 2:14 pm, , , Reply, , , I love the warmth, the festivities, the smells, the smiles, and laughter.  Halloween is the one night, “no matter if your rich, or poor,” no one went home hungry, or had to beg for food, or sweets! Plus, you didn’t have to be welcome, or invited. You just had to be there, you, yourself, or another., Thank You, , , , , , , , , Edwina Gay Harlander, —, , October 5, 2023 @ 2:28 am, , , Reply, , , I made this diabetic friendly by substituting Splenda for sugar and sugar free maple syrup. It was very good., Fall is perfect for all things Pumpkin 🎃!, Edwina Harlander, , , , , , , , , Edwina Gay Harlander, —, , October 5, 2023 @ 2:32 am, , , Reply, , , PS on my previous comment I did use part half and half and part heavy cream to make it thicker., , , , , , , , , Megan, —, , October 29, 2023 @ 7:32 pm, , , Reply, , , Do you use dry oatmeal in the smoothie?  Instant or steel cut?, Or is it cooked oatmeal?, , , , , , , , , Jacqui, —, , October 30, 2023 @ 2:10 am, , , Reply, , , I use dry rolled oats or instant oats. If you’re gluten free make sure it’s certified GF or purity protocol., , , , , , , , , , , Tibbs, —, , November 6, 2023 @ 11:00 pm, , , Reply, , , Cinnamon and nutmeg IS pumpkin pie spice…, , , , , , , , , Kathy, —, , August 25, 2024 @ 4:03 pm, , , Reply, , , I can’t eat raw banana.  Suggestions?, , , , , , , , , Jacqui, —, , September 3, 2024 @ 2:05 am, , , Reply, , , I would leave the banana out and try adding a little extra Greek yogurt, just to give it a thicker texture., , , , , , , , , , , Bernice, —, , September 15, 2024 @ 2:34 pm, , , Reply, , , Can any remaining be refrigerated or frozen?, , , , , , , , , Jacqui, —, , September 16, 2024 @ 4:29 pm, , , Reply, , , You can, , , , , , , , , , , Lavender, —, , September 19, 2024 @ 8:15 pm, , , Reply, , , Made this using frozen ripe banana to make it more like a shake and topped with hemp hearts. So good!, , , , , , , More Comments:, , , « Previous, , 1, , 2, , , , , , , , , , , , , Welcome!, Hi, I’m Jacqui!, , I believe that gluten free food doesn't have to be boring! Here you'll find big flavors, easy recipes, and a few classic comfort foods, all 100% gluten free!, , , Read More », , , , Seasonal Favorites!, , , , Air Fryer Green Beans, , Air Fryer Turkey Meatballs, , Air Fryer Chickpeas, , , Brownie Chocolate Cake, , Chocolate Dipped Marshmallows, , Chocolate Covered Peanut Butter Balls, , , , , Most Popular!, , , , Cinnamon Baked Apple Slices, , Gluten Free Pumpkin Muffins – Soft & Fluffy!, , Chewy Almond Paste Cookies, , , , , Chewy Gluten Free Chocolate Chip Cookies, , Cream Cheese Sausage Balls, , Instant Pot Apple Crisp – Gluten Free!, , , , Search Recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Get Free Recipes, Right into your inbox weekly, 100% Gluten Free!, , , , , , , Your email address, , , , , , , , Sign Up, , , , , , , , , , , , , As Seen In…, , , , , , , 5 Days, 5 Easy Dinners – Ready in 30 Minutes or Less!, YES, I WANT THIS, We respect your privacy. Unsubscribe at anytime., , , , , , , , ^ Back to Top, , Home, , Recipes, , About, , Press, , Contact, , Privacy Policy, , Website Accessibility Policy, , , Follow Me:, , , , , , , , , ©2025 Dishing Delish. All Rights Reserved., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Let us know what you thought of this recipe:, , , This worked exactly as written, thanks!, , My family loved this!, , Thank you for sharing this recipe, , , Or write in your own words:, , , , , , , Name *, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , Instructions: ",
        "Peach and Oat Breakfast Smoothie": "❌ Error scraping http://www.cookingclassy.com/2014/04/peach-oat-breakfast-smoothie: 404 Client Error: Not Found for url: https://www.cookingclassy.com/peach-oat-breakfast-smoothie"
    }
}