{
    "ingredients": {
        "Vegan Tofu omelets": "silken tofu,nutritional yeast,onion powder,gluten free all purpose flour",
        "Chinese style Breakfast pancakes": "all purpose flour, extra firm tofu, carrot,red bell peppers, spice powder, roasted sesame seeds",
        "Vegan Spinach Quiche": "all purpose flour,vegan butter,egg,non dairy cream,leek,spinach,silken tofu,nutritional yeast,besan,vegan feta cheese"
    },
    "recipe_url": {
        "Vegan Tofu omelets": null,
        "Chinese style Breakfast pancakes": "https://thefoodietakesflight.com/chinese-style-savoury-stuffed-breakfast-pancakes-vegan-recipe/",
        "Vegan Spinach Quiche": "https://biancazapatka.com/en/vegan-spinach-quiche/#recipe"
    },
    "Recipe": {
        "Chinese style Breakfast pancakes": "Ingredients: two trees (instead of 1!) will be planted for every download of my eBook through non-profit organisation, One Tree Planted, .?, , Find out more about my reforestation initiatives, here, ., , , , , , , Chinese-Style Savoury Stuffed Breakfast Pancakes, , , Jeeca, , , 5, from, 8, votes, , , Pancakes filled with a mix of scrambled tofu and veggies! These Chinese-Style Savoury Stuffed Breakfast Pancakes are wrapped in homemade dough and pan-fried. These can be made beforehand and stored to be enjoyed anytime!, , , Print Recipe, , Pin this Recipe, , Rate this Recipe, , , , , , Prep Time, 1, hour, , hr, Cook Time, 30, minutes, , mins, Dough rest time, 1, hour, , hr, Total Time, 2, hours, , hrs, , 30, minutes, , mins, , , , , , , Course, Appetizer, Breakfast, Side Dish, Snack, Cuisine, Chinese, , , , , , , Servings, 8, , pancakes, Calories, 119, , kcal, , , , Equipment, Rolling pin (I use a dumpling rolling pin), , , US Customary, Metric, , 1x, 2x, 3x, Dough, 2, , cups, , all-purpose flour, 3/4, , tsp, , salt, 3/4, , cup, , warm water, , , plus 1 tbsp water, 1, , tsp, , neutral oil, Filling, Tofu, 1, , lb, , extra firm tofu, 1, , tsp, , turmeric powder, 3/4, , tsp, , black salt, , or regular salt, Veggies Mix, 1, , cup, , finely shredded carrots, 1, , cup, , chopepd scallions, 1/2, , cup, , diced red bell peppers, 1/2, , tsp, , salt, 1/4, , tsp, , 5 spice powder, , optional but highly recommended, 1, , tsp, , roasted sesame seeds, 1, , tbsp, , toasted sesame oil, , for the vegetable mix, Sesame oil or other oil, , for cooking, For cooking, 1, , tbsp, , neutral oil, , , for 2 pancakes, 1, , tbsp, , water, , , for each pancake,  Instructions: , For the Dough, Add in the flour and salt into a mixing bowl. Mix., , Create a well in the center of the bowl and pour in the warm water., , Use a wooden spoon or spatula to mix the flour and water. Once the dough starts to come together, add in 1 tsp of oil., , Use your hands to mix the bits of dough. You can also use a stand mixer if you have one. Knead together for several minutes. If the dough is a bit dry, add a splash of water., , Keep kneading until you have a smooth ball of dough., , Shape the dough into a ball, then place it in a bowl., , Cover it with a damp towel and let it rest for 30 minutes., , Filling, Drain excess liquid from your tofu. I like to do this by wrapping the tofu in a towel and pressing down with a heavy surface. Mash the tofu afterwards then set aside., Heat a pan. Add in 2 tbsp sesame or other oil. When the oil is hot, add in the scallions, bell peppers, and carrots. Season with some salt, sesame seeds, and chinese 5 spice (optional). Cook over medium high heat for 4-5 minutes until the carrots are tender. Add in a bit more sesame oil. Adjust seasoning based on desired taste., , In the same pan, add in the tofu. Mix in turmeric and black salt or other salt. Mix until well incorporated and tofu is yellow. Leave to cook for a few minutes until excess water from the tofu has evaporated. Turn off heat and then mix the tofu and carrot mix together., Leave filling to cool while you prepare the wrappers., , Making the wrappers, You can watch the video below to see a complete step-by-step on how to make the wrappers., Add some flour on your work surface. Take the dough out of the bowl and knead it  a few times., Punch hole in the middle of the dough and then create a donut shape. Slowly stretch., , Slice the dough into 8 pieces. Roll or shape each piece of dough into a ball. Cover the dough with a towel to prevent from drying while you work on one at a time., , To make a wrapper, press down on the ball of dough and lightly flatten it over the surface. Sprinkle a little flour on top and lightly coat your rolling pin with some flour as well., While holding both ends of the rolling pin, roll out the dough by moving the pin forward and backward. Rotate the dough 90 degrees and repeat the movement., Continue to roll out the dough until you have a wrapper that’s around 5-5 ½ inches in diameter. If you can’t make them into a perfectly round shape, that’s okay! Mine weren’t perfect but I was still able to properly fold these together. It really takes some time and practice to get a hang of making wrappers., , Place the rolled out wrappers on a tray and cover with a dry towel to prevent them from drying out. Roll out the rest of the dough., Take a rolled out piece of wrapper and place around 1/3-1/2  cup of filling into the center., , Crease the edges and pinch with your fingers. Twist to seal and then carefully press it down to flatten. See video for a visual guide. Afterwards, place back the pancake on the tray and cover with a dry towel to prevent it from drying out. Repeat for the rest of the wrappers., , Cooking the pancakes, Heat a pan (with a lid), add in 1 tbsp of oil (for every 2 pancakes). When hot, add in the pancakes and lightly press down. Leave to cook over medium heat for 4-5 minutes until it has a golden brown crust. Flip over and leave to cook for another 4-5 until golden brown., , Prepare the lid of your pan. Using the lid as protection, carefully pour 2 tbsp of water (1 tbsp for each pancake) into the pan and then immediately cover to prevent it from splashing due to the heat., Leave to cook in the steam, until the water has evaporated, around 5-6 minutes. Take out the pies and repeat this step for the remaining ones. Enjoy while hot! See storage tips in the notes below., , , WATCH Video, , Notes, Refrigerator:, , Place the cooked pancakes in an air-tight container and refrigerate for up to 5 days. To reheat, you can pan fry them again with a splash of water or oven-toast in low heat., , Freezer:, You can freeze the cooked pancakes for months (longest I’ve done is 2) and then just reheat from frozen by pan-frying. Cook with a splash of water and then cover to cook in steam., , , NUTRITIONAL INFO, Calories:, 119, kcal, |, Carbohydrates:, 24, g, |, Protein:, 3, g, |, Fat:, 1, g, |, Saturated Fat:, 1, g, |, Polyunsaturated Fat:, 1, g, |, Monounsaturated Fat:, 1, g, |, Trans Fat:, 1, g, |, Sodium:, 582, mg, |, Potassium:, 42, mg, |, Fiber:, 1, g, |, Sugar:, 1, g, |, Vitamin A:, 1, IU, |, Vitamin C:, 1, mg, |, Calcium:, 6, mg, |, Iron:, 2, mg, , , , DID YOU MAKE THIS RECIPE?, Please leave a rating or comment and share a photo on, Instagram,, and tag me @thefoodietakesflight or use #thefoodietakesflight 🙂, , , You can Pin these Images:, , , , , , , , , , , , , , , , , , , , , This Post Has 8 Comments, , , , , , , , , Britany, , , March 10, 2022, , Reply, , , , , , , I would give 6 stars if I could. This was my first recipe I’ve ever made with tofu, as I was skeptical of trying tofu after my school gave me raw cubes from a package to eat. When I took a bite of this, I said “This tastes too good to be healthy!” Wow. Will definitely be trying more recipes from this site!, , , , , , , , , , , , Jeeca, , , March 10, 2022, , Reply, , , , , , , Ahh this makes me so happy. Thanks so much Britany, really happy you liked it!, , , , , , , , , , , , , , Brenda, , , April 4, 2022, , Reply, , , , , , , I substituted 1/2 cup shredded beet for 1/2 cup of carrot and freshly grated ginger. Great recipe, , , , , , , , , , , , Jeeca, , , April 6, 2022, , Reply, , , , , , , Glad you like it! Thanks Brenda  ◡̈, , , , , , , , , , , , , , Jillian, , , October 25, 2022, , Reply, , , , , , , I’ve wanted to make these for a while and they are SOOO delicious! I used some dried shiitake (rehydrated) instead of the red pepper but otherwise kept to the recipe, including using black salt and five spice. I’m really impressed by how flavorful they are with just a few seasonings! Thanks for such a yummy recipe. I’ll definitely make these again!, , , , , , , , , , , , Jeeca, , , October 25, 2022, , Reply, , , , , , , Thanks Jillian! Happy you enjoyed these! And thanks for leaving a review. Appreciate it a lot  ◡̈, , , , , , , , , , , , , , Bianca, , , January 17, 2023, , Reply, , , , , , , Delicious recipe and so well explained. Really haooy with how well these turned out. Thank you!, , , , , , , , , , , , Jeeca, , , January 17, 2023, , Reply, , , , , , , Thank you so much Bianca! Hope you enjoyed it!  ◡̈, , , , , , , , , , , , 5 from 8 votes (, 4 ratings without comment, ), , , , Leave a Reply, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, Enter your name or username to comment, , Enter your email address to comment, , Enter your website URL (optional), , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Hello there!, , , , , , I’m Jeeca, a food content creator and recipe developer passionate about creating easy yet tasty and flavour-packed vegan recipes. I share a lot of Asian recipes inspired by my travels and those I grew up enjoying., , , , , , , , , , , , , ​\nMORE ABOUT TFTF >, , , , , , , , , , , , , , MY COOKBOOK, , , , , , , , , , , , , , , , , , , , , Subscribe for recipes and updates, , , , , , , , , , , , , , , , , First name or full name, , , Email, , , , , , , , , , , , , , , , , , , Search for a recipe:, , , , , , , , , Search, , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Prev, 3 Tasty & Budget-Friendly Pasta Recipes (Vegan), , , , , , , Vegan Pancake Cereal Recipe (Vegan Version of TikTok Recipe), Next, , , , , , , , , , , , , , , , Latest Recipes, , , , , , , , , , , , , 15 Delicious Tofu Recipes You Need To Try!, , , GET THE RECIPE », , , , , , , , , , Vietnamese-Inspired Tomato Noodle Soup, , , GET THE RECIPE », , , , , , , , , , Mushroom and Tofu Patties with Garlic Sauce, , , GET THE RECIPE », , , , , , , , , , Easy Stir-Fried Rice Noodles, , , GET THE RECIPE », , , , , , , , , , Braised Mushrooms and Tofu with Soy, Ginger, and Garlic, , , GET THE RECIPE », , , , , , , , , , Mushroom Freekeh Bowl with Chili Lime Tahini Dressing, , , GET THE RECIPE », , , , , , , Page, 1, , Page, 2, , Page, 3, , …, , Page, 10, , , , , , , , , , , , , , , , , , Search, , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , RECIPES, , , , , , SHOP MY ESSENTIALS, , , , , , ABOUT, , , , , , COOKBOOKS, , , , , , , , , , , , , , FOLLOW ME ON SOCIAL MEDIA:, , , , , , , , , Youtube, , , , , , , Facebook, , , , , , , Instagram, , , , , , , Pinterest, , , , , , , Tiktok, , , , , , , , , , , , , , , , , , PRIVACY POLICY, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 46666, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , ,",
        "Vegan Spinach Quiche": "Ingredients: , , , Easy Homemade Pie Crust Recipe, , I baked this quiche in a simple homemade pie crust which is very easy to make and prepared in only 5 minutes. All you have to do is whisk together the flour and salt. Then add cubed vegan butter, and optionally, also a flax-egg, (or regular egg if you’re not vegan). The flax-egg is not necessary, but I find the dough holds together better with it, especially when using gluten-free flour. After adding the vegan butter (and the flax-egg), knead with your hands until the dough starts to clump together. Then transfer to a working surface and continue kneading until a smooth dough forms. Flatten dough into a disc, wrap in plastic and refrigerate for 30 minutes., , , How to make Homemade Pie Crust, , After the chill time, roll out pie crust dough evenly on a floured surface, about 1/6-inch (4mm) thick. Then transfer into an 8- or 9-inch (20/22cm) lightly greased pie dish. Shape the edges in whatever shape you like or crimp the overhanging dough. Before adding the filling make sure to prick the bottom a few times with a fork. Now you can decide if you want to pre-bake your crust for a crispier result or just add the filling and bake both together. If you’re like me, you will probably bake both together, haha!, , , , , , , , , , Healthy Vegan Quiche, , I prefer using fresh spinach in my quiche, though frozen spinach would be fine as well. Also, I love to add leek, scallions, and garlic, which gives my vegan quiche a little extra flavor but any kind of onions will do! And if you do not have fresh onions or garlic on hand, you can substitute onion powder and garlic powder., , , , , , How to make Spinach Quiche + Helpful Tipps, , The key to preventing a soggy quiche is to reduce the moisture in your vegetables. So please make sure to first sauté the spinach until completely wilted (or thaw frozen spinach) and then drain and squeeze well to remove any excess liquid. When you wrap it in several layers of paper towel and squeeze it you’ll be surprised at how much more water will come out of the spinach!, And if you want to add additional veggies, such as mushrooms, , , Creamy, Cheesy Eggless Quiche, , Once your spinach mixture is prepared and well squeezed, such as crumbled vegan feta or any shredded vegan cheese you like. Finally, add the creamy spinach filling into your prepared pie crust and bake as instructed in the recipe box below., , , , , , , , , , A note about the Baking Time, , All ovens are different in temperature so the total baking time could take anywhere from 30 minutes to 1 hour. The baking time also depends on which pie dish you use or if you cover your vegan quiche during baking because a covered pie takes longer until done. I recommend checking every now and then. As the center of your quiche is no longer liquid and lightly browned, you can remove it from the oven. It’s totally okay if the filling is still a bit wobbly because it firms up as it cools. My cheesy spinach quiche took around 50 minutes, but I covered it after 25 minutes to keep the crust from burning., , , Toppings, , Finally, you can top the quiche with toasted pine nuts for an incredibly tasty nutty flavor, if you like. Another great idea is to serve your individual slices with creamy, guacamole, , dollops of, almond ricotta, , , cashew aioli, , or any other, dips, of your choice., , , This Cheesy Vegan Spinach Quiche is:, , , Vegan, Vegetarian, , Eggless, , Dairy-free, , Plant-based, , Can be made Gluten-free & Soy-free, , Savory, , Healthy, , Easy to make, , Totally delicious!, , Perfect for breakfast, brunch, lunch or dinner, , Also great for meal prep as it tastes cold too!, , Can be served crustless as a vegan omelet or vegan frittata, , , , , Vegan Spinach Quiche Serving Suggestions, , If you are serving your frittata as part of a bigger brunch, , vegan egg salad burritos, ,, vegan french toast, , , pancakes, , , crêpes, , , apple pie roll-ups, , , waffles, , , oatmeal, , , overnight oats, or a simple but delicious, banana bread, would all be great choices to go with it., , , More Spinach Recipes to try, , , Best Spinach & Garlic Mushroom Pizza, , Easy Mushroom Spinach Pasta, , Crispy Spinach Pockets, , Turkish Borek (Spinach Rolls), , Vegan Empanadas, , Ravioli Pockets (German Maultaschen), , Vegan Spinach Croquettes, , Spinach Wraps with Cashew Cheese, , , , If you try this Vegan Spinach Quiche or another of my recipes, feel free to leave a comment on how it goes. And if you take a picture of your dish and share it on Instagram, please make sure to tag me @biancazapatka and use the hashtag #biancazapatka so I won’t miss your post! Happy cooking!, , , , , , , , Vegan Spinach Quiche, Author:, Bianca Zapatka, , , This vegan spinach quiche is creamy, cheesy and totally delicious! It is baked in a flaky homemade pie crust that is very easy to make and can be prepared in under 10 minutes! Impress all your guests with this simple vegan quiche recipe for the ultimate savory breakfast, brunch, or lunch!, , , 4.89, von, 52, Bewertungen, , , , Print, , Pin, , Review, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 45, minutes, , mins, , , , , , , Course, Appetizer, Breakfast, Lunch & Dinner, Main Course, Pie, Side Dish, , , , , , Servings, 1, , 8-/9-inch Pie, Calories, 230.5, , kcal, , , , , , Pie Crust, 1 ½, , cup, , , , all-purpose flour, , 190g, or sub gluten-free flour blend, 2.8, , oz, , , , vegan butter, , 80g, 1, , ,  Instructions: , or add just 3-4 tbsp cold water (or use 1 regular egg, if non-vegan), pinch, , , , of salt, , , pinch of turmeric, , optional for the yellow color, 2, , tbsp, , , , non-dairy cream, , optional to brush the pie crust for shiny color, Spinach mixture, 1, , tbsp, , , , olive oil, ½, , stick, , , , leek (light green or white part only), , or 4 scallions, or 1 regular onion, 12.3, , oz, , , , fresh spinach, , 350g, optional frozen spinach, Tofu filling, 12.3, , oz, , , , silken tofu, , 350g, drained, 1, , tbsp, , , , chickpea flour, , or soy flour, optional sub cornstarch, 2-3, , tbsp, , , , nutritional yeast, , optional, 1, , tsp, , , , salt, ½, , tsp, , , , black pepper, ¼, , tsp, , , , turmeric, , optional for color, ¾, , tsp, , , , garlic powder, , optional, 4.4, , oz, , , , vegan feta cheese, , 125g, or other shredded cheese (optional), To serve, , , pine nuts, , optional, , *, Note, : Please watch the recipe video and check out the step-by-step pictures in my blog post for visual instruction!, Prepare Pie Crust, To make the flax-egg stir 1 tbsp ground flaxseeds in 3 tbsp water. Set aside for 5 minutes. (, If you skip the flax-egg, add a little cold water, )., In a large bowl, whisk together the flour and salt. Add cubed vegan butter and the flax-egg (, or just cold water, ). Knead with your hands until the dough starts to clump together. Transfer to a working surface and continue kneading until a smooth dough forms., Flatten dough into a disc, wrap in plastic and refrigerate for 30 minutes., Roll out evenly on a floured surface, about ⅙-inch (4mm) thick, then transfer into an 8x2-inch (20x5cm) or 9-inch lightly greased pie dish. Shape the edges as you like (, or crimp them, ) and prick the bottom a few times with a fork. (*, Read recipe notes if you want to pre-bake your crust, )., Preheat oven to 425°F (220°C)., Spinach mixture, In a large pan, heat the oil. Add in the leek or scallions, and sauté for about 3 minutes until lightly browned and softened. Add the spinach, and continue cooking until wilted, about 2 minutes (, or simply thaw frozen spinach, )., Transfer into a colander and drain. Then wrap in paper towels and squeeze to remove any excess liquid., Tofu filling, Blend the tofu, chickpea flour, nutritional yeast, and seasonings until smooth and creamy., Add spinach mixture and mix to combine. Then, stir in crumbled vegan feta cheese. Taste and adjust seasonings as needed. (, If the filling seems too thick, add a bit of non-dairy cream, or if it seems too watery, stir in a bit of flour, .), Fill the filling into the prepared crust, smoothing out evenly., Bake for 10 minutes to set pie crust, then turn the temperature down to 356°F (180°C) and bake for further 30-40 minutes until filling is set and light golden brown on top.  (*, If the crust seems getting too dry during baking, brush with a little non-dairy cream for a shiny golden color, and if it’s getting too dark, cover loosely with aluminum foil or baking paper, )., Allow the quiche to cool slightly before slicing. Top with toasted pine nuts and serve with, dips, if you like., Enjoy! 😊, , , Notes, , If you want to pre-bake your crust for a crispier result, top with dried beans or chickpeas to avoid collapsing, and blind bake for 15 minutes at 425°F. Then lower temperature to 356°F, remove the beans, add the filling and bake for another 30-40 minutes., , The baking time may vary, depending on your oven temperature, which pie dish you use, or if you cover the quiche during baking. I recommend checking every now and then., , Please read my blog post for additional information on this recipe., , Nutrition information is calculated for 1 Serving of 8., , , Nutritions, Serving:, 1, Serving, |, Calories:, 230.5, kcal, |, Carbohydrates:, 24.9, g, |, Protein:, 8.6, g, |, Fat:, 11, g, |, Saturated Fat:, 2.3, g, |, Sodium:, 398.8, mg, |, Potassium:, 421.7, mg, |, Fiber:, 2.6, g, |, Sugar:, 1.9, g, |, Vitamin A:, 4674.5, IU, |, Vitamin C:, 13.7, mg, |, Calcium:, 87, mg, |, Iron:, 3.3, mg, , Nutrition is calculated automatically and should be used as estimate., , , , , , Did you make this recipe?, Mention, @biancazapatka, or tag, #biancazapatka, !, , IF YOU HAVE PINTEREST, YOU CAN FIND ME, HERE, AND PIN THE FOLLOWING PICTURE, IF YOU LIKE! 🙂, , , ©Bianca Zapatka | All images & content are copyright protected. Please do not use my \r\n            images without prior permission. If you want to republish this recipe, please link back to this post for the recipe. More info, here, . Thank you \r\n            for supporting, biancazapatka.com, !, , Disclosure for affiliate links with asterisk (*):, This\r\n            page may contain affiliate links that earn me a small commission, at no additional cost to you. You can find more information, here, ., , Filed Under:, Breakfast, , , Lunch & Dinner, , , Recipes, , Tagged With:, baked, , , cheese, , , creamy, , , crispy, , , dairy-free, , , egg-free, , , gluten-free, , , pie, , , quiche, , , savory, , , spinach, , , spinach pie, , , tofu, , , vegan, , , vegetables, , , vegetarian, You may also like:, , , , Previous Post:, « Summer Fruit Cream Tart – easy, no-bake, Next Post:, Vegan Vanilla Cake with Frosting Recipe », Reader Interactions, , , , 4.89 from 52 votes (, 12 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , I have read and accepted the, Privacy Policy, *, , , , Notify me of followup comments via e-mail., , , , , , Comments, , , , , , Alicia, , , 11. April 2024 at 21:20, , , , That filling is genius! I loooved it and so did my omnivore friends (without even knowing it was vegan 🌱 ). Luckily I made the double amount so I could have it for breakfast all week 😍, , , Reply, , , , , , , , Bianca Zapatka, , , 3. May 2024 at 14:04, , , , Great! Thank you! 🙂, , , Reply, , , , , , , , , , Anne, , , 9. April 2024 at 18:52, , , , Great taste but the filling stayed very mushy, it was basically an omelette in a quiche dish. I expected it to set with the chickpea flour., , , Reply, , , , , , , , Bianca Zapatka, , , 11. April 2024 at 11:09, , , , Okay, did you chill it before slicing?, , , Reply, , , , , , , , , , Heather, , , 29. February 2024 at 18:13, , , , Hi Bianka,, , We are looking forward to making this quiche for brunch this weekend. Thank you again for your superb recipes., , A question – do you think you could freeze pieces of this?, , Many thanks,, Heather in New York, , , Reply, , , , , , , , Bianca Zapatka, , , 1. March 2024 at 14:30, , , , Yes, you can also freeze pieces from this. However, take note that this will change the texture., , , Reply, , , , , , , , , , Chrissy, , , 19. January 2024 at 1:55, , , , Made this for dinner with fresh greens from the garden and it was a HUGE success.  Thank you so much for putting this recipe online., , , Reply, , , , , , , , Bianca Zapatka, , , 24. January 2024 at 13:54, , , , Glad you love this recipe. Thanks for your feedback! 🙂, , , Reply, , , , , , , , Suzie, , , 4. February 2025 at 20:39, , , , When you say one serving, how many slices should be in the pie?, , , Reply, , , , , , , , Bianca Zapatka, , , 11. February 2025 at 11:25, , , , The nutritional information is calculated for 1 of 8 small servings as a side dish., , , Reply, , , , , , , , , , , , , , Christa, , , 4. February 2023 at 21:07, , , , Sehr leckere Rezept. Schmeckt auch mit einer Pilz-Spinat Füllung hervorragend., , , Reply, , , , , , , , Bianca Zapatka, , , 7. February 2023 at 12:44, , , , Freut mich, dass die vegane Quiche gut schmeckt! Danke für dein Feedback! ♡, , , Reply, , , , , , , , , , Meagan, , , 26. December 2022 at 19:46, , , , Just made this recipe, and wow!, was it delicious!!! Even my 10 year old devoured it without picking spinach or onions out of the dish. I’ll definitely be making this one again. Thank you!!, , , Reply, , , , , , , , Bianca Zapatka, , , 31. December 2022 at 22:59, , , , Great! Thanks for your feedback! ☺️, , , Reply, , , , , , , , , , Céline, , , 5. December 2022 at 19:46, , , , Obwohl ich eigentlich nicht so ein grosser Fan von Quiches bin, bin ich sehr begeistert von diesem Rezept. Die Spinat Quiche schmeckt wirklich super lecker!, , , Reply, , , , , , , , Bianca Zapatka, , , 6. December 2022 at 22:02, , , , Super, das freut mich! 🙂, , , Reply, , , , , , , , , , TJ, , , 31. October 2022 at 23:21, , , , Currently baking and used a whole serving of tofu with out double checking the measurements. I hope longer time in the oven will eventually dry it out. I’m gutted was so excited to try, , , Reply, , , , , , , , Bernadette, , , 14. October 2022 at 1:50, , , , This quiche was awesome. Will make again. Thanks for sharing., , , Reply, , , , , , , , Bianca Zapatka, , , 14. October 2022 at 21:44, , , , Great! 🙂, , , Reply, , , , , , « Older Comments, Primary Sidebar, Follow Me, , Email, Facebook, Instagram, Pinterest, YouTube, , About Me, , Hi! I’m Bianca, and welcome to my blog! I love to cook and bake and want to share that passion with you. Here you’ll find many delicious recipes which are mainly plant-based and easy to make for everyone., Read More…, , , , , Search, , New Posts, , Vegan Fajitas with Sheet Pan Vegetables, Cilantro Lime Rice Recipe, Tabbouleh Salad Recipe Original (quick & easy), , Tags, , autumn, , baked, , berries, , cake, , christmas, , creamy, , crispy, , dairy-free, , dessert, , egg-free, , fall, , fluffy, , fruit, , fruits, , fruity, , garlic, , gluten-free, , green, , sauce, , savory, , snack, , spicy, , spring, , summer, , sweet, , tomato, , vegan, , vegetables, , vegetarian, , winter, , , , , , , , Footer, , txt, , , , Email, Facebook, Instagram, Pinterest, YouTube, , About Me, , Hi! I’m Bianca, and welcome to my blog! I love to cook and bake and want to share that passion with you. Here you’ll find many delicious recipes which are mainly plant-based and easy to make for everyone., , , My Favorites, , , Legal Notice, , Privacy Policy, , Contact, , , Copyright © 2025 Bianca Zapatka, WordPress Betreuung by Florian Salman, , , , , Bianca Zapatka, , , , , , , , , , Search, Home, Browse Recipes, , , Basics, , , Bread, Naan (Flatbread), Pancakes, Pasta Dough, Pizza Dough, Dumpling Wrappers, Vegan Mozzarella, Sponge Cake, Pie Dough, Back, , , Breakfast & Brunch, Appetizers, Sides & Salads, Soup, Stew & Curry, Lunch & Dinner, Pasta & Gnocchi, Quick & Easy, Pizza, Sandwiches & Burger, Fingerfood & Snacks, Cake, Sweets & Dessert, Drinks, Back, , Topics, , , Vegan Protein Sources, Vegan Collagen, Vegan BBQ Recipes, Vegan Pasta Recipes, Best Vegan Cheesecakes, Easy Vegan Recipes, Vegan Cookies, Veganuary Recipes, Vegan Christmas Dinner, Back, , Tips & Tricks, , , How to peel and cook Asparagus, Vegan Baking Tips, Cake Pan Conversion Calculator, Egg Substitutes, Meat Alternatives, Vegan Food Pyramid – Nutrients & Nutrition Facts, Food Storage and Shelf Life – How To Store Food, Back, , Cookbooks, , , Vegan Food Love, Vegan Paradise, Vegan Cakeporn, Vegan Soulfood, Vegan Foodporn, Vegan & Easy, Back, , My App, About me, , , Work with Me, Contact, Newsletter, Back, , , × Close Panel, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,"
    }
}