{
    "ingredients": {
        "Vegetarian Stuffed Peppers": "red bell peppers,yellow onion,white rice,diced tomatoes,green onions,taco seasoning,black beans,corn,vegan cheese",
        "Breakfast Squash": "acorn squash,oatmeal,cinnamon,breakfast sausage,vanilla extract",
        "Smashed pea pancakes": "cornflour,baking powder,eggs,frozen peas,onions,mint leaves,poached eggs,spring onions,coriander"
    },
    "recipe_url": {
        "Vegetarian Stuffed Peppers": "http://themodernproper.com/vegetarian-stuffed-peppers",
        "Breakfast Squash": "fixate_recipes\\Breakfast\\FXR-EN-Breakfast_Squash-6.2.21-Recipe.pdf",
        "Smashed pea pancakes": "https://www.tastemade.co.uk/videos/smashed-pea-pancakes/"
    },
    "Recipe": {
        "Vegetarian Stuffed Peppers": "Ingredients: , , , , , , , 4, , large red bell peppers, , , , 1 tablespoon, , extra-virgin olive oil or vegetable oil, , , , ½, , medium yellow onion, diced, , , , 1 teaspoon, , salt, , , , 1 cup, , uncooked white rice, , , , 1 ⅔ cups, , vegetable broth, , , , 1 (13.5-ounce) can, , diced tomatoes, , , , 3-4, , green onions, chopped, , , , 2 tablespoons, , taco seasoning (homemade or store bought), , , , 1 (13.5-ounce), , can black beans, drained and rinsed, , , , 1 cup, , frozen corn, , , , 1 cup, , shredded pepper jack cheese, , , , Minced fresh cilantro (optional), , , , , , , , , , , , , , , , , , , , , , , In step 2 it mentions to dice one of the bell peppers and halve the other 3. so 3 get halved and stuffed and one gets diced to put in the filling. Hope you enjoy Beverly!, , , , , , , , Load More Questions, , , , , , , Starr, , , , , , , , , , , , , , , , , , , One of my got meatless Monday favorites.  Lots of flavor and easy to make. I use par boiled rice, I add it after the black beans and corn and it always cooks. Thank you!, , , , , , , , , , , , , , , Thanks Starr, so glad you love it!, , , , , , , Muffy, , , , , , , , , , , , , , , , , , , Oh so good!  I used poblanos cause thats what I had on hand.  I had a fresh tomato 🍅 so I used that with small can of tomato sauce.  Feeling a bit rushed so used 90 second cilantro lime rice.  Great flavors., , , , , , , , , , , , , , , Muffy Beth, so glad you loved it!, , , , , , , Alauna, , , , , , , , , , , , , , , , , , , These were sooo good! My family has begun transitioning to a pescatarian lifestyle so I've been trying to find filling vegetarian recipes. They loved these. I used green bell peppers because the grocery store didn't have red ones, but they turned out so good! I have a house full of teens and pre-teens and they raved over these., , , , , , , , , , , , , , , YAY! Thanks Alauna, we are so happy you all loved them! We have a post titled \"60 Best Vegetarian Meals\" if you need more ideas while you're transitioning to pescatarian!, , , , , , , Ashlee, , , , , , , , , , , , , , , , , , , This recipe was amazing ! I added some plant based beef crumbles. Also, I used hot taco seasoning and hot diced tomatoes. Then I put tapatío on my serving. Soooooo good!!!!!, , , , , , , , , , , , , , , Thanks Ashlee, glad you loved it!, , , , , , , Grace, , , , , , , , , , , , , , , , , , , Thank you for this recipe!! It tasted really delicious!! I enjoyed every bite 😍, , , , , , , , , , , , , , , Thanks Grace, we are so happy you loved it!, , , , , , , , Load More Reviews, , , , , , , , , , , , , , , , , , , , , Our Recipes, Your Inbox, , Subscribe to our Newsletter for weekly recipe inspiration as well as seasonal menu tips and resources., , , , , , , , , , , , , , Simple Dinners for Every Day, , , , Home, , , , Recipes, , , , About, , , , Contact, , , , Privacy Policy, , , , , , , , Join our Newsletter, , Weekly recipe inspiration and seasonal menu tips right in your inbox., , , Subscribe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Follow TMP on Instagram, , , , , , , , , , , , , Follow TMP on Pinterest, , , , , , , , , , , , , Follow TMP on Facebook, , , , , , , Follow TMP on TikTok, , , , , , , , , , , , , , , Instructions: , , , , , Preheat the oven to 400°F with a rack in the center position. Grease a 9 x 13-inch baking dish with olive oil., Trim, deseed, and dice one of the bell peppers. Halve the remaining bell peppers lengthwise, keeping the stems intact as much as possible. Discard the seeds and ribs., Heat the oil in a large skillet over medium heat. Once the oil is glistening, add the onion and cook, stirring, until just softened, about 4 minutes. Stir in the rice and salt and cook for about 3 minutes more. Stir in the broth, tomatoes, green onions, taco seasoning, and bell pepper. Bring the rice mixture to a boil. Reduce the heat, cover, and simmer until the rice is tender, about 25 minutes. Stir in black beans and corn, until fully combined and warmed through., Arrange the peppers in the prepared baking dish and fill them with the rice mixture, dividing evenly. Top with cheese. Bake, uncovered, until cheese is bubbling and golden brown, about 40 minutes., Sprinkle with cilantro, if desired, and serve., , , , , , , , Nutrition Info, , , Per Serving, , Amount, , , , , , , Calories, , 319, , , , Protein, , 12 g, , , , Carbohydrates, , 49 g, , , , Total Fat, , 9 g, , , , Dietary Fiber, , 7 g, , , , Cholesterol, , 20 mg, , , , Sodium, , 626 mg, , , , Total Sugars, , 10 g, , , , , , , , , , , , Scroll to Top, , , , , , , , , , , , , , , Vegetarian Stuffed Peppers, , Questions & Reviews, , Join the discussion below., , , Ask a Question, , , or, , , Write a Review, , , , , , , , , , , , Name*, , , , , , Email*, , , , , , Comment, , , , , , , Rating, , , , , , , 5, , , , , , , , 4, , , , , , , , 3, , , , , , , , 2, , , , , , , , 1, , , , , , Submit, , , This form is protected by reCAPTCHA and the Google, Privacy Policy, and, Terms of Service, apply., , , , , , , Questions, , 34, , , , Reviews, , 24, , , , , Avg: 5, , , , , , , , , Donna, , Can these be assembled ahead of time and then baked the next day?, , , , , , , , , , , , , , , Absolutely! Hope you enjoy!, , , , , , , Kathy, , Can Minute Rice be used or brown rice?, , , , , , , , , , , , , , , , , , , , , Ting, , You mentioned to bake for 40mins. How many degrees celcius or fereignheit?, , , , , , , , , , , , , , , 400°F Hope you enjoy!, , , , , , , Maria, , Will the peppers soften in the oven within 40min, or will they still be crunchy?, , , , , , , , , , , , , , , They will soften, hope you enjoy!, , , , , , , Beverly, ",
        "Breakfast Squash": "Ingredients: , since foods are often processed at facilities that also process wheat and other grains., © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., GF, FIXATE BREAKFAST SAUSAGE, SERVES: 4 (approx. ¾ cup each)    Prep Time: 10 min.    Cooking Time: 8 min., CONTAINER EQUIVALENTS (per serving):, 1, 1 lb., 2 Tbsp., 1 tsp., 1 tsp., 1 tsp., ¼ tsp., 1 dash, ¼ tsp., 2 tsp., 1 tsp., raw 93% lean ground turkey, pure maple syrup, sea salt (or Himalayan salt), finely chopped fresh sage, finely chopped fresh rosemary, ground black pepper, ground juniper berries (optional), ground nutmeg, ice cold water, olive oil, 1.\t Combine turkey, maple syrup, salt, sage, rosemary, pepper, juniper,, nutmeg, and water in a large mixing bowl; mix with clean hands until just, blended. Set aside. Cook’s Note: Try not to overmix as that will make the, homogenous mixture., 2.\t Heat oil in large nonstick skillet over medium-high heat., 3.\t Add turkey mixture; cook, stirring frequently to break turkey into crumble-, sized pieces, for 5 to 8 minutes, or until turkey is no longer pink., TIPS:, • If possible, use dark amber maple syrup, which can be found at upscale, markets or online., • If you can’t find juniper berries at your local store, check online., • This sausage can also be cooked in patties. Store cooked sausage in the, refrigerator for up to 5 days., • Sausage can be held raw, in the refrigerator, for 3 days, or in the freezer, for up to 3 months., PF, RECIPES, , NUTRITIONAL INFORMATION (per serving): Calories: 188  Total Fat: 9 g   Saturated Fat: 2 g   Cholesterol: 50 mg   Sodium: 491 mg   Carbohydrates: 8 g, Fiber: 0 g   Sugars: 6 g   Protein: 24 g, Recipes containing the GF icon are designed to be Gluten Free and contain no gluten. If you are following a gluten-free diet, , since foods are often processed at facilities that also process wheat and other grains., Recipes containing the PF icon are designed to be Paleo Friendly and contain no grains or legumes, and only paleo appropriate starchy vegetables and dairy. Please read product labels for each ingredient, to ensure this to be the case., © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Smashed pea pancakes": "Ingredients: Learn More, Recipe of the Day, Save, Share, Radish Salad with Citrus Dressing, Bitter radishes are accented with bright, citrusy dressing in this bright salad., View More, Featured Show, Forking Delicious: 100 Iconic Dishes, Tastemade's panel of comedians and food icons judge and debate today's top 100 iconic dishes as voted by YOU., Learn More, Recipe of the Day, Save, Share, Five-Spice Seared Duck Breast, Surprise your beau with this romantic dinner created by the very talented Chef Shirly Chung. First, we start with an impressive Five Spice Seared Duck Breast with Kumquat Mustard followed by a Radish and Citrus salad., View More, Recipe of the Day, Save, Share, Spring Salad with Seasonal Vegetables and Honey-Berbere Dressing, Chef Keith Corbin celebrates spring with a Southern-inspired salad, packed with seasonal vegetables tossed in a flavorful honey-berbere vinaigrette., View More, Featured Show, Andrew Zimmern's Wild Game Kitchen, Chef Andrew Zimmern demystifies sourcing wild game and cooking gourmet food over an open fire., Learn More, Find Your New Favorite Show, View All Shows, View full content for [object Object], Food, The ultimate destination for food lovers and home chefs alike. Featuring award-winning food and lifestyle programming designed to get you off the couch., View All Food Shows, View full content for [object Object], Travel, Find new adventures that make the local, global with off-the-beaten-path series that encourage you to stop scrolling and start hunting for ways to make the everyday special., View All Travel Shows, View full content for [object Object], Home & Design, For a new generation of homeowners and renters alike. With award-winning design shows and DIY-focused programming to inspire you to make your home a vibe., View All Home & Design Shows, Seasonal Recipes For April, View All Recipes, Featured Recipe, Save, Share, Apricot, Mint + Burrata, This summery salad stars sweet apricots, herby mint, and creamy burrata., Make Now, Featured Recipe, Strawberry Rhubarb Crumble, Get all the strawberry rhubarb flavor you love in this simple, sweet and hearty crumble., View More, Featured Recipe, Cheesy Spring Chard Cannelloni, Baked pasta is pure comfort, and this dish highlights the vibrant, iron-rich flavor of spring chard. It pairs perfectly with the sweet tomato base and creamy cheesy topping—spring on a plate!\n\nJamie Oliver: Seasons Series 1: “© 2024 Jamie Oliver”\nwww.jamieoliver.com\nhttps://www.instagram.com/jamieoliver, View More, Everything you love, ad-free and on-demand, Start Free Trial, Follow-along & shop, your favorite shows with us LIVE!, Watch Now!, Streaming Now, Tastemade Series Streaming 24/7 for Free, Find Where to Watch, Make this Tonight, The first cookbook from Tastemade invites food lovers to prepare, plate and present vibrant, delicious plates of food for all occasions., Order Now, Weekend Refresh, No need to dream of a beautiful home when you can make it happen in just 48 hours. Join us to learn how to make the most of your space no matter the size or shape., Order Now, Personalized  Meal Plans, Make Cooking So Much Easier, Personalized meal plans, tailored to your tastes, lifestyle, and dietary needs., Included in your Tastemade+ membership, Start 1-week FREE Trial, Get Our Newsletter, Stay in the loop with weekly recipes, tips, show recommendations, and more from Tastemade., Sign Up, About, Press, Advertise, Careers, Contact, Privacy, Terms, Accessibility, Help Center, Cookie Settings, Shop, Tastemade on, Instagram, Tastemade on, Pinterest, Tastemade on, TikTok, Tastemade on, Snapchat, Tastemade on, Amazon Live, 2025, © Tastemade, Inc. Instructions: "
    }
}