{
    "ingredients": {
        "Mexican Salad": "red bell pepper,corn,tomato,mango,avocado,black beans,cilantro",
        "Tuscan Bean Salad": "cannellini beans,tomatoes,garlic,red onion,rosemary,red wine vinegar,basil",
        "French Lentil Salad": "red onion,celery,carrots,green lentils,bay leaf,thyme,dill,tarragon,celery, red wine vinegar,white miso paste,pine nuts"
    },
    "recipe_url": {
        "Mexican Salad": "https://www.littlebroken.com/chopped-mexican-salad-with-honey-lime-cilantro-vinaigrette/",
        "Tuscan Bean Salad": "fixate_recipes\\Salad\\FXR_Tuscan_Bean_Salad_R_03.19.18.pdf",
        "French Lentil Salad": "fixate_recipes\\Salad\\FXR_French_Lentil_Salad_R_03.19.18.pdf"
    },
    "Recipe": {
        "Mexican Salad": "Ingredients: How to Make Mexican Salad, Mexican Salad Recipe Variations, How to Serve Mexican Salad, How to Store Mexican Salad, Mexican Salad Recipe FAQs, Video: How to Make Chopped Mexican Salad, You May Also Like, Simple Mexican Style Salad Recipe, , , , , What Makes, T, his The Best Mexican Salad Recipe, , such as corn, tomatoes, mango, and avocado, and tossed in honey-sweet cilantro lime dressing., , Not to mention, this Mexican side salad makes the best summer side dish and pairs so well with, jalapeño, , turkey burgers, or these, spicy chicken and sweet potato kebabs, . It’s sweet, light, and very citrusy tasting. If you’re serving anything spicy, this salad is your friend., , , , , , , , , red bell peppers, , corn, , tomatoes, , mango, , avocado, , black beans, , cilantro, , lime juice, , orange juice, , garlic, , shallot, , honey, , olive oil, , , , Tip!, This salad also tastes great with an addition of red onions or chopped romaine lettuce., , , , Simple Mexican Salad Dressing, , , It consists of fresh lime juice, fresh orange juice, garlic, shallots, honey, and cilantro., , , , Tip!, The key to this salad dressing is to use fresh citrus juice.  It’s truly the best! If you end up with leftover dressing, simply store in an airtight container, refrigerated, for up to 3 days and use it over taco bowls, fresh salads, or as a marinade., , , , How to Make Mexican Salad, , To make this salad, select quality, check out your local farmer’s market. It’s a great way to buy locally and support your local farmers., , , Step 1:, First you want to start by roasting corn and bell peppers. Roasting brings out the natural sweetness of the vegetables and gives them a beautiful color., , , For the bell peppers, set your oven to 425 F. Cut the bell peppers in half, clean out the seeds, and core. Rub with little olive oil and roast, cut side down, until soft and lightly brown, about 20 minutes., , , Step 2:, In the meantime, on the stovetop, roast the corn in little olive oil over medium-high heat until charred and golden, about 4-8 minutes., , Step 3:, Next, , Step 4:, Once the peppers have cooled enough to handle, scrape away the skin and cut into 1/2-inch dice., , Step 5:, Combine the roasted peppers, corn, , , , , , , , Mexican Salad Recipe Variations, , Try these ideas to make this recipe your own:, , , Dressing:, Feel free to swap out the cilantro lime dressing with any dressing you like best!, , Protein:, Transform this side dish into a complete meal by adding, chicken, , shrimp, or ground beef., , Herbs and Spices:, Add even more flavor by incorporating herbs and spices such as cumin, garlic powder, and cilantro., , Add Greens:, Lettuce, spinach, or mixed greens are a great way to add extra nutrients and bulk., , Tortilla Chips:, Tortilla chips or tortilla strips add a nice crunch., , , , , , How to Serve Mexican Salad, , , Portobello Mushrooms with Chicken and Corn, , Zucchini Chicken Enchiladas, , Chicken Patties with Corn Succotash, , One-Pan Chicken with Zucchini and Corn, , Ground Chicken Enchiladas, , Grilled Chicken Tacos, , , , , How to Store Mexican Salad, , Mexican chopped salad recipe is best enjoyed on the same day that it’s made. You can store the leftovers for 1-2 days in an airtight container, however, the avocado will oxidize and turn brown., , , , Mexican Salad Recipe FAQs, , What is Mexican salad made of?, , Mexican salad is made with roasted red bell peppers, corn, tomatoes, mango, avocado, black beans, and cilantro, and tossed in a cilantro lime dressing made with lime juice, orange juice, garlic, shallot, honey, cilantro, and olive oil., , , Can I add meat to Mexican salad?, , I do not recommend adding chopped meat to Mexican salad, however, you can serve the Mexican salad alongside grilled chicken or shrimp., , , Can I make Mexican salad ahead of time?, , You can make Mexican salad up to 1 day ahead of time. Hold off on adding the avocado just until ready to serve., , , , , Video: How to Make Chopped Mexican Salad, , , , , , You May Also Like, , , , , , Mexican Tuna Salad with Creamy Cilantro Dressing, , , , , , , Chicken Fajita Bowl, , , , , , , The Best Cilantro Dressing Recipe, , , , , , , Mexican Beans and Rice, , , , , , If you try this recipe, please leave a star rating and let me know how you like the recipe in the comments below., , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , , Simple Mexican Style Salad Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.9, from, 16, reviews, , , , , , , Author:, , Katya, , , Prep Time:, , 30 mins, , , Cook Time:, , 20 mins, , , Total Time:, , 50 mins, , , Yield:, , 8, , 1, x, , , Category:, , Salad, , , , , , , Units, , US, M, , , , Scale, , 1x, 2x, 3x, , , , , , , 2, red bell peppers, , halved lengthwise, stem/seed core removed, , 1 1/2, , cups, frozen or fresh corn, , 2, large tomatoes, , cored, seeded, and cut into, 1/4, -inch dice, , 1, large ripe mango, , cut into, 1/4, -inch dice, , 2, large avocados, , peeled, pitted, and cut into, 1/4, -inch dice, , 1, (15 oz.) can black beans, , drained and rinsed, , 1/4, , cup, coarsely chopped fresh cilantro, , Olive oil, , , Cilantro Lime Dressing, , , 3 Tbsp, . fresh lime juice, , 3 Tbsp, . fresh orange juice, , 1, clove garlic, minced, , 2 tsp, . finely chopped shallot, , 1 Tbsp, . honey, , 1 Tbsp, . minced fresh cilantro, , 3 Tbsp, . extra-virgin olive oil, , Kosher salt, and fresh black pepper, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , , More about  », , , , , , , , , « Previous Post, , Grilled Mediterranean Turkey Burgers, , Next Post », , Ina Garten Roasted Tomato Soup, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, , , Email, , , , , , , , 51 comments on “Mexican Chopped Salad”, , , , « Previous, , 1, , 2, , , , , , , , Amber R Glauvitz, —, July 1, 2024 @ 3:25 PM, , Reply, , , this was so good!!  made it exactly as written! I think next time I’ll add some jalapeños.  I used fresh sweet corn off the cob. the longer it sits the better it gets! printed to make again!, , , , , , , , Anonymous, —, May 26, 2024 @ 3:08 PM, , Reply, , , perfect summer salad!, , , , , , , , Chef Jeanne, —, December 16, 2023 @ 1:14 PM, , Reply, , , I am a personal chef and this salad is a big hit with all my clients!!, , , , , , , , peggy underwood, —, May 7, 2023 @ 5:49 PM, , Reply, , , Salad is delish! I feel like you can top your individual serving with a little bit of baby spring greens.  What do you think?, , , , , , , , Katya, —, May 8, 2023 @ 8:13 AM, , Reply, , , I think that would be great! Arugula, spring mix, or even spinach would work., , , , , , , , , Tracy Jabs, —, January 4, 2023 @ 5:07 PM, , Reply, , , Love this salad!, , , , , , , Sharon, —, September 7, 2022 @ 11:17 AM, , Reply, , , This was delicious. I did add 2 teaspoons of mesquite liquid smoke to help enhance the flavor., , , , , , , Luna, —, August 21, 2022 @ 1:50 PM, , Reply, , , Is there a possible substitute for the orange juice?, , , , , , , Katya, —, August 22, 2022 @ 9:53 AM, , Reply, , , Hi Luna: Pineapple juice would be a good substitute., , , , , , , , , James, —, August 13, 2022 @ 11:57 PM, , Reply, , , It is a great mexican salad recipe., , , , , , , Stacy, —, April 10, 2022 @ 2:20 PM, , Reply, , , I made this last night for a party we were attending I did not put the mango in it….I left it out at the last minute because I wasn’t confident in selecting a mango and I’m not a fan of fruit in my regular food (just personal preference!) The other change I made was adding Corina cheese crumbles to the top. Other than those 2 changes, I made the recipe exactly as directed and it was delicious. I received many compliments and had no leftovers to bring home. When I make this again, I think might add a dash of cumin and some diced jalapeños to personalize to our palate, but a great recipe as is 🙂, , , , , , , , Stacy, —, April 11, 2022 @ 1:21 PM, , Reply, , , My phone auto corrected the cheese-it should say Cotija cheese 🙂, , , , , , , , , Debbie Hewson, —, January 16, 2022 @ 1:15 PM, , Reply, , , Just wondering if I can make this early in the day and  refrigerate it until dinner. Will the mango and avocado turn dark?, , , , , , , Katya, —, January 16, 2022 @ 2:06 PM, , Reply, , , Mango should be fine but avocado may turn a little brown. You can add the avocado right before serving., , , , , , , , , Mary, —, July 26, 2021 @ 8:25 AM, , Reply, , , Im going to use fresh ripe peaches, , , , , , , Katya, —, July 26, 2021 @ 3:49 PM, , Reply, , , That sounds like a delicious addition! Let me know how it works out for you., , , , , , , Marilynn, —, May 5, 2022 @ 4:34 PM, , Reply, , , That sounds great., , , , , , , , , restaurantthatdeliversnearme.website, —, January 21, 2021 @ 2:48 AM, , Reply, , , thanks for the salad, , , , , , , « Previous, , 1, , 2, , , , Leave a comment », , , , , , , , , , , , Hello & Welcome, Hi! I’m Katya., , Little Broken is a food blog that I started in 2014. Here, , Learn more, , Follow Me:, , , , , , Search Recipes, , , , Submit, , , , , Reader Favorites, Healthy Dinner Favorites, , , , , , , Whole Wheat Mac and Cheese, , , , , , , How to Make Chicken Teriyaki, , , , , , , Baked Sausage and Peppers, , , , , , , Lettuce Wrap Tacos, , , , , , , Turkey Shepherd’s Pie (Easy!), , , , , , , Ground Turkey Spaghetti Squash, , , , , , , Reader Favorites, Cozy Soups, , , , , , , Creamy Chicken and Mushroom Soup, , , , , , , Beef Stew in Dutch Oven, , , , , , , Three Bean Turkey Chili, , , , , , , Scallop Chowder, , , , , , , Chicken Orzo Soup Recipe, , , , , , , Tuscan Kale White Bean Soup, , , , , , , get my, latest recipes, delivered to your inbox:, , , , , , , Subscribe, , , , , , , , , , featured on, Featured On, , , get my, latest recipes, delivered to your inbox:, , , , , , , , , , , , , , , , , ^ Back to Top, , Home, , Recipe Index, , About, , Contact, , Popular FAQs, , Disclosure, , Privacy Policy, , , , , ©2025 Little Broken, ., Design by, , Purr, ., , , , , , , , , , , , , , , , , , , , , Instructions: , Chop, , , Cuisine:, , Mexican, , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , Description, , , Chopped Mexican salad with roasted peppers, corn, beans, and avocado, tossed in the most amazing cilantro lime dressing. So good as a side to grilled chicken or shrimp., , , , , , , , , , , , Preheat the oven to 425 degrees F. Line a, baking sheet, with parchment paper and put the pepper halves on the, baking sheet, , cut side down. Drizzle with olive oil and rub to coat. Roast until the peppers are soft and lightly browned, about 20 minutes., , While the peppers are roasting, in a medium skillet over medium-high heat roast corn in little bit of olive oil until slightly charred and golden, about 5-8 minutes. Remove from heat and cool slightly., , When the peppers are done roasting and cooled enough to handle, scrape away the skins and cut into 1/2-inch dice., , In a small bowl, whisk lime juice, orange juice, garlic, shallot, honey, cilantro, and olive oil. Season to taste with salt and pepper., , In a large salad bowl, combine bell peppers, corn, tomatoes, mango, avocados, and black beans. Add the vinaigrette to your taste and mix well. Sprinkle with fresh cilantro and chill for 15-30 minutes, covered, in the refrigerator., , , , , , , Nutrition, , , Serving Size:, , , Calories:, , 281, , Sugar:, , 11.7 g, , Sodium:, , 214 mg, , Fat:, , 17.2 g, , Carbohydrates:, , 29.9 g, , Protein:, , 6.8 g, , Cholesterol:, , 0 mg, , , , , , , , Did you make this recipe?, , Tag, @littlebrokenblog, on Instagram and hashtag it, #littlebrokenblog, , , , , , , , This Mexican Salad was first published in 2014. Updated with new images in June 2019., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , This post may contain affiliate links. Read my, disclosure policy, ., , , , Cuisine, , Dairy Free, , Diet, , Gluten Free, , Mexican, , Recipes, , Salads, , Season, , Summer, , Vegetarian, , Videos, , , , originally published on, Jun 11, 2019, (last updated, Apr 29, 2023, ), , , , 51 comments, , , Leave a comment », , , , , , , About the author, , , ",
        "Tuscan Bean Salad": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., NUTRITIONAL INFORMATION (per serving): Calories: 151   Total Fat: 7 g   Saturated Fat: 1 g   Cholesterol: 0 mg   Sodium: 304 mg   Carbohydrates: 17 g, Fiber: 4 g   Sugars: 1 g   Protein: 6 g, TUSCAN BEAN SALAD, O, SERVES: 6 (¾ cup each)    Prep Time: 15 min.    Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, ½, 1, 2, 1.\t Combine beans, tomatoes, garlic, onion, rosemary, salt, pepper, oil, and, vinegar in a large mixing bowl; toss gently to blend., 2.\t Stack and roll basil leaves on your work surface and thinly slice, (chiffonade). Add to bean mixture; toss gently to blend. Enjoy!, RECIPE NOTES:, •\t To seed a fresh tomato, cut the ends off, cut out the core, and gently, scoop out any remaining seeds that weren’t removed with the core., •\t Chiffonade is a simple technique in which the leaves of a soft herb are, stacked, rolled, and sliced thin. It is a great way to cut delicate herbs, without bruising and it looks beautiful!, 2 cans (15-oz. each)\t \u0007cannellini beans, , drained, rinsed, ¾ cup, , \u0007seeded, chopped Roma, tomatoes (approx. 2, medium), 2 cloves, , garlic, finely chopped, 1⁄3 cup, , \u0007thinly sliced red onion, (approx. ½ medium), 1 Tbsp., , \u0007finely chopped fresh, rosemary, ½ tsp., , sea salt (or Himalayan salt), ½ tsp., , ground black pepper, 3 Tbsp., , extra-virgin olive oil, 1 Tbsp., , red wine vinegar, ¼ cup, , \u0007loosely packed, fresh whole, basil leaves, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "French Lentil Salad": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., FRENCH LENTIL SALAD, O, SERVES: 8 (approx. ½ cup each)  Prep Time: 15 min.  Cooking Time: 37 min., CONTAINER EQUIVALENTS (per serving):, ½, ½, 1, Loaded with fiber and protein, lentils are a great source of nutrition, but they can be a bit dull if not prepared, properly. This French Lentil Salad is layered with flavors, both during and after cooking, giving you a lip-smacking, mix of savory, sweet, salt, and herbs. If you think you don’t like lentils, now’s the time to give them a second try., 1 cup, finely chopped red onion, (approx. 11⁄3 medium), ½ cup, finely chopped celery, (approx. 1¼ medium stalks), ½ cup, peeled and finely chopped carrots, (approx. 1¼ medium), 1 cup, dry French green lentils, rinsed, 1, bay leaf, 3 sprigs, fresh thyme, , Water, ¼ cup, olive oil, 1 Tbsp., finely chopped fresh dill, 1 Tbsp., finely chopped fresh tarragon, 1 Tbsp., finely chopped celery leaves, ¼ cup, red wine vinegar, 1 Tbsp., white miso paste (or ½ tsp. sea salt, or Himalayan salt), ½ tsp., ground black pepper, ½ cup, thinly sliced red onion, (approx. 2⁄3 medium), ¼ cup, pine nuts, toasted, SPECIAL EQUIPMENT:, Nonstick cooking spray, 1. \t Heat medium saucepan, lightly coated with spray, over medium heat., 2 .\t Add chopped onion, celery, and carrots; cook, stirring frequently, for 5 to 6, minutes, or until onion is translucent., 3. \t Add lentils, bay leaf, and thyme. Cover with 2 inches of water. Bring to, a boil. Reduce heat to low; gently boil, covered, for 20 to 25 minutes, or, until lentils are tender but still have some bite., 4. \t While lentils are cooking, make dressing by combining oil, dill, tarragon, , celery leaves, vinegar, miso paste, and pepper in a large bowl; whisk, to blend., 5. \t When lentils are finished cooking, drain; discard bay leaf and thyme sprigs., 6 .\t Add lentils to dressing; toss gently to blend., 7.  \t Add sliced onion and pine nuts; mix well., 8 .\t Serve warm or at room temperature., RECIPE NOTES:, •\t The best lentils to use are French green lentils du Puy., •\t While it’s fine to serve this salad right away, we find that letting it cool to, room temperature really gives the lentils a chance to absorb the flavors, in the dressing., NUTRITIONAL INFORMATION (per serving): Calories: 158  Total Fat: 9 g  Saturated Fat: 1 g   Cholesterol: 0 mg  Sodium: 107 mg  Carbohydrates: 14 g  Fiber: 4 g, Sugars: 2 g  Protein: 6 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: "
    }
}