{
    "ingredients": {
        "Vegan Chickpea Salad": "chickpeas,onion,cucumbers,green peppers, cherry tomatoes,strawberries, olive oil,lemon juice,black peppercorns,green chillies,sugar",
        "India Chickpea Salad": "chick peas,coriander,cucumber,curd,dahi,mint,onion,peas,spring onion,tomato,",
        "Chickpea Salad": "avocado,chickpeas,onion,grape tomatoes,green bell pepper",
        "Hummus and Carrots": "carrot,garbanzo beans,tahini sauce,parsley",
        "Italian Chickpea salad": "chickpeas,cherry tomatoes,potatoes,red onion,cucumber,black olives,arugula,olive oil,lemon juice,oregano,salt,pepper",
        "Indian chickpea salad": "chickpeas,tomato,cucumber,spring onion,mint,coriander,sugar,dahi,salt,pepper",
        "Peanut Chickpea Bowls": "peanut butter,soy sauce,maple syrup,sesame oil,rice vinegar,ginger,garlic,lime juice,red pepper flakes, chickpeas,kale,jasmine rice",
        "Chopped Thai Chickpea Salad: Sprouts Salad": "capsicum,carrot,coriander,cucumber,mint,onion,spring onion,sprouts,tomato,",
        "Vegan Tuna Salad": "chickpeas,avocado, green onion,red onion,celery,lemon juice,dijon mustard,dill weed"
    },
    "recipe_url": {
        "Vegan Chickpea Salad": "https://www.cookclickndevour.com/easy-chickpea-salad-vegan/",
        "India Chickpea Salad": "https://www.tarladalal.com/indian-chickpea-salad-for-weight-loss-3596r",
        "Chickpea Salad": "https://www.spendwithpennies.com/chickpea-salad/",
        "Hummus and Carrots": "https://www.eatingwell.com/recipe/259375/carrot-hummus/",
        "Italian Chickpea salad": "https://anitalianinmykitchen.com/easy-italian-chickpea-salad/",
        "Indian chickpea salad": "https://www.tarladalal.com/indian-chickpea-salad-for-weight-loss-3596r",
        "Peanut Chickpea Bowls": "https://eatwithclarity.com/peanut-chickpea-buddha-bowl/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=1137229638_55822488_544776",
        "Chopped Thai Chickpea Salad: Sprouts Salad": "https://hebbarskitchen.com/sprout-salad-recipe-moong-bean-sprout/",
        "Vegan Tuna Salad": "fixate_recipes\\Lunch\\FXR_Vegan-Tuna-Salad_R_05.09.19.pdf"
    },
    "Recipe": {
        "Vegan Chickpea Salad": "Ingredients: get creative and build your own salad bowl 🙂, , , , , Table Of Contents, , , , A Vegan Chickpea Salad So Good!, How To Make Chickpea Salad, Serving Suggestions, How To Make Chickpea Salad Sandwich, Variations & Recipe Notes, Frequently Asked Questions, More Salad Recipes, Recipe Card, Easy Chickpea Salad, For chickpea salad dressing, , , , , , A Vegan Chickpea Salad So Good!, , What is a good salad for you? For me best salads are made of season’s fresh produce, has a perfect balance of flavors, varied textures and a just right dressing. This homemade chickpea salad fits the bill perfectly!, , I love chickpea for its versatility. I always have soaked and drained chickpeas handy., , It is so easy to make chickpea recipes like, hummus, , , falafel, , , chole, , , roasted chickpeas, , , vegan chickpea curry, or this, spinach chickpea curry, when you have them soaked and ready., , Making protein packed salad is a child’s play when you soaked chickpeas. To that you add gorgeous fresh and crisp summer produce and there you have a winner 🙂, , During summer when there is a bounty of fresh produce, I always fix quick salads for lunch., , Crispy cucumber and juicy tomatoes just make anything so good right? In this chickpea salad recipe we also have season’s best strawberries come to act 🙂, , This is such a wonderful and versatile salad that you can build in so many ways., , Just add whatever you have in hand. No strawberries, just leave it out. Have perfectly ripe avocado handy?, throw it in, it will be so good., , Be sure to check my notes for all the variations you can make with this recipe., , If you are big on meal prep, this is a best recipe for you. Just pack in required portions in separate container in the fridge and store dressing separately. Drizzle the dressing just before eating, mix and enjoy 🙂, , This garbanzo bean salad is so good on it own as a light summer meal. Easy to make, vegan and gluten free power packed! This vegan Chickpea Salad Is, , Delicious with varied textures, , loaded with fresh summer produce, , So easy to make, , perfect side dish for summer grill., , best source for plant protein, , vegan and gluten free, , colorful & vibrant for kids., , , , Chickpeas, – Chickpeas are healthy legume from the pea or bean family. Chickpeas as they are called in USA are also known as garbanzo beans in UK and other European countries., , These are what we call kabuli channa or safed channa. The same ones used for chole., , I always soak dry chickpeas and cook them. You can also use canned chickpeas for making this salad quickly. In this recipe you can also use kala channa or black chickpeas. Use chickpeas drained and rinsed to make this recipe if using from a can., , Veggies & Fruits, – Any salad vegetable you fancy. Think in season fresh produce in various colors here. I have used cubed English cucumbers, salad tomatoes, sweet onions, strawberries and green peppers., , Few more choices that would go well in this salad are zucchini, colored peppers, avocado, raw and ripe mangoes, papaya, pomegranate, broccoli (steamed)., , Chickpea salad dressing, – The dressing for this salad super simple yet very delicious. It is a mix of lemon juice, extra virgin  olive oil, freshly cracked back pepper, finely chopped chilies, salt and a bot of brown sugar., , , How To Make Chickpea Salad, , Prep your veggies first by rinsing, peeling if needed and combine them in a mixing bowl. I have used sliced strawberries, cubed cucumbers, onions, halved salad tomatoes and green peppers., , , Add cooked chickpeas to the veggies., , , lemon juice, finely chopped green chilies, freshly cracked black pepper, brown sugar and salt., , , Pour the dressing over the prepped salad and toss well. Adjust salt and pepper., , , Serve chickpea salad as side with your favorite grilled dishes or as main meal with a piece of bread., , , Serving Suggestions, , This salad is a wonderful, filling yet light summer meal that you can enjoy as such. Other ways to serve this are, , Add 1/2 cup cooked brown rice or quinoa to make a filling cold rice salad., Mash the boiled chickpeas, place on a bread slice or toast, , Next mash the chickpeas coarsely., , Now to make the sandwich, spread some vegan mayo or butter on one side of a bread. Place some mashed chickpeas and top it with salad. You can add some grated cheese if you like. Close with another buttered slice., , Now you can toast or grill the sandwich and serve hot., , Variations & Recipe Notes, , To make this salad more satiating you can add crumbled feta cheese as in this, watermelon feta salad, ., , You can add some kalamata olives for a different flavor., , You can add a dash of dijon mustard to the dressing., , Some toasted bread pieces or croutons will be a good addition., , Add a handful of al dente pasta for more substantial meal., , Instead of pepper powder you can add zartar, sumac or any other spice., , Add a splash of good vinegar for more zing in the dressing. You can add a pinch of sea salt., , Refrigerate the salad for few hours before serving to deepen the flavor., , Frequently Asked Questions, , What other vegetables can be added in this salad?, , You can add halved cherry tomatoes, finely diced red bell pepper, red onion, raw mango, roasted sweet potatoes, roasted beet, cauliflower, broccoli, grated carrot or diced baby carrots, green onions in this salad., , Can I add mixed leaves salad in this recipe?, , Yes if vegetables are not available you can easily add boiled chickpeas to your favorite leafy greens., , I usually add rinsed and spin dried romaine lettuce, arugula, kale, baby spinach etc., , Are chickpeas good for vegans?, , Yes it is good source of plant based protein, it is filling, satiating and good in many recipes., , How to mash chickpeas?, , You can mash them with a fork or a potato masher or if the the quantity is large use food processor., , More Salad Recipes, , Winter beetroot salad, , Roasted sweet potato salad, , apple cucumber salad, , roasted corn salad, , mung bean salad, , I hope you will try this chickpea salad recipe and enjoy as much as we did. Do snap a pic and share on Instagram with hashtag, #cookclickndevou, and please give a star rating ★ in the recipe card below. Follow us on, Pinterest, ,, Instagram, ,, Facebook, for more recipes and ideas., , Recipe Card, , , , , Easy Chickpea Salad, , , Cook Mode, Prevent your screen from going dark, , Harini, , , A delicious chickpea salad with veggies and a mild yet flavorful dressing. This is a basic vegan and gluten free salad with chickpeas which you can build in so many ways. In this salad, chickpeas are combined with crispy cucumbers, tomatoes, strawberries and all tossed in a super flavorful lemon dressing! Perfect summer side dish!, , , 3.35, from, 40, votes, , , Print Recipe, , Pin Recipe, , , Prep Time, 15, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 30, minutes, , mins, , , , , , , Course, Salad, Side Dish, Cuisine, continental, , , , , , Servings, 3, Calories, 253, , kcal, , , , , 1 CUP = 250 ml, , , 1x, 2x, 3x, ▢, 1, , cup, , chickpeas, , around 2 cups cooked, ▢, 1/4, , cup, , onions, , chopped, ▢, 1/4, , cup, , cucumbers, , cubed, ▢, 1/4, , cup, , green peppers, , cubed, ▢, 1/2, , cup, , cherry tomatoes, ▢, 12, , strawberries, , sliced, For chickpea salad dressing, ▢, 3, , tablespoons, , extra virgin olive oil, ▢, 3, , tableespoons, , lemon juice, ▢, 1/2, , teaspoon, , freshly cracked black peppercorns, ▢, 2, , green chilies, finely sliced, ▢, 2, , teaspoons, , brown sugar, ▢, salt, , to taste, , lemon juice, finely chopped green chilies, freshly cracked peppercorns, brown sugar and salt., Pour the dressing over the prepped salad and toss well., Serve chickpea salad as side with your favorite grilled dishes or as main meal with a piece of bread., , Notes, , Instead of lemon juice you can add orange juice., , The recipe can be doubled., , , Nutrition, Serving:, 3, g, Sodium:, 9, mg, Calcium:, 45, mg, Vitamin C:, 46, mg, Vitamin A:, 196, IU, Sugar:, 9, g, Fiber:, 6, g, Potassium:, 348, mg, Calories:, 253, kcal, Saturated Fat:, 2, g, Fat:, 16, g, Protein:, 6, g, Carbohydrates:, 24, g, Iron:, 2, mg, , , , , Keyword, chickpea salad, , , , , , Tried this recipe? Snap a pic and share 🙂, Mention cookclickndevou or tag cookclickndevour, , , , , , 1450, , shares, , , , , , , , Share, , , , , , , Pin, 1448, , , , , , , Yummly, , , , , , , Flipboard, , , , , , , Twitter, , , Shared by, Harini, , About, Harini, I am Harini. The recipe developer, food photographer and chef behind cook click n devour. My aim behind this blog is to provide easy, tried and tested recipes that beginners can cook with confidence. I took keen interest in cooking and took courses on cooking, baking during teens purely out of passion. With a decade of cooking experience I am glad to share my recipes and culinary knowledge with you all here. Stay tuned and happy cooking!, Harini :), , Comments, , , , , , Clare, , says, , , December 31, 2021 at 7:56 pm, , , , Looks absolutely delicious.  I never thought of adding strawberries to a dish like this., Sugar in a dressing isn’t something that appeals to me though so I’d omit that., , , , , , , Leave a Reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., , Hello, I am Harini, , , , , , The chef, author and photograper of cook click n devour. Here you'll find tried & tested vegetarian recipes with step by step photos and videos to make cooking a pleasure and fulfilling experience. Happy cooking!, , , Read More, , , , , Popular Recipes, , , , As Seen In, , , About, Contact, Privacy, Copyright ©2025, Cook Click N Devour!!!. All Rights Reserved., , , , , , , , , , , , , , Instructions: Adjust salt and pepper before serving., , How To Make Chickpea Salad Sandwich, , , Prep your veggies first by rinsing, peeling if needed and combine them in a bowl. I have used sliced strawberries, cubed cucumbers, onions, halved salad tomatoes and green peppers., Add cooked chickpeas to the veggies.",
        "India Chickpea Salad": "Ingredients: , , , , , , , , , , For Indian Chickpea Salad For Weight Loss, , , 2 cups soaked, drained and, boiled kabuli chana (white chick peas), , , 3/4 cup, tomato cubes, , , 1 cup, cucumber cubes, , , 3/4 cup, chopped spring onions whites, and, , , salt, to taste, , , For The Mint Dressing, , , 1/2 cup, chopped mint leaves (phudina), , , 1/2 cup, chopped coriander (dhania), , , 1/2 tsp, sugar, , , 2 tbsp, low fat curds (dahi), , , , salt, to taste, , , freshly ground black pepper (kalimirch), to taste, , , , , , How to proceed, , To make, indian chickpea salad for weight loss, , add the mint dressing and toss well., Serve the, indian chickpea salad for weight loss, immediately or chilled., , , , , , , , , , , , , , Indian chickpea salad for weight loss | kabuli chana salad with pudina dressing | Video by Tarla Dalal, , , , , ×, , , , , , Indian Chickpea Salad for Weight Loss recipe with step by step photos, , , , , , , , , , , , , , , , , , , Like Chickpea Salad with Mint Dressing, , , , , , , , , Salads are light on your tummy, wholesome and good for your health. If you are someone who often munches on salad for lunch and dinner, you must check out this collection of, 700+ vegetarian salad recipes, beans or pulses is a good idea to make it more filling. Like, Indian chickpea salad for weight loss | kabuli chana salad with pudina dressing |  healthy chickpea salad for weight loss |, Listing down some of my favorite salad recipes made using chickpeas :, , Chick peas Lettuce Salad, , Chick Pea Mushroom and Barley Salad, , Chawli rajma and Chick Peas and Roasted Pepper, , , , , , , , , , , , , , , , , , Preparation for the chickpea salad, , , , , , , , , To make the, , Indian chickpea salad for weight loss | kabuli chana salad with pudina dressing |  healthy chickpea salad for weight loss |, , wash and soak 1 cup of kabuli chana overnight in a deep bowl, , , , , , , In the morning, drain well using a strainer, , , , , , , Transfer the soaked chana to a pressure cooker., , , , , , Add the salt and 3 cup of water., , , , , , Pressure cook it for 3 to 4 whistles over a medium flame or until they are soft. Allow the steam to escape naturally and then carefully open the lid, , , , , , Drain the boiled kabuli chana using a strainer and keep aside, , , , , , Chop the tomato and cucumber into cubes., , , , , , Also, chop spring onion greens and whites., , , , , , For the mint dressing, we will be using fresh mint leaves and coriander leaves. Pick and clean the bunch of these leafy greens., , Wash them thoroughly, pat them dry and chop them. Measure ½ cup each and keep aside., , , , , , , , , , , , , , , , For the mint dressing, , , , , , , , , For preparing a refreshing mint dressing, in a mixer jar, take chopped mint leaves., , , , , , Add chopped coriander., , , , , , Next, add 2 tbsp of low-fat curds. This increases the tanginess of the chickpea salad and also adds in protein and calcium to that bowl., , , , , , Season it with salt and freshly ground black pepper., , , , , , Grind to a smooth paste using a little water and keep aside. You can refrigerate this dressing until serving if not using it immediately, , , , , , , , , , , , , , , , , , , , How to make chickpea salad with mint dressing, , , , , , , , , To make, kabuli chana salad with phudina dressing, , in a bowl take 2 cups of drained and boiled kabuli chana. You can even use kala chana or any other pulses., , Add tomato cubes. Mint, coriander and tomato increase the folic acid and vitamin A content of this, chickpea salad recipe, ., , , , , , Add cucumber cubes., , Add chopped spring onion greens and whites., , , , , , Add salt to taste. Be careful while adding salt as the dressing and also, the boiled chana has salt already., , Add the prepared mint puree., , , , , , Toss gently using two spoons and our kabuli chana salad with mint dressing is ready., , , , , , Transfer to a serving bowl and serve, chickpea salad with mint dressing, . You can relish it immediately or put it in a refrigerator for a while and enjoy a chilled bowl of, chickpea salad, ., , , , , , , , , , , , , , , , , , , , Indian chickpea salad for weight loss, , , , , , , , , , Indian chickpea salad for weight loss., High protein and high fiber diet is the essence of weight loss. And this Indian chickpea salad is the best example of this. The, high protein salad, content (8.1 g per serving)  helps to boost metabolism and build muscle mass. It also aids in building the cells of your body, including the immune cells. This, high fiber salad, abounds in fiber too, which gives you a feeling of satiety and avoids binge eating. The mint dressing is the true essence of this recipe. It adds not many calories but instead lends antioxidants to avoid inflammation along with irresistible flavours. It can be served in small portions as a snack or toss in some paneer and make it a meal in itself. Remember to chew it well to avoid indigestion. If you face bloating problems with pulses at night, avoid this salad during dinner time and have it for lunch. This would give you enough time to complete digestion. To achieve weight loss turn to recipes like, chickpea salad, along with a good exercise regime, as only diet doesn’t aid in achieving your weight loss targets., , , , , , , , , , , , , , , , , , , , Tips for Indian chickpea salad for weight loss, , , , , , , , , This recipe has overnight soaking, so plan for it in advance., , , , , , The kabuli chana for this recipes should be perfectly cooked till done and yet maintain a texture that you can bite into., , , , , , , , There is salt added while cooking chana and while making the dressing both. So ver little salt while making the salad finally., , , , , , , Look for mint leaves and coriander leaves that have firm, unwilted leaves, are vividly deep green in color with no signs of yellowing or browning., , , Do not make the dressing too much in advance. It may lose its colour., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 167 cal, Protein, 8.1 g, Carbohydrates, 28.5 g, Fiber, 13.4 g, Fat, 2.3 g, Cholesterol, 0 mg, Sodium, 21.8 mg, , , , , , , Click here to view, Calories for Indian Chickpea Salad for Weight Loss, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Foodie #694755, , March 13, 2025, midnight, , The taste of this salad was good. everyone in family enjoyed eating this. However pls avoid suggesting sugar for diabetic recipes., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Ashwini Naidu, , March 13, 2025, midnight, , I always try ur recipes every time but never get time to post but have taken time today to post ??I have done this recipe salad today it came out very well n it was very very tasty but I didn?t add sugar then to it was very very yummy _x0001F60B_ \nPlease share like this salads more, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thank you for the feedback. Please keep reviewing recipes and articles you love., , , , , , , , , , , , , Meeta, , March 13, 2025, midnight, , Simply delicious! I?m not a fan of mint so only used coriander in the dressing with a bit of fresh chilli and lemon too. Highly recommended for a healthy and filling lunch or dinner!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Bhavna Kantharia, , March 13, 2025, midnight, , Very Easy & healthy recipe, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Bhavna, we are delighted you loved the Indian Chickpea Salad for Weight Loss recipe. Your review will help hundreds of users to try the recipe. Happy cooking and hope to hear from you again., , , , , , , , , , , , , Yogesh Parihar, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Sathya Prakash, , March 13, 2025, midnight, , Wonderful recipe. I make it many times and every time comes out very well. I skip curds as I don''t like it., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Healthy Eating, , March 13, 2025, midnight, , Chick peas, tomatoes, cucumber and spring onions tossed in a mint dressing.  High in protein and very healthy. Soaked chick peas goes well with anything and absorbs all dressings., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Mruga D, , March 13, 2025, midnight, , I often make this recipe when i am bored of making dinner...its easy and delicious...and yes..Nutritious too!!!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Gunjan Shivkumar Agrawal, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #700068, , March 13, 2025, midnight, , Hello Madam,\nIts an awesome recipe. testy, healthy and easy too. thanks a lot.\nPlZ share some more like this, if you can., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , kiran prabhu, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Kiran, we are delighted you loved the Indian Chickpea Salad for Weight Loss recipe. Your review will help hundreds of users to try the recipe. Happy cooking and hope to hear from you again., , , , , , , , , , , , , Aditi Godbole, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thank you for the feedback. Please keep reviewing recipes and articles you love., , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , red cabbage radish and carrot salad recipe | Indian carrot salad with red cabbage | healthy |, , , 48 Calories, , , , , , , , , , , , , , , , , Banana Noodle and Cucumber Salad recipe, Indian Vegetarian Recipes, , , 232 Calories, , , , , , , , , , , , , , , , , bean and vegetable salad recipe | Indian bean veg salad | healthy vegetable and bean salad for weight loss |, , , 92 Calories, , , , , , , , , , , , , , , , , cabbage moong dal salad recipe | Indian moong dal salad | yellow moong dal salad for weight loss |, , , 137 Calories, , , , , , , , , , , , , , , , , Fig and Almond Salad recipe, Quick Recipes, , , 181 Calories, , , , , , , , , , , , , , , , , Mexican Salad recipe, , , 77 Calories, , , , , , , , , , , , , , , , , ridge gourd and dill soup recipe | ridge gourd Indian soup | healthy turai and shepu soup |, , , 107 Calories, , , , , , , , , , , , , , , , , Russian Salad Bread Cups recipe, Healthy Snacks for Kids Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Shell Pasta Salad with Pesto Dressing recipe, Pizzas & Pasta Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Sprouted Fruity Bean Salad (  Desi Khana) recipe, Indian Recipes, , , 137 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like Chickpea Salad with Mint Dressing, , , , , , , , , Preparation for the chickpea salad, , , , , , , , , For the mint dressing, , , , , , , , , How to make chickpea salad with mint dressing, , , , , , , , , Indian chickpea salad for weight loss, , , , , , , , , Tips for Indian chickpea salad for weight loss, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , Indian chickpea salad for weight loss, |, kabuli chana salad with pudina dressing, |, healthy chickpea salad for weight loss, | with amazing 23 images., One of the most nutritious beans - chickpeas are rich in, iron, , , protein, and, folic acid, . Curds enrich this tangy, Indian chickpea salad with mint dressing, with more protein and, calcium, while coriander and mint increase its, vitamin A, content. So we have got you a salad with such a combination that is, chickpea salad with mint dressing, ., kabuli chana salad for weight loss, is very quick and easy to make. If you are on a diet or need to watch weight, this is a perfect, healthy chickpea salad for weight loss recipe, . This salad is light on the tummy and is super healthy. You can even have this for your, lunch, or, dinner, or you can also use it as a, tiffin recipe, !!, Indian chickpea salad with pudina dressing, is very easy!! We have soaked kabuli chana overnight and cooked them, but make sure you do not over cook them or the salad will get mushy will tossing. Take mint, coriander, curds, salt and pepper and blend them together to make the mint dressing. Cut cucumbers and tomatoes into cubes and chop the spring onion greens and white. To prepare the chick pea salad with mint dressing, combine chickpeas, tomatoes, onions, spring onions, prepared mint dressing, salt and pepper to taste and toss everything well. You can even add few drops of lemon juice if you wish to., Refrigerate the, healthy salad with dressing, and serve it chilled to relish the flavours of, kabuli chana salad with pudina dressing, ., Enjoy, Indian chickpea salad for weight loss, |, kabuli chana salad with pudina dressing, |, healthy chickpea salad for weight loss, | with detailed step by step photos and video below, Indian Chickpea Salad for Weight Loss recipe - How to make Indian Chickpea Salad for Weight Loss, , , , , , , , Tags, , , , , Pressure Cooker, , Indian Salads, , Indian Salads with dressing, , Low Calorie Indian Salad, , Indian Veg Recipes, , North Indian Vegetarian Food, , Punjabi, , Punjabi Raita | Punjabi  Chutney | Achar, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 20 Mins, , , , , , , Total Time, , 35 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , , For the mint dressing, ",
        "Chickpea Salad": "Ingredients: ., , It’s great to, make ahead, and perfect as a side dish or for lunches all week long., , , , , , , Chickpeas, : Also known as garbanzo beans, this recipe calls for canned chickpeas. Be sure to rinse them to remove excess salt., , Cucumbers:, Use English, Persian, or baby cucumbers, as they have nice, thin skins and don’t require peeling., , Tomatoes, : You can use grape (or cherry tomatoes) or seeded and diced Roma tomatoes., , Bell peppers:, Green bell peppers add crunch and flavor. Use red bell peppers for a sweeter flavor., , Parsley:, Parsley adds a lot of flavor (and it doesn’t always get enough credit for the freshness it adds!). It can be replaced with other fresh herbs like cilantro or dill., , , Variations, , This chickpea salad recipe is so versatile. Swap in your favorite vegetables; red pepper for green pepper, white or green onion for red onion., , Try adding kalamata olives or a bit of feta cheese. Feta is quite salty itself, start with less salt when you add the seasonings., , , How to Make a Chickpea Salad, , , Add the veggies and rinsed chickpeas to a bowl (, recipe below, )., , Drizzle with oil, vinegar, and seasonings. Toss to combine., , If using, top with avocado and enjoy!, , , , , Prep Tip, , , Chickpea salad will last for up to 5 days in the fridge. If you’re making this ahead of time, cut the avocado just before serving!, , , , Chickpea Salad Dressing, , red wine vinegar and olive oil, with a hint of seasoning is all that’s needed., , , Choosing Olive Oil:, Extra virgin olive oil is considered the least processed and most flavorful, while extra light is the most processed and has a much lighter flavor (but it isn’t lighter in fat or calories). We prefer a lighter version of olive oil in this recipe. Vegetable oil or avocado oil will also work., , , Fresh and Flavorful Salads, Greek Salad, Side Dishes, Easy Panzanella Salad, Salads, Cucumber Onion Salad, Salads, Broccoli Apple Salad, Salads, , Did your family love this Chickpea Salad? Leave us a rating and a comment below!, , , , , 4.99, from, 362, votes, ↑  Click stars to rate now!, Or to leave a comment, click here!, , Chickpea Salad, , Chickpeas are mixed with ripe tomatoes, crisp cucumbers, and creamy avocados, coated in a simple lemon-infused dressing., , , Save, Saved, , , Pin, , , , , , , , , , , Prep Time, 20, minutes, , minutes, Cook Time, 5, minutes, , minutes, Chill Time, 1, hour, , hour, Total Time, 1, hour, , hour, , 25, minutes, , minutes, , , , , , , Servings, 6, , servings, , , , , , Author, Holly Nilsson, , , , Equipment, Citrus Juicer, Mixing Bowls, , , Cook Mode, Prevent your screen from going dark, , 1x, 2x, 3x, ▢, 2, , cups, , grape tomatoes, , halved, ▢, 2, , cups, , diced cucumber, ▢, 15.5, , ounces, , chickpeas, , drained and rinsed, 1 can, ▢, ¾, , cup, , diced green bell pepper, ▢, ½, , cup, , chopped fresh parsley, ▢, ¼, , cup, , finely diced red onion, ▢, ½, , lemon, , juiced, Dressing, ▢, ¼, , cup, , olive oil, ▢, 2, , tablespoons, , red wine vinegar, ▢, ½, , teaspoon, , cumin, ▢, ¼, , teaspoon, , salt, ▢, ¼, , teaspoon, , black pepper, ▢, 1, , avocado, , optional, , , , , Course, Salad, Side Dish, , , Cuisine, American, , , © SpendWithPennies.com. Content and photographs are copyright protected. Sharing of this recipe is both encouraged and appreciated. Copying and/or pasting full recipes to any social media is strictly prohibited., Please view my photo use policy here, ., , , , , , share:, Pin, Facebook, Tweet, Yummly, Email, , Categories:, Lunch, , , Meatless Main Dishes, , , On The Lighter Side, , , Salads, , , Side Dishes, , Recipes you'll love, The Best Chili Recipe, Soups & Stews, Vegetable Soup Recipe, On The Lighter Side, Homemade Tomato Soup (Fresh Tomatoes), Soups & Stews, Cowboy Caviar, Side Dishes, The Best Coleslaw Recipe, Salads, Baked French Fries (Oven Fries), Side Dishes, , About the author, Holly Nilsson is the creator of Spend With Pennies, where she creates easy, comforting recipes made for real life. With a passion for nostalgic flavors and simplified techniques, Holly helps busy home cooks create delicious meals that always work. She is also the author of “Everyday Comfort,” which promises to inspire even more hearty, home-cooked meals., See more posts by Holly, , Follow Holly on social media:, pinterest, , facebook, , twitter, , instagram, , , Free eBook!, , Subscribe to receive weekly recipes and get a FREE Bonus e-book: Quick & Easy Weeknight Meals!, , Please enable JavaScript in your browser to complete this form., Email, *, GDPR Agreement, *, Yes! Send me the latest recipes via email., *, Comment, Go, , , You can unsubscribe anytime by clicking the “unsubscribe” link at the bottom of emails you receive., , , , , , 4.99 from 362 votes (, 278 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , By submitting this comment you agree to share your name, email address and IP address with Spend With Pennies. This information will not be used for any purpose other than enabling you to post a comment.*, , , , , Δ, , , Comments, , , , , , , Sara, , says:, , , , March 27, 2025 at 7:01 am, , , , , What do you think some couscous mixed in would taste like?  I’m making it this Sunday for a barbecue and have a box of couscous that I need to use up., , , Reply, , , , , , , , Spend With Pennies SN, , says:, , , , March 27, 2025 at 10:21 am, , , , , I think that sounds like a delicious addition!, , , Reply, , , , , , , , , , Nancy, , says:, , , , March 26, 2025 at 12:46 pm, , , , , Probably the best Chickpea Salad recipe, like cream, rises to the top!  Check out their other delicious recipies!, , , Reply, , , , , , , , Shannon, , says:, , , , January 7, 2025 at 3:28 pm, , , , , is it ok to sub in apple cider vinegar instead of red wine vinegar? I don’t usually have red wine vinegar on hand.., , , Reply, , , , , , , , Holly Nilsson, , says:, , , , January 7, 2025 at 3:38 pm, , , , , That should work just fine!, , , Reply, , , , , , , , , , michelle, , says:, , , , June 28, 2024 at 6:09 am, , , , , I love chickpea salad and I’m now adding this recipe to my collection, , , Reply, , , , , , , , Robin, , says:, , , , May 31, 2024 at 6:23 pm, , , , , I used to make a salad very similar to this for my hubby to take to work. I always added halved red grapes for a little sweetness, but for this challenge I added tiny pieces of strawberry as I didn’t have the grapes. And I always include the feta- yum!, , , Reply, , , , , , , , Spend With Pennies SN, , says:, , , , June 3, 2024 at 10:35 am, , , , , That sounds delicious, Robin! Thanks for sharing., , , Reply, , , , , , , , , , Adrienne, , says:, , , , May 29, 2024 at 10:09 am, , , , , I just love this salad! It is so tasty and I love to pair it with a piece of warm pita bread on the side and sometimes a sprinkling of feta or crumbled goat cheese. Delish!, , , Reply, , , , , , , , Michelle Bauer, , says:, , , , May 27, 2024 at 10:18 am, , , , , This was tasty & lightly filling perfect for a hot summer’s day.  I used a can of Chana Masala Chickpeas as I had them on hand & it added a bit of a kick to the salad.  Also, I decided to add some cheese tortellini & mediterranean herb feta (I just love feta).   I shared this with my friend & her husband and they both thought it was a perfect summery dish., , , Reply, , , , , , , , Agnes, , says:, , , , May 24, 2024 at 8:01 pm, , , , , I made this salad for lunch today and it was delicious ., , , Reply, , , , , , , , SandyMc, , says:, , , , May 19, 2024 at 4:09 pm, , , , , This salad is delicious!! I used a yellow bell pepper instead of a green one. This salad tastes so fresh., , , Reply, , , , , , , , Leatha, , says:, , , , May 17, 2024 at 9:36 am, , , , , I made this Chickpea Salad for dinner last night. I left out the cucumber and added extra tomatoes, my favorite. I served it with Lemon Chicken Thighs and Sweet Potato Fries. My family said that the whole dinner was amazing. Thanks so much for sharing the recipes., , , Reply, , , , , , , , Amber Kuiper, , says:, , , , May 16, 2024 at 9:16 pm, , , , , This was a nice fresh salad that came together quickly. The family enjoyed it and the kids seemed to enjoy it as well. Will be making this one again :), , , Reply, , , , , , , , Carole, , says:, , , , May 16, 2024 at 6:01 am, , , , , Good recipe. Made it for Mother’s Day and we all loved it., , , Reply, , , , , , , , Susan Clamp, , says:, , , , May 15, 2024 at 2:46 pm, , , , , I love every recipe I’ve tried so far. you have surpassed all the TV COOKs in my eyes as the best! we are still enjoying the cucumber salad with pickling cucumbers I made., , , Reply, , , , , , , , Spend With Pennies SN, , says:, , , , May 15, 2024 at 2:59 pm, , , , , That is so sweet of you, Susan! I am glad you enjoyed it so much., , , Reply, , , , , , , , , , Ashley, , says:, , , , May 12, 2024 at 2:30 pm, , , , , Really good recipe. And the perfect way to use the surplus of tomatoes my garden is producing., , , Reply, , , , , , , , Janie, , says:, , , , May 11, 2024 at 5:19 pm, , , , , Really great salad!!! Made as written. I added feta right before serving. I served this as a light dinner for my husband and myself. It will definitely be in the rotation this summer., , , Reply, , , , , , , , Janie, , says:, , , , May 11, 2024 at 5:12 pm, , , , , Wonderful salad!! I made it as written and sprinkled it with feta just before serving. I served it as a light dinner for my husband and myself. I haven’t used cumin in a salad dressing before but it was excellent! I’ll be making this on rotation this summer., , , Reply, , , , , , , , Heather, , says:, , , , May 8, 2024 at 7:29 pm, , , , , Very refreshing, perfect summer salad! I added rotisserie chicken and jalapeños for extra protein and heat!, , , Reply, , , , , Comment navigation, Older Comments, , , , , Find the perfect recipe, Search, , welcome to, spend with pennies, Welcome to Spend With Pennies! Here you will find deliciously simple recipes for the every day home cook. Easy to follow, tried, tested and loved! From my home to yours…happy cooking!, Read more about me, , follow us on social media:, , , , , , , , reader favorites, Pea Salad, Salads, Tomato Salad, Salads, Honey Butter Chicken, Chicken, Stromboli Recipe, Main Dishes, One-Pot Spaghetti (Meghan Markle Viral Pasta), Pasta, Cornish Hen, Chicken, see more reader favorites, , as seen on, , Classics done right!, Crock Pot Chicken and Dumplings, Chicken, Crock Pot Mac and Cheese, Slow Cooker, The Best Banana Cake, Desserts, Easy Banana Bread Recipe, Baking & Breads, 4 Ingredient Chicken Rice Casserole, Casseroles, The Best Meatloaf Recipe, Ground Beef, , , get delicious new recipes daily, Please enable JavaScript in your browser to complete this form., Email, *, GDPR Agreement, *, Yes! Send me the latest recipes via email., *, Website, Go, , You can unsubscribe anytime by clicking the “unsubscribe” link at the bottom of emails you receive., follow us on social media:, , , , , , , as seen on, Home, , Recipes, , About, , Contact Us, , Disclosure/Privacy Policy, , FAQ, , © 2025 spend with pennies, Pin, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Your email address will not be published. By submitting this comment you agree to share your name, email address, and IP address with Spend With Pennies. This information will not be used for any purpose other than enabling you to post a comment. All fields required., , , , , , , Name *, , , , , Email *, , , , , , Rate Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: In a medium bowl, combine tomatoes, cucumber, chickpeas, bell pepper, parsley, and red onion., Add the olive oil, vinegar, cumin, salt, and pepper. Toss well to combine., If using, cut the avocado into cubes and place in a small bowl. Squeeze the juice from ½ of a lemon over the avocado and gently stir to combine. (If not using avocado, squeeze 1 to 2 tablespoons lemon juice over the salad and toss., Refrigerate for at least one hour before serving., , Video, , , , , , , , , , Notes, Store leftover Chickpea Salad covered in the fridge for up to 5 days., , 4.99, from, 362, votes, , Nutrition Information, Calories:, 238, |, Carbohydrates:, 20, g, |, Protein:, 6, g, |, Fat:, 15, g, |, Saturated Fat:, 2, g, |, Sodium:, 259, mg, |, Potassium:, 552, mg, |, Fiber:, 7, g, |, Sugar:, 3, g, |, Vitamin A:, 1000, IU, |, Vitamin C:, 38.4, mg, |, Calcium:, 58, mg, |, Iron:, 2.1, mg, ",
        "Hummus and Carrots": "Ingredients:  Instructions: ",
        "Italian Chickpea salad": "Ingredients: , , Cooked chickpeas – also known as garbanzo beans, either canned or dried and soaked overnight, , Grape tomatoes  – or cherry tomatoes, , Potatoes – cooked and cubed, , Red onion – or white onion if you prefer, , Cucumber – sometimes I like to use an English cucumber that way I don’t have to peel it, , Back olives – pitted and halved kalamata olives, , Arugula – also known as rocket, , Olive oil – extra virgin olive oil, , Red wine vinegar – or you could use lemon juice, , Oregano, , Salt, , Black pepper, , , for example you could add a  chopped red bell pepper, sliced avocado, some chopped fresh herbs including parsley, , , How to make a Chickpea Salad, , Cook your chickpeas and potatoes until tender and let cool. In a large bowl add the chickpeas, halved grape tomatoes, chopped cucumber, onion, olives and potatoes., , , , In a small jar add the olive oil, vinegar, salt, pepper and oregano and shake to combine. Combine the salad with the dressing and refrigerate for short amount of time to combine the flavors. Add the arugula just before serving (so it doesn’t wilt)., , , , Are chickpeas good for you?, , Chickpeas, are definitely good for you, they are a rich source of vitamins, minerals and fiber. They may even help  improve digestion, help with weight loss and reduce the risk of several diseases. They are also high in protein which makes them a perfect substitute in vegetarian cooking., , Can I use canned chickpeas?, , I like to use dried chickpeas but canned would work also. Just make sure to drain and rinse them well., , How to prepare dried chickpeas, , In a large bowl add the dried chickpeas and cover well with water. Let the dried chickpeas sit for about 8 hours then drain and cook until tender. Let cool before adding to the salad., , , , How to store the Chickpea Salad, , The Chickpea Salad should be well covered or placed in an airtight container and refrigerated. It will keep for up to three days in the fridge., , More Delicious Salads to Try, , , Easy Italian Pasta Salad Recipe, , Shredded Brussel Sprouts Salad, , Mediterranean Rice Salad Bowl, , Mediterranean Chickpea Salad, , , So if you are looking for a Healthy Delicious Salad to try, I hope you give this Chickpea Salad a try and let me know what you think. Buon Appetito!, , , , , , , , Easy Italian Chickpea Salad, , , Rosemary Molloy, , , , An easy Chickpea Salad recipe, made with tomatoes, potatoes, olives, arugula and spices and tossed with a simple olive oil dressing. The perfect side dish or main dish salad!, , , , , , , Prep Time, 20, minutes, , mins, Chilling time, 1, hour, , hr, Total Time, 1, hour, , hr, , 20, minutes, , mins, , , , Course, Main Dish, Side Dish, Cuisine, Italian, , Servings, 4, , servings, Calories, 318, , kcal, , , , , US Customary, Metric, , 1x, 2x, 3x, , , , Print Recipe, , , Save, Saved!, , , , 1½, , cups, , drained cooked chickpeas (approximately 2 cans drained and rinsed), ¾, , cup, , grape or cherry tomatoes (halved), 2, , medium, , potatoes cooked and cubed, ½, , red onion chopped, ½, , cucumber (cut & cubed), 12, , black olives (halved), 2-3, , handfuls arugula, DRESSING, ¼, , cup, , olive oil, 2, , tablespoons, , red wine vinegar or lemon juice, ½, , teaspoon, , oregano, ¼, , teaspoon, , salt, 2, , dashes, , pepper (or more if desired), , , , Reply, , , , , , , , Rosemary, , says:, , , , September 15, 2022 at 8:21 pm, , , , , Hi Jennifer, thanks so much, glad you enjoyed it. Shaved Parmesan is perfect. I love the stuff. Take care!, , , Reply, , , , , , , , , , Amy Regutti, , says:, , , , August 31, 2022 at 7:15 pm, , , , , So simple and delicious!, , , Reply, , , , , , , , Rosemary, , says:, , , , September 1, 2022 at 8:15 pm, , , , , Thanks so much Amy, glad you enjoyed it. Take care!, , , Reply, , , , , , , , , , Elva, , says:, , , , January 27, 2022 at 12:19 am, , , , , This salad is delicious, thank you for sharing the recipe.  It was very easy to make it.  My family loved it!, , , Reply, , , , , , , , Rosemary, , says:, , , , January 29, 2022 at 10:03 pm, , , , , Hi Elva, thanks so much, so glad you enjoyed it. Have a great weekend., , , Reply, , , , , , , , , , shelley carefoot, , says:, , , , September 3, 2019 at 3:51 pm, , , , , By the picture, it appears to have fresh basil. But there is none in the recipe?, , , Reply, , , , , , , , Rosemary, , says:, , , , September 3, 2019 at 10:28 pm, , , , , Hi Shelley, I actually just added it after for photos, but you can add it if you want. 🙂, , , Reply, , , , , , , , , , Rita Grisetti, , says:, , , , September 2, 2019 at 11:02 pm, , , , , I love all the recipes I’m fortunate to collect from you.  They all sound amazing.  When I retire I am planning to cook all of them!  Thanks so very much for sharing your talent!  Rita Grisetti, , , Reply, , , , , , , , Rosemary, , says:, , , , September 3, 2019 at 11:20 pm, , , , , Hi Rita, thanks so much, what a wonderful compliment. Have a great week., , , Reply, , , , , , , , , , Lorraine marano, , says:, , , , August 31, 2019 at 5:03 pm, , , , , If using canned chick peas do I still need to cook them?, , , Reply, , , , , , , , Rosemary, , says:, , , , September 1, 2019 at 1:26 am, , , , , Hi Lorraine no you don’t have to cook them, just give them a rinse. Let me know how it goes., , , Reply, , , , , , , , , , Jeff Pike, , says:, , , , August 25, 2019 at 3:16 pm, , , , , Excellent recipe for a “meatless Monday” dinner. I used this as an antipasto and followed it with a small, grilled steak. i will definitely make this again soon., , , Reply, , , , , , , , Rosemary, , says:, , , , August 25, 2019 at 3:49 pm, , , , , Hi Jeff, thanks glad you enjoyed the salad. Have a great Sunday., , , Reply, , , , , , , , , 5 from 23 votes (, 17 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , Website, , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , , , , fresh veggies and delicious spices. So take a seat and have a taste!, , , About Me, , , , Facebook, , Instagram, , YouTube, , Pinterest, , Search, , , , Most Popular Recipes, , , Quick & Easy Homemade Puff Pastry, Authentic Bolognese Sauce, Homemade Potato Gnocchi, Easy Lemon Squares, Homemade Rustic No Yeast Bread, Best Homemade Pizza Dough, , Spring/Summer Favorites, , Easy Italian Cheese and Tomato Pie, Homemade Berry Frozen Yogurt, Italian Grilled Chicken Salad, Easy No Bake Berry Cheesecake Parfait, Limoncello Cocktail (Spritz), Easy Homemade Fudgesicles, , , , , , , , , , , , , , , , , , , , , , , , , Browse, , About Rosemary, Contact, Disclosure / Privacy, Recipe Index, Sitemap, , , , , Course, , Appetizers & Snacks, Breakfast / Brunch, Drinks, Lunch, Main Dish, , , , , , , , Beef, Chicken, Chocolate, Eggs, , , , Fish & Seafood, Pasta, Pork, , , , , , , , , , , , , , , , , , , , , , PRIVACY POLICY, | COPYRIGHT © 2025 AN ITALIAN IN MY KITCHEN | CRAFTED BY GRACE + VINE STUDIOS, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Recipes, Toggle child menu, Expand, , , , Cakes & Cupcakes, , Appetizers & Snacks, , Main Dish, , Muffins & Sweet Breads, , Pasta, , Pizza / Bread, , Recipe Index, , , , Seasons, Toggle child menu, Expand, , , , Christmas, , Easter, , Fall/Winter, , Halloween, , Thanksgiving, , , , American Favorites, Toggle child menu, Expand, , , , Drinks, , Appetizers, , Breakfast, , Lunch, , Main Dish, , Desserts, , , , Cooking Tips, , , , , , , , , , , , , , , , , , , , , , , , , , , , Search for:, , , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , In a large bowl add the chickpeas, tomatoes, potatoes, onions, cucumber and black olives., in a small jar add the olive oil, vinegar, oregano, salt and pepper. Place the top on the jar and shake to combine., Pour desired amount of dressing over the salad and toss to combine. Cover and refrigerate for about 30-60 minutes. Just before serving add the arugula, toss and serve. Enjoy!, , , Notes, I like to use dried chickpeas but canned would work also. Just make sure to drain and rinse them well., , To prepare dried chickpeas – In a large bowl add the dried chickpeas and cover well with water. Let the dried chickpeas sit for about 8 hours then drain and cook until tender. Let cool before adding to the salad., , The Chickpea Salad should be well covered and refrigerated. It will keep for up to three days in the fridge. I don’t recommend freezing., , , , Nutrition, Calories:, 318, kcal, |, Carbohydrates:, 35, g, |, Protein:, 9, g, |, Fat:, 17, g, |, Saturated Fat:, 2, g, |, Sodium:, 352, mg, |, Potassium:, 751, mg, |, Fiber:, 9, g, |, Sugar:, 5, g, |, Vitamin A:, 251, IU, |, Vitamin C:, 24, mg, |, Calcium:, 84, mg, |, Iron:, 6, mg, , , , Did You Make This Recipe?, Please leave a, comment, below or pin it to your Pinterest account!, , Updated from August 18, 2019, , Share, Share, Pin, Email, Share, , , Related, , , , , It’s All About Pasta, , Amazing pasta recipes to make your mouth water!, , Get the EBook, , , , , , , , , , , , Authentic Italian Desserts, , 75 Traditional Desserts Made Easy, , Buy on Amazon, , , , , , , , 22 Comments, , , , , , , AnnieR, , says:, , , , January 27, 2024 at 7:32 pm, , , , , My family really enjoyed this hearty salad.  I used white wine vinegar as that is what I had.  We ate half with the arugula and I intended to have the other half with a tin of tuna in olive oil for lunch the next day.  We had it with the arugula again….maybe next time., , , Reply, , , , , , , , Rosemary, , says:, , , , January 28, 2024 at 4:20 pm, , , , , Hi Annie, thanks so much, so glad everyone enjoyed it. That would be good with tuna. Take care!, , , Reply, , , , , , , , , , Paola, , says:, , , , January 18, 2024 at 4:27 am, , , , , Made this for lunch today as a side dish. Delicious., , , Reply, , , , , , , , Rosemary, , says:, , , , January 18, 2024 at 8:01 pm, , , , , Hi Paola, thanks so much, glad you enjoyed it. Take care!, , , Reply, , , , , , , , , , Amy, , says:, , , , January 24, 2023 at 8:03 pm, , , , , What is the best recommendation for how to pre cook the chickpeas and potatoes? Are they baked, boiled, , , Reply, , , , , , , , Rosemary, , says:, , , , January 24, 2023 at 9:34 pm, , , , , Hi Amy, if you buy canned chick peas then they are already cooked. I recommend boiled the potatoes in order to cook them. Hope that helps. Let me know., , , Reply, , , , , , , , , , tahiti, , says:, , , , January 19, 2023 at 7:55 pm, , , , , i bought basil leaves just to try this recipe, so gonna make  it for my office lunch. Many thanks!, , , Reply, , , , , , , , Rosemary, , says:, , , , January 20, 2023 at 5:56 pm, , , , , Hi Tahiti, thanks I hope you enjoy it. Take care!, , , Reply, , , , , , , , , , Jennifer, , says:, , , , September 13, 2022 at 4:13 am, , , , , Came across this recipe when searching for a different salad of yours. I decided to try this one. Another great hit. It was more delicious the next day – with or without arugula!, I also added shaved Parmesan cheese",
        "Indian chickpea salad": "Ingredients: , , , , , , , , , , For Indian Chickpea Salad For Weight Loss, , , 2 cups soaked, drained and, boiled kabuli chana (white chick peas), , , 3/4 cup, tomato cubes, , , 1 cup, cucumber cubes, , , 3/4 cup, chopped spring onions whites, and, , , salt, to taste, , , For The Mint Dressing, , , 1/2 cup, chopped mint leaves (phudina), , , 1/2 cup, chopped coriander (dhania), , , 1/2 tsp, sugar, , , 2 tbsp, low fat curds (dahi), , , , salt, to taste, , , freshly ground black pepper (kalimirch), to taste, , , , , , How to proceed, , To make, indian chickpea salad for weight loss, , add the mint dressing and toss well., Serve the, indian chickpea salad for weight loss, immediately or chilled., , , , , , , , , , , , , , Indian chickpea salad for weight loss | kabuli chana salad with pudina dressing | Video by Tarla Dalal, , , , , ×, , , , , , Indian Chickpea Salad for Weight Loss recipe with step by step photos, , , , , , , , , , , , , , , , , , , Like Chickpea Salad with Mint Dressing, , , , , , , , , Salads are light on your tummy, wholesome and good for your health. If you are someone who often munches on salad for lunch and dinner, you must check out this collection of, 700+ vegetarian salad recipes, beans or pulses is a good idea to make it more filling. Like, Indian chickpea salad for weight loss | kabuli chana salad with pudina dressing |  healthy chickpea salad for weight loss |, Listing down some of my favorite salad recipes made using chickpeas :, , Chick peas Lettuce Salad, , Chick Pea Mushroom and Barley Salad, , Chawli rajma and Chick Peas and Roasted Pepper, , , , , , , , , , , , , , , , , , Preparation for the chickpea salad, , , , , , , , , To make the, , Indian chickpea salad for weight loss | kabuli chana salad with pudina dressing |  healthy chickpea salad for weight loss |, , wash and soak 1 cup of kabuli chana overnight in a deep bowl, , , , , , , In the morning, drain well using a strainer, , , , , , , Transfer the soaked chana to a pressure cooker., , , , , , Add the salt and 3 cup of water., , , , , , Pressure cook it for 3 to 4 whistles over a medium flame or until they are soft. Allow the steam to escape naturally and then carefully open the lid, , , , , , Drain the boiled kabuli chana using a strainer and keep aside, , , , , , Chop the tomato and cucumber into cubes., , , , , , Also, chop spring onion greens and whites., , , , , , For the mint dressing, we will be using fresh mint leaves and coriander leaves. Pick and clean the bunch of these leafy greens., , Wash them thoroughly, pat them dry and chop them. Measure ½ cup each and keep aside., , , , , , , , , , , , , , , , For the mint dressing, , , , , , , , , For preparing a refreshing mint dressing, in a mixer jar, take chopped mint leaves., , , , , , Add chopped coriander., , , , , , Next, add 2 tbsp of low-fat curds. This increases the tanginess of the chickpea salad and also adds in protein and calcium to that bowl., , , , , , Season it with salt and freshly ground black pepper., , , , , , Grind to a smooth paste using a little water and keep aside. You can refrigerate this dressing until serving if not using it immediately, , , , , , , , , , , , , , , , , , , , How to make chickpea salad with mint dressing, , , , , , , , , To make, kabuli chana salad with phudina dressing, , in a bowl take 2 cups of drained and boiled kabuli chana. You can even use kala chana or any other pulses., , Add tomato cubes. Mint, coriander and tomato increase the folic acid and vitamin A content of this, chickpea salad recipe, ., , , , , , Add cucumber cubes., , Add chopped spring onion greens and whites., , , , , , Add salt to taste. Be careful while adding salt as the dressing and also, the boiled chana has salt already., , Add the prepared mint puree., , , , , , Toss gently using two spoons and our kabuli chana salad with mint dressing is ready., , , , , , Transfer to a serving bowl and serve, chickpea salad with mint dressing, . You can relish it immediately or put it in a refrigerator for a while and enjoy a chilled bowl of, chickpea salad, ., , , , , , , , , , , , , , , , , , , , Indian chickpea salad for weight loss, , , , , , , , , , Indian chickpea salad for weight loss., High protein and high fiber diet is the essence of weight loss. And this Indian chickpea salad is the best example of this. The, high protein salad, content (8.1 g per serving)  helps to boost metabolism and build muscle mass. It also aids in building the cells of your body, including the immune cells. This, high fiber salad, abounds in fiber too, which gives you a feeling of satiety and avoids binge eating. The mint dressing is the true essence of this recipe. It adds not many calories but instead lends antioxidants to avoid inflammation along with irresistible flavours. It can be served in small portions as a snack or toss in some paneer and make it a meal in itself. Remember to chew it well to avoid indigestion. If you face bloating problems with pulses at night, avoid this salad during dinner time and have it for lunch. This would give you enough time to complete digestion. To achieve weight loss turn to recipes like, chickpea salad, along with a good exercise regime, as only diet doesn’t aid in achieving your weight loss targets., , , , , , , , , , , , , , , , , , , , Tips for Indian chickpea salad for weight loss, , , , , , , , , This recipe has overnight soaking, so plan for it in advance., , , , , , The kabuli chana for this recipes should be perfectly cooked till done and yet maintain a texture that you can bite into., , , , , , , , There is salt added while cooking chana and while making the dressing both. So ver little salt while making the salad finally., , , , , , , Look for mint leaves and coriander leaves that have firm, unwilted leaves, are vividly deep green in color with no signs of yellowing or browning., , , Do not make the dressing too much in advance. It may lose its colour., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 167 cal, Protein, 8.1 g, Carbohydrates, 28.5 g, Fiber, 13.4 g, Fat, 2.3 g, Cholesterol, 0 mg, Sodium, 21.8 mg, , , , , , , Click here to view, Calories for Indian Chickpea Salad for Weight Loss, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Foodie #694755, , March 13, 2025, midnight, , The taste of this salad was good. everyone in family enjoyed eating this. However pls avoid suggesting sugar for diabetic recipes., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Ashwini Naidu, , March 13, 2025, midnight, , I always try ur recipes every time but never get time to post but have taken time today to post ??I have done this recipe salad today it came out very well n it was very very tasty but I didn?t add sugar then to it was very very yummy _x0001F60B_ \nPlease share like this salads more, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thank you for the feedback. Please keep reviewing recipes and articles you love., , , , , , , , , , , , , Meeta, , March 13, 2025, midnight, , Simply delicious! I?m not a fan of mint so only used coriander in the dressing with a bit of fresh chilli and lemon too. Highly recommended for a healthy and filling lunch or dinner!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Bhavna Kantharia, , March 13, 2025, midnight, , Very Easy & healthy recipe, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Bhavna, we are delighted you loved the Indian Chickpea Salad for Weight Loss recipe. Your review will help hundreds of users to try the recipe. Happy cooking and hope to hear from you again., , , , , , , , , , , , , Yogesh Parihar, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Sathya Prakash, , March 13, 2025, midnight, , Wonderful recipe. I make it many times and every time comes out very well. I skip curds as I don''t like it., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Healthy Eating, , March 13, 2025, midnight, , Chick peas, tomatoes, cucumber and spring onions tossed in a mint dressing.  High in protein and very healthy. Soaked chick peas goes well with anything and absorbs all dressings., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Mruga D, , March 13, 2025, midnight, , I often make this recipe when i am bored of making dinner...its easy and delicious...and yes..Nutritious too!!!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Gunjan Shivkumar Agrawal, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #700068, , March 13, 2025, midnight, , Hello Madam,\nIts an awesome recipe. testy, healthy and easy too. thanks a lot.\nPlZ share some more like this, if you can., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , kiran prabhu, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Kiran, we are delighted you loved the Indian Chickpea Salad for Weight Loss recipe. Your review will help hundreds of users to try the recipe. Happy cooking and hope to hear from you again., , , , , , , , , , , , , Aditi Godbole, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thank you for the feedback. Please keep reviewing recipes and articles you love., , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , red cabbage radish and carrot salad recipe | Indian carrot salad with red cabbage | healthy |, , , 48 Calories, , , , , , , , , , , , , , , , , Banana Noodle and Cucumber Salad recipe, Indian Vegetarian Recipes, , , 232 Calories, , , , , , , , , , , , , , , , , bean and vegetable salad recipe | Indian bean veg salad | healthy vegetable and bean salad for weight loss |, , , 92 Calories, , , , , , , , , , , , , , , , , cabbage moong dal salad recipe | Indian moong dal salad | yellow moong dal salad for weight loss |, , , 137 Calories, , , , , , , , , , , , , , , , , Fig and Almond Salad recipe, Quick Recipes, , , 181 Calories, , , , , , , , , , , , , , , , , Mexican Salad recipe, , , 77 Calories, , , , , , , , , , , , , , , , , ridge gourd and dill soup recipe | ridge gourd Indian soup | healthy turai and shepu soup |, , , 107 Calories, , , , , , , , , , , , , , , , , Russian Salad Bread Cups recipe, Healthy Snacks for Kids Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Shell Pasta Salad with Pesto Dressing recipe, Pizzas & Pasta Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Sprouted Fruity Bean Salad (  Desi Khana) recipe, Indian Recipes, , , 137 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like Chickpea Salad with Mint Dressing, , , , , , , , , Preparation for the chickpea salad, , , , , , , , , For the mint dressing, , , , , , , , , How to make chickpea salad with mint dressing, , , , , , , , , Indian chickpea salad for weight loss, , , , , , , , , Tips for Indian chickpea salad for weight loss, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , Indian chickpea salad for weight loss, |, kabuli chana salad with pudina dressing, |, healthy chickpea salad for weight loss, | with amazing 23 images., One of the most nutritious beans - chickpeas are rich in, iron, , , protein, and, folic acid, . Curds enrich this tangy, Indian chickpea salad with mint dressing, with more protein and, calcium, while coriander and mint increase its, vitamin A, content. So we have got you a salad with such a combination that is, chickpea salad with mint dressing, ., kabuli chana salad for weight loss, is very quick and easy to make. If you are on a diet or need to watch weight, this is a perfect, healthy chickpea salad for weight loss recipe, . This salad is light on the tummy and is super healthy. You can even have this for your, lunch, or, dinner, or you can also use it as a, tiffin recipe, !!, Indian chickpea salad with pudina dressing, is very easy!! We have soaked kabuli chana overnight and cooked them, but make sure you do not over cook them or the salad will get mushy will tossing. Take mint, coriander, curds, salt and pepper and blend them together to make the mint dressing. Cut cucumbers and tomatoes into cubes and chop the spring onion greens and white. To prepare the chick pea salad with mint dressing, combine chickpeas, tomatoes, onions, spring onions, prepared mint dressing, salt and pepper to taste and toss everything well. You can even add few drops of lemon juice if you wish to., Refrigerate the, healthy salad with dressing, and serve it chilled to relish the flavours of, kabuli chana salad with pudina dressing, ., Enjoy, Indian chickpea salad for weight loss, |, kabuli chana salad with pudina dressing, |, healthy chickpea salad for weight loss, | with detailed step by step photos and video below, Indian Chickpea Salad for Weight Loss recipe - How to make Indian Chickpea Salad for Weight Loss, , , , , , , , Tags, , , , , Pressure Cooker, , Indian Salads, , Indian Salads with dressing, , Low Calorie Indian Salad, , Indian Veg Recipes, , North Indian Vegetarian Food, , Punjabi, , Punjabi Raita | Punjabi  Chutney | Achar, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 20 Mins, , , , , , , Total Time, , 35 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , , For the mint dressing, ",
        "Peanut Chickpea Bowls": "Ingredients: , Chickpeas., Chickpeas are my favorite in buddha bowls. I don’t recommend another kind of bean here because the more firm texture of chickpeas works really well with the sauce!, , Peanut Sauce., My go to, peanut sauce, for everything and anything! It’s so easy to make and pairs so well with these chickpeas., , Kale., The kale is quickly sauteed with garlic and olive oil for a lot of flavor. Plus, cooking it this way makes it a lot easier to digest!, , Jasmine Rice., I love using my instant pot jasmine rice, but if you’re in a pinch, frozen white or brown rice will also work! Quinoa or millet are also great in buddha bowls., , , How to make a buddha bowl, , First, prepare the, peanut sauce, if you haven’t already. It’s super easy to make, , Drain and rinse the chickpeas and add to a pan on the stove., , Add in the peanut sauce, adding as much or as little as you like. I usually end up doing about 1/3 cup and saving some more for drizzling on the final bowls., , Heat over low heat for about 5 minutes, allowing the sauce to cook into the chickpeas. This really brings out a lot of flavor!, , Meanwhile, mince the garlic and add to a second pan with the olive oil. Saute until golden., , Add in the chopped and de-stemmed kale and saute until dark green and wilted, this will only take a couple of minutes., , Remove from heat. Once the chickpeas are done, serve with the kale on top of a bed of rice along with the avocado., , Drizzle with additional peanut sauce & enjoy! I also love some fresh chopped chives and red pepper flakes for additional spice, but the choice is yours., , , , Should I serve it hot or cold?, , Buddha bowls in general can be served either hot or cold, but this one in particular I suggest serving hot., , It’s still delicious cold, so it’s perfect for a grab and go kind of lunch, but if you’re making it fresh, hot from the pan is my favorite way to enjoy this chickpea veggie buddha bowl!, , , Does it keep well?, , Yes! Once prepared, the chickpeas will keep in an air tight container in the fridge for about 3-5 days. I suggest reheating on the stove with a splash of oil., , The kale is best served fresh, but it only takes about 5 minutes to make so it’s easy to whip up right before serving., , Do you need to cook canned chickpeas?, , Nope! Canned chickpeas are already cooked, so all you need to do is drain and rinse them and you’re good to go., , If you have chickpeas that you’ve already cooked from dried, you will need 1.5 cups of cooked chickpeas for every can in this recipe., , , Try these next!, , , Peanut Tofu, , Orange Chickpeas, , Peanut Tempeh, , Peanut Cauliflower Wings, , , If you make this recipe, don’t forget to, subscribe to newsletter, and tag me on, instagram, so I can see your creation! Leave a comment below and let me know how it turns out!, , , , , , 5, from, 41, votes, , Peanut Chickpea Buddha Bowl, , by:, claire cary, , Fluffy white rice, garlicky sautéed kale and 5 minute Thai peanut chickpeas, this is an easy and incredibly quick vegan buddha bowl! Perfect for a simple dinner or lunch on the go!, , Print, /, Pin, /, Rate, , , , , Prep:, 10, minutes, , mins, Cook:, 10, minutes, , mins, Total:, 20, minutes, , mins, , 4, , 1x, 2x, 3x, , , ▢, 2, , cans, , chickpeas, ▢, 1/2-1, , cup, , peanut sauce, , click for recipe, ▢, 4, , cups, , chopped & de-stemmed kale, ▢, 2, , cloves, , garlic, ▢, 2, , tablespoons, , olive oil, ▢, 2, , cups, , cooked jasmine rice, ▢, 1, , avocado, US Customary, –, Metric, , , , Reply, , , , , , , , Claire Cary, , says, , , September 11, 2022 at 9:04 am, , , , Recipe, here, !, , , Reply, , , , , , , , Antonia, , says, , , November 23, 2022 at 3:38 am, , , , Hello, thank you., , , Reply, , , , , , , , Claire Cary, , says, , , November 23, 2022 at 8:51 am, , , , Here is the link again!, https://eatwithclarity.com/easy-thai-peanut-sauce/, , , Reply, , , , , , , , , , , , , , jessica, , says, , , July 12, 2022 at 8:36 pm, , , , LOVED this recipe!! The chickpeas really took on the flavor of the delicious peanut sauce.  That garlicky kale?  Amazing too!  This is definitely going into our rotation and I wouldn’t change anything about it.  It is the first recipe I have tried from eat with clarity and am so excited now to make more!, , , Reply, , , , , , , , Shyna, , says, , , April 23, 2022 at 6:54 pm, , , , Delicious and super easy., , , Reply, , , , , , , , Carrie, , says, , , March 31, 2022 at 7:04 pm, , , , This was very good! I added more red pepper flakes to it., , , Reply, , , , , , , , Jen, , says, , , December 31, 2021 at 5:03 pm, , , , Wow! This was delicious, it will definitely be on repeat at our house., , , Reply, , , , , , , , Jan, , says, , , October 30, 2021 at 4:11 pm, , , , I think there might be an incorrect measurement of soy sauce in the peanut sauce recipe? I followed it exactly and added 3 Tbsp of soy sauce and the end result was so salty that I had to throw it out. We hate wasting food, but it was inedible. We tried adding more peanut butter, but there was no saving it., , , Reply, , , , , , , , Claire Cary, , says, , , October 30, 2021 at 6:35 pm, , , , That’s correct, but you need low sodium soy sauce! Otherwise, you’ll need to use about half the amount called for., , , Reply, , , , , , , , , , Morgan, , says, , , October 11, 2021 at 9:58 pm, , , , So simple and delicious!!, , , Reply, , , , , , , , Claire Cary, , says, , , October 13, 2021 at 10:27 am, , , , The best kind of recipe!, , , Reply, , , , , , , , , , Kimberley, , says, , , September 13, 2021 at 5:22 pm, , , , I made this for dinner last night and it was delicious! I was eating the peanut butter sauce right out of the pot!, , , Reply, , , , , , , , Claire Cary, , says, , , September 20, 2021 at 4:11 pm, , , , It’s hard not to! So glad you enjoyed it., , , Reply, , , , , , , , , , Jody, , says, , , September 7, 2021 at 9:15 am, , , , Filling, healthy and delicious! Hard to find all three in one recipe!, , , Reply, , , , , , , , Elaine, , says, , , August 30, 2021 at 2:17 pm, , , , Can you please convert a can of chickpeas into a measurement for cooked chickpeas? I don’t live in a country where chickpeas come in cans. Thank you, , , Reply, , , , , , , , Claire Cary, , says, , , August 30, 2021 at 4:09 pm, , , , You will need 1 1/2 cups of cooked chickpeas for every 1 can!, , , Reply, , , , , , , , Jamie, , says, , , September 8, 2021 at 12:11 pm, , , , Each can of chickpeas is like 1.5 cups, , , Reply, , , , , , , , Welcome,, I’m Claire, , Eat With Clarity is a place for gluten free recipes that are just as good as the real thing. With plenty of vegan, vegetarian and paleo options, there is something here for everyone!, , Read Claire’s Story, , , , , , , , , you’ll also love, , , , , , Tomato Cucumber & Avocado Salad, PB&J Overnight Oats, Vegan Buffalo Mac & Cheese, Gluten Free Beef & Broccoli, Mini Meatball & Tomato Soup, PB&J Vegan Baked Oatmeal, , , , , , , get more, clarity, , , , Name, (Required), Email, (Required), , , , , , , , , , , , , , , , , Δ, , , , , More, , About, , eBook, , Disclaimer, , Privacy, , Services, , , Recipes, , Recipe Index, , Breakfast, , Desserts, , Dinner, , Drinks, , , As Seen In, , Buzzfeed, , Yahoo!, , Well + Good, , Parade, , Self, , , , , , Site by, Katelyn Gambler, &, Made To Thrive, , COPYRIGHT © 2021 · EAT WITH CLARITY, LLC. ALL RIGHTS RESERVED., , , , , , , , Recipes, Dinner, ▼, Beef, Chicken, Seafood, Dessert, ▼, Cakes & Cupcakes, Chocolate, Cookies, Ebook, About, ▼, About Claire, Work With Me, Shop, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: First, prepare the, peanut sauce, if you haven't already. I suggest keeping it on the thicker side for this recipe., Drain and rinse the chickpeas and add to a pan on the stove., Add in the peanut sauce, adding as much or as little as you like. I usually end up doing about 1/3 cup and saving some more for drizzling on the final bowls., Heat over low heat for about 5-10 minutes, allowing the sauce to cook into the chickpeas and thicken., Meanwhile, mince the garlic and add to a second pan with the olive oil. Saute until golden., Add in the chopped and de-stemmed kale and saute until dark green and wilted, this will only take a couple of minutes., Remove from heat. Once the chickpeas are done (be sure to taste and add more sauce as desired), serve with the kale on top of a bed of rice along with the avocado. Drizzle with additional peanut sauce & enjoy!, , Notes, Once prepared, the chickpeas will keep in an air tight container in the fridge for about 3-5 days. The kale is best served fresh, but it only takes about 5 minutes to make so it’s easy to whip up right before serving., , Other delicious veggies to serve with this bowl include carrots, steamed broccoli, roasted sweet potato or arugula., , Serving:, 1, bowl, /, Calories:, 359, kcal, /, Carbohydrates:, 40, g, /, Protein:, 12, g, /, Fat:, 19, g, /, Saturated Fat:, 2, g, /, Fiber:, 4, g, /, Sugar:, 6, g, , , , Did you make this?, , Mention, @eatwithclarity, or tag, #eatwithclarity, !, , , , , , , , , , , , , , , , , , , , , , , , 5 from 41 votes (, 27 ratings without comment, ), , , , leave, a comment and rating, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Name*, , , , , Email*, , , , , Website, , , , , Save my name, email, and website in this browser for the next time I comment., , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , Sarah, , says, , , September 9, 2024 at 11:41 pm, , , , Made this tonight!!! Soooo grateful for leftovers for the week! Thank you!, , , Reply, , , , , , , , Claire Cary, , says, , , September 11, 2024 at 10:45 am, , , , Thank you, Saarah!, , , Reply, , , , , , , , , , Briana, , says, , , August 5, 2024 at 11:00 pm, , , , I don’t normally leave comments on recipes but I was so surprised by this one. I expected it to be good, but I didn’t expect it to be that good!! This recipe is fantastic! Checks all the boxes: healthy, filling, quick, easy, and super flavorful. The garlic kale pairs perfectly with the Thai chickpeas. Loved the avocado too. I drizzled mine with Siracha and some green onions and it was so savory and tasty. This is definitely a recipe I will make on the regular now. Highly recommend. Thanks for the great recipe!, , , Reply, , , , , , , , Claire Cary, , says, , , August 6, 2024 at 1:00 pm, , , , Thanks so much, Briana! Makes me so happy to hear!, , , Reply, , , , , , , , , , Carol, , says, , , January 26, 2024 at 8:41 pm, , , , You didn’t put the recipe for the peanut sauce, , , Reply, , , , , , , , Claire Cary, , says, , , January 28, 2024 at 8:53 pm, , , , It’s linked in the recipe card!, , , Reply, , , , , , , , , , Zsófi, , says, , , October 25, 2023 at 6:47 am, , , , Best recipe I’ve tried in a long time. Full of flavour, quick, healthy and very filling, what’s not to like? 🙂, , , Reply, , , , , , , , Rachel C., , says, , , June 6, 2023 at 11:14 am, , , , Easy to whip up and super tasty! I love that you can modify with other veggies on-hand and that it keeps well for leftovers., , , Reply, , , , , , , , Katie, , says, , , February 13, 2023 at 5:56 pm, , , , So good!! And easy!, , , Reply, , , , , , , , Rachel, , says, , , December 3, 2022 at 12:03 am, , , , So yummy!! I was wondering what a serving size would be considered, , , Reply, , , , , , , , Claire Cary, , says, , , December 23, 2022 at 10:10 am, , , , About 1 cup of the prepared chickpeas!, , , Reply, , , , , , , , , , Marelle, , says, , , September 11, 2022 at 2:00 am, , , ",
        "Chopped Thai Chickpea Salad: Sprouts Salad": "Ingredients: , , , Table of Contents, , , hide, , , , , , , 1, , sprout salad video recipe:, , , , , 2, , recipe card for moong bean sprout salad recipe:, , , , , 3, , , , , , 4, , how to make sprout salad with step by step photo:, , , , , 5, , notes:, , , , , , sprout salad recipe | how to make moong bean sprout salad – weight loss recipe, with step by step photo and video recipe. salad recipes are generally served for purpose which is either weight loss or with dietary requirements. obviously these recipes are not a popular choice and are consumed with an intention. however, there are some salad recipes which are pure fun to consume and moong bean sprout salad recipe and is tasty and healthy., , as i previously mentioned, salad recipes are generally less preferred recipes and do not have huge fan base compared to other recipes. it does not offer the same spice level or the combination of flavour. well, there is a reason for it. there is a saying that whatever tastes good to your tongue is not good for your health and vice versa. basically, the salad recipes fall under the latter section and generally avoided. having said that there are some particular salad recipes which offer both., moong bean, sprout salad, is one such which is a combination of taste and health factor. i personally make these for my weekend lunch and server it as a side dish with a combination of sambar and rasam., , , in addition to these, some of the tips, suggestions and variations to a healthy moong, bean, , sprout salad recipe, . firstly, in this recipe, i have used a homemade moong bean sprouts and it took me around 2-3 days to sprout mung. having said that to cut down the sprout time, you should be able to use the store-bought sprouts. secondly, you can use the same recipe and use any sprouts with the same combination. i personally recommend you to use moth beans, green peas as an alternative. lastly, the salad can be easily extended by adding or topping other veggies to this recipe. as a matter of fact, you can add finely chopped carrot, beans, beetroot, cabbage and any fresh leafy vegetable., , finally, i request you to check my other detailed, salad recipes collection, with this post of moong bean, sprout salad recipe, . it mainly includes recipes like, moong sprouts curry, , , sprouts curry, , , soya keema, , , soya chunks kurma, , , carrot beans poriyal, , , soya chunks curry, , , soya chunks fry, , , mix veg, , , veg handi, , , sagu, . further, to these, i would like to highlight my other detailed recipes collection like,, , , breakfast recipes collection, , vrat or fasting recipes collection, , sandwich recipes collection, , , sprout salad video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for moong bean sprout salad recipe:, , , , , sprout salad recipe | how to make moong bean sprout salad - weight loss, , , HEBBARS KITCHEN, , , easy sprout salad recipe | how to make moong bean sprout salad - weight loss, , , 4.99, from, 203, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 5, minutes, , mins, Cook Time, 2, minutes, , mins, , , , , , , Course, Salad, Cuisine, Indian, , , , , , Servings, 2, , Servings, , , , , , , 1x, 2x, 3x, ▢, 1, , cup, , moong sprouts, ▢, 3, , cup, , hot water, ▢, ½, , tsp, , cumin powder, ▢, ¼, , tsp, , kashmiri red chilli powder, ▢, ½, , tsp, , aamchur, ▢, ¼, , tsp, , salt, ▢, ½, , cucumber, , , chopped, ▢, ½, , tomato, , , chopped, ▢, ½, , carrot, , , grated, ▢, 2, , tbsp, , capsicum, , , chopped, ▢, 2, , tbsp, , spring onion, , , chopped, ▢, 2, , tbsp, , coriander, , , finely chopped, ▢, 2, , tbsp, , mint / pudina, , , finely chopped, ▢, 1, , chilli, , , finely chopped, ▢, 1, , tsp, , lemon juice, ▢, 2, , tbsp, , peanuts, , , roasted & crushed,  Instructions: , firstly, blanch 1 cup moong sprouts in 3 cup hot water for 5 minutes. you can alternatively boil for 2 minutes., drain off the water. make sure the moon sprouts are softened a bit yet crunchy., take the blanched moong sprouts into a large mixing bowl., add ½ tsp cumin powder, ¼ tsp chilli powder, ½ tsp aamchur and ¼ tsp salt., mix well making sure the spices are well combined., further add ½ cucumber, ½ tomato, ½ carrot, 2 tbsp capsicum, 2 tbsp spring onion, 2 tbsp coriander, 2 tbsp mint, 1 chilli and 1 tsp lemon juice., mix well making sure everything is well combined., finally, serve moong sprouts salad garnished with 2 tbsp roasted peanuts., , , , , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make sprout salad with step by step photo:, , , firstly, blanch 1 cup moong sprouts in 3 cup hot water for 5 minutes. you can alternatively boil for 2 minutes., , , drain off the water. make sure the moon sprouts are softened a bit yet crunchy., , , take the blanched moong sprouts into a large mixing bowl., , , add ½ tsp cumin powder, ¼ tsp chilli powder, ½ tsp aamchur and ¼ tsp salt., , , mix well making sure the spices are well combined., , , further add ½ cucumber, ½ tomato, ½ carrot, 2 tbsp capsicum, 2 tbsp spring onion, 2 tbsp coriander, 2 tbsp mint, 1 chilli and 1 tsp lemon juice., , , mix well making sure everything is well combined., , , finally, serve, moong sprouts salad, garnished with 2 tbsp roasted peanuts., , , , notes:, , , firstly, you can use sprouts of your choice to make a healthy salad., , also, blanching sprouts helps to soften slightly and yet have a crunchy bite., , additionally, adjust the chilli based on the spice level you can handle., , finally, adding fresh herbs makes, sprouts salad, healthy and flavourful., , , , , , , , , Related Recipes, , , , , , , , , , salad recipes, , , high protein salad recipe | weight loss salad..., , , , Hebbars Kitchen, , -, , , April 14, 2021, , , , , , , , , , , , salad recipes, , , laccha salad recipe – 2 ways | lacha..., , , , Hebbars Kitchen, , -, , , April 5, 2021, , , , , , , , , , , , , , , dessert, , fruit cocktail recipe | fresh fruit cocktails for..., , , , Hebbars Kitchen, , -, , , May 22, 2019, , , , , , , , , , , , , chaat recipes, , peanut chaat recipe | boiled peanut chaat salad..., , , , Hebbars Kitchen, , -, , , May 14, 2019, , , , , , , , , , , , , raita recipes, , boondi raita recipe | boondi ka raita |..., , , , Hebbars Kitchen, , -, , , March 27, 2019, , , , , , , , , , , , , dal recipes, , moong dal carrot salad | hesaru bele carrot..., , , , Hebbars Kitchen, , -, , , February 20, 2019, , , , , , , , , , , 00:01:19, , , , international recipes, , pasta salad recipe | macaroni salad | how..., , , , Hebbars Kitchen, , -, , , February 18, 2019, , , , , , , , , , , 00:01:22, , , , dessert, , fruit salad recipe | fruit salad with ice..., , , , Hebbars Kitchen, , -, , , February 2, 2019, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 4.99 from 203 votes (, 203 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , appetizer, , , 00:02:05, , , , Chilli Mushroom Recipe | Mushroom Chilli..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , appetizer, , capsicum chutney recipe | capsicum tomato chutney recipe, , , , , , , , What's New, , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli – Healthy & Tasty, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Vegan Tuna Salad": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., VEGAN TUNA SALAD, O, SERVES: 4 (approx. ½ cup each) Prep Time: 15 min.  Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1⁄2, 1, 1, VEGAN CONTAINER EQUIVALENTS (per serving):, 1⁄2, 1⁄2, 1, 1½ cups, chickpeas, drained, rinsed, ¼ cup, mashed avocado, (approx. ¼ medium), ¼ cup, sliced green onion, ¼ cup, chopped red onion, (approx. 1⁄3 medium), ¼ cup, \u0007chopped celery, (approx. ¾ medium stalk), 1 Tbsp., extra-virgin olive oil, 1 Tbsp., fresh lemon juice, 1 Tbsp., Dijon mustard, 1 Tbsp., finely chopped fresh dill weed, (or 1 tsp. dried), ½ tsp., kombu powder (optional), ¼ tsp., sea salt (or Himalayan salt), ¼ tsp., ground black pepper, 1. \t Place chickpeas in medium bowl. Mash with back of a fork (or a potato, masher). Set aside., 2. \t Combine avocado, green onion, red onion, celery, oil, lemon juice, , mustard, dill, kombu powder (if desired), salt, and pepper in a medium, bowl; mix well., 3. \t Fold avocado mixture into chickpeas; toss gently to blend., RECIPE NOTES:, •\t To make kombu powder: Toast kombu in a toaster (or 450° F oven, for 3 minutes, or until golden brown), then blend in a food processor, , blender, or spice grinder into a fine powder., •\t Vegan Tuna Salad can be enjoyed on your bread of choice, or try it in a, collard wrap! Make sure you account for the correct containers., NUTRITIONAL INFORMATION (per serving): Calories: 140  Total Fat: 7 g  Saturated Fat: 1 g  Cholesterol: 0 mg  Sodium: 362 mg  Carbohydrates: 16 g  Fiber: 5 g, Sugars: 3 g  Protein: 5 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 3, Instructions: "
    }
}