{
    "ingredients": {
        "Fiesta Quinoa Salad": "quinoa,black beans,sweet corn,grape tomatoes,cucumbers,jalapenos,red onion,red bell pepper,avocado,oil,limes",
        "Healthy Quinoa Salad": "lime juice,champagne vinegar,jalapeno,quinoa,black beans,chickpeas,red bell pepper,red onion,avocado,cilantro,mint",
        "Quinoa and Black Bean Salad": "black beans,quinoa,red bell pepper,orange bell pepper,yellow bell pepper,corn kernels,lime juice,red wine vinegar",
        "Spring Veggie Orzo Salad": "lemon juice,honey,garlic,veg broth,orzo whole wheat,carrots,peas,asparagus,zucchini,basil,lemon zest"
    },
    "recipe_url": {
        "Fiesta Quinoa Salad": "https://www.pinterest.com/pin/496592296426658963/https://www.pinterest.com/pin/496592296424219786/",
        "Healthy Quinoa Salad": "https://www.foodiecrush.com/healthy-quinoa-salad/",
        "Quinoa and Black Bean Salad": "fixate_recipes\\Salad\\FXR_Quinoa_and_Black_Bean_Salad_R_03.19.18.pdf",
        "Spring Veggie Orzo Salad": "fixate_recipes\\Salad\\FXR_Spring_Veggie_Orzo_Salad_R_03.19.18.pdf"
    },
    "Recipe": {
        "Fiesta Quinoa Salad": "❌ Error scraping https://www.pinterest.com/pin/496592296426658963/https://www.pinterest.com/pin/496592296424219786/: 404 Client Error: Not Found for url: https://www.pinterest.com/pin/496592296426658963/https://www.pinterest.com/pin/496592296424219786/",
        "Healthy Quinoa Salad": "Ingredients: mango, red bell peppers, and fresh herbs from the produce aisle then stacked with organic beans for added protein., , Quinoa salads like this one are a favorite healthy side dish that can easily slide into the all-in-one plant-based meal category too. They’re fast to make but last all week in the refrigerator, making them a meal-prepper’s dream for lunch, dinner, or as a quick, satisfying snack., , , What This Healthy Quinoa Salad is Made of, , Adding fresh veggies and fruit to the diet are essential to healthy living. Luckily, , Kroger’s, abundance of organic and sustainably produced fruits and vegetables in their produce aisles make it easy and economical to add to every meal or grab as a snack on their own., , This salad combines some favorite fresh produce with a few of my go-to, Simple Truth Organic, pantry items to make a side dish salad that works all year long, no matter what the season., , , Simple Truth Organic quinoa, , Red bell pepper, , Red onion, , Cilantro, , Mint, , Mango, , Avocado, , Simple Truth Organic black beans, , Simple Truth Organic garbanzo beans, , Lime, , Jalapeno, , Canola oil, , Champagne vinegar, , Chili powder, , , , Beans, Beans, The Magical Fruit, , Black beans and garbanzo beans (aka chickpeas) not only add flavor and bite to this salad, but are a good source of vegetarian protein too. Using, Simple Truth organic canned beans, saves time and convenience (no soaking required) and are sustainably grown and harvested for better piece of mind., , White cannellini beans, pinto beans, and Great Northern beans are good choices too., , Is Quinoa Salad Healthy?, , Known as one of nature’s superfoods, quinoa (KEEN-wah) is a carbohydrate that’s extra rich in protein, dietary fiber, B vitamins, and dietary minerals. In fact, 1 cup of quinoa provides twice the protein plus about 5 grams more fiber than the same amount of cooked white rice, making it a favorite plant-based protein for vegetarians and vegans. As a combo carb/protein, it fills you up faster and sticks with you longer., , Quinoa is easy to cook, and flavor neutral so it melds in nicely with just about anything you add it to, making it a perfect base for this easy to make salad. Use, Simple Truth Organic white or red quinoa,, or a combination of both., , , How to Cook Quinoa, , Conventional teachings instruct the home cook to prepare quinoa the same as rice, in portions set to a formulaic ratio that’s brought to a boil, then covered and simmered until done. Personally, I rarely find success cooking it that way and end up adding more water as it cooks, and more water, sometimes ending in a gummy mess., , Instead, , I follow the idea of cooking quinoa just like pasta, , in a pot of water at a rolling boil, checking for doneness and those little quinoa finally emerge and the quinoa is a tender bite. Then, I use a fine mesh strainer to drain. If serving warm, fluff with a fork and cover the pot with a dish towel and top with a lid to absorb some of the excess moisture as it keeps warm. If eating the quinoa at room temperature, spread the quinoa on a plate or a baking sheet to cool and dry so it doesn’t get clumpy and gummy., , Quinoa is often sold pre-washed but if you’re not sure, it’s safest to rinse and drain it in a colander before cooking to remove it’s natural coating as it can taste bitter., , 1 cup of dried quinoa typically yields about 3 cups of cooked quinoa., , , Tips for Making This Healthy Quinoa Salad, , All this salad requires is a smidgen of cooking, a bit of chopping, and a little stirring., , , Cut the vegetables and fruits into similar bite-size pieces, , making it easy to get more flavors in each forkful., , Be sure to use cool quinoa before adding your raw vegetables., If you favor a nuttier flavor, toast the quinoa before boiling it. To toast the quinoa, add it to a non-stick skillet over medium-high heat and cook for 5 minutes, stirring often. Then, cook the quinoa as directed., , Give your mango and avocado time to ripen, by purchasing them 1-2 days before making this salad., , Rinse and drain the beans, before adding them to the salad., , Gently toss the salad, after dressing it so the avocado doesn’t turn into mush., , , , Quinoa Salad Dressing, , Don’t be alarmed by the amount of dressing called for in this salad. Quinoa is absorbent, and the dressing is where each of the grains gets its flavor., , This salad dressing calls for two types of acid:, fresh squeezed lime juice and champagne vinegar. Using two different acids mellows the other out, avoiding that puckery bite. Feel free to use a similar mellow vinegar such as rice wine or red wine vinegar instead., , Use a neutral oil., Because it’s flavorless, I prefer canola oil in salad like this but feel free to use olive oil if its what you have., , Choose your sweetener., Because it dissolved easily, I use regular old sugar in my dressing but honey works well too. Be sure to taste for sweetness and add more of one or the other as needed., , For a balanced flavor flair,, I used chili powder to add an earthy note to the dressing. You could also try cumin or allspice if you prefer., , , What to Serve With Quinoa Salad, , If you’re craving another layer of clean protein to make this an even more robust meal, feel free to add any of the following:, , , Fried or Baked Tofu, , Grilled Shrimp, , Marinated Greek Chicken, or, Cilantro Lime Grilled Chicken, , 10-Minute Maple-Crusted Salmon, , Classic Gazpacho, , , If you mak, e this recipe, please let me know! Leave a, rating on this recipe below and leave a comment, take a photo and, tag me on Instagram, , with #foodiecrusheats., , , , , , 4.94, from, 82, votes, , Healthy Quinoa Salad, , , Make this healthy quinoa salad for easy meal prepped lunches or as a side dish for dinner. Be sure to buy your avocado and mango a few days before making the salad so they're perfectly ripe., , , Print, , Save, Saved!, , , Course, Salad, Cuisine, American, Keyword, quinoa salad, , , Prep Time, 20, minutes, , minutes, Cook Time, 20, minutes, , minutes, Cooling Time, 20, minutes, , minutes, Total Time, 1, hour, , hour, , , Servings, 8, , Calories, 316, kcal, , ½x, 1x, 2x, 3x, For the Dressing, ½, , cup, , vegetable or canola oil, ⅓, , cup, , fresh lime juice from about 4 limes, 2, , tablespoons, , champagne vinegar, 1, , tablespoon, , sugar, 1 ½, , teaspoons, , chili powder, ½, , teaspoon, , kosher salt, 1, , jalapeño, , , seeded and minced, For the Quinoa Salad, 1 ½, , cups, , white or red quinoa, 3, , cups, , water, 1, , 15 ounce can, , black beans, 1, , 15 ounce can, , garbanzo beans, 1, , red bell pepper, , , stemmed, seeded, and chopped into ¼-inch pieces, 1, , mango, , , peeled, pitted, and cut into ¼-inch pieces, ½, , small, , red onion, , , peeled, and cut into ¼\" pieces, 1, , avocado, , , peeled, pitted, and cut into ½-inch pieces, ¼, , cup, , chopped cilantro, ¼, , cup, , chopped mint, , so maybe decreasing to 1 cup would do better., , , Reply, , , , , , , , Lana, , , Sun, Jan 3, 2021 at 4:05 pm, , , , This was delicious! Will definitely make again. We did not have mint or cilantro, but it was great even without those., , , Reply, , , , , , , , Samantha, , , Mon, Jul 17, 2023 at 3:58 pm, , , , Do you happen to know roughly what a serving size equates to? Like is it 1 cup? Thanks in advance., , , Reply, , , , , , , , Hayley, , , Fri, Sep 22, 2023 at 12:31 pm, , , , Hi Lana, this salad yields about 4 1/2 cups of quinoa. I hope that helps!, , , Reply, , , , , , , , , , , , Kristen, , , Sun, Aug 2, 2020 at 11:39 am, , , , I didn’t have mango, but I had a can of peaches so I made that swap with much delicious success. I also omitted the oil with no issues. This was pretty quick and easy and so healthy! I’m taking a huge bowl to share with friends right now. Thank you for coming up with this. Mmm!, , , Reply, , , , , , , , Gina Golden, , , Thu, Jul 30, 2020 at 12:28 pm, , , , Loved it, it paired perfectly with grilled kabobs. I used tri-colored quinoa, shallots instead of red onion, garlic in place of jalapeno, and substituted cumin for chili powder. I had white wine vinegar on hand. Definitely better the first or second day, after that it was soggy., , , Reply, , , , , , , , Jodi, , , Wed, Jul 22, 2020 at 12:21 pm, , , , Delicious! Was looking for a vegetarian dish to have as a main course and this is perfect! Thank you!, , , Reply, , , , , , , , Mariella, , , Wed, Jul 15, 2020 at 1:23 pm, , , , Very yummy salad. Didn’t have mangoes so I used apples, , , Reply, , , , , , , , Greta, , , Sun, Jun 14, 2020 at 3:25 pm, , , , Loooooved this recipe!! We all loved it at home… could not find champagne vinager at the store so I used white wine vinager. Turned out delicious ! Thank you!, , , Reply, , , , , , , , Ashley @ Foodie Crush, , , Mon, Jun 29, 2020 at 3:53 pm, , , , Thank you! Good call on the sub!, , , Reply, , , , , , , , , , Stephanie, , , Sat, May 30, 2020 at 6:08 pm, , , , Such a good and refreshing salad!!! I added some feta- fantastic !!! Thanks for sharing!!, , , Reply, , , , , , , , Heidi, , , Sun, Jun 7, 2020 at 9:16 am, , , , Thank you for the comment Stephanie, thank you for making and glad you liked it!!, , , Reply, , , , , , , , , , Allison, , , Wed, May 6, 2020 at 12:42 pm, , , , Does the jalapeño go into the dressing or the salad?  I’m guessing  it doesn’t really matter…, , , Reply, , , , , , , , Ashley @ Foodie Crush, , , Mon, May 18, 2020 at 7:56 am, , , , I like it in the salad, , , Reply, , , , , , , , , , comet, , , Mon, May 4, 2020 at 2:59 pm, , , , Its really testy and Healthy Quinoa Salad…Thank you for share…, , , Reply, , , , , , , , Elizabeth Russell-Jones, , , Tue, Apr 14, 2020 at 7:19 am, , , , We loved this. We didn’t have access to a mango during the quarantine but we had everything else in our refrigerator/pantry.  It was a great side to our grilled chicken!, , , Reply, , , , , , , , Sarah, , , Wed, Feb 19, 2020 at 9:19 am, , , , Is the nutrition info for a side dish or a meal?, , , Reply, , , , , , , , Heidi, , , Sat, Feb 22, 2020 at 8:19 pm, , , , This is for a side dish., , , Reply, , , , , , Primary Sidebar, , , , Hi!, I’m Heidi, and I cook real good, real food I hope you’ll love to make, too., , Contact, ·, Start Here!, ·, Subscribe, , Instagram, , Pinterest, , Facebook, , Twitter, , YouTube, , , , , , “What should I make for dinner?”, , If this is a question you often ask, take our brief quiz and we’ll recommend a recipe favorite you'll love., , , Take the Quiz!, , , , , Find a Recipe, , Find a recipe..., , Reader Favorites, , Shrimp Scampi, , Classic Waldorf Salad, , How to Make the Best Grilled Salmon, , The BEST Lobster Rolls (With Both Butter AND Mayonnaise), , How to Make THE BEST Pinto Beans, , How to Make THE BEST Potato Salad, , , Recipes by Type, , Dinner, , Lunch, , Breakfast, , Desserts, , Appetizers, , Healthy, , Salads & Sides, , Family Friendly, , , What’s for Dinner?, , Chicken & Turkey, , Meat & Seafood, , Noodles, Rice & Grains, , Soups & Stews, , , By Cuisine, , Asian, , Comfort Food, , Greek, , Grill, , Italian, , Mediterranean, , Mexican, , , Seasonal, , Spring, , Summer, , Fall, , Winter, , , More, , Friday Faves, , How To, , About Me, , FAQ, , , Recipes, , About, , FAQ, , Work With Me, , Contact, , Copyright © 2025 ·, FoodieCrush, ·, Privacy Policy, ·, Terms of Service, , , , 89447, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: Rinse the quinoa in a fine mesh strainer under cold water first. Rinse the quinoa in a fine mesh strainer under cold water. Add the water to the pan with the quinoa and kosher salt. Boil the quinoa like pasta, until al dente and the centers become transparent, stirring occasionally, about 8 to 12 minutes. Drain, fluff with a fork, and return the quinoa to the pot, cover with a kitchen towel and a lid and let sit for 5-10 minutes. Spread the quinoa on a rimmed baking sheet and let cool. Transfer to a large bowl., Pour the can of black beans into a strainer and rinse well with water. Drain and add to the quinoa bowl. Repeat with the garbanzo beans. Add the bell pepper, mango, red onion, avocado, and herbs., To make the dressing, whisk the oil, lime juice, vinegar, sugar, chili powder and kosher salt in a small bowl. Taste for seasoning and adjust if needed to taste. The dressing should taste pretty bold, but balanced., Pour the dressing over the salad and toss gently to mix. Allow the flavors to meld for about 20 minutes up to overnight. Best within the first day, but can be refrigerated for up to 4 days., , , Notes, The quinoa can be cooked and refrigerated up to 3 days before assembling the salad. The dressing can also be made ahead of time., , Substitute the chili powder for cumin or allspice., , Use cannellini beans or Great Northern beans instead of chickpeas/garbanzo beans if desired., , Allow at least 20 minutes up to overnight to serve after tossing the salad for the flavors to meld., , Nutrition, Calories:, 316, kcal, |, Carbohydrates:, 31, g, |, Protein:, 6, g, |, Fat:, 20, g, |, Saturated Fat:, 2, g, |, Sodium:, 162, mg, |, Potassium:, 413, mg, |, Fiber:, 5, g, |, Sugar:, 6, g, |, Vitamin A:, 1006, IU, |, Vitamin C:, 37, mg, |, Calcium:, 30, mg, |, Iron:, 2, mg, , , More Quinoa Recipes to Try, , , Mediterranean Chicken Quinoa Bowl With Broccoli And Tomato, , Mediterranean Quinoa Salad, , Thai Quinoa Salad, , Quinoa And Burrata Caprese Salad, , Spiralized Zucchini, Quinoa And Turkey Sausage Stuffed Peppers, , , We send good emails., Subscribe to FoodieCrush, and have each post plus exclusive content only for our subscribers delivered straight to your e-mail box., , Follow me on, Instagram, ,, Facebook,, , Pinterest, for more FoodieCrush inspiration., , This recipe is sponsored by Kroger. As always, thank you for reading and supporting companies I partner with, which allows me to create more unique content and recipes for you. There may be affiliate links in this post of which I receive a small commission. All opinions are always my own., , , Share this!, , , , , 89447, , shares, , , , , , , Share, , , , , Pin, , , Categories:, Beans, , , Family Friendly, , , Healthy, , , Mediterranean Recipes, , , Noodles, Rice and Grains, , , Picnic Recipes, , , Potluck Recipes, , , Recipes, , , Salads and Sides, , , Seasonal : Fall, , , Seasonal : Spring, , , Seasonal : Summer, , , Seasonal : Winter, , , Sponsored, , , Vegetables and Fruits, , , Vegetarian, , Tags:, avocado, , , black beans, , , garbanzo beans, , , mango, , , picnic, , , potluck, , , quinoa, , , red bell pepper, , , salad, , , side dish, , , vegetarian, , More recipes you’ll love!, , , , , , , How to Make Classic Macaroni Salad, , , , , , , Greek Pasta Salad with Cucumbers and Artichoke Hearts, , , , , , , Panzanella, , , , , , , Mediterranean Quinoa Salad, , , , , , , Hi!, I’m Heidi, and I cook real good, real food I hope you’ll love to make, too., , Contact, ·, Start Here!, ·, Subscribe, , Instagram, , Pinterest, , Facebook, , Twitter, , YouTube, , , , , , “What should I make for dinner?”, , If this is a question you often ask, take our brief quiz and we’ll recommend a recipe favorite you'll love., , , Take the Quiz!, , , , , Reader Interactions, Comments, , , , 4.94 from 82 votes (, 69 ratings without comment, ), , , , Rate & Comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Notify me via e-mail if anyone answers my comment., , , , , Δ, , , , , , , Lisa, , , Sun, Aug 18, 2024 at 9:04 pm, , , , Absolutely delicious!  I used frozen mango because I needed to use it up. Otherwise, made it as directed., , , Reply, , , , , , , , Hayley, , , Mon, Aug 19, 2024 at 8:46 pm, , , , Thank you, Lisa, we’re happy you enjoyed it!, , , Reply, , , , , , , , , , Sarah Murphy, , , Sat, Apr 29, 2023 at 10:55 am, , , , Really not that healthy if you’re using vegetable oil or canola oil.    You should not be using sugar either….  Alternatively you could use coconut or avocado oil and a healthy sugar substitute like monk fruit sugar, , , Reply, , , , , , , , Joanne E Campbell, , , Fri, Apr 28, 2023 at 2:39 pm, , , , I should have skipped the onion even though i only used a quarter of one. right now it is the only thing i can smell. use canned peaches. the mango is to unreliable in terms of ripeness. I did use cumin. I did not use jalepeno because i just don’t like it, lol. this feeds alot of people!!, , , Reply, , , , , , , , Ashly Rivera, , , Mon, Feb 20, 2023 at 2:34 pm, , , , oh this recipe was sooo amazing and a game changer ! I added corn and Cucumbers, and fresh parsley to it, and omitted the avacado and red onion. It was sooo sensational and the flavor was so good, everything paired together so perfectly, very balanced I was surprised how delicious and flavorful this was ! I also did one cup of Quinoa and it worked perfectly!, , , Reply, , , , , , , , Heidi, , , Thu, Aug 17, 2023 at 5:47 pm, , , , Sounds great Ashly! Glad you enjoyed :), , , Reply, , , , , , , , , , Kara, , , Thu, Jun 2, 2022 at 1:37 pm, , , ",
        "Quinoa and Black Bean Salad": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., QUINOA AND BLACK BEAN SALAD, O, SERVES: 6  (1 cup each)    Prep Time: 15 min.    Cooking Time:  None, CONTAINER EQUIVALENTS (per serving):, ½, 1, 1, I usually make a bunch of quinoa at the beginning of the week, so I’m always looking for things to mix it into instead of just eating it, by itself. I usually throw some quinoa in with fruit or veggies or whatever I have handy. Out of all the combinations, this recipe is my, hands-down favorite., ½ cup, canned black beans, , drained, rinsed, 2 cups, cooked quinoa, 1 cup, red bell pepper, finely chopped, (approx. 1¼ medium), 1 cup, orange bell pepper, finely chopped, (approx. 1¼ medium), 1 cup, yellow bell pepper, finely chopped, (approx. 1¼ medium), ½ cup, frozen corn kernels, thawed, 3 Tbsp., fresh lime juice, 2 tsp., red wine vinegar, 2 Tbsp., olive oil, 1½ tsp., ground cumin, 1 tsp., sea salt (or Himalayan salt), , Ground black pepper, (to taste; optional), 1 bunch, fresh cilantro, finely chopped, , , 1.\t\t Combine beans, quinoa, bell peppers, and corn., 2.\t\t Add lime juice, vinegar, oil, cumin, salt, and pepper (if desired)., 3.\t\t Garnish with cilantro., RECIPE NOTES:, •\t This salad is delicious when eaten immediately., •\t It holds well, refrigerated in an airtight container, and can be stored for, up to 2 to 3 days., NUTRITIONAL INFORMATION (per serving): Calories: 166    Total Fat: 6 g    Saturated Fat: 1 g    Cholesterol: 0 mg    Sodium: 200 mg    Carbohydrates: 24 g, Fiber: 5 g    Sugars: 2 g    Protein: 5 g, OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Spring Veggie Orzo Salad": "Ingredients:  Instructions: "
    }
}