{
    "ingredients": {
        "Chocolate Almond Butter Bars": "almond butter, maple syrup,cocoa powder, almond flour, chocolate chips",
        "Vegan Key Lime Pie Bars": "dates, cashews,almond flour,cinnamon,coconut milk,lime juice,lime zest,maple syrup,vanilla extract",
        "Creamy vegan lemon bars": "cashews,coconut cream, cornstarch,lemon juice,lemon zest, maple syrup,sugar, oats, almonds,coconut sugar",
        "Vegan No bake chocolate coconut bars": "shredded coconut, coconut oil, maple syrup, chocolate chips",
        "No Bake Oatmeal Bars": "rolled oats,peanut butter,maple syrup",
        "Peanutty Peanut Butter Squares": "peanut butter,vanilla extract,eggs,baking soda",
        "Chocolate Cherry Bars": "brown sugar, vegan butter,egg,vanilla extract,almond flour,baking powder,chocolate chips,cherries",
        "Snickerdoodles": "brown sugar,vegan butter,egg,vanilla extract, all purpose flour, baking powder,cinnamon",
        "Lemon Bars": "graham crackers,maple syrup, coconut oil,lemon juice,lemon peel,corn starch, coconut cream, egg yolks,all purpose flour,powdered sugar",
        "Vegan Snickers Protein Bars": "protein powder, almond flour, maple syrup, milk, peanut butter, coconut oil, peanuts, chocolate chips",
        "Triple Layer Vegan chocolate bar": "almond flour, cocoa powder, baking powder, almond butter, almond milk, maple syrup, coconut flour, vanilla extract, chocolate chips, coconut oil",
        "Vegan Twix Bars": "plain flour, sugar, butter, vanilla extract, condensed milk coconut, cornflour, dark chocolate",
        "Almond Chocolate Squares": "oat flour,almond flour,vanilla shakeology,almond butter,vanilla extract,almond milk,dark chocolate chips",
        "Chewy Whole grain bars": "rolled oats,quinoa,chia seeds,flax seeds, almond butter,cinnamon,maple syrup, banana,vanilla extract, raisins,apricots,cherries, sunflower seeds,walnuts,chocolate chips",
        "Creamy Vegan lemon bars": "cashews,coconut cream,cornstarch,lemon juice,lemon zest,maple syrup,powdered sugar,oats,almonds,coconut oil",
        "Kit Kat Bars": "almond flour,sugar,flaxseed powder,coconut oil,vanilla extract,dark chocolate,peanut butter",
        "Vegan Lemon Bars": "vegan butter,sugar,all purpose flour,lemon juice,lemon zest,coconut milk,corn starch,turmeric"
    },
    "recipe_url": {
        "Chocolate Almond Butter Bars": "https://www.breesveganlife.com/chocolate-almond-butter-bars-no-bake/?fbclid=IwAR01nP-nGxRc6CZDEIGr38viZbiw8Y9tVexNHMtmc-wHE1J-pkb_i98OC5M",
        "Vegan Key Lime Pie Bars": "https://allthehealthythings.com/healthy-key-lime-pie-bars/",
        "Creamy vegan lemon bars": "https://minimalistbaker.com/creamy-vegan-lemon-bars/",
        "Vegan No bake chocolate coconut bars": "https://thebigmansworld.com/4-ingredient-paleo-vegan-chocolate-coconut-crack-bars-keto-sugar-free-no-bake/",
        "No Bake Oatmeal Bars": "http://www.joannasoh.com/foods/recipes-1/4-high-fibre-oatmeal-breakfasts-quick-healthy",
        "Peanutty Peanut Butter Squares": "fixate_recipes\\Dessert\\FXR_Peanutty_Peanut_Butter_Squares_R_03.19.18.pdf",
        "Chocolate Cherry Bars": "fixate_recipes\\Dessert\\FXR-EN-Chocolate_Cherry_Bars-08.09.21-Recipe.pdf",
        "Snickerdoodles": "fixate_recipes\\Dessert\\FXR-EN-Snickerdoodles-6.7.21-Recipe.pdf",
        "Lemon Bars": "fixate_recipes\\Dessert\\FXR-EN-Lemon_Bars-8.27.20-Recipe.pdf",
        "Vegan Snickers Protein Bars": "https://callascleaneats.com/snickers-protein-bars-vegan-gluten-free/",
        "Triple Layer Vegan chocolate bar": "https://upbeetandkaleingitblog.com/triple-layer-vegan-chocolate-almond-butter-bars/",
        "Vegan Twix Bars": "https://www.thelittleblogofvegan.com/2021/02/easy-vegan-twix-bars.html?m=1",
        "Almond Chocolate Squares": "fixate_recipes\\Dessert\\FXR_Almond_Chocolate_Squares_R_03.19.18.pdf",
        "Chewy Whole grain bars": "fixate_recipes\\Dessert\\FXR_Chewy_Whole_Grain_Bars_R_03.19.18.pdf",
        "Creamy Vegan lemon bars": "https://minimalistbaker.com/creamy-vegan-lemon-bars/",
        "Kit Kat Bars": "https://bakeitpaleo.com/healthy-kit-kat-recipe/#tasty-recipes-27910-jump-target",
        "Vegan Lemon Bars": "https://www.noracooks.com/vegan-lemon-bars/"
    },
    "Recipe": {
        "Chocolate Almond Butter Bars": "Ingredients: , , I absolutely love nut butter treats like these, chocolate peanut butter cookie dough bites, and this, chocolate peanut butter fudge, . I usually go for peanut butter, but these almond butter squares are just as delicious!, , These are so good that I have a hard time stopping myself from eating too many at once!, , These Chocolate Almond Butter Bars Are:, , Vegan, Gluten-free, No-Bake, Absolutely delectable!, , , , For the almond butter base:, , 1 ½ cups all-natural almond butter (almonds should be the only ingredient listed on the container), ½ cup pure maple syrup, 2 tablespoons cacao powder, 140 grams fine almond flour (about 1 + ¼ cups), , For the chocolate top:, , ¾ cups vegan chocolate chips, 2 tablespoons all-natural almond butter, , It is very important that the almond butter you use is natural because it has a different texture from the ones that have added salt, sugar, oil, etc., , How to Make, , First, ensure that you have the correct almond butter for this recipe. It has to be natural, which means it has no added salt, sugar, oil, or anything other than just almonds. All natural nut butter has a much wetter texture, which is necessary for this recipe., , Once you’ve ensured that your almond butter is ready, add it to a bowl with the maple syrup and cacao powder. Mix together., , Next, add the almond flour and mix. You will need to use your hands because the dough is quite thick., , , , , , , Press this dough into an 8 x 8 pan lined with parchment paper, then place it in the fridge for 15 minutes., , , , , , After chilling the dough, melt the chocolate chips and 2 tablespoons of almond butter together in the microwave. One minute should be enough time. Spread this melted chocolate mixture over the dough in the pan. Place in the fridge to set for 2 hours., , Cut into 16 squares and enjoy!, , , , Tips, , If your almond butter has a lot of oil on top and is very firm underneath, it may be hard to mix. When this happens, I empty the jar into a food processor and blend until the almond butter is evenly mixed., Mix the bottom layer of these chocolate almond butter bars very well to eliminate pieces of cacao powder. It may take awhile to get all of the cacao powder completely blended, but it will incorporate if you keep mixing., Weighing your almond flour is best. If you use too much almond flour, these chocolate almond butter bars will be too crumbly, but if you don’t use enough, they will be very soft and won’t hold their shape well. This is why it’s best to use a food scale to weigh your almond flour., Don’t skip the added almond butter for the chocolate layer. Adding 2 tablespoons of almond butter to the melted chocolate chips ensures that the chocolate layer is not too hard once it chills. If you just spread on melted chocolate, it will be very hard and breakable once it sets., , Storing, These Almond Butter Bars, , Store these chocolate almond butter bars in a container in the fridge. They won’t hold up as well at room temperature because they will soften., , You can freeze these chocolate almond butter bars as well. I suggest layering parchment paper between the bars before freezing. When you’re ready to eat them, simply thaw the bars in a container in the fridge., , , More Vegan Dessert Recipes, , Check out these other delicious vegan treats:, , Chocolate Peanut Butter Stuffed Dates, Chickpea Cookie Dough, Chocolate Peanut Butter Bars, Peanut Butter Chocolate Chip Cookie Dough, Sweet Potato Chocolate Pudding, Banana Chocolate Chip Mug Cake, , Recipe, , , , Print Recipe, , , Chocolate Almond Butter Bars (No-Bake), , , These no-bake chocolate almond butter bars are vegan and gluten-free. They are absolutely delicious and a great indulgent snack or dessert, , , , Course:, Dessert, Cuisine:, plant-based, Vegan, , Servings:, 16, , bars, , Calories:, 277, kcal, , Author:, Bree Sheree, , Base, *1 ½ cups natural almond butter, , (no added sugar, salt, or oil), ½, , cup, , maple syrup, 2, , tablespoons, , cacao powder, **140 grams fine almond flour, , (1 + ¼ cups), Top, ¾, , cups, , vegan chocolate chips, 2, , tablespoons, , natural almond butter, , (no added sugar, salt, or oil), , so mix it in evenly before measuring out your almond butter. If it’s difficult to mix because the almond butter is hard under the oil, empty the container into a food processor and blend the almond butter before measuring., , **I suggest weighing your almond flour to ensure you have the correct amount. I have given cup measurements as well, but there can be a big difference based on how you fill your measuring cup. Too much flour will make these bars too crumbly and too little will make them too soft., , After cutting the bars, place them in a sealed container and store in the fridge. They should keep well for a couple of weeks., , Nutritional information is only an estimate., , Nutrition, Calories:, 277, kcal, |, Carbohydrates:, 19, g, |, Protein:, 8, g, , Nutrition Disclaimer, More Plant-Based Dessert Recipes, Peanut Butter Apple Crisp (Vegan), Vegan Valentine's Day Cookies, Edible Peanut Butter Chocolate Chip Cookie Dough, Banana Chocolate Chip Mug Cake, , , , 180, , shares, , , , , , , , , , , , , , , , , , , , , Reader Interactions, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , Primary Sidebar, , , This post contains affiliate links for which I may earn a commission (at no extra cost to you) should you make a purchase. As an Amazon Associate I earn from qualifying purchases. Please see my, disclaimer, for more information., , , Hey, I'm Bree!, , I'm a Certified Nutritionist and a vegan. I love creating recipes and sharing information related to a vegan lifestyle!, , , More about me, , , , Popular Posts, , The 6 Best Vegan Collagen-Boosting Supplements, Going Vegan for Beginners: Everything You Need to Know, Are Sour Patch Kids Vegan? (Most People Get This Wrong), 11 of the Best Vegan and Cruelty-Free Perfumes, , , , , Footer, This post contains affiliate links for which I may earn a commission (at no extra cost to you) should you make a purchase. As an Amazon Associate I earn from qualifying purchases. Please see my, disclaimer, for more information., , , , , About, , , , , Subscribe, , , , , Contact, , , , Bree's Vegan Life is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. As an Amazon Associate, I earn from qualifying purchases. Amazon and the Amazon logo are trademarks of Amazon.com, Inc., or its affiliates., , Privacy Policy, -, Disclaimer, -, Terms & Conditions, , Copyright © 2025, Bree's Vegan Life, , , , , , 180, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: In a bowl, mix 1 ½ cups of almond butter with the maple syrup and cacao powder. Continue mixing until all of the cacao powder is fully mixed in., Add the almond flour and mix. It will be easiest to use your hands because the dough is quite thick., Once the dough is evenly mixed, line an 8 x 8 inch square pan with parchment paper and press the dough into it evenly. Chill this in the fridge for 15 minutes., Once the dough has chilled, add the chocolate chips and 2 tablespoons of almond butter to a bowl and microwave for 30 seconds. Check if it’s melted by mixing with a spoon. Continue microwaving for 30 second intervals until you can stir the chocolate chips into smooth melted chocolate., Pour this chocolate mix over the dough base and spread it out evenly. Place the pan back in the fridge for two hours before cutting and eating the squares., , , Notes",
        "Vegan Key Lime Pie Bars": "Ingredients: , , For the crust you will need:, , , Whole raw cashews, , Dates, , Almond flour, , Cinnamon, , Vanilla extract, , Sea salt., , , The dates give the crust its sweetness and break down when added to a food processor to form a sticky sweet crust. The pinch of sea salt helps to balance out the sweetness for the perfect flavor., , A Perfect Sweet Yet Tart Vegan Key Lime Filling, , , These bars get their creamy texture from whole cashews! When soaked and blended, they create a delicious filling that tastes like key lime pie., , Here is what you’ll need for the key lime filling:, , Soaked Cashews:, , Let your whole cashews soak overnight in water to get that perfect creamy texture., , Full Fat Coconut Milk:, , Use canned full fat coconut to help give the filling the right amount of creaminess., , Lime Juice:, , Of course, you can’t have key lime pie without fresh lime juice. The amount of lime juice depends on how tart you like your key lime pie. I like to start with ¼ a cup and add an additional ¼ cup at a time until it’s the desired tartness you prefer. Usually ¼ a cup to ½ a cup of lime juice should do the trick., , Maple Syrup:, , These bars are naturally sweetened with pure maple syrup. Feel free to use a bit more if you like things on the sweeter side., , Vanilla Extract:, , An obvious addition that adds just the right amount of maple flavor., , Coconut Oil:, , Coconut oil helps to solidify the bars once cooled., , How to Make These Easy Key Lime Pie Bars, , Step One:, , The first step in making these key lime pie bars is to soak the cashews in water overnight. Soaking the cashews helps to soften them and gives the key lime filling a nice creamy texture., , If you do not have time to soak the cashews overnight, you can pour boiling hot water over them and let the cashews soak for  three to four hours until tender. The filling might not be as smooth and creamy, but it will still work., , Step Two:, , , Use your fingers to press the dough into an 8×8 baking pan that has been lined with parchment paper. Put the crust in the fridge or freezer while you prepare the key lime filling., , , Step Three:, , Add the soaked cashews, lime juice, lime zest, maple syrup, coconut oil, coconut milk, and vanilla extract to your food process or high powered blender. Blend the filling until silky smooth and creamy. You want to make sure that there are no lumps or bits of cashew remaining in the filling., , Next, give the filling a taste and adjust it based on your tastes. This is the perfect time to add more lime juice if you like your key lime pie to be more tart or add more maple syrup if you want the bars to be a bit sweeter., , Step Four:, , Once the filling tastes how you want it to taste, pour it over the prepared crust crust., , , Step Five:, , Freeze the key lime pie bars overnight or until completely solid. When you are ready to serve, remove the bars from the freezer and sprinkle with a little extra lime zest. Then, use a sharp knife to slice the bars into 9 or 16 pieces. Serve and enjoy!, , Tips, Tricks, and Storage Details, , These bars are incredibly easy to make but here are a few of my favorite tips and tricks to make sure that they come out absolutely perfect every time!, , , Use fresh lime juice! The bottled shelf-stable stuff is not going to work for this recipe., , Do not forget to remove the pits from your dates before adding them to the food processor., , Do not over process the crust. It should be sticky, similar to a cookie dough, not smooth like a nut butter., , Let the bars freeze until they are completely solid before slicing. It will be tempting to dive in right away but freezing them until firm makes the bars much easier to slice., , Store these bars in the freezer. I like to freeze them completely and then add them to a storage bag. When you are ready to eat, pull one bar out at a time for a few minutes before you are ready to eat., , , , More Delicious Dessert Recipes to Try, , No Bake Strawberry Cheesecake Bars, , Gluten Free Strawberry Crisp, , Strawberry Oatmeal Crumble Bars, , Blueberry Pie Bars, , Vegan Raspberry Oatmeal Bars, , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , , Healthy Key Lime Pie Bars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.9, from, 25, reviews, , , , , , , Author:, , Ashlea Carver, , , Prep Time:, , 4 hours 30 minutes, , , Cook Time:, , 0 minutes, , , Total Time:, , 4 hours 30 minutes, , , Yield:, , 1, 6, 1, x, , , Category:, , Dessert, , , , , , , Scale, , 1x, 2x, 3x, , , , , , Cookie Crust:, , , 6, pitted dates, , ¾ cup, cashews, , ½ cup, almond flour, , ¼ tsp, cinnamon, , 1 teaspoon, vanilla extract, , ½ tsp, sea salt, , , Key Lime Pie Filling:, , , 1 1/4 cup, whole cashews, , 1/4 cup, full fat coconut milk, , ¼, –, ½, cup lime juice (plus more to taste), , 1 tablespoon, lime zest, , ¼ cup, maple syrup (plus more to taste), , 1 teaspoon, vanilla extract, , 2 tablespoons, coconut oil, , , , , , , , , , , , Add the soaked cashews, lime juice, lime zest, maple syrup, coconut oil, coconut milk, and vanilla extract to your food process or high powered blender. Blend the filling until silky smooth and creamy., , , , Give the filling a taste and adjust the level of sweetness or tartness to your taste. You can add more maple syrup or add more lime juice to suit your taste buds., , , , Pour the key lime filling over the prepared crust. Freeze the bars overnight or until completely solid., , , , When you are ready to serve, remove the bars from the freezer and use a sharp knife to slice the bars into 9 or 16 pieces. Top with more lime zest and enjoy!, , , , , , , , , , , , , , , , , Did you make this recipe?, , Share a photo and tag us — we can't wait to see what you've made!, , , , , , , , , , explore, more, , GF, Gluten Free, GR, Grain Free, NF, Nut Free, VG, Vegetarian, The Best Egg Salad Recipe, DF, Dairy Free, GF, Gluten Free, NF, Nut Free, V, Vegan, VG, Vegetarian, Chipotle Corn Salsa (Copycat Recipe), GF, Gluten Free, Green Goddess Chicken Salad, Weekly Meal Plan 007, , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, Name, *, , Email, *, , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , 71 Comments, , , Comments navigation, , Older comments, , , , , , , , JK, , says:, , , , at, , , , , Amazing! How long do you process because mine had just a little gritty texture, will it always have a tiny different texture to it?, Otherwise it’s a hit!!!, , , , Reply, , , , , , , , Ashlea Carver, , says:, , , , at, , , , , Hi JK! That’s normal! next time you can soak the cashews a bit longer or try processing just a bit longer to see if that helps. Sometimes the smoothness depends on your blender., , , Reply, , , , , , , , JK, , says:, , , , at, , , , , Was trying to reply…. I will try with my Ninja blender next time!, , Do you have to serve it frozen?, , , , , , , , , Ashlea Carver, , says:, , , , at, , , , , Great! No, you can let them sit out for a few minutes so that they’re cold but not frozen. Hope that helps!, , , , , , , , , , , , , Laura O., , says:, , , , at, , , , , So how long can these be at room temp after freezing?, , , Reply, , , , , , , , Ashlea Carver, , says:, , , , at, , , , , Hi Laura, I would keep these out at room temp for an hour at most. You can keep them in fridge to help them stayed chill if you don’t want to put them back in the freezer., , , Reply, , , , , , , , , , Tanya, , says:, , , , at, , , , , My second time making this and it’s just so light and refreshing for a summer picnic. I also love to just keep them in the freezer for a evening snack. I shared with all my gluten and dairy free friends. I took to a picnic this week and everyone raves about them and begged me to share the recipe., , , , Reply, , , , , , , , Natalie Perkins (ATHT), , says:, , , , at, , , , , I’m so glad these were a hit, Tanya! Thanks for sharing!, , , Reply, , , , , , , , , , Sara, , says:, , , , at, , , , , These are my FAVORITE! They are so good Instructions: , No Cook, , , Cuisine:, , American, , , Diet:, , Gluten Free, , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , Description, , , Healthy Key Lime Pie Bars made with tart lime juice and just the right touch of maple syrup. The creamy filling is poured on a delicious no bake cookie crust that is perfectly sweetened with dates. This recipe is vegan, dairy-free, gluten free, and Paleo., , , , , , , , , , , , , Soak 1 1/4 cup of cashews in water overnight for the key lime pie filling., , , , it gets so much creamier. I love key lime pie and this is the perfect summer dessert!, , , , Reply, , , , , , , , Ashlea Carver, , says:, , , , at, , , , , so glad you loved them, Sara!, , , Reply, , , , , , , , , , Sophia, , says:, , , , at, , , , , I have told at least 3 random strangers to make this recipe. This recipe made me want to find my grandmother’s recipe box and start my own section for the food I want MY grandchildren to feel nostalgic over. Refeshing, light, creamy, and delicious!, , , , Reply, , , , , , , , Ashlea Carver, , says:, , , , at, , , , , Thank you so much for sharing, Sophia! I’m so happy you loved it!, , , Reply, , , , , , , , , , Tamara D, , says:, , , , at, , , , , Amazing recipe! I love that you can adjust the tartness. I forgot the parchment and it still slide out of my glass pan easily after freezing. I cut into small squares and individually wrapped for a treat to pull out of the freezer whenever the mood strikes. Thank you!, , , , Reply, , , , , , , , Kathleen, , says:, , , , at, , , , , Anxiously waiting to make. Do you think I can use my vitamix??  I don’t own a food processor, , , , Reply, , , , , , , , Ashlea Carver, , says:, , , , at, , , , , Hi, Kathleen! yes! I think that would work!, , , Reply, , , , , , , , , , katie, , says:, , , , at, , , , , These are amazing! These will be in my freezer all summer for a quick treat. Thanks for the recipe!, , , , Reply, , , , , , , , Nicole Foxley, , says:, , , , at, , , , , Holy shit!!!!! I just followed your wonderful recipe….. Never in all my life did I expect it to taste this good., It’s healthy and tasty … This is amazing thank you so much for sharing., So much love and light 🙏🕉️💜😇, , , , Reply, , , , , , , , Ashlea Carver, , says:, , , , at, , , , , Haha, so glad you liked them!, , , Reply, , , , , , , , Comments navigation, , Older comments, , , , , , , , , , , Facebook, , Instagram, , Pinterest, , Mail, , meet, ashlea, , Welcome to All the Healthy Things! I'm the recipe developer and founder of ATHT and I love sharing simple, delicious recipes. Here you'll find a recipe for every occasion from breakfast to sweet treats. I'm so glad you're here!, , learn more about Ashlea, , , work with ashlea, , shop ashlea's faves, , , , , , , join the, community, , Sign up for our newsletter to get the latest recipes delivered straight to your inbox., , , , , , , , , , , , , , \", *, \" indicates required fields, , , Name, , , , First, , , Email, *, , , Name, This field is for validation purposes and should be left unchanged., , , , , , , , , , , , , , , Δ, , , , , , reader’s, favorites, , Treats, DF, Dairy Free, GF, Gluten Free, VG, Vegetarian, Healthy Strawberry Oatmeal Bars, Breakfast, , Treats, VG, Vegetarian, Banana Bread Cinnamon Rolls, Lunch + Dinner, GF, Gluten Free, GR, Grain Free, NF, Nut Free, The Best Cobb Salad, Lunch + Dinner, DF, Dairy Free, GF, Gluten Free, GR, Grain Free, NF, Nut Free, Greek Chicken Meatballs, , , See all dinner recipes, , , , , top, categories, , , , appetizers, , , dinner, , , snacks, , , dessert, , , , , , , , , , , , join the, community, , , , Sign up for our newsletter to get the latest recipes delivered straight to your inbox., , , , , , \", *, \" indicates required fields, , , Name, , , , First, , , Email, *, , , Comments, This field is for validation purposes and should be left unchanged., , , , , , , , , , , , , , , Δ, , , , , , , , , , , , , , , , , , , , , , , , Search, , , , Breakfast, Appetizers, Dinner, Dessert, , , , , , , , , , , , join the community, , , , Facebook, , Instagram, , Pinterest, , Mail, , , , , , , , , , , , , , , , , , , , Back to Top, , About, , Recipes, , Dinner, , Shop, , , , , , , , , Policies, , Copyright Notice, © 2025, , , , , , , , , , Designed by, Weller Smith Design, Developed by Meyne, , site credits, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Recipes, , Dinner, , Dessert, , About, , Shop, , , , , , , Facebook, , Twitter, , Instagram, , , , , , Search for:, , , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , ,",
        "Creamy vegan lemon bars": "Ingredients: , , naturally sweetened,, and, gluten-free, ! I know, I’m excited, too., The almond-oat crust is adapted from my, Peanut Butter and Jelly Snack Bars, , and somehow ends up tasting reminiscent of graham cracker crust! It’s my new favorite thing, besides this über creamy filling., The filling is comprised of soaked cashews, coconut cream, lots of lemon juice + zest, maple syrup, arrowroot starch (for thickening), and sea salt. That’s it!, I didn’t know what would happen if I blended it all up and baked it, but it turns out, , it ends up tasting like a lemon bar with a cheesecake-like texture, . SWOON!, Friends, you’re going to LOVE these bars! They’re:, Creamy, Rich, Lemony, Not too sweet, Simple, Surprisingly healthy, Portable, & Delicious, These would make the perfect dessert for so many things: Bridal showers (I know), baby showers (I know!), study dates (yass girl), office gatherings (the least exciting, but still really cool). Even if you don’t have anywhere special to be, these would make a delicious treat to have around the house for snacking (but watch out – you’ll want 2 or 3)., If you try this recipe, let us know! Leave a comment it, rate it, and don’t forget to tag a picture, @minimalistbaker, on Instagram! I’d love to see what you come up with. Cheers, friends! Now excuse me while I dive into one of these magical bars., , , Creamy Vegan Lemon Bars, , Creamy, , Author, Minimalist Baker, , , , , Print, , , SAVE, SAVED, , , 4.75, from, 262, votes, , , , , , Prep Time, 5, hours, , hours, Cook Time, 45, minutes, , minutes, Total Time, 5, hours, , hours, , 45, minutes, , minutes, , Servings, 9, , (bars), , Course, Dessert, Cuisine, Gluten-Free, Vegan, Freezer Friendly, 1 month, Does it keep?, 2-4 Days, , Cook Mode, Prevent your screen from going dark, , US Customary, –, Metric, FILLING, 1, , cup, , raw cashews, 1, , cup, , coconut cream*, , (the hardened portion at the top of full-fat coconut milk), 2, , Tbsp, , arrowroot or cornstarch, 1/2, , cup, , lemon juice, , (2 large lemons yield ~1/2 cup or 120 ml), 1, , heaping Tbsp, , lemon zest, , (1 large lemon yields ~1 heaping Tbsp or 4 g), 1, , pinch, , sea salt, 1/4, , cup, , maple syrup, , (plus more to taste), 2, , Tbsp, , organic powdered sugar, , (, optional, // for topping), CRUST, 1, , cup, , rolled oats, , (certified gluten-free as needed), 1, , cup, , raw almonds, 1/4, , tsp, , sea salt, 2, , Tbsp, , coconut sugar, 1, , Tbsp, , maple syrup, 4-5, , Tbsp, , coconut oil, , (melted), , but I didn’t notice any. Great for company., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 9, 2024 at 11:13 am, , , , We’re so glad you enjoyed it, Jake! Thanks so much for sharing!, , , Reply, , , , , , , , , , Annie, , says, , , November 25, 2024 at 5:18 am, , , , Wow! C’est un succès! Ma fille n’aime pas les desserts trop sucrés et celui-ci est parfait! Si l’on suit les indications à la lettre le résultat est étonnant. Recette végétale et nourrissante. Merci beaucoup 😊 je vais la refaire ., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 25, 2024 at 9:39 am, , , , Nous sommes ravis que vous ayez tous les deux apprécié. Merci beaucoup pour cette belle critique, Annie! xo, , , Reply, , , , , , , , , , Rachel, , says, , , November 24, 2024 at 7:46 pm, , , , Hello!, , I am wanting to make these for a friend who has a bunch of allergies and cashews are one of them, could we use a different nut (or anything else) in the filling or will they not firm up the same way?, , Thank you, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 25, 2024 at 9:32 am, , , , Hey Rachel! Cashews are pretty key in this recipe for texture and taste. However, we do have a lemon bar recipe, here, that you could use any type of milk in. Hope this helps. xo, , , Reply, , , , , , , , , , Cayla, , says, , , September 15, 2024 at 8:05 pm, , , , Hi! I don’t have almonds on hand, but I do have almond flour. Is there any way to sub almond flour in the crust? If so, how much do you recommend? If not, could I use cashews instead? Thanks so much!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 16, 2024 at 11:32 am, , , , Hi Cayla, another reader mentioned subbing almond flour with success! You likely won’t need quite as much (we’d suggest trying 3/4 cup). Hope that helps!, , , Reply, , , , , , , , , , Erin Contour, , says, , , August 20, 2024 at 8:32 pm, , , , I made this using substitutions since I didn’t have what I thought I did. I substituted Organic Rolled Oats with Ancient Grains & Seeds instead of the oatmeal and Blanched Almond Flour instead of almonds (3/4 c flour rather than 1 c almonds, had to guess about that). Figured they were going to get ground up anyway so the flour should work. These two substitutions resulted in a crust that was drier than I would have liked (the cereal mix had chia seeds which could definitely have sucked up moisture) but they worked in that I achieved a crust that was tolerably crumbly and held together. I am OK with the flavor but sure the straight oatmeal would be better and ditto with the almonds. The flour is a less flavorful., , When I blended the lemon mixture I did double the zest trying to increase the lemon flavor. It’s there, , I did do something with my blender that I often do making vegan sour cream etc. and that is to blend on soup mode which both blends and heats the mixture. That gives me a very smooth, thick mixture which cooked up beautifully., , Frankly, I like these bars but I’d be tempted to rename them because calling them ‘lemon bars’ sets expectations. They’re more of a ‘lemon custard bar’ perhaps?, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 21, 2024 at 9:46 am, , , , Thank you for sharing your experience, Erin! These are more of a creamy lemon bar vs. a classic lemon bar. We have a more classic recipe, here, if you’re interested., , , Reply, , , , , , , , , , Kaylee H., , says, , , August 16, 2024 at 11:40 am, , , , This was a huge hit with my omni family. I ended up zesting all the lemons since we love tart desserts and used pecans instead of almonds since we had those on hand. So good!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 16, 2024 at 12:19 pm, , , , Yay! We’re so glad the lemon bars were a hit with your family, Kaylee. Thank you for the lovely review and for sharing your modification! xo, , , Reply, , , , , , , , , , Jess, , says, , , August 16, 2024 at 8:24 am, , , , Hii! If I am using salted cashews instead of raw, would you recommend I don’t use as much salt?, , Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 16, 2024 at 10:13 am, , , , Hi Jess, yes, reducing the salt would be ideal! Are the cashews roasted? That may throw off the flavor!, , , Reply, , , , , , , , , , Karen, , says, , , July 21, 2024 at 12:10 am, , , , Thanks for this recipe! I made it today and liked it but didn’t love it (yet). I will make it again. I’ll make less crust or will use some of it for another dessert. It was a bit too thick for me but has a good taste. It could be a bar by itself! I wasn’t 100% thrilled with the lemon mixture. There was something missing but I can’t put my finger on what it was. I added more lemon juice and zest. I still needed a bit more of something… I’ll make it again. Perhaps the lemons weren’t as ripe as needed or a bit bland instead of more sour. It was good but not great. The consistency was very much like cheesecake, which was exciting! I’m glad I made it. I also loved that it was easy. Thanks!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 22, 2024 at 10:19 am, , , , Hi Karen, sorry you didn’t love it! Have you tried our more, classic lemon bar recipe, ? You might like it better if you’re looking for a stronger lemon flavor. Hope that helps!, , , Reply, , , , , , , , , , Lilian, , says, , , June 30, 2024 at 10:53 am, , , , Can I use vegan butter for the crust, do you think? We don’t keep coconut oil in the house and I can’t justify buying a whole jar for this recipe., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 1, 2024 at 8:55 am, , , , Yes, that would work!, , , Reply, , , , , , , , , , M, , says, , , June 9, 2024 at 4:17 am, , , , This recipe was ok… I used tapioca starch (turns out that what they call “arrowroot starch” is tapioca starch here in Australia and is the only one available), and i don’t really love the texture of the filling. It actually lacked the creaminess and “airiness” that was appealing to me about the recipe and photos, and the flavours weren’t very bright or particularly tasty after baking even though i added more zest (looks like another reviewer experienced this too- i think i saw on the youtube comments). Unfortunately i would not try this recipe again and do not recommend it. Was not worth it especially because i buy nuts organic and this recipe uses a whole 2 cups of 2 nuts and just ended up feeling like a waste. Also, the base for me was very crumbly and didn’t hold together well., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 10, 2024 at 10:45 am, , , , We’re so sorry you didn’t enjoy it! For the crust, it sounds like it needed more coconut oil or to press more firmly. Tapioca starch and arrowroot starch are different so that may have been part of the issue with the filling. If you’re looking for a more classic, bright lemon bar, we’d suggest our, other lemon bar recipe, ., , , Reply, , , , , , , , , , The Vegan Goddess, , says, , , May 19, 2024 at 8:14 pm, , , , This is a delicious healthy treat!  You can tweak it to your taste — sweeter or more lemony and tart., , The crust reminded me of graham crackers and was easy to make., , I didn’t sprinkle confectioner’s sugar on it but it isn’t necessary., , This would make a great dessert menu item for a vegan restaurant or shop., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 20, 2024 at 9:59 am, , , , Thank you so much for your sweet review! xoxo, , , Reply, , , , , , , , , , Brooke, , says, , , May 10, 2024 at 1:44 pm, , , , I was planning on making these for my mom for Mother’s Day, but oats are a food sensitivity of hers. Do you have any suggestions for a replacement?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 10, 2024 at 4:46 pm, , , , Hi Brooke, another reader mentioned subbing almond flour with success! Otherwise, perhaps quinoa flakes, but you may need to compensate with a little more sweetener since oats have a slightly sweet flavor and quinoa flakes are more bland. We hope your mom loves the lemon bars!, , , Reply, , , , , , , , , , Kim Adlerman, , says, , , April 15, 2024 at 3:28 pm, , , , Can I use a different type of sugar?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 16, 2024 at 6:51 am, , , , Hi Kim, agave might work in place of the maple syrup, but we haven’t tested it. We also have a, lemon bar recipe here, that uses cane sugar. Hope that helps!, , , Reply, , , , , , , , , , Mama, , says, , , April 2, 2024 at 10:00 am, , , , but that’s small potatoes in terms of tweaks. Just a wonderful recipe. Thank you so much. Oh! And for those of you out there feeding people of all different food preferences and allowances, this was an across the board pleaser no matter if the crowd is vegan, gluten free, cane sugar free or not. The lemon flavor is so bright and dominant. I will say that my child wasn’t a big fan because he said it was too tart. I prefer a dessert that is slightly sweet but not cloying, however for kids, the maple could be upped., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 2, 2024 at 11:08 am, , , , Thanks so much for sharing! We’re so glad it was enjoyed by almost everyone! xoxo, , , Reply, , , , , , , , , , Nicci, , says, , , March 22, 2024 at 1:58 pm, , , , Can I double this recipe and use a 9×13 dish?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 22, 2024 at 4:49 pm, , , , That should work! You may need to bake the filling a bit longer. Hope that helps!, , , Reply, , , , , , , , , , Lydia, , says, , , January 29, 2024 at 9:59 am, , , , Would this recipe work with Meyer lemons??, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 29, 2024 at 10:42 am, , , , Hi Lydia, yes, that should work well!, , , Reply, , , , , , , , , , Alyssa, , says, , , January 27, 2024 at 6:12 am, , , , Hi! I made this and made too big of a batch for two people to consume. Can these be frozen? Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 29, 2024 at 8:58 am, , , , Hi Alyssa! These can definitely be frozen!, , , Reply, , , , , , , , , , Jen T, , says, , , January 19, 2024 at 7:09 am, , , , I was drawn to this recipe from your recent vibrant citrus recipes post. My family doesn’t like coconut. Refined coconut oil is fine but what would you suggest to substitute for the coconut cream?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 19, 2024 at 8:39 am, , , , Hi Jen, The coconut cream is pretty essential for the right texture here. You could possibly increase the cashews by ~1/2 cup and use a bit of water, maybe 1/2 cup, to blend the filling, but we haven’t tried it and cannot guarantee results. We do have a more classic lemon bar recipe coming up in the future that you and your family might prefer!, , , Reply, , , , , , , , , , PJ, , says, , , January 18, 2024 at 7:10 pm, , , , Hello community! I have made this with meyer lemons and loved it. Has anyone tried using lime juice instead of lemon? Our lime tree is loaded and literally dropping delicious fruit on the ground. Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 19, 2024 at 8:24 am, , , , Hi PJ, we have a version with limes, here, . Hope that helps!, , , Reply, , , , , , , , , , Tulsi, , says, , , January 7, 2024 at 5:52 pm, , , , Love this recipe so much. Easy to make and incredibly delicious to eat. Just doubled the recipe for a function tomorrow. Can’t wait to bite into one! Cheers, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 8, 2024 at 2:43 pm, , , , We’re so glad you enjoy it, Tulsi! Thanks so much for the lovely review!, , , Reply, , , , , , , , , , Jess, , says, , , January 4, 2024 at 9:55 am, , , , Made this for NYE and it was a hit!!! Thanks for another great one!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 4, 2024 at 6:13 pm, , , , Whoop! Thank you for the lovely review, Jess! xo, , , Reply, , , , , , , , , , Melanie, , says, , , December 10, 2023 at 5:11 pm, , , , Do these bars need to be refrigerated after making or are they ok to sit out on the counter?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 11, 2023 at 12:21 pm, , , , Hi Melanie, these are best stored in the refrigerator., , , Reply, , , , , , , , , , Brigitta, , says, , , October 26, 2023 at 10:17 am, , , , Hi :) I would like to ask about the starch. I am allergic to corn and I don’t have arrowroot. Do you think I could substitute with potato or tapioca starch? Or I have used psyllium with success before in a raw vegan cheesecake.But im not sure about baking it., Thank you :), , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 27, 2023 at 11:32 am, , , , Hi Brigitta, we think tapioca starch might work! We wouldn’t recommend psyllium in this one. Hope that helps!, , , Reply, , , , , , , , Nicole E Brown, , says, , , January 7, 2024 at 7:11 pm, , , , Hi, Brigitta,, I tried replacing the cornstarch with potato starch 1 to 1. The lemon topping had a very gummy texture. So I would not recommend it., , I did sub almond flour for the shortbread layer and it was very delicious., , , Reply, , , , , , , , , , alex, , says, , , October 23, 2023 at 12:08 am, , , , Do you have any substitutes for oats? I don’t have any gluten free oats near me :(, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 23, 2023 at 7:50 am, , , , Hi Alex, another reader mentioned subbing almond flour with success! Otherwise, perhaps quinoa flakes, but you may need to compensate with a little more sweetener since oats have a slightly sweet flavor and quinoa flakes are more bland. Hope that helps!, , , Reply, , , , , , , , , , Jayme, , says, , , October 2, 2023 at 1:56 pm, , , , For the crust, after it’s baked for 15 minutes at 350, do you remove it from the oven, wait for the oven to hit 375 and put it back in? Or do you leave it in while the oven is preheating to 375 and count that as the additional 5-8 minutes?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 2, 2023 at 4:14 pm, , , , Hi Jayme, you can leave it in!, , , Reply, , , , , , , , , , Wendy, , says, , , September 4, 2023 at 8:09 am, , , , Love this recipe! The bars are delicious! I love it so much I’ve tried a number of times to make it into a full cheesecake, but never had success. 😩 Would looove to have a full size cheesecake like this! Any tips? I’ve tried reducing the temp and baking longer, water bath, glass and metal pans.. nothing seems to work to make it a round cake. I’m stumped!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 5, 2023 at 10:40 am, , , , We’re so glad you enjoy the recipe, Wendy! Thank you for sharing! Hmm, possibly similar to our, Easy Baked Vegan Cheesecake, ? Hope that helps!, , , Reply, , , , , , , , , , Donna, , says, , , July 29, 2023 at 8:29 pm, , , , I have made this dessert 3 times in the past month. I made it first for a vegan family member who loves lemon desserts. It was a big hit and I keep making it!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 31, 2023 at 10:05 am, , , , Thanks so much for the lovely review, Donna. We are so glad you’re enjoying the recipe! Next time, would you mind leaving a star rating with your review? It’s super helpful for us and other readers. Thanks so much! xo, , , Reply, , , , , , , , , , Deanna Myers, , says, , , July 19, 2023 at 5:22 pm, , , , Is there a sub for the coconut oil in the crust?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 20, 2023 at 9:45 am, , , , Yes! You could use vegan butter or a neutral-flavored oil, though it may be more crumbly. Hope that helps!, , , Reply, , , , , , , , , , Sarah Bradley, , says, , , July 8, 2023 at 9:19 am, , , , Is there a way to make the crust without using my almonds? My husband would love these but can’t eat almonds (cashews are fine).  Excited to try them! I love all your recipes!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 10, 2023 at 10:06 am, , , , Thank you for your kind words, Sarah! You can use walnuts, pecans, or cashews. We’d suggest reducing the oil since they naturally have more in them., , , Reply, , , , , , , , , , Alina Kazakova, , says, , , June 30, 2023 at 4:47 am, , , , Wow, thank you so much for this recipe! They are so easy and quick to make. I even went a bit freehand with the proportions as I was making a bigger batch, and they turned out amazing! And the taste is delicious!! ❤️, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 30, 2023 at 1:19 pm, , , , We’re so glad you enjoy them, Alina! Thank you for the lovely review! xo, , , Reply, , , , , , Older Comments, Primary Sidebar, , , , Search for, , , , , , , Recipe Key, GF, , Gluten-Free, VG, , Vegan, V, , Vegetarian, DF, , Dairy-Free, NS, , Naturally Sweetened, , Want More Deliciousness?, Get our copy of, FAN FAVORITES, featuring 20 of our most loved, highly-rated recipes!, Please enable JavaScript in your browser to complete this form., Email, *, Website, Submit, , , Find Us, , Facebook, , Instagram, , Pinterest, , Twitter, , YouTube, , Minimalist Baker Brandmark, Simple Recipes That, , Make You Feel Good, Recipes, , Cookbook, , Shop, , About, , ©MinimalistBaker.com, , Privacy Policy, , Terms, , , , , Please enable JavaScript in your browser to complete this form., Email, *, Website, Submit, , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , , , X, , , , , , , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , X, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: Add raw cashews to a mixing bowl and cover with boiling hot water. Let rest for 1 hour (uncovered). Then drain thoroughly., In the meantime, preheat oven to 350 degrees F (176 C) and line an, 8×8 inch baking dish, with parchment paper., Add oats, almonds, sea salt, and coconut sugar to a, high-speed blender, and mix on high until a fine meal is achieved., Transfer to a medium mixing bowl and add maple syrup and melted coconut oil, starting with lesser end of range (4 Tbsp or 60 g as original recipe is written // adjust if altering batch size) and adding more if it’s too dry. Stir with a spoon to combine until a loose dough is formed. You should be able to squeeze the mixture between two fingers and form a dough instead of it crumbling. If too dry, add a bit more melted coconut oil., Transfer mixture to parchment-lined baking pan and spread evenly. Then place parchment paper on top and use a flat-bottomed object, such as a drinking glass, to press down firmly until it’s evenly distributed and well packed., Bake for 15 minutes, then increase heat to 375 F (190 C) and bake for 5-8 minutes more, or until the edges are golden brown and there is some browning on the surface. Remove from oven to cool slightly, then reduce oven heat to 350 degrees F (176 C)., Once cashews are soaked and drained, add to a high-speed blender with coconut cream, arrowroot starch, lemon juice, lemon zest, sea salt, and maple syrup. Mix on high until very creamy and smooth., Taste and adjust flavor as needed. I added a bit more lemon zest and maple syrup. It should be very lemony, and not overly sweet., Pour filling over the pre-baked crust and spread into an even layer. Tap on counter to remove any air bubbles., Bake for 20-23 minutes or until the edges look very slightly dry and the center appears “jiggly” but not liquidy., Let rest for 10 minutes, then transfer to refrigerator to let cool completely (uncovered) – at least 4 hours, preferably overnight., To serve, slice and sift with powdered sugar (optional). Store leftovers in the refrigerator, covered, up to 4 days, though best within the first 2 days., , Video, , Notes, *If you open your can of coconut milk or cream and the cream is not separated from the liquid, that’s ok! Just try and tip out as much of the rich, firm white part and leave the liquid behind. It’s not crucial that it’s entirely cream. But the more cream, the richer the bars will be!, *Nutrition information is a rough estimate calculated without organic powdered sugar., *Crust adapted from my, Peanut Butter and Jelly Snack Bars, ., , Nutrition (1 of, 9, servings), , Serving:, 1, , lemon bar, , Calories:, 326, , , Carbohydrates:, 24.3, , g, , Protein:, 5.9, , g, , Fat:, 24.6, , g, , Saturated Fat:, 13.7, , g, , Trans Fat:, 0, , g, , Cholesterol:, 0, , mg, , Sodium:, 61, , mg, , Fiber:, 3.3, , g, , Sugar:, 11.4, , g, Did You Make This Recipe?, Tag, @minimalistbaker, on Instagram and hashtag it, #minimalistbaker, so we can see all the deliciousness!, Facebook, Twitter, Pin It, If you love this recipe..., , Round-Up, Best Chocolate Desserts for Valentine’s Day (& Beyond!), Round-Up, Magical Holiday Breakfast Ideas, Recipes, Easy Winter Fruit Salad (1 Bowl!), Round-Up, 60 Reader-Favorite Holiday Recipes, , , Reader Interactions, , , Leave a Comment & Rating!, Cancel reply, Have a question?, Use ctrl+f or ⌘+f on your computer or the \"find on page\" function on your phone browser to search existing comments! Need help?, Check out this tutorial!, Comment:, , My Rating:, , , , My Rating:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , I Made this, I Have a Question, , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., You will not be subscribed to our newsletter list., , , , Δ, , , All comments, I made this, Questions, , , , , , FelinaKusinera, , says, , , March 15, 2025 at 10:01 am, , , , I’ve been a longtime follower, I bought yr book or my VG daughter 8 yrs ago and is the most used and earmarked book for refernce.  However i have a son who has cashew allergies, any substitutes for cashew?  I’ll most likelly make this anyway for my daughters <3, God bless, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 17, 2025 at 10:04 am, , , , Aw, thank you for your support! Cashews are pretty key in this recipe for texture and taste, but macadamia nuts would be the next best option. We also have a lemon bar recipe, here, that you could use any type of milk in. Hope this helps. xo, , , Reply, , , , , , , , , , natalie, , says, , , February 25, 2025 at 1:52 pm, , , , Any substitute  for the oats?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 25, 2025 at 4:02 pm, , , , Hi Natalie, another reader mentioned subbing almond flour with success! Otherwise, perhaps quinoa flakes, but you may need to compensate with a little more sweetener since oats have a slightly sweet flavor and quinoa flakes are more bland. Hope that helps!, , , Reply, , , , , , , , , , Jake, , says, , , December 8, 2024 at 1:40 pm, , , , This was fantastic! I opted for a graham cracker crust, but otherwise made it as written with a little extra lemon zest. For my taste it was perfect",
        "Vegan No bake chocolate coconut bars": "Ingredients: , , We adore a good, dessert bar recipe, , and if you do too, try my, raspberry bars, , , pumpkin blondies, , or, zucchini bars, next!, , Table of Contents, Why I love this recipe, How to make coconut chocolate bars, Arman’s recipe tips, Frequently asked questions, Chocolate Coconut Bars (Recipe Card), More chocolate coconut sweet treats, , Chocolate and coconut is probably my family’s favorite flavor combination, which is why I’ve come up with so many chocolate and coconut recipes (hello, , coconut clusters, !)., , Inspired by my, chocolate coconut cookies, , I wanted to make a bar version that’s a bit heavier on the chocolate. The result is a no-bake bar that’s firm yet gooey and naturally sweetened with just a touch of maple syrup., , Why I love this recipe, , , No oven needed., All you need is the fridge and some patience…which will be well-rewarded!, , You won’t find any sweetened condensed milk in this recipe because it isn’t needed. Instead, I use healthy oils and maple syrup as my natural sweetener., , The perfect texture., They’re soft yet firm, and the coconut filling is sweet, gooey, and smooth., , , , , Shredded coconut., , Maple syrup., My preferred natural sweetener that gives the center its chewy bite and decadent flavor. Honey or agave nectar also works., , Coconut oil., I add a little coconut oil to improve the texture. Optionally, you can also use butter., , Water., This thins out the coconut mixture and helps it spread easily., , Chocolate., To coat the bars. I used dark chocolate chips because I’m obsessed with, Bounty bars, , but you could use milk chocolate. To make vegan bars, use, vegan chocolate chips, ., , , How to make coconut chocolate bars, , I’ve included, step-by-step photos, , Slice., Once firm, slice the coconut into bars., , Add chocolate., Microwave the chocolate until melted. Dip each bar into the melted chocolate. Place them on a lined plate and chill until firm., , , Arman’s recipe tips, , , Use a food processor., I tried mixing the coconut in a large bowl by hand, but I wasn’t able to get the right consistency. You want very fine coconut flakes, which is why a food processor or blender comes in handy., , Work quickly when dipping the bars., The chocolate begins to set immediately, so you’ll want to move fast when dipping them and stir the chocolate in between each bar., , Cut the sugar., Use my, keto maple syrup, , and, sugar-free chocolate chips, ., , , Frequently asked questions, , Can I replace the coconut oil?, , If you don’t want to use coconut oil, butter will work., , , , , , , , Chocolate Coconut Bars, , 4.99, from, 297, votes, , chewy, and the perfect sweet tooth fix., Watch the video below to see how I make it in my kitchen!, , Servings:, 24, , servings, Prep:, 1, minute, , min, Cook:, 5, minutes, , mins, Total:, 6, minutes, , mins, , , , Rate This Recipe, , , Pin, , Print, , , Video, , , , , , , , , , 1x, 2x, 3x, ▢, 4, , cups, , unsweetened shredded coconut, ▢, 1/2, , cup, , coconut oil, , melted, ▢, 3/4, , cup, , maple syrup, ▢, 1, , cup, , chocolate, , taste delicious., , , , You May Also Like, , , Chickpea Cookie Dough, Cottage Cheese Pudding, Cottage Cheese Chocolate Mousse, Mars Bars, , , , , 4.99 from 297 votes (, 274 ratings without comment, ), , , , Leave a Comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Notify me of new posts by email., , , , Δ, , , , , , Comments, , , , , , , cyndi, , says:, , , , January 11, 2025 at 2:13 am, , , , , Thank you so much for the big time tasty recipes., Not a bad one yet:), , , Reply, , , , , , , , Arman Liew, , says:, , , , January 25, 2025 at 9:04 pm, , , , , Thanks, Cyndi!, , , Reply, , , , , , , , , , Mario, , says:, , , , December 20, 2024 at 6:33 pm, , , , , I must try this. Coconut flavour I like maybe the most., Also coated in chocolate…Wow. It seems tasteful., , , Reply, , , , , , , , Mario, , says:, , , , June 21, 2024 at 9:05 pm, , , , , Combination of coconut and chocolate is the best. I always buy choco-coconut protein bars., , , Reply, , , , , , , , ju, , says:, , , , November 21, 2023 at 11:47 am, , , , , very tasty i made a small batch and used silicone muffin moulds, , , Reply, , , , , See More Comments, , , , , , , , , , , WELCOME TO THE BIG MAN’S WORLD!, , My name is Arman Liew, and I’m a two-time cooking author and food blogger. Here, you’ll find delicious, HEALTHY, and easy recipes that cater to the beginner or seasoned cook., , , More About Us, , , , , , , Popular Recipes, , Stuffed Chicken Breast, Almond Flour Cookies, Vegan Brownies, Air Fryer Chicken Thighs, , , Air Fryer Favorites, , Air Fryer Chicken Breast, Air Fryer Shrimp, Air Fryer Tilapia, Air Fryer Meatballs, Air Fryer Chicken Tenderloins, Air Fryer Salmon, , As Seen In, The Big Man's World ®, Appetizers & Sides, , Easy Dinners, , Breakfast, , Dessert, , Snacks, , Air Fryer Recipes, , Chicken Recipes, , About, , Cooking Resources, , Contact, , Instagram, , YouTube, , Facebook, , Twitter, , Pinterest, ©2025 The Big Man's World ®. All rights reserved., , , Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: , , Air Fryer, , Cast Iron, , Instant Pot, , Saute, , Sous Vide, , , , , , Main Dishes, , Dessert, , , Cookies, , Cheesecake, , Brownie Recipes, , Bars, Blondies, and Slices, , Cakes, Muffins, and Quick Breads, , Pies, Tarts, and Crumbles, , Chocolate, , Donuts, , Frozen Desserts, , High Protein Desserts, , Holiday, , Homemade Candy, , Mug Cakes, , No Bake, , Peanut Butter, , , , Air Fryer Recipes, , Home, , |, , Dessert Recipes, , |, , No Bake Desserts, , |, , Chocolate Coconut Bars, Chocolate Coconut Bars, , by, Arman Liew, published on Dec 15, 2024, , , 68, comments, 4.99, from 297 votes, , , Jump to Recipe, Print, Print Recipe, , This post may contain affiliate links. See my, disclosure policy, ., , , My family insists I make these, chocolate coconut bars, on a weekly basis. They’re thick, chewy, scroll to the recipe card at the bottom of this post., , Prep., Line a square pan with parchment paper., , Make the coconut filling., Line an 8 x 8-inch pan with parchment paper and set aside., Add the shredded coconut, coconut oil, and maple syrup to a food processor and blend until everything is evenly mixed., Transfer the mixture to the lined pan and press down firmly. Refrigerate for at least an hour to firm up., Once firm, use a sharp knife to slice into bars., In a microwave-safe bowl or stovetop, melt the chocolate. Moving quickly, dip each coconut bar in the melted chocolate until completely coated. Place them on a lined plate and refrigerate until the chocolate has firmed up., , Notes, , TO STORE:, Transfer the bars to an airtight container and store them in the refrigerator for 10 days. Avoid storing them at room temperature for longer than 1 day as the chocolate might begin to melt., , TO FREEZE:, Wrap the bars in plastic wrap, place all the bars in a freezer-safe container, and freeze for up to 6 months., , , Nutrition, Serving:, 1, serving, Calories:, 199, kcal, Carbohydrates:, 15, g, Protein:, 1, g, Fat:, 17, g, Sodium:, 7, mg, Potassium:, 107, mg, Fiber:, 3, g, Sugar:, 7, g, Vitamin C:, 0.2, mg, Calcium:, 15, mg, Iron:, 1, mg, NET CARBS:, 12, g, , , Course:, Dessert, Cuisine:, American, Author:, Arman Liew, , , Tried this recipe?, Give us a shout at, @thebigmansworld, or tag, #thebigmansworld, !, , , , , , , , , , , More chocolate coconut sweet treats, , , Chocolate coconut balls, , Coconut energy balls, , Almond Joys, , , Arman Liew, I’m a two time cookbook author, photographer, and writer",
        "No Bake Oatmeal Bars": "Ingredients:  Instructions: ",
        "Peanutty Peanut Butter Squares": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PEANUTTY PEANUT BUTTER SQUARES, SERVES: 16 (1 square each)   Prep Time: 10 min.   Cooking Time: 25 min., CONTAINER EQUIVALENTS (per serving):, 1, 2½, 1½ cups, all-natural smooth peanut butter, ½ cup, raw honey, 2 tsp., pure vanilla extract, 2, large eggs, at room temperature, ½ tsp., baking soda, gluten-free, SPECIAL EQUIPMENT:, Nonstick cooking spray, 1. \t Preheat oven to 350° F., 2. \t Lightly coat 8 x 8-inch baking pan with spray. Set aside., 3. \t Combine peanut butter, honey, extract, eggs, and baking soda in a large, bowl; mix well., 4. \t Evenly spread batter into prepared pan. Smooth top with a spatula., 5. \t Bake for 22 to 25 minutes. Squares may be a little soft when coming out, of the oven, but they will continue to cook as they cool., 6. \t Cool completely., 7. \t Cut into sixteen squares., VARIATION:, Pure maple syrup can be substituted for honey., NUTRITIONAL INFORMATION (per serving): Calories: 182  Total Fat: 13 g  Saturated Fat: 3 g   Cholesterol: 23 mg  Sodium: 158 mg  Carbohydrates: 13 g, Fiber: 1 g Sugars: 10 g  Protein: 7 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Chocolate Cherry Bars": "Ingredients: 100% gluten-free, since foods are often processed at facilities that also process wheat and other grains. , Instructions: ",
        "Snickerdoodles": "Ingredients: 100% gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., 18 g, Instructions: ",
        "Lemon Bars": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., LEMON BARS, SERVES: 12  (1 bar each) Prep Time: 10 min.  Cooking Time: 50 min. + 3 hours to set, CONTAINER EQUIVALENTS (per serving):, 2½, ½, FOR CRUST:, 11⁄3 cups, , crushed graham crackers, , , gluten-free, 1 Tbsp., , pure maple syrup, 3 Tbsp., , extra-virgin organic coconut oil, FOR FILLING:, ¾ cup, , fresh lemon juice, 1 Tbsp., , finely grated lemon peel, , , (lemon zest), ¾ cup, , pure maple syrup, ¼ cup, , cornstarch (preferably GMO-, , free), 1 cup, , unsweetened coconut cream, , , stirred well, 3, , large egg yolks, 1⁄3 cup, , gluten-free all-purpose flour, , (preferably Bob’s Red Mill® All-, , Purpose Baking Flour, red label), 1 dash, , sea salt (or Himalayan salt), , , Powdered sugar, gluten-free, , , (for garnish), SPECIAL EQUIPMENT:, Nonstick cooking spray, Parchment paper, Kitchen/flour sifter, 1.\t\t Preheat oven to 350° F., 2.\t\t Coat an 8½ inch x 8½-inch baking dish with cooking spray and line with, parchment paper, allowing edges to hang over side of dish. Coat parchment, paper with spray. Set aside., 3.\t\t Place graham crackers in a small food processor (or blender) and pulse until, fine. Add maple syrup and oil and pulse until thoroughly combined., 4.\t\t Cover the bottom of baking dish with crust mixture, packing it down evenly., Bake for 12 to 15 minutes, or until edges are golden brown., 5.\t\t While crust is baking, place lemon juice, lemon peel, maple syrup, cornstarch, , coconut cream, egg yolks, flour, and salt in blender. Cover and blend until, 6.\t\t Once crust has finished baking, allow to cool for 10 minutes then carefully, pour filling mixture over crust and bake for 30 to 35 minutes, or until set., 7.\t\t Allow lemon bars to cool for 10 minutes. Then place them in the refrigerator, for 3 hours, or until completely cool., 8.\t\t Once lemon bars are cool, carefully lift parchment paper with pastry from, baking dish and place on a cutting board. Trim off any charred edges. Sift, powdered sugar lightly and evenly over the top of lemon bars. Cut into 12 bars., 9.\t\t Serve immediately, or store refrigerated in an airtight container for up to 3 days., \u0007RECIPE NOTES:, •\t The crust requires a good, dense texture so don’t be afraid to take your, time packing it down into the baking dish., •\t The top of the bars will look a little uneven and/or have a few bubbles, after baking. This is normal. Dust lightly with powdered sugar to cover, any imperfections right before cutting., NUTRITIONAL INFORMATION (per serving): Calories: 271  Total Fat: 10 g  Saturated Fat: 7 g  Cholesterol: 46 mg, Sodium: 66 mg  Carbohydrates: 44 g  Fiber: 1 g  Sugars: 31 g  Protein: 2 g, Bob’s Red Mill is a trademark of Bob’s Red Mill Natural Foods, Inc., RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 11, Instructions: ",
        "Vegan Snickers Protein Bars": "Ingredients: , coconut oil, , peanuts, — look for dry roasted as many roasted varieties contain inflammtory oils such as canola, peanut, or soybean, , chocolate chips, — vegan, if needed. I also like to look for “lecithin” free varieties such as Good and Gather Organic, Nestle Tollhouse Organic Allergen Friendly, or Enjoy Life Foods., , Yes, that’s it!, , , , , , Print Recipe, , 5, from, 4, votes, , , Snickers Protein Bars, , , , , Course:, Dessert, Snack, Keyword:, candy, candy bar, chocolate, dairy free, gluten free, grain free, high protein, low sugar, peanut butter, plant based, protein, protein bars, protein powder, refined sugar free, snickers, vegan, , Servings:, 7, , bars, , Layer 1, 2/3, , cup, , vanilla protein powder, 1/2, , cup, , almond flour, 2, , tbsp, , maple syrup, 6, , tbsp, , non-dairy milk of choice**, , (start with less and add until you reach a thick “dough” consistency as different protein powders will have different effects!), Layer 2, 1/2, , cup, , peanut butter, , (or nut/seed butter of choice), 2, , tbsp, , coconut oil, , (melted), 2, , tbsp, , maple syrup, pinch, , sea salt, 1/3, , cup, , peanuts, , (+ more for topping), Chocolate coating, 1.5, , cups, , chocolate chips, 1.5, , tbsp, , coconut oil, , Melt chocolate and coconut oil over the stovetop or in 30 second intervals in the microwave (stir between each)., Remove bars from loaf pan and slice. Dip each bar into melted chocolate and place on a plate or tray. Top with sea salt. Set back in the freezer to harden and enjoy!, , Notes, **see my video on Instagram @callascleaneats for the proper dough consistency that you should have 🙂, , , , , , , , , , , , , Share, , , , , , , , , , , , , , , , , , , , , , Previous, , , , Nutella Baked Oatmeal, , , , , , , , Next, , , , Healthier Tuna Noodle Casserole (gluten-free & dairy-free!), , , , , , , , You may also like, Breakfast, Gluten Free, Recipes, Vegan, Carrot Cake Baked Oatmeal (Gluten Free, Dairy Free), April 11, 2025, This Carrot Cake Baked Oatmeal can be made gluten free, dairy free, vegan, and is refined sugar free. It’s a delicious breakfast or snack to prep for the week ahead that tastes like you’re diving into a slice of carrot cake. With fresh grated carrot, crushed pecans, warming spices, and a cake-like texture, it’s like you’re having dessert for breakfast!, , , , Gluten Free, Recipes, Treats, Reese's Cheesecake Cup (High Protein, Low Carb), April 9, 2025, This Reese’s Cheesecake Cup is high protein, low carb, cottage cheese, this cup has a silky smooth and creamy texture that pairs perfectly with the hardened chocolate shell. If you love all things peanut butter and chocolate, you’re going to want to try this one!, , , , Gluten Free, Lunch/Dinner, Recipes, Healthier Chicken Parmesan (High Protein, Low Carb), April 2, 2025, This Healthier Chicken Parmesan is gluten free, high protein, some simple spices, and twenty minutes to enjoy this lighter version of an Italian classic. Pair this tender, juicy, cheesy chicken with a side salad, roasted vegetables, or with pasta for a balanced and satisfying dinner any night of the week!, , , , , , , 25 Comments, , , , , , , Reply, , , , , , , , Kat, , , March 4, 2022 at 1:22 am, , , These look amazing! Do you know what the macros are for one bar?, , , , , , , , , , , Reply, , , , , , , , Jess, , , March 6, 2022 at 8:42 am, , , I’d love to know the macros too! I made these today and they were delicious but the bottom layer was really soft and never froze properly. Will use less almond milk next time., , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , March 6, 2022 at 5:43 pm, , , Hi! I don’t have the macros but they should be pretty quick to plug into a nutrition calculator 🙂 Yes, you can always add more/less milk depending which kind of protein powder you use. The dough should look like my dough in my video on Instagram! Hope that helps x, , , , , , , , , , , Reply, , , , , , , , AmyKY, , , March 7, 2022 at 10:04 pm, , , Same here in macros and mine never fully formed too and was super hard to add chocolate layer too because of this. I used monk fruit maple flavoring and skinny taste salted caramel syrups instead of maple syrup. Flavor is good. Execution not so easy, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , March 8, 2022 at 1:48 pm, , , Hi! The kind of protein powder you use and any substitutions may affect the consistency of the first layer. I recommend starting with less milk and adding more until you reach the same consistency of dough I had (see in my video on Instagram!), , , , , , , , , , , , , , , Reply, , , , , , , , Amanda Smith, , , March 12, 2022 at 11:30 pm, , , How long do I set layer one before adding layer 2?, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , March 13, 2022 at 1:45 pm, , , Just a few minutes while you make layer 2 🙂, , , , , , , , , , , , , Reply, , , , , , , , Larissa, , , March 23, 2022 at 1:41 am, , , These were amazing! I’ve been eating them as a quick breakfast replacement on my way to work in the morning… and wow. They are so good! I used coconut flour and they still turned out delicious 😋, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , March 23, 2022 at 1:36 pm, , , Aw yay! I am so happy to hear that you are loving them! And so good to know they worked with coconut flour too— thank you!!, , , , , , , , , , , , , Reply, , , , , , , , Farah, , , April 2, 2022 at 6:29 pm, , , YUM! How many calories are in them?, , , , , , , , , , , Reply, , , , , , , , Nancy, , , May 23, 2022 at 11:25 pm, , , Can you replace peanuts (butter) with almonds?(butter), , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , May 24, 2022 at 1:42 pm, , , Yes! 🙂, , , , , , , , , , , , , Reply, , , , , , , , Vanessa, , , June 28, 2022 at 10:24 pm, , , How many calories per bar, , , , , , , , , , , Reply, , , , , , , , Amber, , , June 30, 2022 at 6:05 pm, , , Do you have to store them in the freezer or refrigerator? How long will they last?, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , June 30, 2022 at 6:33 pm, , , Either works but I prefer keeping them in the freezer and just letting one thaw for a couple minutes before eating. They will last probably a week in the fridge and a super long time in the freezer (at least 6 months!), , , , , , , , , , , , , Reply, , , , , , , , Stefanie, , , July 7, 2022 at 11:25 am, , , Ein super Rezept! Vielen Dank dafür. Habe den Sirup mit Erythrit/Wasser Mischung ersetzt.  Hat super funktioniert.🤗, , , , , , , , , , , Reply, , , , , , , , Kat, , , August 28, 2022 at 12:45 pm, , , awesome just made these!! I ended up mixing peanut butter and almond and as I didn’t have any peanuts I just used other nuts (some cashews and almonds) currently in the freezer but I tried one and I had plans on sharing them with my family but now im thinking I might just have to eat them myself ahaha thank you for the recipe!!, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , August 29, 2022 at 2:08 pm, , , Aw yay I am so glad you love them! Hahaha that sounds like me— I have to keep a secret stash of them in the freezer otherwise they are gone in a day!!!, , , , , , , , , , , , , Reply, , , , , , , , Claire, , , September 9, 2022 at 8:20 pm, , , Just finished making these and wow they’re so good!! Thanks for sharing a great recipe Calla 🙂, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , September 12, 2022 at 1:07 pm, , , Ahhhh yay I am so glad you love them! These are one of my favorites 🙂, , , , , , , , , , , , , Reply, , , , , , , , Luna, , , October 29, 2022 at 6:20 pm, , , I love these so much I finished them in two days! Truly an amazing recipe thank you Calla!, , , , , , , , , , , Reply, , , , , , , , Calla Ramont, , , October 31, 2022 at 2:00 pm, , , I’m so glad you loved them! They are one of my faves too 🙂, , , , , , , , , , , , , Reply, , , , , , , , Terri, , , June 25, 2023 at 10:02 pm, , , These look amazing! I can’t do protein powders, any ideas for a possible substitute I could try? Or am I just out of luck. 🙂, , , , , , , , , , , Reply, , , , , , , , Calla's Clean Eats, , , June 26, 2023 at 1:35 pm, , , Thank you so much! You could likely do more almond flour and maple syrup 🙂 let me know how it goes if you give it a try!, , , , , , , , , , , Reply, , , , , , , , Terri, , , June 26, 2023 at 8:59 pm, , , Thank you, I certainly will!, , , , , , , , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , Email, *, , Website, , , , , Δ, , , , , , , , , , , , Home, , About Me, , Contact, , Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: ",
        "Triple Layer Vegan chocolate bar": "❌ Error scraping https://upbeetandkaleingitblog.com/triple-layer-vegan-chocolate-almond-butter-bars/: 404 Client Error: Not Found for url: https://upbeetandkaleingitblog.com/triple-layer-vegan-chocolate-almond-butter-bars/",
        "Vegan Twix Bars": "Ingredients: , and is fully vegan!, , Chocolate :, An easy step but makes all the difference is encasing each bar in luscious chocolate. You can use dairy-free milk or dark chocolate depending on your preference. So yummy!, , , , , scrumptious, , , All purpose / plain flour, , Caster sugar, , Dairy-free butter, , Vanilla extract, , Light brown sugar, , Vegan condensed milk, , Dairy-free chocolate, , , , , Tips for the BEST vegan Twix bars, , Homemade candy / chocolate bars are definitely worth the extra effort. I find the process of making homemade bars really fun. Pop some music on in the kitchen, get your apron on and just have fun! I’ve listed a few tips in order to make the best homemade Twix bars:, , Don’t rush the caramel:, The caramel is the star of the show and you want it to the thick, , , Copy to clipboard, , Copy to clipboard, , , , , , , , Scale, , 1x, 2x, 3x, , , , , , , , 300g, of plain flour (or gluten-free plain flour), , 10g, of caster sugar, , 200g, of dairy-free block butter (cold and cut into cubes), , 1 teaspoon, of vanilla extract, , , , , 640g, of vegan sweetened condensed milk, , 270g, dairy-free block butter, , 100g, of light brown sugar, , , , , 250g, of dairy-free dark chocolate, , Flaked sea salt (optional), , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , heat the caramel on low / medium, stirring all the time until it turns a amber colour. This will take approximately 15-20 minutes. You want the caramel to reach firm ball stage (if you drop a little caramel into ice-cold water it should form a firm non-sticky ball in your fingers). If the caramel hasn’t reached this stage, cook it for a little longer., , Once ready, carefully pour the caramel over the biscuit base, leveling off with a spoon. Be very quick as this caramel sets quite quickly., , Refrigerate for 3-4 hours or until the caramel is set and firm.  for an hour before coating. Make sure the caramel has fully set, if not, it will be very gooey and a nightmare to coat in chocolate., , , , , , Reply, , , , , , , , , Rick Castle, , June 3, 2022 / 10:18 am, , , , I have read this blog often, it is a very impressive and informative blog., the vip gentlemens club, ., , , , Reply, , , , , , , , , Jessica L Roberts, , August 26, 2023 / 7:58 pm, , , , I made them tonight for my family and they couldn’t believe they were vegan!!!!!!! I am so impressed holly, thank you SOOOOOOOOO much. simply WOW, , , , , Reply, , , , , , , , , thelittleblogofvegan, Author, , August 29, 2023 / 6:32 pm, , , , Hello, Aw thank you, im over the moon you enjoyed!! 🙂 xx, , , , Reply, , , , , , , , , , , Laurie B, , August 29, 2023 / 6:34 pm, , , , I have the caramel setting on the shortbread n the fridge now, I had to make them after seeing you new instagram reel video. I tried a little bit of the caramel and it tastes just ike how I remember the twit bar caramel… I am very excited to dip the bars in the chocolate and try them complete. Ill keep you updated =], , , , , Reply, , , , , , , , , Suzanne, , November 3, 2023 / 4:46 am, , , , This looks so good! What a fun treat to make as a family!, , , , Reply, , , , , , , , , Vanessa, , November 3, 2023 / 4:46 am, , , , Thanks for sharing! Does it keep long?, , , , Reply, , , , , , , , , Melissa, , December 29, 2023 / 2:59 am, , , , Wow thanks for making this recipe GF, , , , Reply, , , , , , , , , Alex, , October 22, 2024 / 11:32 pm, , , , hi Holly, I tried your recipe and it came out quite good. only issue was, when coating with the melted chocolate, the set caramel began to soften up and I had to repeat the coating quickly a few times before popping it in the fridge again, as the chocolate sort of slipped away from the caramel in the process. i am not too sure why, as the caramel was firmly set, but obviously melted chocolate was hot enough to create this reaction. my bars didnt come out quite as beautiful as yours but still tasty and it was a fun recipe to try 🙂, , , , , Reply, , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , , , , , , , , Hello, Holly Jade here and Welcome to The Little Blog of Vegan. A multi-award winning vegan food and lifestyle blog. Food Blogger of the Year 2017, Top 10 must follow blogger 2018, to being featured in Hello! Magazine, multiple recipe Magazines etc. All recipes are 100% vegan & delicious! They never fail to impress!, , Popular Posts, , , , , , , , No-Bake Vegan Mango Cheesecake, , , , , , , , , Vegan Bourbon Brick Brownies, , , , , , , , , Vegan Pine Cone Truffles, , , , , , , , , No-Bake Chocolate Strawberry Cheesecake, , , , , , , , , No-Bake Vegan Pistachio Cheesecake, , , , , , , , , Mini Jammie Dodger Cheesecakes, , , , , , , , , Vegan Danish Butter Cookies, , , , , , , , , Vegan Pumpkin Pie Cookies, , , , , Shop my kitchen essentials, , , , , , , , ORDER MY NEW BOOK, , , , , , , , , , As seen in, , , , , , , , , , , , , , , Categories, Categories, , Select Category, , Air Fryer recipes, , All, , Autumnal Bakes, , Basics, , Biscoff bakes, , Brownies and Bars, , Cakes and Layer Cakes, , Cheesecakes, , Christmas recipes, , Cookies and Biscuits, , Cupcakes and Muffins, , Doughnuts, , Easter recipes, , Gluten-free, , Halloween Bakes, , Low sugar recipes, , Macarons, , Mothers Day Recipes, , New Year recipes, , No Bake Desserts, , Pies and Pastry, , Popular posts, , Summer recipes, , Tarts and Tartlets, , Valentines Recipes, , , , , , , , , , , , © 2025, The Little Blog Of Vegan, , Content & Privacy Policy, , , , , Web Design by, pipdig, , , , , , , , , , , , , , , , , , , , , , ×, , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , Caramel is super chewy, , Great homemade candy bar for Halloween, , Great for storing, , Great for kids to make and decorate, , Coated in chocolate (what could be better), , They taste identical to a classic Twix, , Hit the sweet spot, , , , Layers of a homemade Twix bar, , If you know Twix, you will know they have 3 distinct layers from the buttery shortbread to the chocolate coating. Let’s chat about the layers in a-little more detail., , Shortbread :, Shortbread is the best form of biscuit. It’s soft, buttery and light and literally melts in your mouth. It’s ridiculously easy to make and bake, and makes for the best base for the caramel., , Caramel :, This is the ULTIMATE vegan caramel, it’ll be like liquid gold if done correctly., , Bake the shortbread until golden:, Be sure to bake it for the perfect time, don’t over bake or the shortbread will be super dry and will crumble when you try and cut the bars. The shortbread slab wants to be lightly golden…that’s the perfect colour for the base., , Chill the caramel and shortbread layer:, Make sure you give the shortbread/caramel bars time to chill and set up. This will make dunking the bars in the melted chocolate so much cleaner and easier., , Sprinkle with salt:, Add a dash of salt over the bars before serving. Sweet caramel and salt is the BEST flavour combo and makes the bars taste like salted caramel … it’s heavenly, but if you don’t want it on there… leave it off! It’s completely optional., , , , If you make, and love this recipe, please leave a ⭐⭐⭐⭐⭐ rating below. Thank you & happy baking! Make sure to tag me in your photos on, Instagram, and, Facebook, ! And if you want to pin this recipe for later, you can use the button on the recipe card, above or below this post, or on any of the photos. Happy baking all!, , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , Easy Vegan Twix Bars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.7, from, 3, reviews, , , , , Author:, , thelittleblogofvegan, , , , Total Time:, , 30 minutes, , , , Diet:, , Vegan, , , , , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , Description, , , BEST EVER Classic Vegan Twix Bars, which are easy to make with a buttery shortbread, caramel layer and chocolate., , , , , , , , , , , , , Preheat oven to 180°C fan, and line a square baking tin with greaseproof paper. Make sure the base and sides are fully lined, as the caramel could stick., , In a medium mixing bowl, sift in the flour and sugar. Add in the butter and vanilla extract, using your fingertips, rub the butter into the dry mixture until a dough forms. Form into a ball., , Press the dough into the lined tin, making sure it’s even. Prick the base with a fork., , Pop into the oven and bake for 30 minutes or until lightly golden in colour. Once golden, remove from the oven and place the tin onto a cooling rack., , Leave the shortbread in the tin as we’ll be pouring over the caramel., , , , , , , Fill a small saucepan 3/4 full with water, creating a bain-marie, place onto the hob over low/ medium heat., , Finely chop the dark chocolate and place into a heat proof bowl. Place the bowl on top of the saucepan and allow to melt., , Cut the bars into thin, finger-width sizes. Tip: To get an even amount of bars, slice the entire sheet in half (width-wise), then cut about 6 bars from each half, for a total of approximately 12, thin bars. Use a large, sharp knife to prevent the biscuit base from crumbling apart., , One by one, balance the Twix Bars on a fork or spatula, and using a spoon, pour the chocolate over the bars, allowing any excess chocolate to drip back into the bowl. Don’t try to dunk the bars as that risks the shortbread base from crumbling. Repeat for all bars. Place them onto grease proof paper and pop into the freezer for 10 minutes or fridge for 30 minutes to allow the chocolate to set., , Drizzle any left over chocolate for decoration., , Serve with a sprinkling of sea salt (optional)., , , , , , Notes, , , To store: Store the bars in a sealed container, allow the come to room temperature before enjoying. Can be stored at room temperature if the chocolate is tempered., , Which vegan condensed milk? My favourite vegan condensed milk are Natures Charm Condensed Oat / Coconut milk. I also really like the Carnation Vegan Condensed milk!, , , , , , Cook Time:, , 30 minutes, Category:, , brownies and bars, , Baking, Cuisine:, , American, , , , , , , , Did you make this recipe?, , Tag, @thelittleblogofvegan, on Instagram and hashtag #thelittleblogofvegan, , , , , , , , , Follow:, , , , You may also enjoy:, Vegan Bourbon Brick Brownies, Vegan Orange Cream Brownies, Vegan Custard Cream Blondies, Vegan Tiramisu Brownies, , , , Share:, , , , recipes, , , twix bars, , , vegan twix bars, , , , , , Previous Post, Vegan Millionaires Shortbread Hearts, , Next Post, Baked Blueberry Cheesecake Bars, , , , 9 Comments, , , , , , , Dayna Gushiken, , March 16, 2022 / 8:49 pm, , , ",
        "Almond Chocolate Squares": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., ALMOND CHOCOLATE SQUARES, SERVES: 16 (1 square each)   Prep Time: 15 min.   Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, ½, 2, 1 cup, oat flour, gluten-free, ½ cup, almond flour, 3 scoops, Vanilla Shakeology, ½ tsp., sea salt (or Himalayan salt), 1 cup, all-natural almond butter, 2 tsp., pure vanilla extract, ½ cup, unsweetened almond milk, ¼ cup, dark chocolate chips, 70% cacao, (or more), SPECIAL EQUIPMENT:, Parchment paper, 1. \t Line 8 x 8-inch baking pan with parchment paper. Set aside., 2. \t Place flours, Shakeology, and salt in food processor; pulse to mix., 3. \t Add almond butter and extract; pulse for 1 minute, or until crumbly., 4. \t Add almond milk; pulse for 1 minute, or until mixture forms a soft dough., 5. \t Press dough into prepared pan. Smooth top with a spatula., 6. \t Freeze, covered, for 15 minutes., 7. \t Cut into sixteen squares (approx. 2 x 2 inches)., 8. \t Melt chocolate in double boiler., 9. \t Drizzle melted chocolate evenly on top of squares., 10. \tFreeze for 10 minutes, or until chocolate sets., 11. \tStore in freezer for up to one week in an airtight container., RECIPE NOTES:, •\t You can make oat flour by processing oats in a food processor, (or blender) until smooth., •\t You can make your own almond flour by processing 1 cup slivered, almonds in a food processor (or blender with a strong motor). Make, sure that you pulse in 20-second intervals to prevent the almonds from, turning into almond butter. 1 cup of slivered almonds yields approx. 1, cup of almond flour., •\t If you can’t find almond flour in your store, you can look at club stores, or online., •\t If you don’t have a double boiler, use a medium stock pot. Fill bottom, of pot with water, place heat-resistant bowl on top, so that water is not, touching the bottom of the bowl. Place over high heat. Once water is, boiling add chocolate chips, stirring until fully melted., VARIATIONS:, •\t You can substitute any nut or seed butter for almond butter., •\t Coconut flour or hazelnut flour can be substituted for almond flour., NUTRITIONAL INFORMATION (per serving): Calories: 186  Total Fat: 13 g  Saturated Fat: 2 g   Cholesterol: 2 mg  Sodium: 154 mg  Carbohydrates: 13 g  Fiber: 3 g, Sugars: 4 g  Protein: 8 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Chewy Whole grain bars": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., NUTRITIONAL INFORMATION (per serving): Calories: 196   Total Fat: 9 g   Saturated Fat: 2 g   Cholesterol: 0 mg   Sodium: 98 mg   Carbohydrates: 26 g, Fiber: 4 g   Sugars: 12 g   Protein: 5 g, CHEWY WHOLE-GRAIN BARS, SERVES: 12 (1 bar each)    Prep Time: 15 min.    Cooking Time: 20 min., CONTAINER EQUIVALENTS (per serving):, 1½, ½, ½, we make, these bars in muffin cups so they come out of the oven already wrapped and portioned with no cutting required!, 1 cup, dry old-fashioned rolled oats, , gluten-free, ½ cup, dry quinoa, rinsed, 2 Tbsp., chia seeds, 2 Tbsp., flaxseeds, 1 tsp., ground cinnamon, ½ tsp., sea salt (or Himalayan salt), ¼ cup, all-natural almond butter, 3 Tbsp., pure maple syrup (preferably, dark amber), 1, large very ripe banana, 1 tsp., pure vanilla extract, ½ cup, mixed dried fruit (like raisins, , cherries, apricots), chopped, ¼ cup, raw sunflower seeds, ¼ cup, chopped raw walnuts (optional), ¼ cup, bittersweet chocolate chips, SPECIAL EQUIPMENT:, Muffin papers/cupcake liners, Nonstick cooking spray, 1.\t Preheat oven to 350º F., 2.\t Prepare 12 muffin cups by lining with muffin papers and lightly coating, with spray., 3.\t Combine oats, quinoa, chia seeds, flaxseeds, cinnamon, and salt in a large, bowl; mix well., 4.\t Add almond butter, maple syrup, banana, and extract; mix well with clean, hands or a rubber spatula., 5.\t Fold in dried fruit, sunflower seeds, walnuts (if desired), and chocolate, chips; mix well with clean hands or a rubber spatula., 6.\t Add ¼ cup batter to each muffin cup. Use back of a ¼ cup measure to, compress batter into a tight puck., 7.\t Bake for 18 to 20 minutes, or until edges just begin to brown., 8.\t Cool; store in an airtight container, in the refrigerator, for up to 2 weeks., RECIPE NOTES:, •\t In this recipe we have specified almond butter, but you can use any nut, butter you like. If you have a nut allergy, you can use sunflower butter., •\t Pumpkin seeds can be substituted for sunflower seeds. Or use your, favorite seed!, •\t You can also use any kind of nuts that you like. Make sure they are, raw! If you have a nut allergy, you can add an additional ¼ cup of your, favorite seeds., •\t You can substitute semisweet or dark chocolate chips for bittersweet, chocolate chips., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Creamy Vegan lemon bars": "Ingredients: , , naturally sweetened,, and, gluten-free, ! I know, I’m excited, too., The almond-oat crust is adapted from my, Peanut Butter and Jelly Snack Bars, , and somehow ends up tasting reminiscent of graham cracker crust! It’s my new favorite thing, besides this über creamy filling., The filling is comprised of soaked cashews, coconut cream, lots of lemon juice + zest, maple syrup, arrowroot starch (for thickening), and sea salt. That’s it!, I didn’t know what would happen if I blended it all up and baked it, but it turns out, , it ends up tasting like a lemon bar with a cheesecake-like texture, . SWOON!, Friends, you’re going to LOVE these bars! They’re:, Creamy, Rich, Lemony, Not too sweet, Simple, Surprisingly healthy, Portable, & Delicious, These would make the perfect dessert for so many things: Bridal showers (I know), baby showers (I know!), study dates (yass girl), office gatherings (the least exciting, but still really cool). Even if you don’t have anywhere special to be, these would make a delicious treat to have around the house for snacking (but watch out – you’ll want 2 or 3)., If you try this recipe, let us know! Leave a comment it, rate it, and don’t forget to tag a picture, @minimalistbaker, on Instagram! I’d love to see what you come up with. Cheers, friends! Now excuse me while I dive into one of these magical bars., , , Creamy Vegan Lemon Bars, , Creamy, , Author, Minimalist Baker, , , , , Print, , , SAVE, SAVED, , , 4.75, from, 262, votes, , , , , , Prep Time, 5, hours, , hours, Cook Time, 45, minutes, , minutes, Total Time, 5, hours, , hours, , 45, minutes, , minutes, , Servings, 9, , (bars), , Course, Dessert, Cuisine, Gluten-Free, Vegan, Freezer Friendly, 1 month, Does it keep?, 2-4 Days, , Cook Mode, Prevent your screen from going dark, , US Customary, –, Metric, FILLING, 1, , cup, , raw cashews, 1, , cup, , coconut cream*, , (the hardened portion at the top of full-fat coconut milk), 2, , Tbsp, , arrowroot or cornstarch, 1/2, , cup, , lemon juice, , (2 large lemons yield ~1/2 cup or 120 ml), 1, , heaping Tbsp, , lemon zest, , (1 large lemon yields ~1 heaping Tbsp or 4 g), 1, , pinch, , sea salt, 1/4, , cup, , maple syrup, , (plus more to taste), 2, , Tbsp, , organic powdered sugar, , (, optional, // for topping), CRUST, 1, , cup, , rolled oats, , (certified gluten-free as needed), 1, , cup, , raw almonds, 1/4, , tsp, , sea salt, 2, , Tbsp, , coconut sugar, 1, , Tbsp, , maple syrup, 4-5, , Tbsp, , coconut oil, , (melted), , but I didn’t notice any. Great for company., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 9, 2024 at 11:13 am, , , , We’re so glad you enjoyed it, Jake! Thanks so much for sharing!, , , Reply, , , , , , , , , , Annie, , says, , , November 25, 2024 at 5:18 am, , , , Wow! C’est un succès! Ma fille n’aime pas les desserts trop sucrés et celui-ci est parfait! Si l’on suit les indications à la lettre le résultat est étonnant. Recette végétale et nourrissante. Merci beaucoup 😊 je vais la refaire ., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 25, 2024 at 9:39 am, , , , Nous sommes ravis que vous ayez tous les deux apprécié. Merci beaucoup pour cette belle critique, Annie! xo, , , Reply, , , , , , , , , , Rachel, , says, , , November 24, 2024 at 7:46 pm, , , , Hello!, , I am wanting to make these for a friend who has a bunch of allergies and cashews are one of them, could we use a different nut (or anything else) in the filling or will they not firm up the same way?, , Thank you, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 25, 2024 at 9:32 am, , , , Hey Rachel! Cashews are pretty key in this recipe for texture and taste. However, we do have a lemon bar recipe, here, that you could use any type of milk in. Hope this helps. xo, , , Reply, , , , , , , , , , Cayla, , says, , , September 15, 2024 at 8:05 pm, , , , Hi! I don’t have almonds on hand, but I do have almond flour. Is there any way to sub almond flour in the crust? If so, how much do you recommend? If not, could I use cashews instead? Thanks so much!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 16, 2024 at 11:32 am, , , , Hi Cayla, another reader mentioned subbing almond flour with success! You likely won’t need quite as much (we’d suggest trying 3/4 cup). Hope that helps!, , , Reply, , , , , , , , , , Erin Contour, , says, , , August 20, 2024 at 8:32 pm, , , , I made this using substitutions since I didn’t have what I thought I did. I substituted Organic Rolled Oats with Ancient Grains & Seeds instead of the oatmeal and Blanched Almond Flour instead of almonds (3/4 c flour rather than 1 c almonds, had to guess about that). Figured they were going to get ground up anyway so the flour should work. These two substitutions resulted in a crust that was drier than I would have liked (the cereal mix had chia seeds which could definitely have sucked up moisture) but they worked in that I achieved a crust that was tolerably crumbly and held together. I am OK with the flavor but sure the straight oatmeal would be better and ditto with the almonds. The flour is a less flavorful., , When I blended the lemon mixture I did double the zest trying to increase the lemon flavor. It’s there, , I did do something with my blender that I often do making vegan sour cream etc. and that is to blend on soup mode which both blends and heats the mixture. That gives me a very smooth, thick mixture which cooked up beautifully., , Frankly, I like these bars but I’d be tempted to rename them because calling them ‘lemon bars’ sets expectations. They’re more of a ‘lemon custard bar’ perhaps?, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 21, 2024 at 9:46 am, , , , Thank you for sharing your experience, Erin! These are more of a creamy lemon bar vs. a classic lemon bar. We have a more classic recipe, here, if you’re interested., , , Reply, , , , , , , , , , Kaylee H., , says, , , August 16, 2024 at 11:40 am, , , , This was a huge hit with my omni family. I ended up zesting all the lemons since we love tart desserts and used pecans instead of almonds since we had those on hand. So good!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 16, 2024 at 12:19 pm, , , , Yay! We’re so glad the lemon bars were a hit with your family, Kaylee. Thank you for the lovely review and for sharing your modification! xo, , , Reply, , , , , , , , , , Jess, , says, , , August 16, 2024 at 8:24 am, , , , Hii! If I am using salted cashews instead of raw, would you recommend I don’t use as much salt?, , Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 16, 2024 at 10:13 am, , , , Hi Jess, yes, reducing the salt would be ideal! Are the cashews roasted? That may throw off the flavor!, , , Reply, , , , , , , , , , Karen, , says, , , July 21, 2024 at 12:10 am, , , , Thanks for this recipe! I made it today and liked it but didn’t love it (yet). I will make it again. I’ll make less crust or will use some of it for another dessert. It was a bit too thick for me but has a good taste. It could be a bar by itself! I wasn’t 100% thrilled with the lemon mixture. There was something missing but I can’t put my finger on what it was. I added more lemon juice and zest. I still needed a bit more of something… I’ll make it again. Perhaps the lemons weren’t as ripe as needed or a bit bland instead of more sour. It was good but not great. The consistency was very much like cheesecake, which was exciting! I’m glad I made it. I also loved that it was easy. Thanks!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 22, 2024 at 10:19 am, , , , Hi Karen, sorry you didn’t love it! Have you tried our more, classic lemon bar recipe, ? You might like it better if you’re looking for a stronger lemon flavor. Hope that helps!, , , Reply, , , , , , , , , , Lilian, , says, , , June 30, 2024 at 10:53 am, , , , Can I use vegan butter for the crust, do you think? We don’t keep coconut oil in the house and I can’t justify buying a whole jar for this recipe., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 1, 2024 at 8:55 am, , , , Yes, that would work!, , , Reply, , , , , , , , , , M, , says, , , June 9, 2024 at 4:17 am, , , , This recipe was ok… I used tapioca starch (turns out that what they call “arrowroot starch” is tapioca starch here in Australia and is the only one available), and i don’t really love the texture of the filling. It actually lacked the creaminess and “airiness” that was appealing to me about the recipe and photos, and the flavours weren’t very bright or particularly tasty after baking even though i added more zest (looks like another reviewer experienced this too- i think i saw on the youtube comments). Unfortunately i would not try this recipe again and do not recommend it. Was not worth it especially because i buy nuts organic and this recipe uses a whole 2 cups of 2 nuts and just ended up feeling like a waste. Also, the base for me was very crumbly and didn’t hold together well., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 10, 2024 at 10:45 am, , , , We’re so sorry you didn’t enjoy it! For the crust, it sounds like it needed more coconut oil or to press more firmly. Tapioca starch and arrowroot starch are different so that may have been part of the issue with the filling. If you’re looking for a more classic, bright lemon bar, we’d suggest our, other lemon bar recipe, ., , , Reply, , , , , , , , , , The Vegan Goddess, , says, , , May 19, 2024 at 8:14 pm, , , , This is a delicious healthy treat!  You can tweak it to your taste — sweeter or more lemony and tart., , The crust reminded me of graham crackers and was easy to make., , I didn’t sprinkle confectioner’s sugar on it but it isn’t necessary., , This would make a great dessert menu item for a vegan restaurant or shop., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 20, 2024 at 9:59 am, , , , Thank you so much for your sweet review! xoxo, , , Reply, , , , , , , , , , Brooke, , says, , , May 10, 2024 at 1:44 pm, , , , I was planning on making these for my mom for Mother’s Day, but oats are a food sensitivity of hers. Do you have any suggestions for a replacement?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 10, 2024 at 4:46 pm, , , , Hi Brooke, another reader mentioned subbing almond flour with success! Otherwise, perhaps quinoa flakes, but you may need to compensate with a little more sweetener since oats have a slightly sweet flavor and quinoa flakes are more bland. We hope your mom loves the lemon bars!, , , Reply, , , , , , , , , , Kim Adlerman, , says, , , April 15, 2024 at 3:28 pm, , , , Can I use a different type of sugar?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 16, 2024 at 6:51 am, , , , Hi Kim, agave might work in place of the maple syrup, but we haven’t tested it. We also have a, lemon bar recipe here, that uses cane sugar. Hope that helps!, , , Reply, , , , , , , , , , Mama, , says, , , April 2, 2024 at 10:00 am, , , , but that’s small potatoes in terms of tweaks. Just a wonderful recipe. Thank you so much. Oh! And for those of you out there feeding people of all different food preferences and allowances, this was an across the board pleaser no matter if the crowd is vegan, gluten free, cane sugar free or not. The lemon flavor is so bright and dominant. I will say that my child wasn’t a big fan because he said it was too tart. I prefer a dessert that is slightly sweet but not cloying, however for kids, the maple could be upped., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 2, 2024 at 11:08 am, , , , Thanks so much for sharing! We’re so glad it was enjoyed by almost everyone! xoxo, , , Reply, , , , , , , , , , Nicci, , says, , , March 22, 2024 at 1:58 pm, , , , Can I double this recipe and use a 9×13 dish?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 22, 2024 at 4:49 pm, , , , That should work! You may need to bake the filling a bit longer. Hope that helps!, , , Reply, , , , , , , , , , Lydia, , says, , , January 29, 2024 at 9:59 am, , , , Would this recipe work with Meyer lemons??, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 29, 2024 at 10:42 am, , , , Hi Lydia, yes, that should work well!, , , Reply, , , , , , , , , , Alyssa, , says, , , January 27, 2024 at 6:12 am, , , , Hi! I made this and made too big of a batch for two people to consume. Can these be frozen? Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 29, 2024 at 8:58 am, , , , Hi Alyssa! These can definitely be frozen!, , , Reply, , , , , , , , , , Jen T, , says, , , January 19, 2024 at 7:09 am, , , , I was drawn to this recipe from your recent vibrant citrus recipes post. My family doesn’t like coconut. Refined coconut oil is fine but what would you suggest to substitute for the coconut cream?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 19, 2024 at 8:39 am, , , , Hi Jen, The coconut cream is pretty essential for the right texture here. You could possibly increase the cashews by ~1/2 cup and use a bit of water, maybe 1/2 cup, to blend the filling, but we haven’t tried it and cannot guarantee results. We do have a more classic lemon bar recipe coming up in the future that you and your family might prefer!, , , Reply, , , , , , , , , , PJ, , says, , , January 18, 2024 at 7:10 pm, , , , Hello community! I have made this with meyer lemons and loved it. Has anyone tried using lime juice instead of lemon? Our lime tree is loaded and literally dropping delicious fruit on the ground. Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 19, 2024 at 8:24 am, , , , Hi PJ, we have a version with limes, here, . Hope that helps!, , , Reply, , , , , , , , , , Tulsi, , says, , , January 7, 2024 at 5:52 pm, , , , Love this recipe so much. Easy to make and incredibly delicious to eat. Just doubled the recipe for a function tomorrow. Can’t wait to bite into one! Cheers, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 8, 2024 at 2:43 pm, , , , We’re so glad you enjoy it, Tulsi! Thanks so much for the lovely review!, , , Reply, , , , , , , , , , Jess, , says, , , January 4, 2024 at 9:55 am, , , , Made this for NYE and it was a hit!!! Thanks for another great one!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 4, 2024 at 6:13 pm, , , , Whoop! Thank you for the lovely review, Jess! xo, , , Reply, , , , , , , , , , Melanie, , says, , , December 10, 2023 at 5:11 pm, , , , Do these bars need to be refrigerated after making or are they ok to sit out on the counter?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 11, 2023 at 12:21 pm, , , , Hi Melanie, these are best stored in the refrigerator., , , Reply, , , , , , , , , , Brigitta, , says, , , October 26, 2023 at 10:17 am, , , , Hi :) I would like to ask about the starch. I am allergic to corn and I don’t have arrowroot. Do you think I could substitute with potato or tapioca starch? Or I have used psyllium with success before in a raw vegan cheesecake.But im not sure about baking it., Thank you :), , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 27, 2023 at 11:32 am, , , , Hi Brigitta, we think tapioca starch might work! We wouldn’t recommend psyllium in this one. Hope that helps!, , , Reply, , , , , , , , Nicole E Brown, , says, , , January 7, 2024 at 7:11 pm, , , , Hi, Brigitta,, I tried replacing the cornstarch with potato starch 1 to 1. The lemon topping had a very gummy texture. So I would not recommend it., , I did sub almond flour for the shortbread layer and it was very delicious., , , Reply, , , , , , , , , , alex, , says, , , October 23, 2023 at 12:08 am, , , , Do you have any substitutes for oats? I don’t have any gluten free oats near me :(, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 23, 2023 at 7:50 am, , , , Hi Alex, another reader mentioned subbing almond flour with success! Otherwise, perhaps quinoa flakes, but you may need to compensate with a little more sweetener since oats have a slightly sweet flavor and quinoa flakes are more bland. Hope that helps!, , , Reply, , , , , , , , , , Jayme, , says, , , October 2, 2023 at 1:56 pm, , , , For the crust, after it’s baked for 15 minutes at 350, do you remove it from the oven, wait for the oven to hit 375 and put it back in? Or do you leave it in while the oven is preheating to 375 and count that as the additional 5-8 minutes?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 2, 2023 at 4:14 pm, , , , Hi Jayme, you can leave it in!, , , Reply, , , , , , , , , , Wendy, , says, , , September 4, 2023 at 8:09 am, , , , Love this recipe! The bars are delicious! I love it so much I’ve tried a number of times to make it into a full cheesecake, but never had success. 😩 Would looove to have a full size cheesecake like this! Any tips? I’ve tried reducing the temp and baking longer, water bath, glass and metal pans.. nothing seems to work to make it a round cake. I’m stumped!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 5, 2023 at 10:40 am, , , , We’re so glad you enjoy the recipe, Wendy! Thank you for sharing! Hmm, possibly similar to our, Easy Baked Vegan Cheesecake, ? Hope that helps!, , , Reply, , , , , , , , , , Donna, , says, , , July 29, 2023 at 8:29 pm, , , , I have made this dessert 3 times in the past month. I made it first for a vegan family member who loves lemon desserts. It was a big hit and I keep making it!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 31, 2023 at 10:05 am, , , , Thanks so much for the lovely review, Donna. We are so glad you’re enjoying the recipe! Next time, would you mind leaving a star rating with your review? It’s super helpful for us and other readers. Thanks so much! xo, , , Reply, , , , , , , , , , Deanna Myers, , says, , , July 19, 2023 at 5:22 pm, , , , Is there a sub for the coconut oil in the crust?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 20, 2023 at 9:45 am, , , , Yes! You could use vegan butter or a neutral-flavored oil, though it may be more crumbly. Hope that helps!, , , Reply, , , , , , , , , , Sarah Bradley, , says, , , July 8, 2023 at 9:19 am, , , , Is there a way to make the crust without using my almonds? My husband would love these but can’t eat almonds (cashews are fine).  Excited to try them! I love all your recipes!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 10, 2023 at 10:06 am, , , , Thank you for your kind words, Sarah! You can use walnuts, pecans, or cashews. We’d suggest reducing the oil since they naturally have more in them., , , Reply, , , , , , , , , , Alina Kazakova, , says, , , June 30, 2023 at 4:47 am, , , , Wow, thank you so much for this recipe! They are so easy and quick to make. I even went a bit freehand with the proportions as I was making a bigger batch, and they turned out amazing! And the taste is delicious!! ❤️, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 30, 2023 at 1:19 pm, , , , We’re so glad you enjoy them, Alina! Thank you for the lovely review! xo, , , Reply, , , , , , Older Comments, Primary Sidebar, , , , Search for, , , , , , , Recipe Key, GF, , Gluten-Free, VG, , Vegan, V, , Vegetarian, DF, , Dairy-Free, NS, , Naturally Sweetened, , Want More Deliciousness?, Get our copy of, FAN FAVORITES, featuring 20 of our most loved, highly-rated recipes!, Please enable JavaScript in your browser to complete this form., Email, *, Website, Submit, , , Find Us, , Facebook, , Instagram, , Pinterest, , Twitter, , YouTube, , Minimalist Baker Brandmark, Simple Recipes That, , Make You Feel Good, Recipes, , Cookbook, , Shop, , About, , ©MinimalistBaker.com, , Privacy Policy, , Terms, , , , , Please enable JavaScript in your browser to complete this form., Email, *, Website, Submit, , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , , , X, , , , , , , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , X, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: Add raw cashews to a mixing bowl and cover with boiling hot water. Let rest for 1 hour (uncovered). Then drain thoroughly., In the meantime, preheat oven to 350 degrees F (176 C) and line an, 8×8 inch baking dish, with parchment paper., Add oats, almonds, sea salt, and coconut sugar to a, high-speed blender, and mix on high until a fine meal is achieved., Transfer to a medium mixing bowl and add maple syrup and melted coconut oil, starting with lesser end of range (4 Tbsp or 60 g as original recipe is written // adjust if altering batch size) and adding more if it’s too dry. Stir with a spoon to combine until a loose dough is formed. You should be able to squeeze the mixture between two fingers and form a dough instead of it crumbling. If too dry, add a bit more melted coconut oil., Transfer mixture to parchment-lined baking pan and spread evenly. Then place parchment paper on top and use a flat-bottomed object, such as a drinking glass, to press down firmly until it’s evenly distributed and well packed., Bake for 15 minutes, then increase heat to 375 F (190 C) and bake for 5-8 minutes more, or until the edges are golden brown and there is some browning on the surface. Remove from oven to cool slightly, then reduce oven heat to 350 degrees F (176 C)., Once cashews are soaked and drained, add to a high-speed blender with coconut cream, arrowroot starch, lemon juice, lemon zest, sea salt, and maple syrup. Mix on high until very creamy and smooth., Taste and adjust flavor as needed. I added a bit more lemon zest and maple syrup. It should be very lemony, and not overly sweet., Pour filling over the pre-baked crust and spread into an even layer. Tap on counter to remove any air bubbles., Bake for 20-23 minutes or until the edges look very slightly dry and the center appears “jiggly” but not liquidy., Let rest for 10 minutes, then transfer to refrigerator to let cool completely (uncovered) – at least 4 hours, preferably overnight., To serve, slice and sift with powdered sugar (optional). Store leftovers in the refrigerator, covered, up to 4 days, though best within the first 2 days., , Video, , Notes, *If you open your can of coconut milk or cream and the cream is not separated from the liquid, that’s ok! Just try and tip out as much of the rich, firm white part and leave the liquid behind. It’s not crucial that it’s entirely cream. But the more cream, the richer the bars will be!, *Nutrition information is a rough estimate calculated without organic powdered sugar., *Crust adapted from my, Peanut Butter and Jelly Snack Bars, ., , Nutrition (1 of, 9, servings), , Serving:, 1, , lemon bar, , Calories:, 326, , , Carbohydrates:, 24.3, , g, , Protein:, 5.9, , g, , Fat:, 24.6, , g, , Saturated Fat:, 13.7, , g, , Trans Fat:, 0, , g, , Cholesterol:, 0, , mg, , Sodium:, 61, , mg, , Fiber:, 3.3, , g, , Sugar:, 11.4, , g, Did You Make This Recipe?, Tag, @minimalistbaker, on Instagram and hashtag it, #minimalistbaker, so we can see all the deliciousness!, Facebook, Twitter, Pin It, If you love this recipe..., , Round-Up, Best Chocolate Desserts for Valentine’s Day (& Beyond!), Round-Up, Magical Holiday Breakfast Ideas, Recipes, Easy Winter Fruit Salad (1 Bowl!), Round-Up, 60 Reader-Favorite Holiday Recipes, , , Reader Interactions, , , Leave a Comment & Rating!, Cancel reply, Have a question?, Use ctrl+f or ⌘+f on your computer or the \"find on page\" function on your phone browser to search existing comments! Need help?, Check out this tutorial!, Comment:, , My Rating:, , , , My Rating:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , I Made this, I Have a Question, , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., You will not be subscribed to our newsletter list., , , , Δ, , , All comments, I made this, Questions, , , , , , FelinaKusinera, , says, , , March 15, 2025 at 10:01 am, , , , I’ve been a longtime follower, I bought yr book or my VG daughter 8 yrs ago and is the most used and earmarked book for refernce.  However i have a son who has cashew allergies, any substitutes for cashew?  I’ll most likelly make this anyway for my daughters <3, God bless, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 17, 2025 at 10:04 am, , , , Aw, thank you for your support! Cashews are pretty key in this recipe for texture and taste, but macadamia nuts would be the next best option. We also have a lemon bar recipe, here, that you could use any type of milk in. Hope this helps. xo, , , Reply, , , , , , , , , , natalie, , says, , , February 25, 2025 at 1:52 pm, , , , Any substitute  for the oats?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 25, 2025 at 4:02 pm, , , , Hi Natalie, another reader mentioned subbing almond flour with success! Otherwise, perhaps quinoa flakes, but you may need to compensate with a little more sweetener since oats have a slightly sweet flavor and quinoa flakes are more bland. Hope that helps!, , , Reply, , , , , , , , , , Jake, , says, , , December 8, 2024 at 1:40 pm, , , , This was fantastic! I opted for a graham cracker crust, but otherwise made it as written with a little extra lemon zest. For my taste it was perfect",
        "Kit Kat Bars": "Ingredients: , , There are SO many reasons to love these homemade Kit Kats and here are a few recipe highlights worth mentioning..., , Recipe Highlights, , , vegan:, these Kit Kats are vegan friendly, meaning dairy free and egg free and made without any animal products., , paleo:, although my recipe calls for peanut butter, you can makes these homemade kit kat bars without peanut butter by substituting with, sunbutter, .  In addition, this recipe is grain free, dairy free and refined sugar free - perfect for a paleo dessert., , dairy free:, made without butter and uses dark chocolate, no milk chocolate, , easy to make:, although this recipe does require some assembly, it is easy to make.  Simply make the cookie dough, roll, cut and bake the cookies.  Then sandwich them between fudge and coat in dark chocolate., , , The end result is a healthy Kit Kat recipe with the perfect crunch and a mouthwatering flavor., , This recipe can even be made allergy friendly (gluten free, nut free, egg free, dairy free, soy free) by swapping the almond flour for tigernut flour and the peanut butter for sunbutter., , , , Here's a list of what you'll need to make these gluten free Kit Kat candy bars:, , For the Cookies, , , blanched almond flour, (or, tigernut flour, for nut free), , coconut sugar, , ground flax, , salt, , melted coconut oil, , water, , vanilla extract, , , For the Filling, , , creamy peanut butter (or, sunbutter, ), , dark chocolate, , , For the Coating, , , dark chocolate, , coconut oil, , , If you need these to be nut free Kit Kats, then substitute the almond flour for tigernut flour and swap the peanut butter for sunbutter.  These are simple swaps that don't change much of the taste, texture or flavor., , Another thing to note, you can use any cut-out cookie recipe in place of the one I used.  You just need to make sure the cookie dough can be rolled thin.  Also, a crunchy cookie recipe is best., , For the ground flax, I always make my own by grinding, whole flax seeds, in a, coffee grinder, .  This ensures a fresh, finely ground flax \"flour\"., , , How to Make Healthy Kit Kats, , Like I mentioned earlier, this healthy Kit Kat bar recipe is easy to make but does require some assembly.  Here's what you need to do:, , First, preheat your oven to 350 degrees F., , Make the Cookies, , Next, coconut sugar, ground flax and salt.  This recipe does not contain any baking soda, as you want the cookies to hold their shape - no rise needed., , Then, water and vanilla.  First mix with the dough with a spatula, then use your hands to knead it., , Once the dough is well combined, roll it between two sheets of parchment paper using a rolling pin.  The parchment paper will allow you to roll the dough super thin without it sticking to the surface or the rolling pin.  You want the cookies to be about ⅛\" thick., , Use a knife or pizza cutter to cut the cookies into rectangles about 3.5\" x 0.75\".  Remove the excess dough and set it aside.  (You'll re-roll it to make more cookies.), , Next, transfer the cookie dough on the parchment paper to a baking sheet (keeping the cookies on the parchment).  Bake them at 350 degrees for 8-10 minutes.  They will darken in color and should turn out crisp once fully cooled., , After baking the cookies, remove them from the oven and use a knife or pizza cutter to spread the cookies apart.  Let them cool on the pan for 5-10 minutes, then transfer them to a wire cooling rack., , , Make the Fudge Filling, , After the cookies have cooled, make the fudge filling., , Melt the dark chocolate, then stir in the peanut butter.  I melted my chocolate on the stove top, over low heat.  You may also use the microwave., , Cool the fudge mixture for about 10 minutes before spreading it onto the cookies (It should be thick like frosting)., , Assemble Cookies, , Each Kit Kat has 3 cookies.  Two cookies will be topped with the fudge filling.  So: cookie, fudge, cookie, fudge, cookie., , Once assembled, place the cookies on a baking sheet or large plate and pop in the freezer for 15 minutes.  This allows the fudge filling to harden and will make dipping the Kit Kats in dark chocolate much easier., , Coat in Dark Chocolate, , Lastly, make the dark chocolate coating.  Place the dark chocolate and coconut oil in a small saucepan and melt over low heat, stirring frequently.  (Another option is to melt them in the microwave.), , Once melted, grab the cookies from the freezer and dip them into the melted chocolate., , Here's how I do it: drop a cookie into the chocolate.  Use a fork to rotate the cookie until it is fully coated.  Using the fork, lift the cookie out of the chocolate and allow excess chocolate to drip off, back into the pan.  Then, place the dipped cookie onto a parchment-lined baking sheet to set., , Drizzle any remaining chocolate over the dipped bars., , You can pop the Kit Kats in the fridge or freezer for a few minutes to fully set., , , Storage, , These paleo Kit Kats are best kept in the fridge or freezer.  Like many of my recipes, I prefer leftovers straight from the freezer.  (They keep nice and crisp this way.), , Store the Kit Kats in a sealed container or baggie.  They'll last up to two weeks in the fridge or up to two months in the freezer., , , Frequently Asked Questions, , , Here's what is in a conventional Kit Kat candy bar:, , \"Milk chocolate (sugar, cocoa butter, cocoa mass, whey powder, lactose, soya lecithin, polyglycerol polyricinoleate, natural flavour), wheat flour, sugar, modified palm oil, cocoa, sodium bicarbonate, soya lecithin, yeast, natural flavour.\", , And here's what I use in my Kit Kat recipe:, , Dark chocolate, almond flour, coconut sugar, ground flax, salt, coconut oil, water, vanilla extract, peanut butter., , Why are Kit Kats unhealthy?, , Looking at the conventional Kit Kat ingredient list, it's easy to point out why Kit Kats aren't healthy.  First off, they contain milk chocolate which uses conventional dairy, is loaded in sugar and contains emulsifiers and \"natural flavour\" (which could be derived from all sorts of unhealthy substances)., , Kit Kats also contain non-organic wheat flour, which most likely contains glyphosate and is disruptive to the gut., , Basically, Kit Kats provide no nutritional benefit and are loaded with refined sugar, conventional dairy, emulsifiers and preservatives., , Are Kit Kats gluten free?, , Kit Kats are not gluten free, but my recipe is!, , How do you make this recipe nut free?, , These can be nut free Kit Kats by substituting the almond flour for tigernut flour and swapping the peanut butter for sunbutter., , , More Homemade Candy Bar Recipes, , , Homemade Protein Snickers Bars, , Healthy Twix Bars, , Chocolate Covered Fig Bars, , Mounds Bars, , , Enjoy!, , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , , Healthy Kit Kat Recipe (Gluten Free, Vegan), , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 5, from, 1, review, , , , , , , Author:, , Katie, , , Prep Time:, , 40 minutes, , , Cook Time:, , 8 minutes, , , Total Time:, , 48 minutes, , , Yield:, , 11, -, 12, Kit Kat Bars, 1, x, , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , Description, , , These homemade Kit Kat bars are a healthy spin on the original version.  They're crispy, crunchy and absolutely delicious!  Gluten Free, Vegan and Paleo., , , , , , , , , , , , Scale, , 1x, 2x, 3x, , , , , , Cookies, , , 1 ¼ cup, , blanched almond flour, (or, tigernut flour, ) (, 115g, )*, , 3 Tbsp, , coconut sugar, , 1 Tbsp, ground flax**, , ⅛ tsp, salt, , 3 Tbsp, melted coconut oil, , 1 Tbsp, water, , 1 tsp, vanilla extract, , , Fudge Filling, , , 2 Tbsp, dark chocolate, , 3 Tbsp, , peanut butter, (or, Sunbutter, ), , , Chocolate Coating, , , 1 cup, dark chocolate (, 5oz, ), , ½ Tbsp, coconut oil, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , coconut sugar, ground flax and salt., , , , water and vanilla. First mix with the dough with a spatula, then use your hands to knead it., , , , Roll the dough between two sheets of parchment paper using a rolling pin. The cookie dough should be about ⅛\" thick., , , , Use a knife or pizza cutter to cut the cookies into rectangles about 3.5\" x 0.75\". Remove the excess dough and set it aside. (You'll re-roll it to make more cookies.), , , , Transfer the cookie dough on the parchment paper to a baking sheet (keeping the cookies on the parchment). Bake them at 350 degrees for 8-10 minutes., , , , Remove them from the oven and use a knife or pizza cutter to spread the cookies apart. Let them cool on the pan for 5-10 minutes, then transfer them to a wire cooling rack., , , , Fudge Filling, , , Melt the dark chocolate, then stir in the peanut butter., , Cool the fudge mixture for about 10 minutes before spreading it onto the cookies (It should be thick like frosting)., , Each Kit Kat contains 3 cookies and two layers of fudge.  Assemble the cookies and then set them on a lined baking sheet and place them in the freezer to set., , , Chocolate Coating, , , Place the dark chocolate and coconut oil in a small saucepan.  Melt over low heat, stirring frequently., , Grab the cookies from the freezer and dip them, one at a time, into the melted chocolate., , Place the cookies back on the lined baking sheet to set., , Drizzle any remaining chocolate over the cookies., , , , , , , , Notes, , , *Substitute, tigernut flour, for a nut free version., , **I make my own ground flax by grinding, whole flax seeds, in a, coffee grinder, ., , , , , , , , Did you make this recipe?, , Tag, @bakeit.paleo, on Instagram and hashtag it, #bakeitpaleo, , , , , , , , «, Vegan Buckwheat Pumpkin Pancakes (Paleo), Healthy Apple Walnut Muffins (Paleo), », Reader Interactions, Comments, , , , , , Carol, , , November 01, 2021 at 7:18 pm, , , , I made these for Halloween. They are FANTASTIC! Thank you!, , , , Reply, , , , , , , , Ryan Wright, , , September 26, 2022 at 6:38 pm, , , , Where are the nutrition facts?, , , Reply, , , , , , , , , , marci, , , February 16, 2023 at 5:41 pm, , , , these look amazing...any sub fir the flax seeds as i do not tolerate them?  thanks 😊, , , Reply, , , , , , , , Katie, , , February 16, 2023 at 6:58 pm, , , , Ground chia seeds should work.  If you can't have those either, psyllium husk or gelatin may be appropriate alternatives, , , Reply, , , , , , , , , , Sheila, , , November 09, 2023 at 9:55 am, , , , Made these today. I used a blend of tigernut and almond flours, because I didn't have enough tigernut. The final product is a bit \"grainy\" and definitely has coconut taste. The chocolate tastes good, especially if you like peanut butter in your chocolate. These don't taste like Kit Kats at all, but at least they're healthier., , , Reply, , , , , , , , Katie, , , November 09, 2023 at 1:26 pm, , , , Tigernut flour tends to be a bit grainy, so that's probably why the kit kats turned out that way.  Hope you enjoyed them even though they aren't quite the real deal 😉, , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, , , , Hi there!, , I'm Katie and I have a passion for baking healthy treats using real, all gluten free and dairy free. My mission is to make baking nutritious, delicious, simple and family friendly., , , More about me, , , , , Subscribe, , Sign up for my mailing list to get early access to discounts, new recipes and more!, , , Subscribe here!, , , , Cereal, , Cereal is typically anything but healthy... not, Lovebird, ! It's all organic, paleo, plant based AND low in sugar. My kids love it too!, , , Popular, , Brownie Protein Bites (Gluten Free, Paleo), Healthy Coffee Cookie Cups (No Bake, Gluten Free), Almond Flour Banana Bread (Gluten Free, No Sugar), Healthy Banana Blondies (Gluten Free, Paleo), , , , , Footer, , ↑ back to top, , , , , , , About, , , About, , Privacy Policy, , Disclaimer, , Terms & Conditions, , , , , Recipes, , , Paleo, , Vegan, , Whole30, , Nut Free, , , , , Search, , Search, , , , link to Instagram account, , link to pinterest account, , link to facebook, , , , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2025 - Powered by Feast+, , , , , , , , , , Instructions: , , , Cookies, , , Preheat oven to 350 degrees F., , ",
        "Vegan Lemon Bars": "Ingredients: , , Classic lemon bars without any eggs? Yup! Today I’m sharing what I think are the best vegan lemon bars, with the perfect balance of shortbread crust to tart lemon filling. And of course, a generous dusting of powdered sugar on top!, , If you are a lemon dessert fan, you will love these little squares of sunshine. And while you’re at it, you might want to try my, vegan lemon cake, , , lemon loaf, or, 1 bowl lemon cupcakes, ., , , How to make Vegan Lemon Bars:, , , First, make the crust., In a medium bowl, mix together the melted vegan butter, sugar and salt. Add the flour and stir to combine. It will be thick. Press it into the prepared pan (lined with parchment paper) evenly and smoothly. Bake for 16-18 minutes at 350 degrees F until lightly golden on the edges., , , While the crust bakes, make the lemon filling., In a medium saucepan, add the lemon juice, lemon zest if using, sugar, coconut milk and cornstarch (+tiny pinch of turmeric if desired for color). Whisk well to dissolve the cornstarch, and heat over medium heat until the sugar dissolves and the mixture thickens. It should look like the photos below, and can take 5-10 minutes., , Remove from heat, and spread lemon mixture over the crust, evenly, using a spatula if needed. Bake for 15 minutes. Let the bars cool for about 30 minutes at room temperature, then transfer to the refrigerator to cool another 1-2 hours, or overnight., , , Can I make these lemon bars gluten free?, , I haven’t personally tried these gluten free, but I think it would work with a quality all purpose gluten free flour mix, such as Bob’s Red Mill 1:1 Baking Flour., , How long will vegan lemon bars keep?, , They will keep for about a week in a covered container in the refrigerator. They also freeze really well! The powdered sugar will melt into the bars though, so add some fresh when you want to eat or serve them., , Can you make these a day ahead?, , Yes, these are the perfect dessert to make a day in advance, as they slice better when they have a lot of time to cool. That being said, they can also be ready in an hour or 2, but they may not be as firm as if you left them overnight., , , I hope you LOVE these easy Vegan Lemon Bars! If you are looking for more delicious vegan dessert recipes with a Summer vibe, check these out:, , , Vegan Lemon Loaf, , Vegan Lemon Cake, , 1 Bowl Vegan Lemon Cupcakes, , Vegan Strawberry Pie, , Vegan Smores Cookie Bars, , , , , , , 4.80, stars (, 189, ratings), , Vegan Lemon Bars, , The most incredible Vegan Lemon Bars, , Prep:, 15, minutes, , mins, Cook:, 35, minutes, , mins, Chilling time:, 2, hours, , hrs, Total:, 2, hours, , hrs, , 50, minutes, , mins, Servings:, 16, , bars, , , , Print, , Pin, , Comment, , Save, Saved, , , US Customary, Metric, , 1x, 2x, 3x, Shortbread crust:, ▢, 1/2, , cup, , vegan butter, melted, ▢, 1/4, , cup, , granulated sugar, ▢, 1, , cup, , all purpose flour, ▢, 1/4, , teaspoon, , salt, Lemon filling:, ▢, 3/4, , cup, , lemon juice, , from about 4 large lemons, ▢, optional:, , 2 teaspoons, , lemon zest, ▢, 1 1/2, , cups, , granulated sugar, ▢, 1 1/4, , cups, , full fat coconut milk, using mostly the white part, ▢, 6, , tablespoons, , cornstarch, ▢, tiny pinch of turmeric, optional for color (1/8th teaspoon), For serving:, ▢, powdered sugar, for dusting the tops, , , , Reply, , , , , , , , Nora, , says:, , , , October 31, 2024 at 7:27 am, , , , , Is it actually super liquidity still, like juice? It should thicken quite a bit in the pan, then it firms up considerably as it chills. You are using cornstarch that isn’t old or doesn’t work for any reason? Cornstarch when mixed and heated with liquid thickens. And then, because you are using coconut milk, when you chill the mixture, maybe it’s just not getting hot enough., , , Reply, , , , , , , , , , , , , , Lucy, , says:, , , , July 13, 2024 at 8:45 am, , , , , Any chance a can use some lemon juice concentrate?, , , Reply, , , , , , , , Nora, , says:, , , , July 14, 2024 at 7:58 am, , , , , I’m not sure how they will taste or turn out. I’ve only used fresh lemon juice., , , Reply, , , , , , , , , , Rubi reyes, , says:, , , , July 4, 2024 at 5:16 pm, , , , , , , , I want to try to make these.  Can I use regular chaboni oat milk?, , , Reply, , , , , , , , Nora, , says:, , , , July 5, 2024 at 7:24 am, , , , , You can, yes., , , Reply, , , , , , , , , , Alyssa, , says:, , , , June 26, 2024 at 11:21 am, , , , , This sounds delicious! Can I substitute vegan cream or condensed milk for the coconut milk?, , , Reply, , , , , , , , Nora, , says:, , , , June 26, 2024 at 4:20 pm, , , , , Thanks! I think you could use vegan cream or another vegan friendly milk, but I’m not sure condensed milk will work so well. I like full fat oat milk in place of coconut milk., , , Reply, , , , , , , , , , Lisa, , says:, , , , June 23, 2024 at 5:36 am, , , , , , , , I think some people arent cooking their mixtures long enough. I even used light coconut milk cause that’s what I had on hand and it still came out perfectly.  Set up and stayed firm! Absolutely delicious., , , Reply, , , , , , , , Joni, , says:, , , , June 18, 2024 at 6:53 am, , , , , , , , Once again Nora cooks has created a wonderful recipe!!, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , June 18, 2024 at 8:37 am, , , , , Hi Joni.  Thanks for your wonderful review and feedback!, , , Reply, , , , , , , , , , Ashley, , says:, , , , June 16, 2024 at 8:27 am, , , , , , , , My 5-year-old daughter and I made these for my lemon-loving husband and they came out great. Bright and flavorful!, , , Reply, , , , , , , , Roxanne, , says:, , , , June 12, 2024 at 10:39 pm, , , , , , , , Being a huge lemon bar fan, I was skeptical that a vegan version could be delicious.  I made them this evening and everything worked perfectly.  The lemon curd set up perfectly and I took a taste, and it was delicious.  They are in the fridge, cooling right now.  I will be serving them tomorrow along with a vegan lunch.  So thrilled to have this as an alternative to traditional lemon bars.  For those saying that their lemon curtains set, , , Read More About Me, , , , , , , , , , , , , , Most Popular, , , , , , , , Cake, , The Best Vegan Chocolate Cake, , , , , , , Bars and Brownies, , Best Ever Vegan Brownies Recipe, , , , , , , Side Dishes, , The Best Vegan Cornbread, , , , , , , Main Dish, , The Best Vegan Lasagna, , , , , , , as featured in…, , , , , , , , , , , , , , , , , , , , Back to top, Nora Cooks, , , Recipe Index, , About, , Contact, , Privacy / Disclosure, , Cookie Policy, , ©, 2025 Nora Cooks., Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , Instructions: Preheat the oven to 350 degrees F and line an 8 by 8 inch pan with parchment paper, leaving a little overhang for easy removal., Make the crust:, In a medium bowl, add the mix together the melted vegan butter, sugar and salt. Add the flour and stir until combined. The dough will be thick. Press it into the pan with your hands, evenly and firmly. Bake for 16-18 minutes until the edges are very lightly browned. Set aside., Make the filling:, In a medium saucepan, add the lemon juice, lemon zest if using for even more lemon flavor, sugar, coconut milk and cornstarch + tiny pinch of turmeric for color, if desired. Whisk well to dissolve the cornstarch. Heat over medium heat, stirring constantly until the sugar dissolves and the mixture thickens. (see photos in post above for reference), Spread the filling over the crust evenly, using a spatula if needed to smooth. Bake for 15 minutes, then remove from the oven and let cool at room temperature for 30 minutes. Transfer to the refrigerator for an additional 1-2 hours, or overnight, until set., Lift the bars out of the pan with the parchment paper, dust generously with powdered sugar and cut into 16 squares., Leftover bars will keep for up to 1 week in a covered container in the refrigerator. They freeze well, too. Enjoy!, , , Notes, , For gluten free vegan lemon bars, use an all purpose gluten free flour, such as Bob's Red Mill 1:1 Baking Flour., , , Nutrition, Serving:, 1, serving, |, Calories:, 203, kcal, |, Carbohydrates:, 32, g, |, Protein:, 1, g, |, Fat:, 8, g, |, Saturated Fat:, 5, g, |, Sodium:, 85, mg, |, Potassium:, 59, mg, |, Fiber:, 1, g, |, Sugar:, 22, g, |, Vitamin A:, 270, IU, |, Vitamin C:, 5, mg, |, Calcium:, 5, mg, |, Iron:, 1, mg, , Course:, Dessert, Cuisine:, American, Author:, Nora Taylor, , , , , Did you make this recipe?, Mention, @nora_cooks_vegan_, or tag, #noracooks, !, , , , , About Nora, , , Read more about Nora, , , , , , , , , , , Posted In:, , Bars and Brownies, , , Dessert, , , Holiday, , , Nut Free, , , Popular Posts, , , Special Dietary Needs, , , Spring, , , Summer, , , , Like this? Share with your friends!, , Pin, Facebook, Tweet, Yummly, Email, , , , , , you may also like:, , , , , , , , Bars and Brownies, , Pumpkin Crumble Bars, , , , , , , Bars and Brownies, , Vegan Carmelitas, , , , , , , Dessert, , Vegan Strawberry Cheesecake Crumble Bars, , , , , , , Bars and Brownies, , Lemon Brownies, , , , , , , , Comments, , , , , , , Rose, , says:, , , , March 30, 2025 at 1:57 pm, , , , , , , , I had high hopes for this recipe, but the combination of coconut milk and lemon juice smelled and tasted foul from the instant I first combined them. I’m going to try this again with a neutral flavored plant milk., , , Reply, , , , , , , , Jasmin Adams, , says:, , , , March 28, 2025 at 10:13 am, , , , , EVERYONE Lovvvvvves them!!!!, I also used part orange juice and it’s very good!, , , Reply, , , , , , , , Mycale, , says:, , , , March 16, 2025 at 3:28 pm, , , , , , , , Great recipe for bright tangy lemon bars!  I had no problems with the crud thickening and the texture was smoooooth., , The first time I made them I added a little vanilla bean paste to the crust and used Bob’s 1:1 gf flour.  Everyone at work loved them.  I just made these for St. Patrick’s Day with key limes instead of lemons and added 1/2c coconut to the gf crust with vanilla bean paste.  I didn’t increase the butter so they might crumble a bit but that’s my fault., , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , March 17, 2025 at 8:53 am, , , , , Hi Mycale.  How fabulous you love the lemon bars!  I love the idea of making lime bars with the recipe!  Thanks for sharing your stellar review and feedback!  Wishing you lots of happy cooking!, , , Reply, , , , , , , , , , Cames, , says:, , , , February 24, 2025 at 1:49 pm, , , , , Can I use almond milk instead of coconut milk?, , , Reply, , , , , , , , Nora, , says:, , , , February 26, 2025 at 7:17 am, , , , , It will work okay, but the filling won’t be as thick., , , Reply, , , , , , , , , , Regina Brooks, , says:, , , , February 11, 2025 at 4:52 am, , , , , , , , So dreamy!, , , Reply, , , , , , , , Dee, , says:, , , , February 6, 2025 at 1:52 pm, , , , , , , , These were beyond delicious.  Best GF dessert I’ve ever made, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , February 7, 2025 at 9:45 am, , , , , I’m so glad you love the lemon bars, Dee!  Thank you for sharing your stellar review!, , , Reply, , , , , , , , , , Caroline, , says:, , , , January 3, 2025 at 1:15 pm, , , , , Made these for some Vegan/gf friends.  Turned out perfectly and were well received.  Sprinked some tops with toasted slivered almond.  Used almond milk with some coconut cream; meyer lemons.   Stirred cornstarch into sugar before adding liquids.  Bring to full boil slowly, stir constantly and cook until filling is clear & thickish., , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , January 4, 2025 at 9:05 am, , , , , Hi Caroline. Thanks for sharing your lemon bar cooking experience!  I’m glad the lemon bars turned out perfectly for you!, , , Reply, , , , , , , , , , Caroline, , says:, , , , January 3, 2025 at 1:12 pm, , , , , Made these for some Vegan/gf friends.  Turned out perfectly and were well received.  Sprinked some tops with toasted slivered almond.  Used almond milk with some coconut cream; meyer lemons.   Stirred cornstarch into sugar before adding liquids.  Bring to full boil slowly and cook until filling is clear & thickish., , , Reply, , , , , , , , Colin, , says:, , , , October 19, 2024 at 5:18 pm, , , , , , , , the filling would simply not thicken up no matter how long i whisked or heated it. not sure what I’m doing wrong., , , Reply, , , , , , , , Nora, , says:, , , , October 21, 2024 at 10:33 am, , , , , Did you make any substitutions at all? Are you using cornstarch? That’s what makes the mixture thicken., , , Reply, , , , , , , , Renae, , says:, , , , November 8, 2024 at 2:13 pm, , , , , , , , I had that too. I ended up turning up the heat like another comment said, and at the point just before the mix started to boil, it thickened up really nicely., , Had to act quickly, though. It started to burn a tiny bit at that point. Probably just too high of heat., , , Reply, , , , , , , , Jonah, , says:, , , , November 18, 2024 at 2:37 pm, , , , , Did you test the temperature with a thermometer? I’m trying this recipe right now and I swore that my mixture was hot enough but it was actually below the temp at which corn starch fully gelatinizes (203F or 95C). Started thickening pretty rapidly after that. Cheers!, , , Reply, , , , , , , , , , Sassafrass, , says:, , , , September 12, 2024 at 5:06 am, , , , , , , , Hi Nora, I’m a huge fan of your recipes! These bars tasted delicious and had just the right amount of tart-ness and lemony-ness. I had a question though, is there a gram measurement for the cornstarch by any chance? I doubled the recipe for these today and it of course doubles to 12 tablespoons, so thinking I could measure this out quicker I looked up how many grams in 1 tbsp of cornstarch with varying results. I then decided to weigh 1 tbsp myself and for 12 tbsp that equated to 150g of cornstarch – it seemed like quite a bit but figured that would be the amount if I did spoon out and level 12 tbsp so went with it. The bars are certainly set! Almost a little too set… They’re on the side of gummy/gelatinous. I’m in Australia so I know some metric measurements are a little different to the US – was this just a case of too much cornstarch or is that how they’re supposed to be? And is there a gram conversion for the cornstarch that I’ve missed somewhere as this would eliminate any errors in the future (and make it so so much easier for us Aussies!). Thanks so much for any advice!, , , Reply, , , , , , , , Nora, , says:, , , , September 12, 2024 at 7:44 am, , , , , Hi there, and thanks for being a fan of my recipes! 🙂 Okay, I checked that out and you’re right, grams were missing for cornstarch. I’ve updated it now to be correct. 6 tablespoons of cornstarch is 48 grams, so even with doubling the recipe, 150g would be too much. I hope that helps for next time!, , , Reply, , , , , , , , Sassafrass, , says:, , , , September 12, 2024 at 2:33 pm, , , , , It absolutely does, thank you SO much!! 😊, , , Reply, , , , , , , , , , , , Madison, , says:, , , , August 17, 2024 at 2:10 pm, , , , , Mine turned out gritty and grainy. The custard was smooth and creamy and then when I took it out of the fridge next day the consistency was totally different. Not sure what went wrong. It still tasted good but the texture was off putting., , , Reply, , , , , , , , Nora, , says:, , , , August 18, 2024 at 6:52 am, , , , , I’m sorry to hear that. I’ve never had that happen myself. Did you stir constantly as it heated? It’s possible tiny granules formed if it wasn’t being stirred constantly. Or is it possible you used really coarse sugar instead of fine, and it just couldn’t break down and melt all the way?, , , Reply, , , , , , , , , , Lori T, , says:, , , , August 13, 2024 at 2:52 pm, , , , , , , , I have made these a few times and they always come out AMAZING!! I actually like them more than the non-vegan!! Just made them again and my can of coconut milk barely had any white, but it was the only can I had and it still came out great….just kept stirring on the stove until it thickened from the corn starch. Thank you Nora!!, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , August 14, 2024 at 5:25 pm, , , , , You are welcome, Lori!  I’m so glad you loved the lemon bars!  Thanks for your wonderful review and feedback!  Wishing you happy cooking!, , , Reply, , , , , , , , , , L., , says:, , , , August 11, 2024 at 6:09 pm, , , , , , , , How long can the lemon bars be frozen?, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , August 12, 2024 at 9:42 am, , , , , They should freeze well for about 3 months., , , Reply, , , , , , , , L., , says:, , , , August 12, 2024 at 11:50 am, , , , , Would they be damaged if frozen for a year?, , , Reply, , , , , , , , Nora, , says:, , , , August 13, 2024 at 7:02 am, , , , , That’s probably too long to freeze them. I wouldn’t recommend more than 3-6 months., , , Reply, , , , , , , , , , , , , , Donna, , says:, , , , July 18, 2024 at 9:07 am, , , , , Hi Nora! I love these bars – one of our favorite desserts! I have leftover coconut cream from another recipe that only used 1/2 cup from a full can. Would that work in place of the white part of full fat coconut milk for this recipe?, , , Reply, , , , , , , , Nora, , says:, , , , July 19, 2024 at 7:29 am, , , , , I’m glad the bars are one of your favorite desserts! Yes, coconut cream works well, you can use it. Thank you!, , , Reply, , , , , , , , Ann, , says:, , , , October 31, 2024 at 4:17 am, , , , , , , Reply, , , , , , , , Mandy, , says:, , , , June 9, 2024 at 7:21 pm, , , , , , , , These were delicious Nora! Thank you for the recipe!, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , June 9, 2024 at 9:34 pm, , , , , You are welcome, Mandy.  I’m so glad you enjoyed them! Thanks for your wonderful review!, , , Reply, , , , , , , , , , Casey, , says:, , , , May 26, 2024 at 5:16 am, , , , , , , , I have made this recipe several times and the only time it didn’t come out is because I used too much of the thin coconut milk v. the white part because I only had 1 can on hand. I find I need two cans of coconut milk to get the full 1 1/4 cup. Or I suppose you could buy 1 can of coconut cream. These bars are always a hit at parties, thanks Nora!, , , Reply, , , , , , , , Sean, , says:, , , , May 17, 2024 at 5:01 pm, , , , , , , , Not much of a cook but made these for a party after I won a lemon from a competition. Worked perfectly for me. Was kind of magical when the lemon filling randomly solidified in 5 seconds on the stove after like 10 minutes of stirring., , , Reply, , , , , Comment navigation, Older Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , , , , Hello, I’m Nora!, , I create vegan recipes that are easy to cook"
    }
}