{
    "ingredients": {
        "Vegan Oreos": "maple syrup, cocoa powder, brown rice flour, coconut milk, sugar, peanut butter, banana",
        "Vegan Nutella": "coconut milk, chocolate chips",
        "Vegan Flan": "sugar, coconut milk, oat milk, besan, sugar, vanilla extract, agar agar powder",
        "Vegan Date caramel": "dates, maple syrup, coconut oil, vegan milk",
        "Vegan Caramel": "brown sugar,almond milk,vegan butter,vanilla extract",
        "Cookie Dough hummus": "chickpeas,oats,cashews,maple syrup,vanilla extract,coconut milk,chocolate chips",
        "Chickpea Brownie Dip": "chocolate chips,coconut oil,chickpeas,maple syrup,coconut milk,cocoa powder,vanilla extract",
        "Chocolate Donuts": "sugar,coconut milk,maple syrup,ghee,egg,vanilla extract,all purpose flour,almond flour,baking powder,chocolate chips,coconut oil",
        "Coconut Macaroons": "shredded coconut,sugar,all purpose flour,egg whites,vanilla extract",
        "Cranberry Orange Biscotti": "sugar,cranberries,egg,orange peel,vanilla extract,whole wheat flour,baking powder",
        "Peanut Butter Hazelnut Cookie Sandwiches": "brown sugar, peanut butter,egg,vanilla extract,all purpose flour, baking powder,nutella",
        "Deconstructed cheesecake dip": "graham crackers,coconut oil, maple syrup,cream cheese,sour cream,vanilla extract,mixed fruits",
        "Nutty Vegan Chocolate Digestives": "oat flour,baking powder,sugar,maple syrup,coconut oil,almond milk,dark chocolate,almonds"
    },
    "recipe_url": {
        "Vegan Oreos": "http://www.feastingonfruit.com/easy-vegan-oreos-gluten-free-oil-free/",
        "Vegan Nutella": "https://bloomingnolwenn.com/vegan-nutella-recipe/",
        "Vegan Flan": "https://dorastable.com/vegan-flan/",
        "Vegan Date caramel": "https://plantbasedjess.com/vegan-caramel-sauce-healthier-recipe/",
        "Vegan Caramel": "https://wallflowerkitchen.com/vegan-caramel-5-minute/",
        "Cookie Dough hummus": "fixate_recipes\\Dessert\\FXR_Cookie-Dough-Hummus_R_09_06_19.pdf",
        "Chickpea Brownie Dip": "fixate_recipes\\Dessert\\FXR-EN-Chickpea_Brownie_Dip-11.2.20-Recipe.pdf",
        "Chocolate Donuts": "fixate_recipes\\Dessert\\FXR-EN-Chocolate_Donuts-6.5.20-Recipe.pdf",
        "Coconut Macaroons": "fixate_recipes\\Dessert\\FXR-EN-Coconut_Macaroons-4.29.21-Recipe.pdf",
        "Cranberry Orange Biscotti": "fixate_recipes\\Dessert\\FXR-EN-Cranberry_Orange_Biscotti-6.1.21-Recipe.pdf",
        "Peanut Butter Hazelnut Cookie Sandwiches": null,
        "Deconstructed cheesecake dip": "fixate_recipes\\Dessert\\FXR-EN-Deconstructed_Cheesecake_Dip-7.30.20-Recipe.pdf",
        "Nutty Vegan Chocolate Digestives": "https://nadiashealthykitchen.com/nutty-vegan-chocolate-digestives/#recipe"
    },
    "Recipe": {
        "Vegan Oreos": "Ingredients: , , My first concern when I got this recipe request was crispy cookie?….how to make a crispy crumbly oil-free cookie? We can’t have soft chewy vegan oreos, then they’d just be whoopee pies pretending., , Based on, these oatmeal cookies, , I knew, maple syrup, had to be involved. And of course, cacao powder, is an integral ingredient too because chocolate. So from there, using my Magic School Bus knowledge, brown rice flour, . Yep, , , Filling your Vegan Oreos, , There’s no better creamy white filling then, coconut cream., However, since I know many of you are high carb vegans, I wanted to include some lower fat options for the filling as well…, , –, Powdered peanut butter., It sounds like a higher fat option, but with powdered peanut butter it’s actually a lower fat way to go!, –, Chocolate peanut butter., Utilize the thickening action of powdered peanut butter to make a chocolate filling. Powdered peanut butter + cacao powder + water., –, Banana., If you size your cookies just right, then one banana coin will sandwich in between two cookies perfectly. It’s almost the right color too!, –, Nicecream., Blend up some frozen bananas, dollop on a cookie, sandwich, freeze, you have an ice cream sandwich! And of course you could make the nicecream any flavor you want–strawberry, chocolate, cinnamon, gingerbread, chocolate chip, lemon, endless ice cream-abilities!, –, Date caramel., My favorite sweet filling or frosting: dates + water., , , I, love, these little sandwich cookies. Fresh from the oven: love them. Cold from the fridge: love them. With cream: love them. Without cream: love them. Three days old and starting to get a little soft: still love them. I hope you love them too!, , , Click To Tweet, , Print, , , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , , Easy Vegan Oreos, , , , , , ★, ★, ★, ★, ★, , 4.5, from, 22, reviews, , , , , , , , , Prep Time:, , 20 minutes, , , Cook Time:, , 9 minutes, , , Total Time:, , 29 minutes, , , Yield:, , 8, cookies, 1, x, , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , , , , , , , Scale, , 1x, 2x, 3x, , , , , , Cookie, , , 1/4 cup, +, 1 tbsp, maple syrup, , 1/2 cup, cacao powder, , 1/4 cup, +, 2 tbsp, s brown rice flour, , , Filling, , , 1, can of full fat coconut milk chilled overnight, , 2, tbsps powdered sugar (store-bought or homemade in the blender), , , Lower fat filling options, , , Powdered peanut butter, , OR powdered peanut butter + cacao powder, , OR, 1, banana (sliced), , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , , Roll into 16 balls. Arrange on a pan (or two pans) lined with parchment paper. Cover with a piece of wax paper and flatten with the bottom of a cup or jar to about 1/2 inch thickness, , Bake for 8-10 minutes at 350F., , Let them cool, they will become crispy as they cool., , Filling:, Scoop out the cream from the can of coconut milk leaving behind the liquid. Add the powdered sugar and whisk till smooth and creamy., , Spoon onto your cookie, smush, and enjoy! Keep any leftovers int the fridge for up to 3 days., , , , , , , , , , Did you make this recipe?, , Tag, @feastingonfruit, on Instagram, , , , , , , , , , Pin, Share, Tweet, Email, , Related Posts, , , , , , Vegan Pumpkin Spice Oreos, , , , , , Chocolate Crinkle Cookies, , , , , , Crispy Chocolate Chip Cookies, , , , , , Easy Vegan Peanut Butter Cookies, , , , Pin, Share, Tweet, Email, , vegan, , , chocolate, , , gluten-free, , , easy, , , cookies, , , sweet, Previous Post:, « Vegan Lemon Poppy Seed Muffins, Next Post:, Oil-Free Cinnamon Rolls (Vegan + GF) », Recipes to your inbox, , enter your email to get on the list!, , , , , , , , , , , Related Posts, , , , , , Vegan Pumpkin Spice Oreos, , , , , , Chocolate Crinkle Cookies, , , , , , Crispy Chocolate Chip Cookies, , , , , , Easy Vegan Peanut Butter Cookies, , , , , Reader Interactions, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , ★, 5 Stars, , , ☆, , , , , ★, 4 Stars, , , ☆, , , , , ★, 3 Stars, , , ☆, , , , , ★, 2 Stars, , , ☆, , , , , ★, 1 Star, , , ☆, , , , , , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., Comments, , , , , , Leah M @ love me, feed me, , says, , , March 11, 2016 at 5:03 pm, , , , Nowwwww I want to watch Magic School Bus and snack on these beauties haha! Would make for a perfect Friday night in my opinion. Loooove how simple these are! I just got brown rice flour too, so these are definitely going to happen soon and I cannot wait!, , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 8:31 pm, , , , Sounds like a party to me haha! No but really, I totally be down for that 😀, , , Reply, , , , , , , , Lisa McCullough, , says, , , February 25, 2017 at 3:43 pm, , , , ???. Magic school bus ❤. Used to watch that with my boys when they were little ✌?, , , Reply, , , , , , , , Petra Yomanda, , says, , , June 8, 2017 at 5:47 am, , , , HELP. I AM A VEGAN BUT I LOVE MEAT. WHAT TO DO???!!!, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Anna Horen, , says, , , August 19, 2017 at 6:42 pm, , , , not be vegan, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Annika, , says, , , August 25, 2018 at 3:09 pm, , , , I used to love meat, but don’t anymore. In my case, I just got a bit disgusted by the thought of it. Try seasoning meat alternatives with the same spices as you used to season your meat, because plain meat isn’t what you like. Also don’t trap yourself in this mindset. Most vegans used to love meat and cheese. We eat them for so long we become accustomed. Also make sure you reward yourself for eating consciously and sacrificing something you like for the greater good of everything. Ask yourself if you love meat or animals more, maybe. Just make sure you always remember your reasons for going vegan. Try to associate living animals with meat in your mind. That way there will never be disconnect, and you won’t fall under a sick illusion., , , Reply, , , , , , , , Evelyn, , says, , , October 14, 2018 at 5:28 pm, , , , There is a documentary on YouTube called “Dominion”. Watch that, and you will never want meat again. 😭 Soy curls, jackfruit, tofu, eggplant, and tempeh are all great replacement!, , , Reply, , , , , , , , Laney, , says, , , June 23, 2019 at 4:16 am, , , , Watching documentaries about animal abuse and conscious eating isn’t the only way – maybe you are having certain cravings because you need comprehensive nutritional testing that will personally profile your nutritional levels.   My integrative/functional MD ordered one (which is covered by my insurance since a Medical Doctor ordered it – you will pay for most testing ordered by non-MD’s out of pocket even if it is covered) and I’m super excited because I’ve been having major problems gaining muscle!   I suspect low amino acids are imbalanced among other things.  After receipt of test results, I’ll be able to fill all the nutrition gaps via supplements and/or diet!, , , Reply, , , , , , , , , , , , Mandy, , says, , , March 11, 2016 at 5:34 pm, , , , WHOA!!!! I came to your blog to pin those cinnamon rolls, , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 8:34 pm, , , , I kinda can’t believe it either! I really thought it’d be a complete fail, I made like a 4 cookie batch to start while I was testing it and was totally shocked that they actually baked into cookies not just weird blobs. Ahh yes Willow my fellow fanatic, she would love these I think! I never even ate my oreos by separating them, but ya know…tradition 😀, , , Reply, , , , , , , , , , Nicola, , says, , , March 11, 2016 at 6:33 pm, , , , Oh wow I can’t wait to try these! This is probably the first recipe I have come across for homemade oreos that are actually baked and without oil? Wow, just wow! Now to get  some brown rice flour…, , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 8:21 pm, , , , I wasn’t sure the oil free part was going to be possible and still have that Oreo texture, but thank goodness for maple syrup! I hope you try them 🙂, , , Reply, , , , , , , , Sammy, , says, , , May 26, 2018 at 6:46 pm, , , , Is there any chance I can sub the brown rice flour for almond or oat flour?, , , Reply, , , , , , , , Natalie, , says, , , May 27, 2018 at 8:54 am, , , , Oat flour will make for a much chewier cookie so I don’t recommend it. Almond flour may work, but you will need probably double the amount. Good luck!, , , Reply, , , , , , , , , , , , Tori des, , says, , , November 4, 2018 at 3:59 pm, , , , Can I use coconut flour????? How would I substitute it, , , Reply, , , , , , , , Natalie, , says, , , November 4, 2018 at 8:38 pm, , , , Not for this one, it’s too crumbly they will just fall apart😕, , , Reply, , , , , , , , Kim, , says, , , December 8, 2018 at 4:34 pm, , , , What about gluten free flour ?, , , Reply, , , , , , , , Natalie, , says, , , December 8, 2018 at 5:32 pm, , , , You could try it, but I think it will still make them more chewy and less crisp!, , , , , , , , , , , , , , , , , Veera R., , says, , , March 11, 2016 at 7:16 pm, , , , Wow! I can hardly wait it’s morning here and I can go to by brown rice flour. I don’t think it’s possible to have any left overs of these though., , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 8:18 pm, , , , Nope, no way! In fact I might suggest doubling the batch there weren’t enough. I can’t wait for you to try them 🙂, , , Reply, , , , , , , , , , Rebecca @ Strength and Sunshine, , says, , , March 11, 2016 at 7:34 pm, , , , These are just little chocolatey pillowy cakes with fluffy white cream between <3 So funny since I knew these were coming and another blogger friend posted gf/vegan oreos and I was like wow! Double recipe love <3, You know what I always hated about them though was that they cracked and crumbled so you could not just bite in.. You HAD to remove one cookie to eat it effectively which I guess was the point!, OOO do you remember those 200 cal packs of :oreo thins\" those were so gross! It was like a stale chocolate disc of sadness speckled with a few white dots of who knows what!, But I did always weirdly like the mini oreos (not the 100 cal ones) but the small bite sized ones that were always all destroyed in the package and seemed to be given out at school, parties, or Halloween. For some reason I thought they tasted best!, Okay…sorry for this novel of a comment 😉 xoxoxo, , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 8:16 pm, , , , Who else posted oreos, I’d love to check them out? I never took my oreos apart actually, always a biter! The secret to the clean crumbly cookie bite is to suck in a little bit as you bite so you can not drop any crumbs! Try it next time, it works. And I LOVED the oreo thins!!! Those were my favorite, I actually think I liked them better than actual oreos. I have no clue what the white stuff was either, probably just sugar, but those were the bomb haha! Not sad to me! Mini oreos were awesome too, more cream I think plus just the bite size means no mess 🙂, , , Reply, , , , , , , , , , Aimee / Wallflower Girl's Kitchen, , says, , , March 11, 2016 at 8:30 pm, , , , You are amazing! Your ability to create healthy yet simple recipes is so inspiring! I love these. Especially the peanut butter option 🙂, , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 8:37 pm, , , , Thank you Aimee! The PB was great, I kinda want to make a mint version now too 🙂, , , Reply, , , , , , , , , , Kaila@HealthyHelperBlog, , says, , , March 11, 2016 at 9:58 pm, , , , Magic School Bus?! LOVE., , , Reply, , , , , , , , Natalie, , says, , , March 11, 2016 at 10:16 pm, , , , YESSSSS!!! I remember cakesters! Those were the bomb, I remember when they were like the coolest thing to have in you lunch box 😀 These do look like them! They aren’t that soft, much more crunchy, but totally lookalikes! Wow you just brought back so many memories in my head ha! Magic school bus was the bomb, I still have it on DVD lol…that’s nerdy 😀 Thanks girl!, , , Reply, , , , , , , , , , Kat, , says, , , March 11, 2016 at 11:00 pm, , , , I’ve said it before and I’ll say it again. YOU ARE MY HERO! Love all of your recipes! Keep them coming 😀, , , Reply, , , , , , , , Natalie, , says, , , March 12, 2016 at 2:54 am, , , , Thanks Kat, you are so sweet! I appreciate all the support <3, , , Reply, , , , , , , , , , Faith VanderMolen, , says, , , March 12, 2016 at 3:47 am, , , , Beautiful photos!! And cookies of course:) So YUM!, , , Reply, , , , , , , , Natalie, , says, , , March 12, 2016 at 4:08 am, , , , Thank you Faith 🙂, , , Reply, , , , , , , , , , Hiroshi, , says, , , March 12, 2016 at 4:49 am, , , , Hello. Is it possible to make without brown rice flour? I’m not sensitive to gluten, and I only have spelt flour at the moment. Thanks., , , Reply, , , , , , , , Natalie, , says, , , March 12, 2016 at 5:22 pm, , , , You can certainly try other flours, my only concern is the cookie might not be quite as crispy. Brown rice flour doesn’t absorb much moisture so it make for a great crisp texture. The spelt flour might make them a little chewier, but they will still taste fine!, , , Reply, , , , , , , , Cecilia Arvidsson, , says, , , October 18, 2016 at 8:43 am, , , , I’ll try them with regular (white) rice flour. Can’t find the brown stuff anywhere around here (smalltown in the south of Sweden:)., , , Reply, , , , , , , , Natalie, , says, , , October 18, 2016 at 2:51 pm, , , , It is certainly worth a try! Let me know how it goes 🙂, , , Reply, , , , , , , , , , , , , , Kyra @ Vie De La Vegan, , says, , , March 12, 2016 at 11:31 am, , , , Oh my gosh Nat, you’ve blown my mind with how EASY these cookies are! And I love those filling options – how perfect are banana coins 😀, I loved the Magic School Bus too haha, I wonder if I can find the episodes on Youtube or somewhere…it would be fun to show my kids “this what what I used to watch on TV!” 😀, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 12, 2016 at 5:26 pm, , , , The cookies blew my mind too! And the moment when I though “hey, a banana coin would work!” yeah that was pretty happy-making too 🙂 So Magic School Bus was international then?? Wow, who knew! I still have a few episodes on dvd, but i’m sure its online somewhere. That was a great show…although your kids will probably think its weird because that what I thought when my parents would show me what they used to watch haha! It’s the generational thing, we can never agree on music or tv or movies 😀, , , Reply, , , , , , , , , , The Vegan 8, , says, , , March 12, 2016 at 1:50 pm, , , , I used to LOVE oreos! Love the rich chocolatey cookie with a sweet cream center…I could never stop at one though and would eat half the bag, LOL! I love that you used brown rice flour, that is the exact flour I used in my classic chocolate chip cookies to get that crispy exterior as well, my exact reasoning, so I know these would be crispy too, YUM YUM. And oreos have to be crispy! These would be great with the peanut butter or heck, even a chocolate ganache, you know for major chocoholics like myself, lol! Oooh that’s giving me ideas. I’m not really a fan of coconut cream because of the strong coconut flavor, so I love that you added a peanut butter option. Great and simple recipe Natalie!, , , Reply, , , , , , , , Natalie, , says, , , March 12, 2016 at 5:32 pm, , , , I used to love them so much too! I ate them in my school lunch mostly so that was good portion control since my mom only sent 2 haha! The brown rice flour is perfect for crispy things! I knew oat wouldn’t work and BR was the only other one I had on hand when I was making these at like 8pm at night, but logically it makes sense. There are lots of times when I hate brown rice flour in breads and things, but here it’s perfect. I wish they would stay crispy though, have you noticed that. The maple syrup thing works, but after a couple of days they are soft 🙁 Kinda like tiny whoopee pies, so still good but not as oreo perfect. GANACHE!!! That’s a great idea, you chocoholic brain works in delicious ways 🙂 Thanks Brandi!, , , Reply, , , , , , , , The Vegan 8, , says, , , March 12, 2016 at 6:03 pm, , , , Haha! Chocoholic brain….sooo funny! Yup, it’s always “on” LOL. Yes, I know what you mean, most cookies don’t stay crispy very long, especially non-fat ones, but that’s ok, just eat them faster 🙂, , , Reply, , , , , , , , , , , , Peanut Butter & Ellie, , says, , , March 12, 2016 at 9:12 pm, , , , Natalie these look amazing (per usual), Magic School Bus + Oreos was such a great combination when I was younger, and I’m sure it would be now too (but sub the packaged 5000 ingredient Oreos for these 4-5 ingredient ones!). Now I want to watch Magic School Bus! I loved the episode when Arnold was sick and they went inside him- it was so cool to a science nerd like me! I want to see the Haunted House one now… Is it on Netflix?? Haha., , , Reply, , , , , , , , Natalie, , says, , , March 13, 2016 at 3:45 am, , , , Well you are Peanut Butter and Ellie so I can’t blame you 😀 I thought about using real pb, but I was worried it might be too runny :/ All I have is one of those natural ones, I need some Justin’s or something with some staying power! I don’t think I ever ate Oreos while watching magic school bus because I ate most of my oreos in school lunches but it sounds like a great afternoon! And I’d totally still be down for that 😀 I liked the arnold one too! The one where he ate too many carrots and turned orange right? And the frog one! And the recycling one! And the outer space one! So many good ones, it would be fun to rediscover them now. Idk if they are on netflix, they should be so children of today can experience the magic lol! Thanks for nerding out with me <3, , , Reply, , , , , , , , Peanut Butter & Ellie, , says, , , March 13, 2016 at 6:54 pm, , , , Hehehe true- I need my peanut butter!  Sometimes I’m “bad” and use regular (like Jif) peanut butter- it’s definitely not as good for me as natural pb is, but it’s cheaper and (not going to lie) yummier, especially straight out of the jar!, That’s so cute that your mom put 2 Oreos in your lunch! My mom always put a piece of candy or something in mine (never Oreos though! I had to go to a friend’s house to get Oreos 🙁 ). My favorite was when she had time to bake and she’d put 2 homemade chocolate chip cookies in my Ariel lunchbox along with a note! Ahh I miss elementary school and having my mommy pack my lunch for me (pb&j, fruit, and dessert, which is STILL my go-to packed lunch lol)., Hahaha I love the one where he ate too many carrots and turned orange because that’s basically my life. One of these days I’m going to post a picture of my feet (right after I get a pedicure hahaha) on my blog because they’re straight-up ORANGE., Okay I REALLY want to have a blogger meet up and bake and eat Oreos and watch “Magic School Bus” (and maybe “Cupcake Wars” too since we’re food bloggers?) xoxo, , , Reply, , , , , , , , Peanut Butter & Ellie, , says, , , March 13, 2016 at 6:55 pm, , , , Also sorry for the novel comment. That’s our thing, though, right?! 🙂, , , Reply, , , , , , , , Natalie, , says, , , March 13, 2016 at 7:34 pm, , , , Totally our thing lol 😀 Have you ever tried the Peanut Butter and Company PBs? They are really close to the “regular” ones I’ve found. I don’t blame you, the texture of regular PBs is so much better to me, I hate when they get all oily. Perhaps it’s just because I was raised on Peter Pan lol! I always loved homemade baked things in my lunch box better too! I actually really wasn’t that excited about oreos or cosmic brownies or those other creepily sweet packaged things. It’s funny how much you don’t care when you are a kid. But I am a little bummed because I never got a character lunchbox!! I always just had a boring solid color one 🙁 lol the things that matter 😀 2 homemade chocolate chips definitely beat 2 oreos though!, , Wait really!?! Your feet are orange!?! Omg I have to see this, you gotta take a pic! How many carrots do you eat??, , Mmmhhh yep a Magic School Bus/Cupcake Wars/baking party is definitely in order!, , , Reply, , , , , , , , Peanut Butter & Ellie, , says, , , March 18, 2016 at 2:34 pm, , , , I have tried PB & co. peanut butter- I LOVE their chocolate peanut butter since it’s two of my favorite things in a jar. 🙂  Do you have a favorite brand/ type of peanut butter/ nut butter or a favorite homemade nut butter recipe?, I was always jealous of my friends for getting cosmic brownies… HoHo’s on the other hand? More like NoNo’s!, It’s crazy what we eat when we don’t realize what is in our food or where it comes from- and how much better natural food tastes than unnatural (aka super processed) food once we know the difference!, Yes my feet seriously are orange!! I eat like a bag of baby carrots a day or 3-5 big carrots. I can’t help it- they pair well with lots of different foods (hummus, peanut butter, guacamole, salsa, salad,etc.) and they taste good! 😀, Have a great weekend, Natalie! I’m thinking about you <3, , , , , , , , , Natalie, , says, , , March 20, 2016 at 2:28 pm, , , , Yes the dark chocolate one is dangerously good! The white chocolate one is pretty amazing too! Truth be told I”m actually kinda scared of homemade nut butter making. I’ve done it a couple times and it always feels like I’m about to break my food processor or blender, so I just buy it. There are so many options out there that I’m cool with letting someone else do the grinding 😀 But freshly ground almond butter with raw almonds is probably my favorite nut butter. I love raw almonds because they are a little bit sweeter, mmmm <3 Although peanut butter is a very very close second. And carrots are the perfect snacking vegetable! With hummus to dip them in one bag is nothing. Guacamole--that's a good idea I've never tried that! But I do wonder why all the pigment goes to your feet lol??, , , , , , , , , , , , , , , , , Brittney, , says, , , March 13, 2016 at 11:29 pm, , , , Fellow nerdy 90s Magic School Bus kid right here!! These are beautiful and I can’t wait to try them! I was kind of excited to find out that Oreos are Vegan, but there is so much processed junk in them and I’m not that big of a fan anyway. These look delicious and I can’t wait!!! Nerds unite! 🙂, , , Reply, , , , , , , , Natalie, , says, , , March 14, 2016 at 2:34 am, , , , Yes!!! I can hear the theme song in my head right now haha 😀 Loved that show. It is still pretty awesome that Oreos are vegan, awesome for the animals, but more of a once in a while thing for me. It’s nice to have a junk-free option too for eating more often 🙂, , , Reply, , , , , , , , Brittney, , says, , , March 14, 2016 at 2:15 pm, , , , Absolutely!!  Have a great day!!!  I am certain that your Oreos trump the packaged ones!, , , Reply, , , , , , , , , , , , Katie C, , says, , , March 14, 2016 at 1:09 am, , , , I’m really intrigued by these, as always with your recipes. Looking forward to trying them…, , , Reply, , , , , , , , Natalie, , says, , , March 14, 2016 at 2:36 am, , , , This is a super easy one, not as healthy and all fruit sweetened as some of the others, but still good! Thanks Katie 🙂, , , Reply, , , , , , , , , , Margaux, , says, , , March 14, 2016 at 4:12 am, , , , I’m going to be late for work but just had to say YUM! and of course WOW! These look so freaking good and I love the ideas for the other fillings. The date caramel and nice-cream and definitely on my list 😀 😀, , , Reply, , , , , , , , Natalie, , says, , , March 14, 2016 at 7:30 pm, , , , Oh no, I hope you made it on time! Thank you Margaux, although now all I can think about is how much I want to try them with the passionfruit curd! Passionfruit is really hard to find here, but if I can I’m making that for sure!, , , Reply, , , , , , , , , , Harriet Emily, , says, , , March 14, 2016 at 12:59 pm, , , , Yummmmm!!! Healthy, easy and vegan oreos – yaaaaayyy!!!!! I am so excited to try these Natalie! They look and sound wonderful! I am in heaven! Pinned <3, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 14, 2016 at 7:30 pm, , , , Thanks girl! Maybe not quite as easy as opening a package…but close 🙂, , , Reply, , , , , , , , , , Bianca @ ElephantasticVegan, , says, , , March 14, 2016 at 2:23 pm, , , , Mhhh! Natalie, you did it again! Making a formerly completely unhealthy treat, especially the banana slice ^.^, , , Reply, , , , , , , , Natalie, , says, , , March 14, 2016 at 7:33 pm, , , , Thank you Bianca! I have to admit I felt pretty clever with the banana slice one haha 😀, , , Reply, , , , , , , , , , Lucie, , says, , , March 14, 2016 at 5:46 pm, , , , I’m so excited about these!!! And you made them so unbelievably simple <3 I'm just starting to experiment more with rice flour so this is definitely going on my list of must makes 🙂 and OMG I used to LOVE Magic School Bus 😀 granted, I watched it in Czech but I'm a fellow nerdy 90s kid all the same 🙂, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 14, 2016 at 7:28 pm, , , , I used to think I hated rice flour but I’m learning it has it’s time and place. I still need to experiment with white rice flour more, haven’t used that yet. And they had Magic School bus in Czech?? That is amazing, I had no clue it was an international thing! Woohoo for the nerdy 90s shows 😀, , , Reply, , , , , , , , Lucie, , says, , , March 15, 2016 at 11:21 am, , , , I only have white rice flour at the moment so I’ll have to give it a try and see how it goes. Brown rice sounds a lot healthier though. Yes, I know right? I still have some ancient episodes on VHS 😀, , , Reply, , , , , , , , , , , , Jenn, , says, , , March 15, 2016 at 1:04 am, , , , , , Reply, , , , , , , , Natalie, , says, , , March 15, 2016 at 3:01 am, , , , Thank you Jenn! Oh I could easily down an entire section too, processed food goes down so easy. But these are a bit richer so perhaps that will help with portion control…or your kids will steal them and “help” with that I’m sure 😀 I hope you give them a shot!, , , Reply, , , , , , , , , , Tiina @myberryforest, , says, , , March 15, 2016 at 9:21 am, , , , You are my hero (and my kids’ hero too 🙂 )!! This is MAGICAL!! And I find it really inspiring that you used Magic School Bus teachings to come up with this recipe. Julia watches the show on Netflix!! So I’m happy to say I know what you’re talking about. But let’s dwell on these magical cookies for a while…hmmm..The cookie is just pure genius!! And the cream options are pretty cool too. I’m adding these on my “TO BAKE list” NOW. The list is looooong (and mostly filled with yours and Audrey’s creations) 🙂 But as these are soooo easy to make I think these might be the first I’ll try. I can already see Julia&I munching on these WHILE watching Magic School Bus. I bet you didn’t see that coming!! 😉, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 15, 2016 at 5:16 pm, , , , So it is on Netflix! After writing and chatting about Magic School Bus so much I really want to watch it again now. With oreos in hand of course 😀 I had no clue it was international either, which is awesome! My to make list is so long I can’t even find the beginning of it anymore, but easy always takes precedence for me too. Which basically just means that the poor complicated things never get made till it’s a special occasion and I feel like being fancy 😀 But that’s okay, simple can be just as magical your recipes are proof of that! If you do get around to trying them then I can’t wait to hear the verdict from both you and Julia 🙂, , , Reply, , , , , , , , , , Rob, , says, , , March 15, 2016 at 12:08 pm, , , , That’s pretty damn impressive. How people have the creativity to come up with these kinds of things always blows my mind., , , Reply, , , , , , , , Natalie, , says, , , March 15, 2016 at 4:56 pm, , , , Thanks Rob!, , , Reply, , , , , , , , , , Melissa @ vegan does it, , says, , , March 16, 2016 at 2:06 pm, , , , Whoa! I can’t believe how ridiculously simple these are! And they look like they have just the right crisp! My kids love Oreos, but we don’t let them have them very often. These would be great instead and they would be so excited! My oldest loves Magic School Bus too!, , , Reply, , , , , , , , Natalie, , says, , , March 16, 2016 at 3:08 pm, , , , Thanks Melissa! While I love soft pillowy cookies, the crisp was a must to call them Oreos. I know, I keep getting people telling me ‘but oreos are already vegan’. Vegan maybe, but still not exactly something I want to be putting into my body very often :/ And I love hearing that your kids are still watching the magic school bus, I feel much less old that way haha! I hope you give them a try!, , , Reply, , , , , , , , , , Lily, , says, , , March 16, 2016 at 2:54 pm, , , , These look amazing! I can’t wait to try them out. Is there any way I could use a non gluten free flour? Thanks so much, , , Reply, , , , , , , , Natalie, , says, , , March 16, 2016 at 3:10 pm, , , , I have tested them with all purpose flour and the gluten in there causes them to rise and become a much softer cookie. The brown rice flour keeps them nice and crunchy. So you are welcome to do it with a different flour, but they won’t be as Oreo-like., , , Reply, , , , , , , , , , Michele @TwoRaspberries, , says, , , March 17, 2016 at 9:12 pm, , , , , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 18, 2016 at 1:27 pm, , , , I know right, easy is my favorite kinda recipe 🙂 Thanks Michele and enjoy!, , , Reply, , , , , , , , , , Bex, , says, , , March 21, 2016 at 2:37 am, , , , Excellent! I used your lower fat options as I didn’t have any coconut milk. First we used it as a bottom crust for nice cream and then we tried it crushed up and mixed in the nice cream. Everyone loved it! Then I tried it with banana which was fantastic and then I tried peanut butter (also fantastic) and then I tried with both banana and peanut butter which was ridiculously fantastic! The cookie/banana/pb combination is great if you want something sweet but don’t want to eat too many sweets as it is quite rich and decadent tasting so one cookies with the pb and banana is very satisfying. Thanks for sharing Natalie!, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 21, 2016 at 3:19 am, , , , This comment just made my day! I love all your fantastic ideas, especially the mixed into nicecream part…sounds likes cookies and cream! And pb with banana sounds fantastic too, they are rich little cookies! I’m so glad you tried them and that everyone loved them, thank you so so much for the wonderful feedback 🙂, , , Reply, , , , , , , , Natalie, , says, , , March 21, 2016 at 3:20 am, , , , This comment just made my day! I love all your fantastic ideas, especially the mixed into nicecream part…sounds likes cookies and cream! And pb with banana sounds fantastic too, they are rich little cookies! I’m so glad you tried them and that everyone loved them, thank you so so much for the wonderful feedback 🙂, , , Reply, , , , , , , , , , Annelina, , says, , , March 23, 2016 at 8:17 am, , , , I didn’t know you made a vegan Oreo recipe. This looks and sounds absolutely delicious and worth to try. I’m looking forward to trying it! Love the lower-fat version :). A big Hug coming your way,, xX Annelina, , , Reply, , , , , , , , Natalie, , says, , , March 23, 2016 at 3:26 pm, , , , I did! And I’m glad they are enticing, the whole 5 ingredient easy peasy part makes them hard to resist. I’ve gotten lots of good feedback on them so far, so I hope you enjoy them too! Thanks girl <3, , , Reply, , , , , , , , , , Summer, , says, , , April 6, 2016 at 2:37 am, , , , Do you think I could use white rice flour instead?, , , Reply, , , , , , , , Natalie, , says, , , April 6, 2016 at 2:53 am, , , , You can, but they will be chewy not as crunchy. Sorry., , , Reply, , , , , , , , , , Audra, , says, , , April 16, 2016 at 1:29 pm, , , , Hi! These look awesome. Think buckwheat flour would work?, Thank you!, , , Reply, , , , , , , , Natalie, , says, , , April 16, 2016 at 4:53 pm, , , , I do think it will work with buckwheat. Will it be quite as crunchy, I’m not sure, but they will still be pretty close I think!, , , Reply, , , , , , , , , , Fede Pastabites, , says, , , July 25, 2016 at 8:12 pm, , , , What a great recipe! I am so going to try it asap, , ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , July 26, 2016 at 12:24 am, , , , Yay!! Let me know how it goes 🙂, , , Reply, , , , , , , , Fede Pastabites, , says, , , August 1, 2016 at 9:23 am, , , , Having troubles locating brown rice flour! frustrating but will keep searching. I adore your blog, is really one of the best i have ever seen (so now have added to my ‘list of blogs I read’, hope you don’t mind., , , Reply, , , , , , , , Natalie, , says, , , August 1, 2016 at 2:24 pm, , , , Have you thought about ordering it online? I often order dry goods like that online from Amazon or Vitacost since I don’t have many good natural grocery stores nearby. Sometimes it’s even cheaper that way! Just a thought, it might not work where you live idk. Oh thank you, of course I don’t mind! That is very sweet <3, , , Reply, , , , , , , , Fede Pastabites, , says, , , August 4, 2016 at 5:39 pm, , , , Yes I think I will try online, if I cant find it from Holland & Barret, which is a british natural / gluten free etc shop, I am confident I will find it. Fingers x!, , , , , , , , , , , , , , , , , Thebakingbabe, , says, , , August 9, 2016 at 5:05 pm, , , , I have lots of food allergies including dairy, and I am also celiac…when I found this recipe I got so excited because it has been years sense I had an oreo!! i used carob powder and Had to make mine with regular rice flour as I am allergic to brown rice and they came out delicious!!! Thank you for such a aimple recipe!, , , Reply, , , , , , , , Natalie, , says, , , August 9, 2016 at 7:48 pm, , , , I am so happy to hear that they worked for you and your diet!! A carbo cookie actually sounds quite delicious, I might have to try that now 🙂 Thank you for taking the time to come back and leave me a comment, I really appreciate you!, , , Reply, , , , , , , , , , Laura Wynn, , says, , , August 12, 2016 at 3:37 pm, , , , Question: I am making this for my daughter and the batter for the chocolate “cake” part is quite runny.  I double checked my measurements based on the recipe.  I can’t form into balls.  It is more like cake batter than like a cookie dough.  Should I add more brown rice flour?, , , Reply, , , , , , , , Natalie, , says, , , August 12, 2016 at 4:29 pm, , , , Yep, more brown rice flour! I would add the flour 1 tablespoon at a time until it is just solid enough to pick up and shape. Good luck!, , , Reply, , , , , , , , , , Theresa, , says, , , August 24, 2016 at 10:25 pm, , , , Hi! Tried making these for the first time today and the “dough” was too wet so I added a touch more brown rice flour to get it to the consistency so I could pick it up. It was so sticky I couldn’t even roll it into a ball. Ended up having to put a drop of coconut oil on my hands and fingers so it would roll up. But they taste great! Any advice?, , ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , August 24, 2016 at 11:52 pm, , , , Hi Theresa! You had the right idea, more brown rice flour or less maple syrup until you get a rollable consistency. You can also spoon it onto a pan and spread it if it’s too thin, but just thickening it is probably better. Also you can use a little water on your hands instead of coconut oil, I use that a lot with sticky doughs. It will just evaporate as they bake and works quite well. I hope that helps!, , , Reply, , , , , , , , , , Betsy, , says, , , September 1, 2016 at 12:13 pm, , , , Is there any way we could sub honey for the maple syrup? I live in the Middle East and finding maple syrup isn’t always easy., , , Reply, , , , , , , , Natalie, , says, , , September 1, 2016 at 4:40 pm, , , , I don’t use honey so I can’t say for sure whether it will make them as crunchy as the maple syrup, but I think it’s worth a try!, , , Reply, , , , , , , , , , Colehilldreamer, , says, , , September 2, 2016 at 2:12 am, , , , , , Reply, , , , , , , , Natalie, , says, , , September 2, 2016 at 3:26 pm, , , , Yay! I am so happy you like them? I know right, I was totally amazed when this super simple recipe worked too the first time. Oooh yes, I really like the sound of that chocolatey crust idea??, , , Reply, , , , , , , , , , Dee | Green Smoothie Gourmet, , says, , , September 17, 2016 at 5:08 pm, , , , Wow, I wanted to make sandwich cookies and need a firm yet raw cookie. Hmm…you are such an inspiration Natalie. And I didn’t know that about rice flour and I have some! Ha! Take care my friend, Dee xx., , , Reply, , , , , , , , Natalie, , says, , , September 17, 2016 at 8:20 pm, , , , Oh these crazy little cookies, they still kind of shock me too actually 🙂 Hmmm they could work raw! Not sure they would really be firm though. I imagine a date-based raw cookie would be better. Date based raw cookies when frozen get a really nice texture but since dates don’t really freeze they still stay bite-able. I saw Audrey do a raw ice cream sandwich with a cookie very similar to this recipe actually, so it could work for a sandwich cookie. Good luck with the cookie experimentation! xo, , , Reply, , , , , , , , , , Sam, , says, , , October 20, 2016 at 4:50 am, , , , Hi Natalie, Looking forward to trying this recipe. Instead of the maple syrup can I use date syrup ( which I make by blending dates and some water)?, , , Reply, , , , , , , , Natalie, , says, , , October 20, 2016 at 2:35 pm, , , , I’m afraid date paste will not work in this recipe. It would make the cookie really chewy, not snappy at all like an oreo should be. And probably not sweet enough either. Sorry!, , , Reply, , , , , , , , , , Kea, , says, , , November 7, 2016 at 8:00 pm, , , , making these – just put the cookies in the oven (the batter i licked off the bowl was amazing), I’m going to use your recipe for filling with a coconut butter as well (blended coconut) just to cut down on the sweetness., i looked at about 10 recipes before yours looked the easiest, and the tastiest (and possibly the healthiest!), , , Reply, , , , , , , , Natalie, , says, , , November 7, 2016 at 8:16 pm, , , , Yay!! I hope they came out of the oven looking perfect 🙂 I like the coconut butter filling idea, that’s a new to me ingredient I’ve been enjoying a lot. And yes, great fro natural sweetness. Enjoy!, , , Reply, , , , , , , , Kea, , says, , , August 23, 2017 at 8:09 am, , , , I have since made these AT LEAST 10 times. They’re SOO easy. Last night we made them and had chocolate ice cream in between two fresh from the oven still sorta warm cookies. It was amazing., , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , August 23, 2017 at 11:23 am, , , , Omg that sounds SO good!! Now you have me craving that cold + warm combo😋 I am so happy you like them and have them on repeat, thanks for taking the time to leave feedback Kea!, , , Reply, , , , , , , , , , , , , , Steph, , says, , , November 16, 2016 at 2:29 am, , , , I made this recipe so many times, my family loves!! But i want your help. My brother wants a more ‘chewy texture’ for this cookie. I have quinoa flour and tapioca flour. What is the best for the chewy? Have a good day Natalie 🙂, , , Reply, , , , , , , , Natalie, , says, , , November 16, 2016 at 2:48 am, , , , I am SO happy to hear that Steph, truly made me smile 🙂 For a chewy texture tapioca would be best! The amount might vary a little bit though, so don’t be afraid to add more flour/maple syrup if necessary to get the right dough texture. Thanks for the lovely comment!, , , Reply, , , , , , , , , , Maria Teresa Parks, , says, , , January 21, 2017 at 1:41 am, , , , My husband is allergic to coconut. What else could be used for the filling?, , , Reply, , , , , , , , Natalie, , says, , , January 21, 2017 at 9:52 pm, , , , Just a basic buttercream frosting recipe would work fine! Or the banana and peanut butter filling options in the post are both coconut free 🙂, , , Reply, , , , , , , , , , Jamie, , says, , , January 23, 2017 at 10:00 am, , , , Hi! I was wondering how I would store this to keep them oreo-like 🙂, , , Reply, , , , , , , , Natalie, , says, , , January 23, 2017 at 10:07 pm, , , , Hi Jamie! The best way to store them to keep the cookies crispy is to actually store the cookies and frosting separately and then just assemble before eating. And make sure the cookies are in an airtight container too. Or if you don’t want to keep the filing and cookies separate, then in the fridge is best 🙂, , , Reply, , , , , , , , , , andy, , says, , , March 16, 2017 at 12:26 pm, , , , Weirdly enough…I offered these to a vegan friend, and she informed me that OREOS (the store bought ones) are actually already VEGAN! Isn’t that weird? But these DO definitely taste better!, , ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 16, 2017 at 3:40 pm, , , , Crazy right!? Just goes to show you that that “cream” filling isn’t cream at all lol. I’m glad that you liked this homemade version too though 🙂, , , Reply, , , , , , , , , , Chris, , says, , , March 18, 2017 at 10:20 am, , , , I loved the recipe. Just one question. You said they started getting soft on the 3rd day. How do you get them to last 3 days??, , , Reply, , , , , , , , Natalie, , says, , , March 18, 2017 at 10:29 am, , , , Whenever I am testing a recipe I save a few pieces/cookies on purpose just to test the texture and flavor after a few days of storing. But with a batch this size it does seem a little unnecessary, huh?? So happy you liked them!!, , , Reply, , , , , , , , , , Melissa lessard, , says, , , March 25, 2017 at 8:15 am, , , , Just made them and they are AMAZING!, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , March 25, 2017 at 10:34 am, , , , Yay!! Happy cookie munching to you?, , , Reply, , , , , , , , , , mouna, , says, , , March 26, 2017 at 5:56 pm, , , , hey we don’t have maple syrup here can i use date caramel instead ?, , , Reply, , , , , , , , Natalie, , says, , , March 26, 2017 at 7:56 pm, , , , Date caramel will change the texture of these cookies quite a bit, making them much more soft and chewy instead of snappy. Date nectar would work though, as would agave or honey if you can find either of those. Sorry!, , , Reply, , , , , , , , , , Ambreen, , says, , , April 25, 2017 at 8:12 am, , , , Could I substitute the coconut milk with chilled coconut cream?, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , April 25, 2017 at 10:11 am, , , , Yes, that would be perfect!, , , Reply, , , , , , , , , , heather, , says, , , May 9, 2017 at 7:35 pm, , , , I just tried this, but I used whole wheat flour. I had to add a bit more maple syrup, and water, as I suppose that flour was more absorbent. But it worked, and was great! Thanks., , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , May 9, 2017 at 7:38 pm, , , , I am so happy you liked them Heather! Yep brown rice is much less absorbent than wheat, which is why I hate it for a lot of things but love it here. I’m glad the tweaks worked though, enjoy 🙂, , , Reply, , , , , , , , , , Sam, , says, , , June 13, 2017 at 3:55 pm, , , , Hi Natalie,, , I tried this recipe today with white rice flour and it didn’t form into a dough at all. I eventually added 60g of water and it still didn’t form into a dough. I melted 50g of coconut butter and added that to see if it would bind together. It was still a little dry so I added 20 additional grams of water. I was able to form it into a ball of dough but when attempting to work with it the dough would crumble easily. I’ve left it in the fridge to settle overnight. Any suggestions as to why it wouldn’t have worked with the initial recipe? Thanks., , , Reply, , , , , , , , Natalie, , says, , , June 13, 2017 at 8:39 pm, , , , Hi Sam! The recipe calls for brown rice flour, not white, and I think that is the issue. White rice flour absorbs A LOT of moisture, , , Reply, , , , , , , , , , Ella Allo, , says, , , June 15, 2017 at 7:04 am, , , , Will black molasses do the job on making them crispy and/or sweet? Thanks!, , , Reply, , , , , , , , Ella Allo, , says, , , June 15, 2017 at 7:15 am, , , , Also, since you are the healthy baking queen …when you mention maple syrup in your recipes will other syrups (black molasses and date syrup)do the same when it comes to consistency?, And specifically to this recipe, should I go for maple syrup if I want the oreo taste you achieved or would date syrup or black molasses do the same?, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , June 15, 2017 at 10:04 am, , , , Sometimes yes and sometimes no. I know that is an annoying answer, but in many recipes swapping the liquid sweetener will be just fine but in others the maple syrup really is best for acheieving a crispy crunchy texture. Like these Oreos for instance, since they are oil free I am using the maple syrup to make them snappy and crisp which molasses will not do as good a job of. You can still try it but the texture will most likely be much chewier. The taste is different as well, but it’s mostly about texture. Hope that makes sense!, , , Reply, , , , , , , , , , andrea, , says, , , July 23, 2017 at 9:06 am, , , , Hello, there way too many comments to read if my question has already being answered., , Can I use Agave instead of maple syrups ??? just for preference, I dont like syrup to be honest, , Thanks, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , July 23, 2017 at 12:58 pm, , , , Yep, that will be fine! Happy baking 🙂, , , Reply, , , , , , , , , , Colleen, , says, , , August 2, 2017 at 6:31 pm, , , , Why did my Frosting not turn out good? I used the boxed kind, is that the problem? I used a cup then added more sugar until my whole bag was gone.😮, , , Reply, , , , , , , , Sandra Lemos, , says, , , September 24, 2017 at 8:26 am, , , , I don’t use maple sirup. If i use dates what would be the amout to use? I also don’t eat cacao powder. Using carob powder how much should i use? I don’t easily find rice flower here, and it is very expensive. What other non gluten flower can i use. Thank you and congratulations for your gift., , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , September 24, 2017 at 9:02 am, , , , perhaps just finding a different chocolate cookie recipe would be a better idea. I cannot tell you all the substitute amounts without testing it, sorry!, , , Reply, , , , , , , , Sandra, , says, , , September 24, 2017 at 9:19 am, , , , Ok, thanks anyway. 🙂, , , Reply, , , , , , , , , , , , Sophia, , says, , , October 10, 2017 at 11:55 am, , , , Hi! Thanks for the recipe! Haven’t tried it yet but looking forward to it as my boys are crazy about oreos and would like to offer them a healthy alternative. I am not sure though I will find brown rice flour here. Would it not work if I used an organic whole meal emmer flour for example?, , , Reply, , , , , , , , Natalie, , says, , , October 10, 2017 at 5:35 pm, , , , any change will affect the texture and likely make them weirdly chewy. I would suggest going with this recipe instead and subbing 1/3 of the flour for cacao/cocoa powder:, https://www.feastingonfruit.com/homemade-vegan-golden-oreos/, . And yes, you can use whole wheat flour in that one instead of oat. Hope that makes sense and I hope your boys love them 🙂, , , Reply, , , , , , , , , , Sophia, , says, , , October 10, 2017 at 11:57 am, , , , Hi! Would another flour not work if we can’t find rice flour?, , , Reply, , , , , , , , Natalie, , says, , , October 10, 2017 at 5:31 pm, , , , Other flours will work, but will change the texture and I can’t tell you exactly how much without testing it. You could try this cookie recipe instead that uses oat flour and just sub 1/3 cup of the flour with cocoa powder:, https://www.feastingonfruit.com/homemade-vegan-golden-oreos/, . Hope that helps!, , , Reply, , , , , , , , , , Jennifer, , says, , , October 30, 2017 at 3:13 pm, , , , These look wonderful!  I don’t have any maple syrup, so can I use brown sugar or cane sugar in the cookie instead?, , , Reply, , , , , , , , Natalie, , says, , , October 30, 2017 at 7:06 pm, , , , Hi Jennifer! Since maple syrup is the only liquid ingredient in this recipe, it really won’t work without it. And if you added water or non-dairy milk it would make the cookie much chewier unfortunately. Sorry! Other liquid sweeteners would work like honey or agave if you have either of those on hand., , Or if you wanted to adapt this recipe (, https://www.feastingonfruit.com/homemade-vegan-golden-oreos/, ) to be chocolate you could try replacing the maple syrup with more coconut butter, adding brown/cane sugar (about 1/3 cup) and replacing 1/2 cup of the flour with cacao powder. I hope that makes sense. I haven’t tried it, so it may take a little experimentation, just an idea 🙂, , , Reply, , , , , , , , , , Angela, , says, , , December 21, 2017 at 7:53 pm, , , , How long do they usually need to cool?, , , Reply, , , , , , , , Natalie, , says, , , December 21, 2017 at 8:53 pm, , , , Just like 10 minutes or so, you’ll know because they harden as they do 🙂, , , Reply, , , , , , , , , , Rose, , says, , , December 31, 2017 at 9:43 pm, , , , Hi! I just came across your recipe linked to the PETA website. I was looking for easy vegan cookie recipes to make with my son (he’s 3.5 and very into baking). This week we have tried 2 recipes, but not very so successful so far. I want to give yours a try! I was wondering if almond flour would work instead of brown rice flour. Also, could I use agave instead of maple syrup? Thank you in advance for your answer and Happy New Year!, , , Reply, , , , , , , , Natalie, , says, , , January 1, 2018 at 6:25 pm, , , , Hi Rose! Sorry to hear you guys haven’t had any cookie luck yet. Agave will be just fine instead of maple syrup, and almond flour will work but the amount will be quite different as it is much more naturally moist so it’s not a 1-for-1 sub unfortunately. A better idea would be to just try this recipe instead:, https://www.feastingonfruit.com/almond-flour-sugar-cookies/, and replace 1/3-1/2 cup of the flour with cocoa powder. Hope that makes sense and they turn out delicious!, , , Reply, , , , , , , , , , Audrey, , says, , , January 9, 2018 at 5:07 am, , , , I love this recipe! I’m planning on baking this for a project in my food technology class, but I need to know the shelf date. If you don’t mind me asking, how long would it last packaged in a pantry and freezer?, , ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , January 9, 2018 at 9:43 am, , , , Hi Audrey, I’ve never tried freezing them but in an airtight container at room temperature they will last at least 4-5 days although do dry out with time as all homemade baked goods will 🙂, , , Reply, , , , , , , , , , Britt, , says, , , March 17, 2018 at 1:32 pm, , , , Made these today for my church’s bake sale tomorrow and let me tell you AMAZING!!! They are delicious my kids are trying to inhale the whole tray and are made because I only allowed one 😂😂😂😂 thank you for coming up with such an amazing easy recipe, , , Reply, , , , , , , , Natalie, , says, , , March 17, 2018 at 4:29 pm, , , , Hahaha!! Well that’s a very good sign, I’m so happy you guys liked them 🙂, , , Reply, , , , , , , , , , HJ, , says, , , March 21, 2018 at 8:40 pm, , , , These look great! Can I replace brown rice flour with oat or spelt flour?, , , Reply, , , , , , , , Natalie, , says, , , March 22, 2018 at 12:48 pm, , , , You can but that will make them more chewy and less crunchy🙂, , , Reply, , , , , , , , , , Chanelle, , says, , , May 28, 2018 at 4:29 pm, , , , Hi! These look great I can’t wait to try them! Do you happen to have the nutritional value for the cookies!?, , ★, ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , May 28, 2018 at 8:30 pm, , , , I haven’t had time to calculate the nutrition stats for my older recipes, https://www.myfitnesspal.com/recipe/calculator, 😊, , , Reply, , , , , , , , Chanelle, , says, , , May 29, 2018 at 4:51 pm, , , , Thank you so much!, , , Reply, , , , , , , , , , , , Nuffy, , says, , , July 28, 2018 at 2:58 am, , , , How would one use the PB2 Powder for the centre filling…, , Many thanks…, , , Reply, , , , , , , , Natalie, , says, , , July 28, 2018 at 8:13 pm, , , , Just mix it with water and make it extra thick so you can dollop it in the middle and it won’t run out 🙂, , , Reply, , , , , , , , , , Lesley, , says, , , August 1, 2018 at 4:43 pm, , , , I was out of brown rice flour so I subbed teff. I used PB2 mixed with water for the filling. They taste fantastic!. Not too sweet. They’re still warm so I don’t know if the teff flour will mnke them less crispy than brown rice flour. Awesome!, , ★, ★, ★, ★, , , Reply, , , , , , , , Natalie, , says, , , August 1, 2018 at 8:20 pm, , , , Yay, I am so happy you liked them🤗🤗 I’ve never tried this one with teff, so good to know it worked. May be a little less crispy, but I love chewy chocolate cookies too😋 Thanks for the feedback Lesley!, , , Reply, , , , , , , , Lesley Lush, , says, , , August 1, 2018 at 11:47 pm, , , , The edges got crispy. I only baked my cookies for 8 min. they were smelling very chocolate-y and I didn’t want to overbake them. perhaps going the full 10 or baking at a lower temp for a couple extra minutes would make them crispy. 😊 And I do love teff flour in chocolate things. The flavours play well together., , , Reply, , , , , , , , , , , , Jamie, , says, , , April 3, 2019 at 6:38 am, , , , Do you have any flour alternatives to rice flour for this recipe??, , , Reply, , , , , , , , Natalie, , says, , , April 3, 2019 at 9:00 am, , , , Not that I have tested, what were you hoping to use?, , , Reply, , , , , , , , Kay, , says, , , April 6, 2019 at 8:22 pm, , , , I used all-purpose flour and they were excellent., , , Reply, , , , , , , , , , Kay, , says, , , April 6, 2019 at 8:25 pm, , , , I used all-purpose flour and they were excellent., , , Reply, , , , , , , , Natalie, , says, , , April 6, 2019 at 9:32 pm, , , , Thanks for sharing, good to know 🙂, , , Reply, , , , , , , , , , Marcy Gengler, , says, , , May 14, 2019 at 1:37 pm, , , , Hi was wondering about changing filling, do you replace the powdered sugar with the peanut butter powder or add to it, it’s not really clear, thank you!, , , Reply, , , , , , , , Natalie, , says, , , May 14, 2019 at 4:17 pm, , , , You can just use powdered peanut butter (the sweetened kind) mixed with water but keep it a little bit thicker than normal and use that as the filling–no need for the powdered sugar or coconut milk!, , , Reply, , , , , , , , , , Kay, , says, , , May 24, 2019 at 5:37 pm, , , , Do you have a vanilla version with vanilla filling and lemon filling?, , , Reply, , , , , , , , Natalie, , says, , , May 25, 2019 at 12:48 pm, , , , I do have a vanilla version, and I think you already found them but right here:, https://www.feastingonfruit.com/homemade-vegan-golden-oreos/, , , Reply, , , , , , , , , , Olivia, , says, , , May 26, 2019 at 10:53 pm, , , , Hi, i was wondering if there was another type of flour i could use instead of brown rice flour because i don’t really like the texture., , , Reply, , , , , , , , Natalie, , says, , , May 27, 2019 at 12:16 pm, , , , You could try buckwheat or oat flour or a gf blend, , , Reply, , , , , , , , , , Chelsea M, , says, , , May 31, 2019 at 4:09 pm, , , , not good at all. I did everything to a T. Including the cook time, arrangement and flattening. they were awful., They did not taste good, and they are so hard my little one is saying yucky she can barely bite into it. My teeth are killing me right now from eating one. I definetly wont be following any more of your recipes, as Ive made a few from your website and that Ive seen on youtube and they all turned out bad., also they looked nothing like the pictures and rolling them was a nightmare. Way too messy. wish I could give this recipe 0 stars. all these people have rated this recipe and they CLEARLY havent even made it LOL. This recipe should say 0 stars not 4., , ★, , , Reply, , , , , , , , Gina, , says, , , March 5, 2020 at 12:49 pm, , , , Hi! Do you have any flour substitutions for the rice flour? I’d prefer not to buy rice flour for one recipe. Can I use a standard GF flour? Almond? Coconut? Thanks!, , , Reply, , , , , , , , Natalie, , says, , , March 5, 2020 at 1:18 pm, , , , I would try the GF flour instead, almond or coconut would both need other adjustments to make it work 🙂, , , Reply, , , , , , Trackbacks, , , , , , , OMG Vegan Cookie Recipes - Healthy Smart Living, , says:, , , , October 11, 2020 at 11:06 am, , , , , […] Feasting On Fruit Sandwich Cookies […], , , Reply, , , , , , , , , Easy Vegan Oreos Recipe – Tasty Recipedia, , says:, , , , November 10, 2020 at 4:21 am, , , , , […] Get full recipe >> Easy Vegan Oreos @ feastingonfruit.com […], , , Reply, , , , , , , , , オレオスは本当にビーガンですか？ – フィットネスと健康, , says:, , , , December 9, 2020 at 12:52 am, , , , , […] 簡単なビーガンオレオ […], , , Reply, , , , , , , , , 14 Best Quick and Easy Dessert Ideas – Recipes By Recipes, , says:, , , , December 25, 2020 at 10:08 pm, , , , , […] Source: www.feastingonfruit.com […], , , Reply, , , , , , , , , Homemade Twix Bars (Vegan and Gluten Free) | Crowded Kitchen, , says:, , , , January 5, 2021 at 12:33 pm, , , , , […] Gluten Free & Vegan Oreos via Feasting on Fruit – another childhood classic! Need to try these asap. […], , , Reply, , , , , , , , , Are Oreos Vegan? Here Is What You Should Know, , says:, , , , May 6, 2021 at 9:43 am, , , , , , , Reply, , , , , , , , , Can You Eat Twix With A Peanut Allergy - Know Your Allergy, , says:, , , , August 23, 2021 at 4:29 pm, , , , , […] Gluten Free & Vegan Oreos via Feasting on Fruit – another childhood classic! Need to try these asap. […], , , Reply, , , , , , , , , Are Skittles Peanut Allergy Safe - Know Your Allergy, , says:, , , , December 17, 2021 at 12:27 am, , , , , […] Gluten Free & Vegan Oreos via Feasting on Fruit another childhood classic! Need to try these asap. […], , , Reply, , , , Primary Sidebar, , Hi, I'm Natalie, , The recipe creator around here sharing simple snacks and treats that are secretly healthy under their sweet dessert disguises!, , , Facebook, Instagram, Pinterest, YouTube, , Search, , recipes to your inbox, , enter your email to get on the list!, , , , , , , , , , CATEGORIES, , , trending now, , , vegan, , , beverages, , , breakfast, , , brownies & bars, , , chocolate, , , gluten-free, , , cakes & breads, , , paleo, , , easy, , , candy, , , fruit-sweetened, , , personal, , , cookies, , , no-bake, , , savory, , , oil-free, , , cupcakes & muffins, , , snacks, , , pies & crumbles, , , sweet, , , creamy, , , , , FEATURED POSTS, , Dubai Chocolate Cups Recipe, Healthy Carrot Cake Cupcakes, Smashed Dates (4 ways!), Carrot Cake Cookies (Crumbl Copycat!), , , Follow @, feastingonfruit, , , , , , , SMASHED DATES (4 WAYS!)😋 \n\n✨Comment “RECIPE, , , , , , , , , CARROT CAKE COOKIES🥕 Inspired by the infamous C, , , , , , , , , BLUEBERRY MINI MUFFINS🫐\n\nInspired by nostalgic, , , , , , , , , , , , , , , , , COPYCAT HEAVENLY HUNKS🍪 Taking inspiration from, , , , , , , , , RASPBERRY CHEESECAKE BROWNIE BITES🍫\n\n✨Comment, , , , , , , , , AIR FRYER CINNAMON ROLL BAKED OATS✨\n\nWith all th, , , , , , , , , BANANA CHOCOLATE CHIP FROYO PROTEIN BITES✨\n\n🍌, , , , , , , , , , , , , , , , , SUGAR COOKIE CHEESECAKE BARS🎅🏼\n\nSugar cookie, , , , , , , , , , , , , , , Footer, , , , , Facebook, Instagram, Pinterest, YouTube, , SEARCH THIS SITE, , Search, , Recipes to your inbox, , enter your email to get on the list!, , , , , , , , , , CATEGORIES, , , trending now, , , vegan, , , beverages, , , breakfast, , , brownies & bars, , , chocolate, , , gluten-free, , , cakes & breads, , , paleo, , , easy, , , candy, , , fruit-sweetened, , , personal, , , cookies, , , no-bake, , , savory, , , oil-free, , , cupcakes & muffins, , , snacks, , , pies & crumbles, , , sweet, , , creamy, , , , , Work With Me, , Blog, , About, , Recipe Index, , Privacy, , Copyright © 2025 ·, Recipe Blogger Theme, ·, Genesis Framework, ·, Privacy Policy, ·, WordPress, ·, Log in, , , , , , , , , , , , , , , , , , , , , , , , , Pin, Share, Tweet, Email, Instructions: , , , , Cookie:, Preheat the oven to 350F., ",
        "Vegan Nutella": "Ingredients: , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , RECIPES, , , BREAKFAST, , LUNCH / DINNER, , DESSERT, , , , SHOP MY EBOOK, , ABOUT, , WORK WITH ME, , , , , , , , , , , , , , , , , , Blooming Nolwenn, /, May 7, 2020, , , , , , You’re going to love this, vegan Nutella recipe, ! This homemade chocolate spread is vegan, healthy, oil-free, crepes, waffles, pancakes and more. Enjoy!!, , , Homemade Vegan Nutella Recipe, , You’re going to love this healthy vegan Nutella recipe!, , Can you believe it’s made with only, and that it doesn’t contain any oil or added sugar?, , It’s very creamy and chocolate-y and it’s delicious on top of bread, , pancakes, , , waffles, , , cinnamon rolls, and more 🙂, , I hope you will like my recipe! Please leave a comment below if you give it a try, it means a lot to me. Have fun!, , , , How to Make Vegan Nutella, , (No Sugar), , , , Dark chocolate, , Canned coconut milk, , Yep, that’s it! No oil, , , How to Store This Homemade Nutella, , You can store this vegan Nutella in the fridge in an airtight container for up to 1 week., , , I hope you will like this homemade vegan Nutella recipe! It’s:, , Easy to make, , , Healthy, , Vegan, , Oil-free, , Refined sugar-free, , Delicious with fresh bread, crepes, waffles, pancakes and more!, , Enjoy! Nolwenn ☀, , PIN ON PINTEREST, 😊, , , You can enjoy this vegan Nutella with:, , Vegan oatmeal pancakes, (gluten-free, Vegan oatmeal waffles, (gluten-free, healthy), Vegan French crepes, (gluten-free, healthy), Vegan chocolate cinnamon rolls, (oil-free, easy), Vegan chocolate stuffed pancakes, (gluten-free, no added sugar, no oil), , , , , , , , , , Yield:, , 1 jar, , , , Prep Time:, , 5 minutes, , , , , Fridge Time:, , 2 hours, , , , , Total Time:, , 2 hours, , 5 minutes, , , , , , You're going to love this, vegan Nutella recipe, ! This homemade chocolate spread is vegan, healthy, oil-free, crepes, waffles, pancakes and more. Enjoy!!, , , , , , Print, , , , , , , , 7/8 cup dark chocolate chips (150 g), , 6.5 oz canned coconut milk, full-fat (200 ml), , , , , , , Next Post, Vegan Chocolate Stuffed Pancakes (Gluten-Free, Easy), , , , 14 Comments, , , , , , , monika, , June 9, 2020 / 9:52 pm, , , , Do you use everything in the can of coconut or just the thick part? (When you leave it in the fridge, the solid part separates from the coconut water, so that’s why I ask if we use the whole can or just the solid part) Thank you., , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , June 10, 2020 / 7:30 am, , , , Hi Monika,, Thanks for reaching out!, For this recipe you will need the whole can of coconut milk – both the solid part and the coconut water., I hope this helps!, Nolwenn, , , , Reply, , , , , , , , , , , Christine, , August 29, 2020 / 6:15 am, , , , What brand of vegan chocolate chips did you use?, , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , January 9, 2021 / 3:28 pm, , , , Hi Christine,, Any vegan dark chocolate will work 🙂, Nolwenn, , , , Reply, , , , , , , , , , , Beth, , December 22, 2020 / 9:29 pm, , , , Once I saw this recipe, I could not make it fast enough. And it’s perfect with fruit for a healthy-ish dessert! Thanks for the recipe!, , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , January 9, 2021 / 3:36 pm, , , , Thank you, Beth!, Nolwenn, , , , Reply, , , , , , , , , , , Maree, , December 24, 2020 / 10:44 am, , , , I’m wondering if you think other nut milks would work?, , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , January 9, 2021 / 3:35 pm, , , , Hi Maree,, You definitely need full-fat coconut milk for the chocolate spread to become creamy., The spread won’t turn out as creamy if you use other nut milks., I hope this helps., Nolwenn, , , , Reply, , , , , , , , , , , Ashley, , February 23, 2021 / 5:11 pm, , , , Does it become liquid again at room temperature? Wondering if I could use it as a frosting substitute?, , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , April 28, 2021 / 2:49 pm, , , , Hi Ashley, thanks for reaching out!, I’ve used this spread several times as a frosting and it works great. Depending on the temperature of the place you’re in, it will slightly desolidify but it won’t become liquid again., My advice would be to frost the cake at the last minute or to keep it in the fridge (frosted) until ready to serve., I hope this helps. Happy baking!, Nolwenn, , , , Reply, , , , , , , , , , , Kristen, , February 26, 2021 / 8:12 am, , , , Can I put hazelnut in it?, , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , April 26, 2021 / 1:12 pm, , , , Hi Kristen,, Yes, totally! I love adding roasted hazelnuts!, Nolwenn, , , , Reply, , , , , , , , , , , Daria, , March 18, 2021 / 4:49 pm, , , , Mine won’t harden, it’s still liquidy. What should I do?, , , , Reply, , , , , , , , , Blooming Nolwenn, Author, , April 28, 2021 / 2:44 pm, , , , Hi there, sorry to hear that. Did you use full-fat canned coconut milk as showed in the recipe?, It should harden after 2 hours in the fridge., Nolwenn, , , , Reply, , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , Website, , , Notify me via e-mail if anyone answers my comment., , I consent to Blooming Nolwenn collecting and storing the data I submit in this form., (Privacy Policy), , *, , , , , , , , , , HELLO, Welcome! I am Nolwenn. I am the recipe developer, food stylist, photographer and writer behind Blooming Nolwenn. I love sharing healthy, vegan and delicious recipes and I am so excited for you to try them! Let's make delicious food together and spread love and compassion around us :), , 35-RECIPE EBOOK, Popular Posts, , , , , , , , , , , , Oil-Free, , , , , , , , , , , , , , , , , , , , , , , , , Vegan Chocolate Mousse with Aquafaba | Easy, , , , , , , , , , , , , , FIND ME ON FACEBOOK, , , , , , , COPYRIGHT© 2018 BLOOMINGNOLWENN.COM, Privacy Policy, , Terms of Service, , , , , Theme design by, pipdig, , , , , , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , Looking for Something?, , , , , , , , , , , , , , , , , Instructions: , , STEP 1, , Place the dark chocolate chips in a bowl and set aside., , , STEP 2, , Pour the coconut milk in a saucepan over medium heat and heat until steam rises from the surface., , You don’t want to boil the coconut milk, otherwise it could burn the chocolate. So keep an eye on it., , , STEP 3, , Pour the hot coconut milk over the chocolate chips and cover with a lid. Let it stand without stirring for 2-3 minutes., , Once the time is elapsed, gently stir the mixture until silky smooth and glossy. It usually takes about 2 minutes., , , , , , , , , , , STEP 4, , Now transfer the mixture to a jar and place it in the fridge for 2 hours or until solid. Enjoy!!, , , , Place dark chocolate chips in a bowl and set aside., Pour coconut milk in a saucepan over medium heat and heat until steam rises from the surface. You don't want to boil it, otherwise it could burn the chocolate., Pour hot coconut milk over chocolate chips and cover with a lid. Let stand without stirring for 2-3 minutes. Then, gently stir the mixture until silky smooth and glossy (about 2 minutes)., Transfer the mixture to a jar and refrigerate for 2 hours or until solid. Enjoy!, , , , Notes, , , Storage, :, store in the fridge in an airtight container for up to 1 week., , , , , , Nutrition Information:, , Yield:, 10, , Serving Size:, 1, , Amount Per Serving:, , Calories:, 120, Total Fat:, 9.1g, Carbohydrates:, 7.3g, Fiber:, 1.6g, Protein:, 1.4g, , , , , , , , , , , , Did you make this recipe?, , Please leave a comment below and tag me on Instagram (@bloomingnolwenn) with #bloomingnolwenn! I will gladly leave you a comment and share your picture in my story 🙂 Your feedback means a lot to me!, , , , , , , © Blooming Nolwenn, , , , Cuisine:, American, , /, , Category:, DESSERT, , , , , , , , , Follow:, , , , , , , You may also enjoy:, Vegan Breakfast Waffles | Healthy, Gluten-Free, Vegan Coconut Chestnut Pumpkin Soup, Raspberry Chia Jam Stuffed Pancakes | Vegan, Gluten-Free, Vegan Deep Dish Leek Pizza | Gluten-Free, , , , , , , , , , Previous Post",
        "Vegan Flan": "Ingredients: Caramel:, ▢, ¾, , cup, , Granulated sugar, Flan base:, ▢, 1, , can, , Full fat coconut milk, ▢, 1, , cup, , Oat milk, ▢, 1, , tsp., , Chickpea flour, ▢, ⅓, , cup, , Sugar, ▢, 1, , tsp., , Vanilla, ▢, 1 ¼, , tsp, , Agar agar powder, , (see note), , Cook Mode, Prevent your screen from going dark, , , , Reply, , , , , , , , Dora S., , says:, , , , 01/06/2022 at 9:16 pm, , , , , Did you use cornstarch or agar agar?? Did you use agar powder or flakes?, , , Reply, , , , , , , , Daniela Araujo, , says:, , , , 11/20/2022 at 7:27 am, , , , , Hi Dora. I used flakes and it didn’t set. Any tips ?, , , , , , , , , Dora S., , says:, , , , 11/21/2022 at 9:36 pm, , , , , Hi, I didn’t test it with flakes I used powder so I couldn’t tell you the amount you would need to use, but I do know you need a larger quantity., , , , , , , , , , , Comments navigation, , Older comments, , , , , 5 from 18 votes (, 13 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , Website, , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , , , , , , , Meet Dora, , , , I’m Dora, and I make traditional vegan Mexican recipes that are easy, mostly healthy and delicious., , , , About Dora, , Search, , , , , , , , , Christmas, , , , , , , , , , Vegan Pozole Verde, , , , , , , , , , , , , , Vegan Mexican Christmas Menu, , , , , , , , , , , , , , Puff Pastry with Quince and Macadamia Nut Cheese, , , , , , , , , , , , , , The Perfect Vegan Mexican Hot Chocolate, , , , , , , , , Other Reader Favs, , , , , , , , , , How to Make Sopa de Fideo, , , , , , , , , , , , , , Salsa Molcajeteada, , , , , , , , , , , , , , Vegan Birria Tacos and Quesabirria (Jalisco Style), , , , , , , , , , , , , , The Best Homemade Vegan Chorizo Recipe, , , , , , , , , , , , , Introducing my new cookbook!, , , , , , , , , , , , , , , , , , , , , , , Featured On, , , , , , , , , , , , , , , , Pre-order My new Cookbook, , , Comida Casera, , , Order now!, , , , , , , , , , , , , , , , , , , , Contact, , Work with Me, , Privacy Policy, , Cookie Policy, , , , , , , , , , , © 2025 Dora's Table, , , , , , , , , , , , , , , , , , As an Amazon Associate I earn from qualifying purchases., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Home, , About, Toggle child menu, Expand, , , , About Dora, , Contact, , , , Recipes, , Cookbook, , Food Photography, Toggle child menu, Expand, , , , Portfolio, , , , Español, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: Get ramekins ready to go., Pour sugar into a medium sauce pot and set to medium-low heat. Let the sugar dissolve, gently swirling the pot but not stirring, until mixture turns a deep golden color, 8 to 9 minutes., Immediately remove pot from heat and pour caramel into ramekins. Gently lift and tilt ramekins to coat the inside with caramel. Set aside., Combine coconut milk and agar agar in a medium sauce pot., In the blender combine the oatmilk, sugar, chickpea flour, and vanilla. Process until smooth. Pour this mixture into the pot with the coconut milk., Bring mixture to a simmer for 5 minutes, then remove from the heat. Let cool slightly, then pour into ramekins., Place ramekins in the fridge for 4 hours to let the flan set., To serve, place bottom of ramekin in a container with hot water for 1 -2 minutes, in order to release the flan., Use a small knife or offset spatula to carefully loosen the edges of the flan. Turn flan over onto a plate, shake gently to release flan and remove ramekin., , Video, , Notes, , If you don’t have access to agar-agar you can use 1/3 cup + 1 tbsp. of cornstarch instead. Dissolve the cornstarch in the oat milk, and then proceed to add it to the blender with the sugar, vanilla, and chickpea flour. Then add to the coconut milk mixture on the stove and simmer for 5 min., , If you would like this flan to be yellow in color you can add a couple drops of yellow food coloring., , If you want to make a very jiggly and delicate version of this flan (like crème caramel) simply reduce the amount of agar-agar to 1 tsp., , , , , Nutrition, Serving:, 1, flan, |, Calories:, 292, kcal, |, Carbohydrates:, 42, g, |, Protein:, 2, g, |, Fat:, 14, g, |, Saturated Fat:, 12, g, |, Sodium:, 28, mg, |, Potassium:, 167, mg, |, Fiber:, 1, g, |, Sugar:, 39, g, |, Vitamin A:, 82, IU, |, Vitamin C:, 1, mg, |, Calcium:, 69, mg, |, Iron:, 2, mg, , , , , Tried this recipe?, Mention, @dorastable, or tag, #mexicangonevegan, !, , , , , , , , Dora R., , , Dora is the founder, recipe developer, and photographer at Dora's Table and Mi Mero Mole. Born and raised in Mexico and a graduate of the Culinary Institute of America in New York, she adopted a vegan (plant-based) diet to take control of her health., , , , , , , , Post navigation, , Previous, , Previous, Sweet Potato and Chickpea Stew in Chile Colorado, Next, Continue, , Fig Mole Mushroom Tacos, , , , , , Similar Posts, , , , , , , , , , , , , , Sweet Blackberry and Vegan Cream Cheese Tamales, , , , , , , , , , , , , , , How to Make Sopa de Fideo, , , , , , , , , , , , , , , Easy Vegan Tinga Tacos, , , , , , , , , , , , , , , Vegan Key Lime Pie Ice Cream, , , , , , , , , , , , , , , Walnut and Bean Vegan Sopes, , , , , , , , , , , , , , , Strawberry Tamales, , , , , , , , , , , , , , 44 Comments, , , Comments navigation, , Older comments, , , , , , , , Mari, , says:, , , , 09/04/2024 at 8:19 pm, , , , , Hi, is unsweetened or sweetened coconut milk needed?, , , Reply, , , , , , , , Dora R., , says:, , , , 09/23/2024 at 11:27 am, , , , , unsweetened, , , Reply, , , , , , , , , , Lourdes, , says:, , , , 05/31/2024 at 10:52 am, , , , , NOT Mexican. Flan is a dessert eaten in all of Latin America but came from Spain!  Obviously Vegan may not have., , , Reply, , , , , , , , Vanessa, , says:, , , , 04/15/2023 at 5:57 pm, , , , , I tried your tres leches yet again and now I have left over evaporated milk; could I use some of the in place of the oat milk?, , , Reply, , , , , , , , Selenia, , says:, , , , 04/10/2022 at 3:02 pm, , , , , Does chickpea flour have to be used or can you use a different kind of flour?, , , Reply, , , , , , , , Dora S., , says:, , , , 07/23/2022 at 10:40 am, , , , , You can just omit it. It’s to give the flan an eggy flavor, , , Reply, , , , , , , , jinale, , says:, , , , 12/10/2023 at 7:48 pm, , , , , I saw another recipe that i, used cornstarch I havent tried bothe but are you able to tell me the difference ? Thanks, , , , , , , , , Dora S., , says:, , , , 12/11/2023 at 6:18 pm, , , , , Yes, when you use agar agar the custard is much smoother, more similar to a real custard. When you make it with cornstarch it has the consistency of a very thick pudding., , , , , , , , , Amber, , says:, , , , 09/05/2024 at 3:54 pm, , , , , Could I possibly replace the chickpea flour with nutritional yeast? Since I know it’s for an eggy flavor., Maybe black salt? I feel like even a little would be too much. I’m not sure., , , , , , , , , , , , , Gaby, , says:, , , , 01/10/2022 at 12:21 pm, , , , , Hello, instead of ramekins can I use a round bigger mold?, , , Reply, , , , , , , , Dora S., , says:, , , , 01/28/2022 at 2:02 pm, , , , , Yes, you should be able to, , , Reply, , , , , , , , , , Roxanna, , says:, , , , 12/31/2021 at 6:41 am, , , , , Hi, , ",
        "Vegan Date caramel": "Ingredients: super sweet and highly addictive caramel sauce. It's a very simple recipe done within 15 minutes. You can spoon/pour it over just about anything without feeling like you are overindulging. SO good!, , , There are so many vegan caramel sauces on the web, but lots of them are made using vegan butter, vegan cream and granulated sugar. These amazing gooey vegan caramel sauces are perfect for the occasional special moments.  But, don't you feel like we should be able to enjoy caramel sauces at any time without feeling like we are spoiling a good healthy eating day? A caramel sauce that you would generously pour over your children's morning oatmeal bowls without any guilt?, , I got you covered., , maple syrup, vegan milk and a hint of coconut oil. It will NOT give you the exact classic caramel-y texture that stretches and pours like a thin sauce. BUT, its flavor and smooth sticky texture is SO darn delicious. You won't be able to resist eating it by the spoon!, , And it is very straight forward to prepare. After you soak the dates, then you only have to blend everything together. Easy peasy. Play around with the amount of vegan milk to reach a desired consistency and use this caramel sauce in anything you want to add a caramel-y flavor!, , (psst. if looking for a delicious layered caramel dessert, then check out this, vegan millionaire shortbread, !), , , Why you will love this vegan caramel sauce, , , Rich flavor, , Sticky, thick and super smooth texture, , Extra sweet, thanks to the medjool dates, , Easy, quick and simple recipe, , No cooking required!, , A healthier option compared to regular caramel sauces, , , How to make this vegan caramel sauce, , , Soak the pitted dates in plenty of boiling water for 10 minutes. Drain., , Then, blend the softened dates, maple syrup, coconut oil and vegan milk until smooth., , Et voilà!, , , , Watch how to make it, , , Tips when making a date caramel sauce, , , The type and freshness of your dates will largely influence the result of your caramel. You want to choose large, moist, soft and fresh medjool dates. The small-ish, dried out and old dates that have been hanging out in your pantry for a while might not be the best choice when making this caramel sauce. You are looking for plump dates that will create a rich flavor and texture. You can find, medjool dates, in the produce section at your grocery stores., , When blending the sauce, take a few breaks to scrape the walls. You might have to do this for a few times. Even after soaking your dates and using a high speed blender, dates can take some time to be crushed into a luscious sauce., , You can adjust the texture of your sauce with more vegan milk if desired, especially if looking for a more pourable sauce. Using more milk will make your sauce not as sweet, which you could adjust by adding an extra tablespoon or so of maple syrup., , , Recipe variation, , I keep this recipe simple as I find its flavor so rich and delicious just as it is. But, you can also:, , , Add a hint of vanilla extract to enhance even more the sweetness., , Use canned coconut milk (mix well before using) instead of regular vegan milk. This will add more fat to the recipe, but also more richness and creaminess., , If you love the salt and sweet flavor combo, then add a pinch of sea salt., , , , How to use this vegan caramel sauce, , The question should be more how, not, to use this decadent delicious sauce! Here are my favorite usages:, , , Morning oatmeal or, vegan overnight oats, , Generously spread over toast or this, vegan apple cinnamon bread, , As a dipping sauce for fruits (perfect for apples), , Over vegan ice cream or when making, caramel ice cream cups, , To top cakes, cupcakes, , healthy black bean brownies, , , vegan banana muffins, , Or, for bad-days-binge-eating by the spoon. You do you, we are not watching., , , Storage, , Keep the date caramel sauce in a airtight container for 1-2 weeks in your fridge. Stir before using. The caramel might appear thicker as it cools down., , It can also be frozen for up to 3 months., , , Other sweet dessert sauces/toppings you might like, , , Cherry marmalade, , Coconut whipped cream, , Healthy peanut butter frosting, , Vegan cashew vanilla icing, , Tahini caramel sauce, , Vegan fruit dip, , , I hope you enjoy this vegan caramel sauce recipe as much as we do! If you try it, please leave a comment below and, rate the recipe, to let me know how it was., Your feedback is so helpful!, , Let's stay in touch with, Instagram, ,, Pinterest, and, Facebook, . Also, don't forget to subscribe to my newsletter to be sure not to miss anything., , 📖 Recipe, , , , Vegan Caramel Sauce (Healthier Recipe), , , 5, from, 6, votes, , , super sweet and highly addictive caramel sauce. It's a very simple recipe done within 15 minutes. You can spoon/pour it over just about anything without feeling like you are indulging. SO good!, , , , , PRINT RECIPE, , PIN RECIPE, , , , , , Prep Time, 15, minutes, , mins, Cook Time, 0, minutes, , mins, Total Time, 15, minutes, , mins, , , , , , , Servings, 8, Author, Jessica Laroche, , , , , 1x, 2x, 3x, ▢, 15, , large medjool dates, -, pitted, ▢, ¼, , cup, , maple syrup, ▢, 1, , tbsp, , coconut oil, -, choose refined to avoid coconut flavor, ▢, ¾ to 1, , cup, , vegan milk, -, or more to reach desired consistency, use oat milk for a nut-free recipe, , Transfer to a air-tight container and store in the fridge for up to 7-10 days. Can be frozen for up to 3 months., , Video, , Notes, , , Serve over vegan ice cream, cakes, toasts, oatmeal bowls, , vegan overnight oats, , , vegan ice cream cups, , topping, vegan banana muffins, or cupcakes. Or, simply by the spoon!, , Nutrition: please note that the nutritional information is an estimate per serving provided for informational purposes only (calculated by software) and accuracy is not guaranteed. Consult with your healthcare provider or a registered dietitian if you need precise nutrition calculations for health reasons., , , NUTRITION, Calories:, 178, kcal, |, Carbohydrates:, 43, g, |, Protein:, 1, g, |, Fat:, 2, g, |, Saturated Fat:, 1, g, |, Polyunsaturated Fat:, 0.03, g, |, Monounsaturated Fat:, 0.1, g, |, Sodium:, 12, mg, |, Potassium:, 347, mg, |, Fiber:, 3, g, |, Sugar:, 38, g, |, Vitamin A:, 113, IU, |, Calcium:, 72, mg, |, Iron:, 1, mg, , , , , , CLICK TO SUBSCRIBE FOR UPDATES!, , , , , , SHARE ON FACEBOOK, , SHARE BY EMAIL, , More Easy Plant-based Sauces, Dips and Condiments, Buffalo Chickpea Dip (Vegan), Red Kidney Bean Hummus, Mango Corn Salsa, Easy Lemon Dill Hummus, Reader Interactions, Comments, , , , , , Amy J., , says, , , February 02, 2025 at 6:30 am, , , , Yummy! I omitted the oil and it’s still super creamy and delicious! I use it to make a healthy caramel macchiato., , , Reply, , , , , , , , Jessica, , says, , , February 02, 2025 at 2:30 pm, , , , Hi Amy, thanks so much for your feedback, so glad it worked out! 😊, , , Reply, , , , , , , , , , Keiarra T, , says, , , June 06, 2024 at 10:52 pm, , , , What can I sup coconut oil for? My daughter has but allergie., , , Reply, , , , , , , , Jessica, , says, , , June 08, 2024 at 3:54 pm, , , , Hi Thanks for your question! You can omit the oil completely, it will still work! 😊, , , Reply, , , , , , , , , , Dani, , says, , , June 04, 2024 at 12:13 pm, , , , Made this today minus the maple syrup and it was just the right sweetness for my liking. I’ve eaten it with an apple and added some to my peanut butter protein balls. Thank you for this delicious recipe!, , , Reply, , , , , , , , Jessica, , says, , , June 04, 2024 at 2:15 pm, , , , Hi Dani! Thanks so much for taking the time to comment. I'm glad you liked it! 😊, , , Reply, , , , , , , , , , laura, , says, , , February 29, 2024 at 3:36 pm, , , , has anyone use honey instead of maple syrup??, , , Reply, , , , , , , , Jenny, , says, , , December 08, 2023 at 8:03 pm, , , , This is soooo delicious!  I’m totally addicted to this dip with apple slices…Yummo!!  I make it with canned coconut milk to make it extra creamy and add a pinch of salt., , , Reply, , , , , , , , Jessica, , says, , , December 09, 2023 at 6:59 am, , , , Oh yum, coconut milk sounds amazing 😊 Thanks for sharing!, , , Reply, , , , , , , , , , Evelyn, , says, , , April 10, 2022 at 6:40 pm, , , , This is absolutely my favorite.  I make it weekly😊. I first tried it with Deglet Noor dates as that is all I had and a big tub from Costco.  Finally tried Mejooled dates and what a difference.  I loved them before. But now wow these are fantastic, , , Reply, , , , , , , , Jessica, , says, , , April 10, 2022 at 6:49 pm, , , , Thank you for your comment Evelyn! I'm glad you like it 🙂, , , Reply, , , , , , , , , , Kimberly Grant, , says, , , December 06, 2021 at 8:02 pm, , , , Love this sauce! Has a great flavor and just the right amount of sweetness., , , Reply, , , , , , , , plantbasedjess, , says, , , December 06, 2021 at 9:27 pm, , , , Oh great Kimberly! I'm glad you liked it 🙂, , , Reply, , , , , , , , Pam, , says, , , February 21, 2022 at 1:36 pm, , , , This is a wonderful recipe!, I make it often!  Just wanted to add that I save the soaking water and use it in a variety of ways!!!  It’s just enough sweetness for smoothies or cereal or  whatever creativity takes you with it!!☺️, , , Reply, , , , , , , , Jessica, , says, , , February 21, 2022 at 2:53 pm, , , , Hi Pam! I'm so glad you like it, thanks for your comment! 🙂, , , Reply, , , , , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, , , Email, , , , , , Δ, , , Primary Sidebar, , , , ABOUT JESS, , , , , , Hi there! I’m Jessica, a pasta obsessed French Canadian now living in beautiful Maine.  I’m a mom of two, , Join me in my kitchen to discover fun and creative recipes or, click to find out more, . Welcome!, , , , CONNECT WITH ME, , , , Facebook, , Instagram, , Pinterest, , YouTube, , , , 🌱 SPRING RECIPES, , , , Barley breakfast bowl with a strawberry-rhubarb compote, Vegan Watermelon Salad with Mint and Cucumber, Vegan Garlic Pasta Bake, Vegan Spinach Quiche (Gluten-Free), Creamy Green Pea Pasta Sauce (20-min Vegan Recipe), Mango Cherry Smoothie, , , POPULAR RECIPES, , , , 3-Ingredient Almond Flour Peanut Butter Cookies, Passion Fruit Mocktail, Easy Buckwheat Bread (No yeast, No kneading!), Oven-Roasted Potatoes and Broccoli, Kale Tonic (First Watch Copy Cat Recipe), Flaxseed Pudding, Footer, , Copyright © 2021 Plant Based Jess, , Privacy Policy, , , , , , , , , , , , , , , , , , , , , , Instructions: , Soak the pitted dates in boiling water for 10 minutes.",
        "Vegan Caramel": "Ingredients: , , Sweet, more-ish vegan caramel sauce that only requires, and, 5 minutes, to make?, , Yes, dreams really can come true., , , , Brown sugar, , Dairy-free milk, - Soy milk or full-fat coconut milk works best., , , Dairy-free butter, - Make sure it's a good-tasting one. I recommend Naturli block or Earth Balance Buttery Spread., , Vanilla extract, (Optional), Sea salt, - To make this into, Vegan Salted Caramel Sauce, , , How to make a 5-minute dairy-free caramel sauce, , It's SO easy., , stirring until bubbling and thickened!, , , Remove from the heat and allow to cool slightly before serving., , You can keep the sauce refrigerated for up to a week., , It will \"set\" when it's cooled, so you will probably need to reheat it gently, for it to regain a pourable consistency., , , Use this sauce to make..., , Vegan Chocolate Toffee Popcorn Celebration Cake, Vegan Apple Pie with Salted Caramel, Indulgent Vegan Twix Tart, , , , , , Continue to Content, , , , 📖 Recipe, , , , , 5-minute Vegan Caramel!, , , , Yield:, , 6, , , , Prep Time:, , 1 minute, , , , , Cook Time:, , 5 minutes, , , , , Total Time:, , 6 minutes, , , , , , A drool-worthy, dairy-free caramel sauce that takes just 5 minutes to make!, , , , , , Print, , , , , , , , 200 g / 1 cup brown sugar, , 4 tbsp dairy-free milk, soy milk or full-fat coconut milk works best, , 8 tbsp dairy-free butter, make sure it's a good-tasting one, , 1 tsp vanilla extract, , (Optional) ½ teaspoon of sea salt, to make Salted Caramel *, , , , , , except the vanilla extract, in a saucepan on a medium boil., Once the mixture has thickened and is bubbling slightly, after approximately 5 minutes, remove from the heat and stir in the vanilla extract., Use the sauce straight away or keep refrigerated for up to a week. The sauce will \"set\" when it's cooled so you will probably need to reheat it for it to regain a pourable consistency., , , , Notes, , , *If adding salt, to make salted caramel, I suggest adjusting to your own tastes., , , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , Pudding jars, , , , , , , , , Silicone Whisk, , , , , , , , , , , , , , Did you make this recipe?, , Please leave a comment, rate and share!, , , , , , , © Aimee, , , , , , , , , , More Sauces, Vegan Korma Curry Sauce (Low Carb), Cashew Cheese Sauce, Quick Sugar-free Strawberry Sauce, , , , 2.6K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , , Kellie, , says, , , October 29, 2023 at 7:03 pm, , , , This was absolutely delicious! The whole table loved it! Plenty left over for the week ahead as well! (I halved the recipe), , , Reply, , , , , , , , Jessica, , says, , , May 05, 2023 at 6:16 am, , , , Hi I just made this and it tastes great but it did not have a pourable consistency. More like a sticky one. How do I make t pourable so that I can drizzle it on my cupcakes?, , , Reply, , , , , , , , Aimee, , says, , , May 10, 2023 at 1:18 pm, , , , It will become sticky and firm as it cools, so you can either simply reheat it (gently) or thin it out a bit more with some dairy-free milk., , , Reply, , , , , , , , , , Jessica, , says, , , May 04, 2023 at 9:01 pm, , , , Can I use Earth Balance butter sticks instead of the spread?, , , Reply, , , , , , , , Aimee, , says, , , May 10, 2023 at 1:19 pm, , , , Yes, any dairy-free butter alternative should work but just make sure it's a good-tasting one as it will strongly effect the flavour :), , , Reply, , , , , , « Older Comments, Primary Sidebar, , , , I'm Aimee, , the author behind the Wallflower Kitchen blog and 'Great British Vegan' cookbook, , More about me →, , , Trending recipes, , Baked Bubble & Squeak Cakes, Creamy Vegan Mushroom Risotto, Easy Vegan French Toast, Footer, , ↑ back to top, , , , About, , , Privacy Policy, , About, , , , , Contact, , , Contact me, , , , Pinterest, , RSS Feed, , YouTube, , , , , As an Amazon Associate I earn from qualifying purchases. This blog earns income from ads., , Copyright © 2024, Wallflower Kitchen, , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2.6K, , shares, , , , , , , , , , , , , , Instructions: ",
        "Cookie Dough hummus": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., COOKIE DOUGH HUMMUS, SERVES: 6 (¼ cup each) Prep Time: 10 min.  Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 11⁄2, 1⁄2, VEGAN CONTAINER EQUIVALENTS (per serving):, 1⁄2    B  1⁄2, 1⁄2, 1¾ cups, , \u0007canned chickpeas, drained, and rinsed, ¼ cup, , dry rolled oats, ½ cup, , unsalted cashews, 3 Tbsp., , pure maple syrup, 2 tsp., , pure vanilla extract, 2 Tbsp., , \u0007unsweetened coconut, milk beverage, 1 Tbsp. + 1 tsp. \t semisweet mini chocolate chips, 1. \t Combine chickpeas, oats, cashews, maple syrup, extract, and coconut milk, in a blender or food processor; cover. Process for approximately 2 minutes, , or until smooth. Scrape down sides as needed., 2. \t Place mixture in a large bowl. Fold in the chocolate chips., 3. \t Serve immediately, or refrigerate, covered, until ready to serve. Store, refrigerated in an airtight container for up to 5 days., RECIPE NOTES:, •\t This is a very thick hummus (to imitate the texture of cookie dough) so, you may need to scrape down the sides of your blender often., •\t Apple slices are probably our favorite accompaniment for this hummus, , but pears work well too, as do carrots, or just enjoy it with a spoon!, NUTRITIONAL INFORMATION (per serving): Calories: 184  Total Fat: 6 g  Saturated Fat: 1 g  Cholesterol: 0 mg  Sodium: 21 mg  Carbohydrates: 25.5 g  Fiber: 4 g, Sugars: 7 g  Protein: 6 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Chickpea Brownie Dip": "Ingredients: gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., CHICKPEA BROWNIE DIP, Serves: 9 (approx. ¼ cup each), GF VG, Total Time: 10 min., Prep Time: 10 min., Cooking Time: None, 2 cups, water, 1 cup, semisweet chocolate chips, 1 tsp., coconut oil, 1½ cups, canned chickpeas (garbanzo beans), drained, rinsed, ½ cup, pure maple syrup, ¼ cup, unsweetened coconut milk beverage, 2 Tbsp., unsweetened cocoa powder, 1 tsp., pure vanilla extract, 1., Bring water to a boil in a small pot over high heat; reduce heat to low., 2., \u0007Place a large, heatproof bowl over pot; add chocolate chips and coconut oil. Stir to combine. Cook, stirring, occasionally, for 5 to 6 minutes, or until chocolate is fully melted., 3.\t \u0007Add melted chocolate, chickpeas, maple syrup, coconut milk, cocoa powder, and extract to a food processor or, blender; pulse until smooth., 4.\t Serve with fruit for dipping., RECIPE NOTES:, • Don’t forget to count the fruit for dipping toward your, Container (Fruits)., • \u0007You can make this recipe vegan by purchasing vegan semisweet chocolate chips., Container counts would be, 1½ and, 1., • Leftovers can be stored refrigerated in an airtight container for up to 4 days. , Instructions: ",
        "Chocolate Donuts": "Ingredients: , since foods are often processed at facilities that also process wheat and other grains., CHOCOLATE DONUTS, SERVES: 12 (1 donut each) Prep Time: 20 min. + 1 hr. Cooking Time: 16 min., CONTAINER EQUIVALENTS (per serving):, 2, 2, FOR DONUTS:, ½ cup, coconut sugar, ½ cup, unsweetened coconut milk, 1⁄3 cup, pure maple syrup, ¼ cup, melted ghee, , (organic grass-fed, if possible), 1, large egg, 1 tsp., pure vanilla extract, 1½ cups, gluten-free all-purpose flour, , (preferably Bob’s Red Mill®, , All-Purpose Baking Flour,, , red label), ½ cup, almond flour, 1½ tsp., baking powder, gluten-free, ½ tsp., sea salt (or Himalayan salt), FOR DIP:, 1 cup, , semisweet chocolate chips, 1 tsp., , coconut oil, SPECIAL EQUIPMENT:, Donut pans, Nonstick cooking spray, 1.\t\t Preheat oven to 350° F., 2.\t\t Coat two donut pans with cooking spray (or work in batches with one donut, pan, if needed)., 3.\t\t Place sugar, coconut milk, maple syrup, ghee, egg, and extract in blender;, cover and blend until smooth. Leave in blender; set aside., 4.\t\t In a medium mixing bowl, stir together flour, almond flour, baking powder, , and salt. Add contents of bowl to blender; cover and blend until smooth batter, forms, scraping down sides as needed., 5.\t\t Transfer batter to a piping bag or resealable plastic bag. Cut a medium hole at, the bottom corner. Divide batter evenly among 12 donut molds; bake 14 to 16, minutes, rotating pans and switching shelves halfway through cooking, until a, toothpick inserted into the center of a donut comes out clean. Transfer donuts, to a cooling rack; let cool 1 hour., 6.\t\t Place a heatproof bowl over a pot of gently simmering water. Add chocolate, chips and oil; stir until melted., 7.\t\t When donuts have cooled, dip one side of each into chocolate; place on, cooling rack to set before serving., 8.\t\t Store donuts refrigerated in an airtight container for up to 5 days., \u0007RECIPE NOTES:, •\t You can carefully divide the batter by pouring out of a liquid measuring, cup or spooning the batter into the donut pan. This will likely be messy!, Using a resealable bag with a hole cut at the bottom corner works just as, well as a piping bag. Be sure to scrape down batter with a butter knife., •\t Not all of the chocolate mixture will stick to the donuts. The Ultimate, Portion Fix containers for this recipe are calculated based on how much, chocolate mixture is actually consumed., NUTRITIONAL INFORMATION (per serving): Calories: 226  Total Fat: 10 g  Saturated Fat: 5 g  Cholesterol: 10 mg, Sodium: 115 mg  Carbohydrates: 32 g  Fiber: 2 g  Sugars: 15 g  Protein: 3 g, Bob’s Red Mill is a trademark of Bob’s Red Mill Natural Foods, Inc., © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 5, Instructions: ",
        "Coconut Macaroons": "Ingredients:  Instructions: ",
        "Cranberry Orange Biscotti": "Ingredients:  Instructions: ",
        "Deconstructed cheesecake dip": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the QE  icon are designed to be made in less than 15 minutes and require little to no cooking., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., GF, DECONSTRUCTED CHEESECAKE DIP, SERVES: 4 (¼ cup + 1 Tbsp. dip, and 2 Tbsp. crumble each)  Prep Time: 10 min.  Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, 1, 2, FOR CRUMBLE:, ½ cup, , crushed gluten-free graham, , crackers, 1 Tbsp., , extra-virgin coconut oil, , , room temperature, 1 tsp., , pure maple syrup, FOR CHEESECAKE:, 1 cup, , cream cheese, softened, 1 Tbsp. + 1 tsp. \t reduced-fat (2%) sour cream, 1 Tbsp. + 1 tsp. \t pure maple syrup, ½ tsp., , pure vanilla extract, 1 pinch, , sea salt (or Himalayan salt), , , Mixed fruits for dipping, 1.\t\t To make crumble, place graham crackers in food processor; pulse into fine, crumbs. Add coconut oil and maple syrup; pulse until combined. Set aside., 2.\t\t To make cheesecake, add cream cheese, sour cream, maple syrup, extract, , and salt to a large mixing bowl. Using a hand mixer, beat until smooth., 3.\t\t Transfer cream cheese mixture to serving bowl; top with graham cracker, crumble. Serve immediately with mixed fruits for dipping, or store in an, airtight container in the refrigerator for up to 4 days., \u0007RECIPE NOTES:, •\t \tTo bring the coconut oil to room temperature and soften the cream, cheese, let them rest on the counter until soft enough to whip., •\t \tDon’t forget to use your, container to count your fruit for dipping!, NUTRITIONAL INFORMATION (per serving, excluding fruit): Calories: 277  Total Fat: 20 g  Saturated Fat: 13 g  Cholesterol: 52 mg  Sodium: 303 mg, Carbohydrates: 19 g  Fiber: 1 g  Sugars: 11 g  Protein: 5 g, QE, RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Nutty Vegan Chocolate Digestives": "Ingredients: , , A homemade vegan digestive biscuit topped with a layer of chocolatey toasted almonds! These are essentially pimped up digestives. So if you’re a fan of chocolate digestives, you definitely need to give these a try!, , Dark chocolate Digestives are my go to biscuit and I often make my own at home because they’re so easy to make and I think everything tastes better when it’s homemade. So I decided to make a fancier version with toasted flaked almonds in the chocolate topping. The almond chocolate layer really makes them feel so decadent – like the biscuits you would spend a lot of money on in fancy tea shops. In fact they would also make a really nice edible gift for someone special who likes their biccies., , , You could top them with any nut you prefer, or if you have a nut-allergy you can leave out the nuts completely and serve them up as chocolate digestives., , I love using oats to make biscuits. They’re perfect to get that crunchy texture whilst also making them slightly healthier than your regular digestives. You can also make them gluten-free by using gluten-free oats if you’re coeliac/have a gluten sensitivity or you’re making them for someone who does., , Why you need to try these nutty vegan chocolate digestives:, , , They’re easy to make, , Vegan, , Can be made gluten-free, , Adjustable, , The biscuits are super crunchy, , Topped with a delicious crunchy chocolate layer, , , They’re a unique way to make and enjoy chocolate Digestives!, , , Are you a chocolate digestive fan?, , , , , , , Nutty Vegan Chocolate Digestives, , , , , 5, from 1 vote, , , , Print Recipe, , Pin Recipe, , , , , , Prep Time, 15, minutes, , mins, Cook Time, 20, minutes, , mins, Chill time, 20, minutes, , mins, , , , , , , Course, Dessert, Snack, Cuisine, British, , , , , , Servings, 10, Calories, 175, , kcal, , , , , Metric, US Customary, , 1x, 2x, 3x, For the digestives, 110g, , , oat flour*, 1/4, , tsp, , salt, 1/2, , tsp, , baking powder, 2, , tbsp, , brown or white sugar**, 2, , tbsp, , maple syrup***, 2, , tbsp, , coconut oil, 1 1/2, , tbsp, , almond milk, For the topping, 100g, , , dark chocolate, 45g, , , almonds, , , September 24, 2015, , , , , , , , , Mushroom Stuffed Potato Cakes, , March 1, 2019, , , , , , , , , Vegan & Gluten-free Florentines, , December 13, 2022, , , , , , , , , Blueberry Soft Baked Bars, , December 6, 2022, , , , , , , , , Healthy Grain-free Granola Recipe, , August 16, 2023, , , , , , , , , , , , , Raspberry Oat Snack Bars, , January 31, 2025, , , , , , , , , Blueberry Oat Bars, , December 28, 2024, , , , , , , , , Date Pistachio Chocolate Wreaths, , December 23, 2024, , , , , , , , , 5-Ingredient Chocolate Orange Pudding, , December 19, 2024, , , , , , , , , Vegan Pistachio Protein Bars, , November 29, 2024, , , , , , , , , Easy Chocolate Tahini Recipe, , November 28, 2024, , , , , , , , , Healthy Date and Walnut Cake, , November 21, 2024, , , , , , , , , Healthy Tahini Pudding, , November 13, 2024, , , , , , , , , Chocolate Quinoa Bites, , November 6, 2024, , , , , , , , , Chocolate Sticky Toffee Puddings, , October 30, 2024, , , , , , , , Follow Me on Socials:, , , , , , , , , , , , , , , , , , , , , , , Home, Recipes, Work With Me, Privacy Policy, Cookie Policy, Sitemap, , , , , , , , , , , , , , , , , , , , , , , , , NADIA'S HEALTHY KITCHEN © 2013-, • ALL RIGHTS RESERVED., , , , , , , , , , , , , , , Page load link, , , , , , , , , , , , , , , , , , , , , , Go to Top, , , , , Instructions: , Preheat your oven to 180C/160C fan., Mix the oats, sugar, baking powder and salt in a bowl, then pour in the oil, milk and maple syrup. Mix to create a dough (if the dough is too soft, place in the fridge for 15-20 minutes)., Roll out between 2 sheets of baking paper, then use a round cookie cutter to cut out the biscuits., Arrange on a baking tray and bake for 15-20 minutes until golden brown. Leave to cool completely., In the meantime dry toast the almonds in a pan for a few minutes until they brown sightly. Set to one side to cool., Melt the dark chocolate in the microwave, then fold in the toasted almonds until fully coated., Once the biscuits have cooled, top each with some of the almond chocolate mixture, then place in the fridge for 5-10 minutes to allow the chocolate to set., Store in an air-tight container at room temperature., , , Notes, * O, ats blended into a fine flour in a high-speed blender. Use gluten-free oats for a gluten-free recipe., , ** Any granulated sweetener will work., , *** Other liquid sweeteners like honey, agave, etc. will work., , Nutrition, Calories:, 175, kcal, Carbohydrates:, 18, g, Protein:, 3, g, Fat:, 10, g, Saturated Fat:, 5, g, Polyunsaturated Fat:, 1, g, Monounsaturated Fat:, 3, g, Trans Fat:, 0.004, g, Cholesterol:, 0.3, mg, Sodium:, 88, mg, Potassium:, 155, mg, Fiber:, 2, g, Sugar:, 8, g, Vitamin A:, 4, IU, Calcium:, 45, mg, Iron:, 2, mg, , , , , Keyword, dairy-free, gluten-free cookies, gluten-free dessert, vegan, vegan biscuits, vegan cookies, , , , , Tried this recipe?, Let us know, how it was!, , , , Nadia, 2022-10-07T16:23:47+01:00, October 7, 2022, |, Chocolate, , , Cookies, , , Dairy Free, , , Desserts, , , Gluten Free, , , snack, , , Sweet Snacks, , , Vegan, , , Vegetarian, |, 14 Comments, , , Share This Recipe!, , Facebook, X, Reddit, LinkedIn, WhatsApp, Tumblr, Pinterest, Email, , , , , Related Posts, , , , , , , , , , , , Raspberry Oat Snack Bars, , , , , , , , , , , , , , , , Blueberry Oat Bars, , , , , , , , , , , , , , , , Date Pistachio Chocolate Wreaths, , , , , , , , , , , , , , 14 Comments, , , , , , , , , Lara Delbono, July 30, 2021 at 4:25 pm, - Reply, , , , Can i have a recipe in Italian, , Thanks, , , , , , , , , , , Nadia, August 1, 2022 at 7:05 pm, - Reply, , , , , , , , , , , , , , , , Amaal nabil, July 30, 2021 at 7:51 pm, - Reply, , , , Can i use honey instead of sugar for the digestive?, , , , , , , , , , , Nadia, August 1, 2022 at 7:10 pm, - Reply, , , , Hi Amaal 🙂 You can substitute the sugar with another granulated sweetener. If you use honey instead of sugar there will be too much moisture and so you’ll will need to add more oat flour. Can’t give you the exact quantities since I haven’t tried it myself, but do let me know how they turn out if you try honey!, , , , , , , , , , , , , Irish, February 3, 2022 at 4:09 am, - Reply, , , , Can’t wait to make these!!, , , , , , , , , , , Nadia, February 4, 2022 at 3:45 pm, - Reply, , , , Let me know what you think once you’ve tried them 😀 x, , , , , , , , , , , , , Elaine, October 7, 2022 at 9:40 pm, - Reply, , , , Hi Nadia, these look amazing!! Do you think almond flour would work instead of oat flour? xx, , , , , , , , , , , Natalie, October 19, 2022 at 9:05 am, - Reply, , , , Looks amazing but I can’t eat coconut. Any other oil possible than coconut or is it important for taste and consistency?, , , , , , , , , , , Nadia, October 19, 2022 at 12:01 pm, - Reply, , , , Hi Natalie 🙂 You can use butter/margarine/vegan butter alternative instead 🙂 Let me know what you think once you’ve tried the recipe 😀 x, , , , , , , , , , , Preetika, February 24, 2023 at 9:00 am, - Reply, , , , Hi if I’m using butter instead of coconut oil it should be salter or unsalted ? Recipe calls for 2 tbsp coconut oil so it should be 2 tbsp butter ? Also can I use cooking oil also if not butter ?, , , , , , , , , , , Nadia, February 24, 2023 at 6:10 pm, - Reply, , , , Hi Preetika 🙂 You can substitute with equal quantities of butter, so 2 tbsp. Butter will work better than oil and I would recommend using unsalted as there’s salt added in the recipe., , , , , , , , , , , , , , , , , Fanni, December 22, 2022 at 3:07 am, - Reply, , , , Hi! 🙂 If I wanted to make it sweeter, do I just need to add more granulated sugar or do I need to adjust the maple syrup also for consistency purpose?, , , , , , , , , , , Nadia, December 22, 2022 at 3:55 pm, - Reply, , , , I would add more granulated sugar – if you add more maple the dough may end up being too wet. Let me know how you get on 😀, , , , , , , , , , , , , Trish, October 24, 2023 at 1:36 pm, - Reply, , , , These look fabulous! Any chance that making these without oil or butter might work?, , , , , , , , , Leave A Comment, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , Search for Recipes, , , , , Search for:, , , , , , , , , , , , , , Popular, , Recent, , , , , , , , , , , , Vegan Tahini Brownies, , June 27, 2022, , , , , , , , , 2-ingredient Chocolate Quinoa Crunch Bites, , January 19, 2019, , , , , , , , , Peanut Butter Chocolate Oat Cups, , January 5, 2022, , , , , , , , , 5-Ingredient No-Bake Chocolate Covered Brownies, , May 13, 2023, , , , , , , , , 3-Ingredient Chocolate Crunch Doughnuts, , September 8, 2022, , , , , , , , "
    }
}