{
    "ingredients": {
        "Matcha Chocolate Chip Cookies": "Air Fryer,Butter,Cane sugar,matcha,flour,chocolate chips, vanilla extract",
        "Chocolate Chip Cookies": "almond milk,semi sweet chocolate,dark chocolate,sugar,baking soda",
        "Vegan Chocolate Chip Cookies": "dark brown sugar, coconut oil,almond milk,oat flour,chocolate chunks",
        "Flourless mudslide chocolate cookies": "sugar,cocoa powder,egg whites,vanilla extract,chocolate chips",
        "Healthy chocolate chip cookies": "coconut oil, applesauce,brown sugar,vanilla extract,egg,whole wheat flour, baking soda,cinnamon,dark chocolate chips",
        "Vegan sugar cookies": "all purpose flour,baking powder,chia seeds/flaxseed powder,vegan butter,vanilla extract,almond milk",
        "Holiday Sugar Cookies": "all purpose flour,corn starch,baking powder,maple syrup,egg,ghee,vanilla extract,colored decorating",
        "Banana Oatmeal cookies": "rolled oats,cinnamon,bananas,raisins,walnuts",
        "Baked Oatmeal Cookies": "rolled oats,cinnamon,bananas,raisins,walnuts",
        "Double Chocolate cookies": "coconut oil,applesauce,maple syrup,coconut milk,coconut flour,whole wheat flour,cocoa powder,chocolate chips",
        "Gluten Free Chocolate chip cookies": "coconut oil,sugar,egg yolk,vanilla extract,all purpose flour, baking soda, baking powder,chocolate chips"
    },
    "recipe_url": {
        "Matcha Chocolate Chip Cookies": "https://culinaryshades.com/matcha-chocolate-chip-cookies/?fbclid=IwAR30hyDZ-movGYyslE5C7rkFzvoWu2aAyFJW4tmgQP9aMJoDm9sri5p_Tv8",
        "Chocolate Chip Cookies": "https://tasty.co/recipe/vegan-chocolate-chip-cookies",
        "Vegan Chocolate Chip Cookies": "https://lovingitvegan.com/vegan-chocolate-cookies/",
        "Flourless mudslide chocolate cookies": "https://mygluten-freekitchen.com/flourless-chocolate-mudslide-cookies-gluten-free-dairy-free/",
        "Healthy chocolate chip cookies": "https://www.wellplated.com/healthy-chocolate-chip-cookies/or https://bakerbynature.com/the-most-wonderful-vegan-chocolate-chip-cookies-ever/",
        "Vegan sugar cookies": "https://itdoesnttastelikechicken.com/perfect-vegan-sugar-cookies/#recipe",
        "Holiday Sugar Cookies": "fixate_recipes\\Dessert\\Fixate_BOD_Recipes-Holiday-Sugar-Cookies.pdf",
        "Banana Oatmeal cookies": "fixate_recipes\\Dessert\\FXR_Banana_Oatmeal_Cookies_R_03.19.182.pdf",
        "Baked Oatmeal Cookies": null,
        "Double Chocolate cookies": "fixate_recipes\\Dessert\\FXR_Double_Chocolate_Cookies_R_03.19.18.pdf",
        "Gluten Free Chocolate chip cookies": "fixate_recipes\\Dessert\\FXR_Gluten_Free_Chocolate_Chip_Cookies_R_03.19.18.pdf"
    },
    "Recipe": {
        "Matcha Chocolate Chip Cookies": "Ingredients: , sugar, , all-purpose flour, , , vanilla extract, , and a pinch of salt. You can easily substitute, all-purpose flour, with, almond flour, to make gluten-free matcha cookies., , The green color of the cookies is because of the, matcha powder, . Matcha powder is a fine powder made from green tea leaves and hence these cookies are also known as green tea cookies., , , , , , , , , 5 Awesome, , Air Fryer, Recipes, , Free email series, , , , , , , , , , , YES, I WANT IT!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Depending on the brand of the matcha powder, the cookies may be less or more green. It is best to use a high-quality matcha powder of culinary grade for optimum results. Also, to ensure that the cookies hold their color on storing, store them in an air-tight container., , I use unsalted butter and it must be at room temperature so you can keep the butter stick outside the fridge for a few hours. If you do not have unsalted butter, you can substitute it with the salted butter and skip the salt., , Chocolate chips add sweetness and chocolatey flavor to the cookies and you can adjust the quantity as per your preference. I have tried making these cookies with baking chocolate chips and also the ones made with, stevia, . Both of them turn out good and taste great!, , , , How to make matcha chocolate chip cookies?, , , It is really very easy to make matcha chocolate chip cookies at home. Before you start making the cookie dough, ensure that the butter is soft and at room temperature. It can also be softened in the microwave by heating it for about 20-30 seconds., , , , , , In a large bowl, whip the butter with a, hand blender, using the, whisk, attachment or in the, stand mixer, using the wire attachment until the butter is light and fluffy. Add sugar and continue to beat the butter and sugar mixture until the mixture is fluffy., , , , Add matcha powder, salt, , vanilla extract, , all-purpose flour, and chocolate chips and mix well. You can use the flat beater attachment of the, stand mixer, to make the cookie dough or bind it with your hands., , , , , , Once the matcha cookie dough is made, preheat the oven to 350° F with the rack at the middle level. In the meantime, divide the dough into equal parts of about 30 grams each, roll them into a ball and flatten them by pressing slightly and place them on a, parchment paper, -lined in the, baking tray, ., , , Place the tray in the oven and bake the matcha cookies for about 15 minutes until the edges start turning golden brown. Remove the tray from the oven and allow the cookies to cool down before transferring or they can crumble and break., , Cooking matcha cookie recipe in air fryer, , Matcha cookies can easily be cooked in the air fryer, especially if you are planning to cook a small batch or if you are baking something else in your oven., , , Since the air fryer is small and the heat circulates in a smaller area, the cookies need a lower temperature of 330 °F to bake. While you are making balls from the cookie dough, preheat the air fryer to 330 °F., , , , , , Make balls of about 30 grams each, flatten them by pressing slightly and place them in the air fryer basket on, parchment paper, . Air fry the cookies for about 8 minutes until the edges start turning golden brown., , , Remove the air fryer basket and allow the cookies to cool down completely before transferring., , , , Storing suggestions, , Matcha cookies can be stored in an air-tight container for about a week. If left open or exposed to air, they can lose some green color and turn brown. So to ensure they retain their color, store them in an air-tight container., , , , , If you enjoyed this recipe, you may also like, , , No egg cookies, , Gluten-free cookies, , Pumpkin cookies, , Chocolate covered strawberries, , Matcha ice cream, , Pumpkin mousse, , , , , Don't forget to rate the recipe by clicking the stars. Also, pin the recipe by clicking the \"Pin\" button, for your future reference., , 📖 Recipe, , , , Matcha Chocolate Chip Cookies, , , If you are looking to make a treat that is green in color then these matcha chocolate chip cookies are a must-try. They are easy to make, soft to bite, and absolutely delicious. Matcha cookies are made with green tea powder or matcha powder and can be baked in the oven or in the air fryer., , , 5, from, 3, votes, , , Rate Recipe, , Print, , Pin, , , Save, Saved!, , , Course:, Dessert, Snack, Cuisine:, American, Diet:, Vegetarian, , , Prep Time:, 15, minutes, , mins, Cook Time:, 15, minutes, , mins, Total Time:, 30, minutes, , mins, , Servings:, 20, , cookies, , Calories:, 159, kcal, , Author:, Alpa Jain, , , , Equipment, Stand Mixer, Convection Oven, Instant Vortex Air Fryer, , ▢, ½, , cup, , Butter, , (unsalted, at room temperature), ▢, ½, , cup, , Organic cane sugar, ▢, 1, , tablespoon, , Matcha Powder, ▢, ⅛, , teaspoon, , Salt, ▢, 1, , cup +, 2 tbsp, , All-purpose flour, , (, 150 grams, ), ▢, 1, , cup, , Semi sweet Chocolate Chips, ▢, ¼, , teaspoon, , Vanilla extract, US Customary, -, Metric, , , Cook Mode, Prevent your screen from going dark,  Instructions: Whip the butter with a hand blender or a stand mixer. (use the wire attachment)., Add sugar and continue to whisk until the mixture is fluffy., Add matcha powder, salt, vanilla extract, all-purpose flour, and chocolate chips and mix well., Baking in oven, Preheat oven to 350° F with the rack at middle level., Make balls of about 30 grams each, flatten them by pressing slightly and place on a parchment paper lined in the baking tray., Place the baking tray in the oven and bake for about 15 minutes until the edges start turning golden brown., Remove the tray from the oven and allow the cookies to cool down., Baking in the air fryer, Preheat the air fryer to 330 °F., Make balls of about 30 grams each, flatten them by pressing slightly and place them in the air fryer basket on a parchment paper., Air fry the cookies for 8 minutes until the edges start turning golden brown., Remove the air fryer basket and allow the cookies to cool down completely before transferring., , Notes, , To make it, vegan, , you can use vegan butter., , To make it, gluten-free, , replace the, all-purpose flour, with 1 ¼ cup (140 grams), almond flour, ., , For consistent results, weigh the flour instead of measuring by a cup (click on \"metric\" units under the ingredient list), , , , , Nutrition Facts, Matcha Chocolate Chip Cookies, Amount per Serving, Calories, 159, % Daily Value*, Fat, , 9, g, 14, %, Saturated Fat, , 6, g, 38, %, Trans Fat, , 1, g, Polyunsaturated Fat, , 1, g, Monounsaturated Fat, , 3, g, Cholesterol, , 13, mg, 4, %, Sodium, , 56, mg, 2, %, Potassium, , 77, mg, 2, %, Carbohydrates, , 17, g, 6, %, Fiber, , 1, g, 4, %, Sugar, , 9, g, 10, %, Protein, , 2, g, 4, %, Vitamin A, , 185, IU, 4, %, Calcium, , 10, mg, 1, %, Iron, , 1, mg, 6, %, * Percent Daily Values are based on a 2000 calorie diet., , , , Click below to checkout more videos on, Culinary Shades YouTube channel, , , , , , , , , , , Subscribe to Newsletter, , Receive new recipes in your inbox, , , , , , , , , , , YES, I WANT IT!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Recipes for you, Air Fryer Vanilla Cupcakes, Indian Charcuterie Board, Air Fryer Chocolate Cake, Air Fryer Pumpkin Bread, , , , , , Facebook, 13, , , , , Pinterest, 55, , , , , X, , , , , WhatsApp, , , , , Yummly, , , , , Flipboard, , , Reader Interactions, , , Comments, , No Comments, , , , , 5 from 3 votes (, 3 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , Primary Sidebar, , , , Hi! I am Alpa. I am passionate about cooking and love to share my tried and tested vegan and vegetarian recipes for your family and friends to enjoy!, , More about me →, , , Air Fryer Recipes, , Air Fryer Banana Muffins, Air Fryer Zucchini Bread, Air Fryer Banana Bread, Air Fryer Bagels, , Instant Pot Recipes, , Instant Pot Vegetarian Lasagna Soup, Christmas Tree Cinnamon Rolls, Hot Cocoa Bombs (2 Ways), Instant Pot Butternut Squash Soup (Vegetarian), , , , , , , , , , , , , , , , , , , , , , Buy Me a Coffee, , , , , Footer, , ↑ back to top, , , , About, , , Privacy Policy, , Affiliate Disclosure, , Terms of Service, , , , , Newsletter, , , Sign Up!, for emails and updates, , , , , Contact, , , Contact, , Buy me a coffee, , , , , Copyright © 2025 CulinaryShades on the, Cravings Pro Theme, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , ,",
        "Chocolate Chip Cookies": "Ingredients: Chicken, Pasta, Salmon, Potato, Beef, Diet, Healthy, Vegetarian, Low Carb, High Protein, Vegan, Meals, Breakfast, Lunch, Dinner, Desserts, Snacks, Submit a recipe to Tasty!, Have a recipe of your own to share?, Submit your recipe, Close, tricks, submenu, Kitchen Tips & Skills, Our Best Everyday Tips, Mistakes to Avoid, Advice from Chefs, Baking Basics, Culinary School Secrets, Food Hacks, Flavor Hacks, Storage Hacks, Baking Hacks, Egg Hacks, Pizza Hacks, Appliance Cooking, Instant Pot Tricks, Crock Pot Pasta, Air Fryer Recipes, Microwave Meals, Food Processor Hacks, Meal Plans, My Meal Plan, My Way, Easy Meal Prep, Family Dinners, $40 A Week, $50 A Week, Close, shop, submenu, Latest Cookbooks, Shop all, Tasty Adulting, Tasty Pride, Tasty Latest & Greatest, Shop all, cookbooks, Featured Cookware, Shop all, Tasty Ceramic Non-Stick 16-Piece Cookware Set, Shop all, cookware, Close, newsletters, submenu, Tasty Newsletter, Sign up for newsletters, Manage your subscriptions, Weeknight Dinners, Budget Recipes, Work Lunches, 5 Ingredient Meals, Latest Recipes, Family Dinners, Weeknight Dinners, Work Lunches, 5 Ingredient Meals, Budget Recipes, Latest Recipes, Family Dinners, Seasonal, Occasion, Party, Gluten, Cookies, Under 1 Hour, Special Occasion, Indulgent Sweets, Baking, Snacks, Kid-Friendly, Desserts, Easy, Vegan, Dairy-Free, Comfort Food, Vegan Chocolate Chip Cookies, featured in, Vegetarian Meals For The Day, Indulge in these delightful Vegan Chocolate Chip Cookies that'll satisfy your sweet tooth without any guilt. With a perfect balance of chewiness and crunch, these cookies are sure to become your new go-to treat., Rachel Gaewski, Tasty Team, Updated on May 04, 2023, 88, % would make again, Share via, facebook, Share via, pinterest, Share via, email, Share via, sms, Print, Total, Time, 1 hr, 1 hr, Prep, Time, 45 minutes, 45 min, Cook, Time, 15 minutes, 15 min, Inspired, by, , tasty.co, Total, Time, 1 hr, 1 hr, Prep, Time, 45 minutes, 45 min, Cook, Time, 15 minutes, 15 min, for, 10, , servings, ½ cup, sugar, (, 100, g, ), ¾ cup, dark brown sugar, (, 165, g, ), , packed, 1 teaspoon, salt, ½ cup, refined coconut oil, (, 120, g, ), , melted, ¼ cup, non-dairy milk, (, 60, mL, ), 1 teaspoon, vanilla extract, 1 ½ cups, flour, (, 185, g, ), ½ teaspoon, baking soda, 4 oz, vegan semi-sweet chocolate, (, 115, g, ), , chunks, 4 oz, vegan dark chocolate, (, 115, g, ), , chunks, Nutrition Info, View, Info, Calories, , 335, Fat, , 20, g, Carbs, , 38, g, Fiber, , 2, g, Sugar, , 24, g, Protein, , 2, g, Estimated values based on one serving size., Preparation, In a large bowl, whisk together the sugar, brown sugar, salt, and coconut oil until combined., Whisk in non-dairy milk and vanilla, until all sugar has dissolved and the batter is smooth., Sift in the flour and baking soda, then fold the mixture with a spatula, being careful not to overmix., Fold in the chocolate chunks evenly., Chill the dough for at least 30 minutes., Preheat oven to 350°F (180°C)., Scoop the dough with an ice cream scoop onto a parchment paper-lined baking sheet. Be sure to leave at least 2 inches of space between cookies and the edges of the pan so cookies can spread evenly., Bake for 12-15 minutes, or until cookies just begin to brown., Cool completely., Enjoy!, Your favorite recipes are just a click away., Download the Tasty app, to save and organize your favorites., Related Recipes, Salted Caramel Espresso Cookies, White Chocolate Cranberry Oatmeal Cookies, Chocolate Cookie Cheesecake-Stuffed Brownies, Carrot Cake Cookies, Chai Madeleines, Maple Molasses Marshmallow Cookies, Spiciest Ice Cream Sandwich, Giant Cookie Ice Cream Sandwich, Heath Bar Cookies by Devonna Banks of Butter Bakery, Inspired, by, , tasty.co, Tasty Logo footer, Get the Tasty App, Get the Tasty Newsletter, Email address, (required), Sign up, This site is protected by reCAPTCHA and the Google, Privacy Policy, and, Terms of Service, apply., Follow Tasty, © 2024 BuzzFeed, Inc, Send feedback, Recipes by Ingredient, Community Recipes, Privacy Policy, User Agreement, Accessibility Statement, Our Tasty Values, Advertise with Tasty, © 2024 BuzzFeed, Inc Instructions: ",
        "Vegan Chocolate Chip Cookies": "Ingredients: , , Add soy milk and mix it into a thick cookie dough., , , Add chocolate chips and mix in., , , Roll the cookie dough into balls and space them evenly on a parchment lined baking tray. Aim to get 20 balls from the batch., Bake at 350°F for 10 minutes., , , As soon as the cookies come out the oven, press more chocolate chips directly into the tops of the cookies., Let the cookies cool and firm up directly on the tray., , , Recipe Tips, , The cookie dough is quite dry., As you can see from the photos, the cookie dough is quite dry. However, the cookies don’t come out dry at all, so don’t worry about that. The only thing to worry about is whether you can roll the dough into balls. If the dough is just way too crumbly and won’t roll into balls, then add in another tablespoon of soy milk (or other non-dairy milk) and try again., , If the cookies don’t flatten., These cookies usually spread on their own, but if they don’t, you can allow an extra couple of minutes baking time. If they still don’t spread/flatten then just press down on the tops gently with a fork to flatten them while they are still warm and soft from the oven. Then get busy adding those extra chocolate chips to the tops of the cookies., , , Make Them Gluten-Free, , These cookies work perfectly as gluten-free. You won’t know the difference., , All you have to do is replace the regular flour with a gluten-free all purpose baking blend., , , Storing and Freezing, , Keep your cookies stored in a covered container at room temperature where they will last for up to a week. You can also store them in the fridge (covered)., , They are also freezer friendly for up to 3 months. Thaw them in the fridge and bring to room temperature on the counter before serving., , , More Vegan Cookies, , Vegan Oatmeal Cookies, Vegan Chocolate Chip Cookies, Vegan Peanut Butter Cookies, The Easiest Vegan Sugar Cookies, Vegan Pumpkin Cookies, Vegan Snickerdoodles, , , , Did you make this recipe? Be sure to leave a comment and rating below!, , , , , Vegan Chocolate Cookies, , , Delicious double-chocolate vegan chocolate cookies! Both quick and easy, crunchy and soft, these cookies are perfect for satisfying all your chocolate cravings., , , 4.93, from, 328, votes, , , Print, , Pin, , Rate, , , Course:, Cookies, Dessert, Cuisine:, American, Diet:, Vegan, , Prep Time:, 20, minutes, , minutes, Cook Time:, 10, minutes, , minutes, Total Time:, 30, minutes, , minutes, , Servings:, 20, , Calories:, 149, kcal, , Author:, Alison Andrews, , , ▢, ½, , cup, , Vegan Butter, , (112g), ▢, ½, , cup, , White Granulated Sugar, , (100g), ▢, ½, , cup, , Light Brown Sugar, , (100g), ▢, 1, , teaspoon, , Vanilla Extract, ▢, 1, , cup, , All Purpose Flour, , (125g), ▢, ⅔, , cup, , Cocoa Powder, , (56g), Unsweetened, ▢, 1, , teaspoon, , Baking Soda, ▢, ¼, , teaspoon, , Salt, ▢, 1, , Tablespoon, , Soy Milk, , or other non-dairy milk, ▢, 1, , cup, , Vegan Chocolate Chips, , (175g) + more for pressing into the tops of the warm cookies after baking, , Cook Mode, Prevent your screen from going dark, , mixing in by hand until crumbly., Add the 1 Tablespoon soy milk or other non-dairy milk and mix into a thick cookie dough., Add the chocolate chips and mix in. Your cookie dough will be very thick, but sticky enough to easily roll into balls., Roll into balls and space them evenly on a parchment lined baking tray. Aim to get 20 cookies from the batch., Bake for 10 minutes. The edges will be firm but the cookies will still be soft in the middle. This is fine, they will firm up as they cool., Press in a few more chocolate chips to the top of the cookies as they come out of the oven., , Video, , Notes, , Chocolate chips or chunks., You can use vegan chocolate chunks (chopped up vegan chocolate) instead of chocolate chips. We used chocolate chips in these photos and chocolate chunks in the recipe video., , You may need more soy milk., Depending on the brand of vegan butter you use, you may need 1 or 2 more tablespoons of soy (or other non-dairy) milk. But be patient with each addition of soy milk, stir well and see if you really need more. It is supposed to be a very thick, crumbly cookie dough. But if you try and roll a section into a ball and it just won’t hold together, then you’ll need a little more., , If the cookies don’t spread:, If you peep into your oven at the 10-minute mark and see that your cookies haven’t spread very much, you can bake for a couple of minutes longer. But even if they are quite puffy on the top, this is still fine, and you can just press down on them gently with a fork as soon as they come out of the oven still warm and soft., , Gluten-free:, These cookies work perfectly as gluten-free. You won’t know the difference. All you have to do is replace the regular flour with a gluten-free all purpose baking blend., , Storing:, Keep your cookies stored in a covered container at room temperature where they will last for up to a week. You can also store them in the fridge (covered)., , Freezing:, They are also freezer friendly for up to 3 months. Thaw them in the fridge and bring to room temperature on the counter before serving., , , Nutrition, Serving:, 1, Cookie, |, Calories:, 149, kcal, |, Carbohydrates:, 22, g, |, Protein:, 2, g, |, Fat:, 7, g, |, Saturated Fat:, 3, g, |, Polyunsaturated Fat:, 1, g, |, Monounsaturated Fat:, 2, g, |, Trans Fat:, 1, g, |, Sodium:, 123, mg, |, Potassium:, 61, mg, |, Fiber:, 2, g, |, Sugar:, 15, g, |, Vitamin A:, 219, IU, |, Vitamin C:, 1, mg, |, Calcium:, 22, mg, |, Iron:, 1, mg, , , , , , DID YOU MAKE THIS RECIPE?, Rate it & leave your feedback in the comments section below, or tag, @lovingitvegan, on Instagram and hashtag, #lovingitvegan, , Get Your Copy! It's FREE!, «, Cheesy Kale Chips, Vegan Tiffin, », , , , 24.0K, , shares, , , , , , , , , , , , , , , , , About the Author, Hi I'm Alison Andrews, I'm the voice and cook behind Loving It Vegan. I love making, delicious, vegan food and creating vegan versions of all your old favorites, so that you’ll never feel like you’re missing out. Find out more about me, here, ., , , Loving It Vegan is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. This site may contain some of these links to Amazon.com. If you make a purchase through one of those links, Loving It Vegan will receive a small commission from the purchase at no additional cost to you., , , , Reader Interactions, Comments, , , , , , Lauren, , says, , , March 18, 2025 at 9:02 pm, , , , Great recipe! I make them with a teaspoon size cookie scoop, which doubles the number of cookies. I bake half and then freeze the other half, pre-scooped. Baking time is about the same for the frozen cookies – maybe add a minute or two. I’ve also made the recipe with the additions of cinnamon and Aleppo pepper, using 1/2 cup of chocolate chips with 1/2 cup of dried cherries. Totally works! Next time I might try ginger bits with the chocolate chips., , , Reply, , , , , , , , Nadine @ Loving It Vegan, , says, , , March 20, 2025 at 11:27 am, , , , Happy to hear you enjoyed the recipe Lauren! Thanks so much for sharing and for your great review!, , , Reply, , , , , , , , , , Shawnna, , says, , , February 26, 2025 at 6:12 pm, , , , Insanely delicious. Like voodoo how decadent they are!, , , Reply, , , , , , , , Nadine @ Loving It Vegan, , says, , , March 03, 2025 at 12:26 pm, , , , Happy to hear you enjoyed the recipe Shawnna! Thanks for your great review!, , , Reply, , , , , , , , , , Joyce Lee, , says, , , February 24, 2025 at 11:10 pm, , , , I confess… I was very skeptical about this recipe but gave it a shot because of the raving reviews. This recipe did not disappoint! As noted, the dough is extremely crumbly and it did take a bit of effort to form them into balls for baking. I ended up adding 1T of soy milk at a time for a total of 3T additional on top what the recipe called for. I balled, chilled for about 15 min and baked as written. The cookies turned out PERFECTLY! They were chewy, fudgy and wasn’t crumbly like some vegan cookie recipes tend to do. Oh, I also added 1 tsp of instant coffee mixed in with the soy milk to help boost the chocolate flavor. Thank you for this recipe! The cookies were a hit and no one suspected they were vegan!, , , Reply, , , , , , , , Nadine @ Loving It Vegan, , says, , , February 26, 2025 at 7:49 am, , , , That’s amazing Joyce! Happy to hear you enjoyed the recipe. Thanks so much for sharing and for your great review!, , , Reply, , , , , , , , , , Kathleen, , says, , , February 22, 2025 at 4:26 pm, , , , Would definitely recommend! If you use a dark chocolate (50%) or over you can use only 100g and it doesn’t really affect the flavor! Also using a slightly flavored dark chocolate is absolutely lush with this recipe it turns out so lovely., , , Reply, , , , , , , , Nadine @ Loving It Vegan, , says, , , February 26, 2025 at 7:51 am, , , , Awesome! Happy to hear you enjoyed the recipe Kathleen! Thanks so much for sharing and for your great review!, , , Reply, , , , , , « Older Comments, , , Comment Policy:, Your feedback is really appreciated! Please do us a favor and rate the recipe as well as this really helps us! The most helpful comments are the ones that give useful feedback for others who might make the recipe, tell about substitutions you made or adjustments you made and how it turned out, or assisting other commenters. Rude or insulting comments will not be accepted., , , , , 4.93 from 328 votes (, 59 ratings without comment, ), , , , Leave A Comment & Review, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , Primary Sidebar, , , , Hi I’m, Alison Andrews!, I love making delicious vegan food and creating delicious vegan versions of all your old favorite dishes, so you can have your vegan cake and eat it too!, , More about me →, , , Facebook, , Twitter, , Instagram, , YouTube, , Pinterest, , , Popular Posts, , Vegan Tuna, The Best Vegan Mac and Cheese (Classic, Baked), Vegan Burrito, Super Eggy Vegan Tofu Scramble, Sliceable Cashew Cheese, Homemade Vegan Butter, , , Veganuary, , Vegan Chop Suey, Vegan German Potato Salad, Vegan Italian Dressing, Vegan Thai Peanut Noodles, Vegan Halloumi, Vegan Stuffed Mushrooms, , See all, Veganuary Recipes →, , , Footer, , ↑ back to top, , As Seen In, , , , , About, , Privacy Policy, Terms & Conditions, , , , Follow Us, , Facebook, , Twitter, , Instagram, , YouTube, , Pinterest, , , , Contact, , About, Contact, , , , Copyright © 2022, Loving It Vegan, , , Get 10 fabulous dinner recipes!, Absolutely free! Sign up below!, Get Your Copy! It's FREE!, , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , Add vegan butter, white granulated sugar and light brown sugar to the bowl of your stand mixer and cream them together until smooth., , , Add vanilla extract and mix it in., , , In a separate bowl, sift all purpose flour and cocoa powder and add baking powder and salt. Mix together., , , Preheat the oven to 350°F (180°C)., Add the vegan butter and brown and white sugar to the bowl of your stand mixer and cream them together. Add the vanilla extract and mix in., Sift the flour and cocoa powder into a separate mixing bowl and mix in the baking soda and salt.",
        "Flourless mudslide chocolate cookies": "Ingredients: , , , Powdered sugar – This acts as a flour in this recipe! If you happen to be avoiding corn, there are several brands that make a powdered sugar that is corn free. I know that as of right now, the Trader Joe’s powdered sugar is corn-free., , Cocoa Powder – I’ve tested this with several and saw no difference between using regular or Dutch cocoas., , Egg Whites – These are essential and I can’t offer you an egg substitution for these. Make sure your eggs are at room temperature before you begin too!, , Dark Chocolate: I wanted these to be rich gluten and dairy free cookies, so I used the, Enjoy Life Dark Chocolate Morsels, in these. Those give the bigger lumps in these flourless dark chocolate cookies!, , Mini chips: My go-to gluten-free, dairy-free mini chips are, Enjoy Life semisweet mini chips, ! They’re certified gluten-free as well as free of other top allergens., , , All those lumps and bumps make it seem like these have nuts, but they don’t! By using a variety of chocolate sizes, I was able to achieve that bumpy look while still keeping them free of nuts., , , I’ve been using Enjoy Life chocolate for my baking for years now. Why? Because it’s certified gluten-free and it tastes great! They’re also free of dairy, meaning I could make these gluten-free dairy-free cookies. The chips melt perfectly too!, , I buy my Enjoy Life baking chocolate locally at stores like Fred Meyer, Albertsons, my local co-op, and even Walmart. The bags of chips are easy to spot since they all have this bright teal packaging now! Some stores place these on the baking aisle with other brands of chocolate chips, while some stores place these in their gluten-free section, so check both places!, , When I really want to stock up, I buy multiple packages of them online from Amazon., , I know many of you like to just add them to your Amazon cart with other items you’re ordering, so you can find the mini chips, here, and the dark chocolate morsels, here, . By buying 6 at a time, you’ll be ready for all sorts of baking!, , , While recreating these gluten-free dairy-free chocolate chip cookies, I knew I couldn’t make them palm sized like the bakery did – these are just too sweet for that! Instead I made these perfectly sized so you can enjoy one!, , I used my, #40 cookie scoop, which is a medium sized scoop to portion these out 12 per baking sheet. Scoop them onto parchment paper that’s been sprayed with nonstick spray. (Yes, these need both parchment and spray or they stick!), , Here’s a look at them ready to bake so you can see the thick batter texture:, , , These were perfectly soft and chewy at the 12 minute mark. They had glossy tops and had cracked nicely – that’s how I knew they were done! If you’d like yours crisper, feel free to bake a little longer., , These flourless chocolate cookies do get crisper on day two and three though, if any last that long!, , Here’s a look at these flourless fudge cookies just out of the oven:, , , I love that chocolate crinkle look to them!, , One batch of these dairy-free cookies makes 18 cookies when using a, #40 scoop, . You can feel free to make them smaller and lessen cooking time a minute or two, or make them larger and lengthen cooking time a minute or two. Just watch for them to be nice and glossy and cracked., , Store leftover cookies in an airtight container or Ziploc bag., , You can freeze the baked flourless chocolate cookies too so that you can pull them out to enjoy another day!, , I bet if you put out a bowl of these cookies for company, there won’t be any left to freeze though!, , , Looking for some other recipes for using your Enjoy Life dark chocolate morsels? Try these, buckeye balls, that use melted dark chocolate morsels for the coating! My friend Chrystal uses them in her, gluten-free vegan chocolate ganache cake, that looks so pretty! I used them in one of my favorite pies ever, this, gluten-free chocolate cream pie, ., , I have so many recipes that use the semisweet mini chips! I loved them in these, gluten-free banana oatmeal chocolate chip cookies, . They’re the perfect addition to this holiday, gluten-free cranberry chocolate bread, . You can use them in this, vegan chocolate pie, from my friend Erin. I’m dying to make this, edible eggless chocolate chip cookie dough, soon for a Friday night treat!, , My gluten free chocolate cookies recipe was adapted from these, chewy gooey flourless chocolate cookies, , some verbal tips from a baker, and various recipes from several cookbooks., , , Please come back and rate and review the recipe if you love it!, , Okay, enough talking, here’s the recipe:, , Gluten-free Flourless Chocolate Cookie Recipe:, , , , , Continue to Content, , , , , , , , Yield: 18 cookies, , Flourless Chocolate Mudslide Cookies (gluten-free, dairy-free), , , , , , , , , Print, , , , , Gluten-free mudslide cookies are a flourless chocolate cookie that's rich, sweet, and will cure your chocolate cravings! These gluten-free chocolate cookies are free of dairy and nuts too!, , , , , , Prep Time, , 10 minutes, , , , , Cook Time, , 12 minutes, , , , , Additional Time, , 12 minutes, , , , , Total Time, , 34 minutes, , , , , , , , , 2 3/4 cups powdered sugar, , 3/4 cup cocoa powder, , 1/4 tsp. salt, , 3 lg. egg whites (room temperature), , 2 tsp. pure vanilla extract, , 3/4 cup mini semi-sweet chocolate chips, , 1/2 cup dark chocolate chips, , , , , , , Lunch Ideas, , Main Dishes, , Menu Plans, , Mousse or Pudding Desserts, , Muffins & Quick Breads, , New Products, , Pies, , Recipe Round-ups, , Reviews, , Salads, , School, , Side Dishes, , Snacks, , Soups, , Tips & Tricks, , Valentine’s Day, , Yeast Breads, , , , , , , , , , , , , , , , , , , , Copyright © 2023 My Gluten-free Kitchen® | Trellis Framework by Mediavine  |  Trellis Framework by, Mediavine, , , , Skip to Recipe, , , , , , , , , , , , , , , Instructions: , Preheat oven to 350°. Line two cookie sheets with parchment paper. Spray top of parchment paper with nonstick cooking spray (otherwise these cookies really stick!), To the bowl of your mixer, add the powdered sugar, cocoa powder, and salt. Mix together on low speed until mixed together well. (If you have a whisk attachment for your mixer, use that.), Add the egg whites and pure vanilla extract and mix on low until mixed. Batter will be very thick when done!, Remove bowl from mixer. Using a spatula, stir in the mini semi-sweet chips and the dark chocolate chips., Use a medium cookie scoop (#40) to scoop out wet dough mounds onto your sprayed parchment sheets, leaving plenty of room for them to spread during baking. On my large cookie sheet, I did 12, and then 6 on the other cookie sheet. You could do 8 per batch too if your sheet is smaller., I prefer to bake one sheet at a time for even baking. If you need to use the same cookie sheet twice, be sure to let it cool between batches., Bake in 350° oven for 12 minutes, or until glossy and cracked and edges are set. They will firm up as they cool too., Remove from oven and let sit on the pan for 2-3 minutes. Slide parchment paper onto cooling rack for cookies to continue to cool. Enjoy!, , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , SACO Pantry Premium Cocoa, Natural and Dutched Blend, Gluten-Free, Nut-Free, Pack of 2, , , , , , , , , AirBake Natural Cookie Sheet, 16 x 14 in, , , , , , , , , Parchment Paper Sheets for Baking, Made in France, Natural Nonstick 16\" x 12\" Precut 100 Sheets, , , , , , , , , Enjoy Life Semi-Sweet Vegan Mini Chocolate Chips, , , , , , , , , Enjoy Life Dark Chocolate Morsels, Gluten, Dairy, Nut & Soy Free and Vegan, 9 oz, 6 Count, , , , , , , , , OXO Good Grips Medium Cookie Scoop, , , , , , , , , © Michelle Palin ~ My Gluten-free Kitchen, , , , Cuisine:, American, , /, , Category:, Cookies, , , , , , , , Pin these flourless cookies to your gluten-free cookies board on Pinterest:, Looking for more flourless cookie recipes or gluten-free cookie recipes? Check out my, Gluten-free Cookies Pinterest Board, . Lots of ideas there!, , This sponsored post was created through my partnership with Enjoy Life Foods. As always, all opinions are my own. Collaborating with brands I love allows me to keep bringing you new and varied recipes! Thanks for your support!, , , I hope you and your friends and family enjoy these flourless cookies as much as mine did!, , , , Click to share this with your friends or family!, , , , , 34224, , shares, , , , , , , Pin, , , , , Share, , , , , Tweet, , , , , , , , By, Author, Michelle Palin ~ My Gluten-free Kitchen, , , Posted on, Published: October 31, 2018, - Last updated:, January 25, 2022, , , , Categories, Cookies, , , Tags, Tags, chocolate, dairy-free, gluten-free recipes, , , , , Post navigation, , Gluten-free Apple Fritter Muffins, Instant Pot Mashed Potatoes {Gluten-free, Dairy-free}, , , , Click here to cancel reply., , Δ, , , , , , , Neita Colin, , Monday 3rd of March 2025, , , , , What is the calorie count per cooky?, , , , , , , Donna, , Wednesday 11th of December 2024, , , , , Do you know how these would freeze? Trying to make ahead for Christmas. Thanks!, , , , , , , Yvette, , Tuesday 19th of December 2023, , , , , Omgosh!!! Delicious- my family loved these cookies. My son ( who is gluten free and dairy free) asked me to make again.  They didn’t look like yours(fluffier), but they were so good!!! Thank you., , , , , , , Roberta, , Thursday 11th of May 2023, , , , , These are my go-to dairy-free gluten-free cookies. I've served at parties and been asked for the recipe many times. Thank you!, , , , , , , Marianna, , Thursday 20th of April 2023, , , , , These are awesome. I used Target's Good & Gathered organic powdered sugar to make them grain-free. I skipped oiling the parchment and had no problems with them sticking. I just made sure they were completely cooled before removing them from the paper., , , , , , , , Find me on social media:, , , , , , , , , , , , , , , , , , , , Search This Site, , , Search for:, , , , , , Categories, Categories, , Select Category, , Appetizers, , Bars & Brownies, , Beverages, , Blog, , Books, , Breakfast, , Cakes, , Candy, , Celiac Disease, , Cookies, , Favorites, , Freezer Friendly, , Fruit Desserts, , Gluten-free Events, , Gluten-free Kids, , Gluten-free Travel, , Ice Cream & Toppings, ",
        "Healthy chocolate chip cookies": "❌ Error scraping https://www.wellplated.com/healthy-chocolate-chip-cookies/or https://bakerbynature.com/the-most-wonderful-vegan-chocolate-chip-cookies-ever/: 404 Client Error: Not Found for url: https://www.wellplated.com/healthy-chocolate-chip-cookies/or%20https:/bakerbynature.com/the-most-wonderful-vegan-chocolate-chip-cookies-ever/",
        "Vegan sugar cookies": "Ingredients: this classic sugar cookie dough creates the best cookies for cut-out shapes that hold perfectly in the oven. Whether you're making Christmas cookies for decorating or just craving a sweet treat, this recipe will become your go-to for every occasion. 🎄💕✨, , , , FEATURED COMMENT:, , Look no further! It took years for us to find the best vegan sugar cookie and these are them! These taste delicious and the kids enjoy decorating them. -, Jennifer, ⭐⭐⭐⭐⭐, , , I just LOVE these cookies. Unlike many sugar cookie recipes that look great but taste bland, these vegan sugar cookies are full of flavor and melt-in-your-mouth delicious. The key is to balance the flour, vegan butter, and sugar just right in combination with both vanilla and almond extract. The result? A light, soft, sweet cookie that’s so delicious you’ll be reaching for seconds (or thirds!). With a 5-star rating from over 100 reviews, these cookies are tried, tested, and loved., , Why You'll Love This Recipe, , , Perfect for Cut-Outs:, The dough holds its shape beautifully, making it ideal for detailed cookie cutters., , Tastes Amazing:, Soft, buttery, and full of flavor, they’re as good as they look., , Easy to Make:, , Customizable:, Perfect for any holiday or occasion—Christmas, Valentine’s day, birthday parties, Halloween, or just because! Use your favorite cookie cutter shape and decorate however you like., , , , , , Common Questions, , Can I Prepare the Cookie Dough Ahead of Time?, Yes! You can prepare the dough up to 3 days in advance. Wrap it tightly in plastic wrap and store it in the refrigerator until ready to use. Let it soften slightly at room temperature before rolling it out., , Can I Freeze These Cookies?, Yes! These cookies freeze beautifully. You can freeze them plain or fully iced. Let them cool completely, then freeze in a single layer on a baking sheet or store them in an airtight container. They’ll keep for up to 3 months., , Can These Be Made Gluten-Free?, Absolutely! Replace the all-purpose flour with a, gluten-free flour 1-to-1 baking blend, . Make sure to chill the dough well to help it hold its shape when rolling and cutting., , What Vegan Butter Should I Ues?, I like to use Earth Balance Original Buttery Spread (the kind in a tub) as it’s reliable for baking. Other brands will also work well—just ensure that the butter is firm when cold (not super soft like margarine) for the best result., , What Vegan Food Coloring Should I Use?, this one, or, this one, ., , Can I Omit the Almond Extract?, Yes! If you prefer not to use almond extract, simply replace it with an equal amount of vanilla extract. The cookies will still be delicious but with a slightly different flavor profile. Alternatively, you can experiment with other extracts like lemon, orange, or peppermint for a unique twist!, , Can I Make a Roll of Cookie Dough and Slice It?, Yes, this dough works well for slice-and-bake cookies! Form the dough into a log, wrap it tightly in plastic wrap, and refrigerate until firm (at least 2 hours). When ready, slice into rounds about ¼ inch thick and bake as directed., , How Do I Get Perfect-Looking Icing?, Ensure your icing is nice and thick. Adding too much plant-based milk will make the icing runny and fall off the cookie. Use, piping bags, or a zip-top bag with the corner snipped off for precise designs. For extra-white icing, I find using, full-fat coconut milk, as the plant-based milk makes it the brightest white (oat and soy milk tend to have a beige tone to them). Double the icing recipe if you plan to go all out with decorating and make several different colors to play with., , , , How To Make Vegan Sugar Cookies:, , Preheat your oven:, Preheat oven to 350°F (180°C)., , , Prepare the chia or flax egg:, In a small bowl, mix together the ground chia or flax and warm water and set aside to thicken. Chia thickens almost instantly, while flax may take up to 10 minutes to thicken., , , , , In a large bowl, mix together the flour, baking powder, and salt. Set aside., , , , , In a large mixing bowl, use a hand mixer or a stand mixer fitted with the paddle attachment to cream the vegan butter and sugar together until fluffy, about 3 minutes. Add the vanilla extract, almond extract, and the thickened chia or flax egg, then mix again until well combined., , , , , Form the dough:, Add the butter mixture to the flour mixture and stir to form a dough. If the dough does not come together, add water 1 teaspoon at a time (up to 3 teaspoons total) until it just comes together., , , , , Roll out the dough:, Place the dough between two sheets of parchment paper and use a rolling pin to roll it out to about ¼ inch (6 mm) thick. Transfer the parchment paper with the rolled dough onto a large baking sheet. Chill in the freezer for 15 minutes or in the fridge for 30 minutes, until firm., , , , , Cut out shapes:, Once chilled, use your favorite cookie cutters to cut out shapes. Place the cutouts on a parchment-lined baking sheet. Re-roll any remaining dough and repeat until all the dough is used, chilling as needed., , , , , Bake the cookies:, Bake for 8–11 minutes, or until the edges are just lightly golden. Let the cookies cool completely before decorating., , , , , To make the icing:, In a small bowl, mix together the powdered sugar and 2 teaspoons of plant-based milk and stir until smooth. You want the icing to be quite thick so that it holds it's shape well. If needed, add more plant-based milk 1 teaspoon at a time to reach the desired consistency., , For colored icing, divide the icing into separate bowls (if using multiple colors), and stir in a few drops of food coloring until desired colors are achieved.The icing recipe makes enough to lightly decorate the cookies. If you want to heavily decorate them (like I did), double the recipe., , , , , Decorate the cookies:, Once the cookies are completely cool, decorate as desired with the prepared icing., , Storage:, Store your decorated vegan sugar cookies in an airtight container at room temperature for up to 5 days or in the fridge for up to 7 days. For longer storage, freeze the cookies (with or without icing) in a single layer on a baking sheet until solid, then transfer them to a freezer-safe container or bag. Frozen cookies keep well for up to 3 months. Allow them to thaw at room temperature before enjoying., , Gifting:, These cookies make perfect gifts! Once the icing is completely set (12–24 hours to harden fully), stack them carefully in a, decorative tin, or wrap them individually in, cellophane bags, tied with a, ribbon, . For a festive touch, add a, personalized tag, or card. Keep the cookies cool and dry during gifting to preserve their shape and freshness., , , , , This Vegan Sugar Cookie Recipe is..., , , easy to make, , oh-so-delicious, , perfect for cookie cutters, , , More Vegan Cookie Recipes to Try:, , , Soft Frosted Sugar Cookies, (Lofthouse inspired), , Easy Vegan Gingersnap Cookies, , The BEST Vegan Chocolate Chip Cookies, , Easy Vegan Shortbread, , Chewy Vegan Molasses Cookies, , , If you try this recipe let us know by leaving a comment, rating it, and don't forget to tag, @itdoesnttastelikechicken, on Instagram. You can also, pin this recipe, on Pinterest to save it for later!, Bon appetegan!, Sam Turnbull., , , , , , 4.98, from, 115, votes, , (click stars to vote), , , Vegan Sugar Cookies, , , Soft, buttery, this classic sugar cookie dough creates the best cookies for cut-out shapes that hold perfectly in the oven. Whether you're making Christmas cookies for decorating or just craving a sweet treat, this recipe will become your go-to for every occasion., , , Prep:, 30, minutes, , mins, Cook:, 1, minute, , min, Total:, 41, minutes, , mins, , Servings:, 24, , cookies (depending on the size of your cookie cutters), , , PRINT, , PIN, , , Save, Saved!, , , Video, , , , , COMMENT, , , , ½, 1x, 2x, For the cookies:, ▢, 1, , tablespoons, , ground chia or ground flax, ▢, 3, , tablespoons, , warm water, ▢, 2 ¼, , cups, , all-purpose flour, , , (or sub, gluten-free 1 to 1 baking flour blend, to make them gluten-free), ▢, ½, , teaspoon, , baking powder, ▢, ¼, , teaspoon, , salt, ▢, ¾, , cup, , vegan butter, , , cold (I used Earth Balance), ▢, ¾, , cup, , white sugar, ▢, 2, , teaspoon, , vanilla extract, ▢, ½, , teaspoon, , almond extract, For the icing:, ▢, 1, , cup, , powdered sugar, ▢, 2-4, , teaspoons, , plant-based milk, , , (such as coconut, oat, or soy), ▢, vegan food coloring, , , (optional), ▢, vegan sprinkles, , , (optional for decorating), US Customary, -, Metric, , In a large bowl, mix together the flour, baking powder, and salt. Set aside., , In a large mixing bowl, use a hand mixer or a stand mixer fitted with the paddle attachment to cream the vegan butter and sugar together until fluffy, about 3 minutes. Add the vanilla extract, almond extract, and the thickened chia or flax egg, then mix again until well combined., , Form the dough:, Add the butter mixture to the flour mixture and stir to form a dough. If the dough does not come together, add water 1 teaspoon at a time (up to 3 teaspoons total) until it just comes together., , Roll out the dough:, Place the dough between two sheets of parchment paper and roll it out to about ¼ inch (6 mm) thick. Transfer the parchment paper with the rolled dough onto a large baking sheet. Chill in the freezer for 15 minutes or in the fridge for 30 minutes, until firm., , Cut out shapes:, Once chilled, use your favorite cookie cutters to cut out shapes. Place the cutouts on a parchment-lined baking sheet. Re-roll any remaining dough and repeat until all the dough is used, chilling as needed., , Bake the cookies:, Bake for 8–11 minutes, or until the edges are just lightly golden. Let the cookies cool completely before decorating., , To make the icing:, Prepare the icing:, In a small bowl, mix together the powdered sugar and 2 teaspoons of plant-based milk and stir until smooth. You want the icing to be quite thick so that it holds it's shape well. If needed, add more plant-based milk 1 teaspoon at a time to reach the desired consistency., For colored icing, divide the icing into separate bowls (if using multiple colors), and stir in a few drops of food coloring until desired colors are achieved., The icing recipe makes enough to lightly decorate the cookies. If you want to heavily decorate them (like I did), double the recipe., , Decorate the cookies:, Once the cookies are completely cool, decorate as desired with the prepared icing., , , Video, , , , , , , , , , Notes, , Storage:, Store your decorated vegan sugar cookies in an airtight container at room temperature for up to 5 days or in the fridge for up to 7 days. For longer storage, freeze the cookies (with or without icing) in a single layer on a baking sheet until solid, then transfer them to a freezer-safe container or bag. Frozen cookies keep well for up to 3 months. Allow them to thaw at room temperature before enjoying., , , , Gifting:, These cookies make perfect gifts! Once the icing is completely set (12–24 hours to harden fully), stack them carefully in a decorative tin or wrap them individually in cellophane bags tied with a ribbon. For a festive touch, add a personalized tag or card. Keep the cookies cool and dry during gifting to preserve their shape and freshness., , , Nutrition, Serving:, 1, cookie (recipe makes about 24), |, Calories:, 131, kcal, |, Carbohydrates:, 20, g, |, Protein:, 1, g, |, Fat:, 5, g, |, Saturated Fat:, 1, g, |, Sodium:, 71, mg, |, Potassium:, 25, mg, |, Fiber:, 1, g, |, Sugar:, 11, g, |, Vitamin A:, 270, IU, |, Calcium:, 9, mg, |, Iron:, 1, mg, , , , , , Did You Make This Recipe?, Tag, @itdoesnttastelikechicken, on Insta and let the world see just how amazing plant-based creations can be!, , , , , Author:, Sam Turnbull, , Cuisine:, American, , Course:, Dessert, , , More Vegan Christmas Recipes You Might Like:, , , Browse All Recipes, , , , «, How to Make a Vegan Snack Board, Easy Vegan Bread Pudding (with endless add-ins!), », Reader Interactions, Comments, , , , , , Emily A, , says, , , December 28, 2024 at 3:23 pm, , , , I usually buy Sweet Loren's cookie dough to make my annual melting snowman cookies, but wanted to try making my own dough this year. I saw lots of recipes online, but they did not seem to hold their shape once baked. This recipe was absolutely perfect! The cut-outs held their shape and the flavor was wonderful. The almond extract complimented the vanilla so well. The icing was also just the right texture and not too sweet. I will be making these again next year and none of our relatives thought they tasted \"vegan\" (even though I only bake and cook vegan lol)., , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , December 28, 2024 at 6:01 pm, , , , That's so wonderful, thrilled you loved the cookies so much Emily! Thank you for the review 🙂, , , Reply, , , , , , , , , , Nella, , says, , , December 25, 2024 at 11:19 am, , , , I made this and it’s absolutely the most delicious recipe. The almond extract somehow boosts that vanilla flavor. Definitely follow this to the “T” - you won’t be disappointed. Also made a second batch and hiding it in the freezer for myself lol❤️, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , December 27, 2024 at 3:19 pm, , , , Haha, love it!! So very happy you love the cookies so much Nella, thank you for the lovely review 🙂, , , Reply, , , , , , , , , , Suzy, , says, , , December 19, 2024 at 6:33 pm, , , , Made the gluten free with Bob's Red Mill AP gluten free flour. this is truly excellent! I added a little almond extract 1/8 tsp and vanilla extract 1 tsp to the glaze icing for flavor. Yum!, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , December 20, 2024 at 9:58 am, , , , Hi Suzy, I’m so happy you enjoyed the cookies and that they turned out perfectly gluten-free! Thank you so much for your review 🙂, , , Reply, , , , , , , , , , Ariana, , says, , , December 11, 2024 at 3:46 pm, , , , I make this recipe multiple times a year, and I am gearing up to make them again for the Holidays. I love these cookies so much. The almond extract addition is perfection and tastes nearly identical to my Great-Grandma’s cookies she made during my childhood. Each bite is a serious hug and taste of nostalgia for me. Thank you, Sam!, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , December 11, 2024 at 4:52 pm, , , , Oh I love that!!! What a wonderful memory. So thrilled you love these cookies! I just updated the photos and answered some common questions as well, so hopefully you enjoy the fresh look 🙂, , , Reply, , , , , , , , , , EmW, , says, , , November 30, 2024 at 6:01 am, , , , My go to recipe for sugar cookies., , Even made them with margarine this time as I was out of block Naturli. Deffo a more gooey cookie dough, but with a floured board, we managed., It was so fun and feral, with flour everywhere and making up shapes as we went, the 8 year old was in heaven!, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , November 30, 2024 at 11:04 am, , , , Aww I love that! I have many memories of baking cookies as a kid. So happy you love the recipe 🙂, , , Reply, , , , , , , , , , Reena, , says, , , November 13, 2024 at 11:23 pm, , , , I made the cookies from another recipe I had, but I tried to make the icing. I put in a little more milk and then put the icing in piping bags to make it look nice on the cookies. But, the icing barely came out of the piping bags!, , , Reply, , , , , , , , Jess @ It Doesn't Taste Like Chicken, , says, , , November 14, 2024 at 12:11 pm, , , , Sorry to hear you had trouble with the icing recipe. If the icing is mixed thoroughly, you can control how runny you make it before you put it into piping bags and then you can also control the size of hole in the piping bag. Wish we could help troubleshoot better than that!, , , Reply, , , , , , , , , , Jessie, , says, , , November 11, 2024 at 12:05 pm, , , , does this icing dry so the cookies can be bagged?, , , Reply, , , , , , , , Jess @ It Doesn't Taste Like Chicken, , says, , , November 12, 2024 at 9:54 pm, , , , Yes it does! Allow several hours (depending on how thick you coat the cookies) for the icing to dry before bagging., , , Reply, , , , , , , , , , Cece, , says, , , November 10, 2024 at 8:59 am, , , , For the butter, does it need to be melted a bit in the microwave? Or be room temperature? Or used straightly from the fridge (cold)?, , , Reply, , , , , , , , Jess @ It Doesn't Taste Like Chicken, , says, , , November 12, 2024 at 9:53 pm, , , , No need to melt the butter as it will be creamed with the sugar., , , Reply, , , , , , , , , , Rochelle, , says, , , August 05, 2024 at 5:14 am, , , , Worked a treat! No need to refrigerate, I was able to bake straight away, , , Reply, , , , , , , , Jennifer, , says, , , July 14, 2024 at 8:34 am, , , , Look no further! It took years for us to find the best vegan sugar cookie and these are them! These taste delicious and the kids enjoy decorating them., , , Reply, , , , « Older Comments, , , , 4.98 from 115 votes (, 70 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me via e-mail if anyone answers my comment., , , , , , , Primary Sidebar, , , , Hi Friends!, , I'm Sam Turnbull. 3x bestselling cookbook author and passionate vegan recipe writer! I LOVE vegan food, but it didn't start that way. Coming from a family of hunters, butchers, and chefs, I'm the last person I thought would go vegan., , , Here's My Story, , , , , JOIN THE NEWSLETTER, , Get a FREE cookbook with 30 of our best vegan recipes!, , , , , , Bestselling Cookbooks, , Take your vegan cooking to the next level with our fan-favorite cookbooks!, , , BUY NOW, , , , , , , Footer, , , , , , , , On the Site, , , Start Here, , About, , Recipe Index, , Tips to Use This Site, , Dietary Preferences, , Cookbooks, , Cooking Courses, , FAQ's About Veganism, , Easy Vegan Meal Plan, , Seitan School, , Contact, , Press, , , , , Shop Bestselling Cookbooks, , , Amazon, •, Barnes & Noble, •, Indigo, •, Walmart, •, Target, •, BAM, •, Bookshop, •, , , , Join Our Newsletter, , Get a, FREE, eCookbook of the top 30 fan-favorite, vegan recipes., , , , , Affiliate Link Disclosure, , On this site, I sometimes use affiliate links. This means that if you were to make a purchase through one of these links, It Doesn't Taste Like Chicken would receive a small cut, at no cost to you., , Privacy Policy, , COPYRIGHT © 2025 -, IT DOESN'T TASTE LIKE CHICKEN, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Leave a Comment, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Post Comment, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: , On, Off, To make the cookies:, Preheat your oven:, Preheat oven to 350°F (180°C)., Prepare the chia or flax egg:, In a small bowl, mix together the ground chia or flax and warm water and set aside to thicken. Chia thickens almost instantly, while flax may take up to 10 minutes to thicken., ",
        "Holiday Sugar Cookies": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., HOLIDAY SUGAR COOKIES, SERVES: 11 (2 cookies each)  Prep Time: 1 hr. 15 min.  Cooking Time: 10 min., CONTAINER EQUIVALENTS (per serving):, 1, 1, 1½ cups, \u0007gluten-free all-purpose flour, (preferably Bob’s Red Mill® All-, Purpose Baking Flour, red label), 1 tsp., \u0007cornstarch (preferably GMO-free), ¼ tsp., \u0007baking powder, gluten-free, ¼ tsp., \u0007sea salt (or Himalayan salt), ¼ cup, \u0007pure maple syrup, 1, \u0007large egg, ¼ cup, \u0007ghee (organic, grass-fed, if, possible), room temperature, 1 tsp., \u0007pure vanilla extract, ½ tsp., \u0007pure butter extract, Colored decorating sugar (optional;, for garnish), SPECIAL EQUIPMENT:, Cookie cutters, Rolling pin, Parchment paper, 1. \t \u0007Whisk together flour, cornstarch, baking powder, and salt in a medium, mixing bowl., 2. \t \u0007In a separate medium bowl, whisk together maple syrup, egg, ghee, and, extracts., 3. \t \u0007Add dry mixture to wet mixture, mixing to form dough. Knead briefly, then, place dough on a large piece of plastic wrap., 4. \t \u0007Form dough into a disc 1-inch thick, cover with another sheet of plastic, wrap, and refrigerate 1 hour., 5. \t \u0007Preheat oven to 350° F. Line a baking sheet with parchment paper., 6. \t \u0007Remove dough from refrigerator. Leave dough between the plastic wrap;, use a rolling pin to roll out dough until it is ⅛-inch thick., 7. \t \u0007Cut out cookies with a cookie cutter. Gather and re-roll unused dough and, cut remaining cookies (repeat as many times as necessary to use all the, dough; gluten-free dough doesn’t toughen)., 8. \t \u0007Place all cookies on prepared baking sheet, leaving a little space between, them. Sprinkle each with a pinch of colored sugar (if desired). Bake for 8, to 10 minutes. Cool on baking sheet for 5 minutes. Remove to a wire rack, to cool completely., 9. \t \u0007Serve immediately, or store refrigerated in an airtight container for up to 3, days, NUTRITIONAL INFORMATION (per serving): Calories: 140  Total Fat: 5 g  Saturated Fat: 3 g  Cholesterol: 31 mg  Sodium: 25 mg  Carbohydrates: 21.5 g, Fiber: 0.5 g  Sugars: 4.5 g  Protein: 2 g, Bob’s Red Mill is a trademark of Bob’s Red Mill Natural Foods, Inc., RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the FIXATE, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 2, Instructions: ",
        "Banana Oatmeal cookies": "Ingredients: since fo ds, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., BANANA OATMEAL COOKIES, 1 cup, dry old-fashioned rolled oats, , gluten-free, 2 tsp., ground cinnamon, ¼ tsp., sea salt (or Himalayan salt), 2, medium ripe bananas, mashed, ¼ cup, golden raisins, ¼ cup, chopped raw walnuts, SPECIAL EQUIPMENT:, Nonstick cooking spray, 1., Preheat oven to 350° F., 2., Lightly coat large baking sheet with spray. Set aside., 3., Combine oats, cinnamon, and salt in a medium bowl; mix well., 4., Add bananas, raisins, and walnuts; mix well., 5., Drop by rounded Tbsp. onto prepared baking sheet to form 16 cookies;, flatten cookies with a spatula., 6., Bake for 14 to 15 minutes or until firm., NUTRITIONAL INFORMATION (per serving): Calories: 104  Total Fat: 3 g  Saturated Fat: 0 g   Cholesterol: 0 mg  Sodium: 73 mg  Carbohydrates: 18 g  Fiber: 3 g, Sugars: 6 g  Protein: 2 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., SERVES: 8 (2 cookies each)   Prep Time: 10 min.   Cooking Time: 15 min., CONTAINER EQUIVALENTS (per serving):       ½       1 ½                ½, VEGAN CONTAINER EQUIVALENTS (per serving):        ½        A ½                 ½ , Instructions: ",
        "Double Chocolate cookies": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., V, VG, DOUBLE CHOCOLATE COOKIES, SERVES: 15 (1 cookie each)   Prep Time: 15 min.   Cooking Time: 12 min., CONTAINER EQUIVALENTS (per serving):, 1, ¼ cup, extra-virgin organic coconut oil, , melted, ½ cup, unsweetened applesauce, 1⁄3 cup, pure maple syrup, ¼ cup, canned lite coconut milk, 1⁄3 cup, coconut flour, ¼ cup, whole wheat flour, ½ cup, unsweetened cocoa powder, ¼ cup, dark chocolate chips, 70% cacao, (or more), SPECIAL EQUIPMENT:, Nonstick cooking spray, 1. \t Preheat oven to 350° F., 2. \t Lightly coat baking sheet with spray. Set aside., 3. \t Combine oil, applesauce, maple syrup, and coconut milk in a medium, bowl; mix well. Set aside., 4. \t Combine flours and cocoa powder in a small bowl; mix well., 5. \t Add flour mixture to applesauce mixture; mix until well blended., 6. \t Add chocolate chips; mix until blended., 7. \t Drop fifteen rounded Tbsp. onto prepared baking sheet., 8. \t Bake for 10 to 12 minutes or until firm., RECIPE NOTE:, For a gluten-free version, substitute 1⁄3 cup brown rice flour for whole, wheat flour., VARIATION:, Substitute 1 oz. slivered raw almonds, chopped pecans, dried cherries, or, raisins for chocolate chips., NUTRITIONAL INFORMATION (per serving): Calories: 97  Total Fat: 5 g  Saturated Fat: 4 g   Cholesterol: 0 mg  Sodium: 2 mg  Carbohydrates: 12 g  Fiber: 2 g, Sugars: 7 g  Protein: 1 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Gluten Free Chocolate chip cookies": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., GLUTEN-FREE CHOCOLATE CHIP COOKIES, SERVES: 16 (1 cookie each)   Prep Time: 15 min.   Cooking Time: 12 min., CONTAINER EQUIVALENTS (per serving):, 1, ½, ¼ cup, extra-virgin organic coconut oil, , solid, ½ cup, coconut sugar, 1, large egg yolk, 1 tsp., pure vanilla extract, 1 cup, gluten-free all-purpose flour, ¼ tsp., baking soda, gluten-free, ¼ tsp., baking powder, gluten-free, ½ tsp., sea salt (or Himalayan salt), ¼ cup, dark chocolate chips, 70% cacao, (or more), SPECIAL EQUIPMENT:, Parchment paper, 1. \t Preheat oven to 325º F., 2. \t Line two baking sheets with parchment paper. Set aside., 3. \t Combine oil and sugar in a large mixing bowl, using a hand mixer; beat, until well mixed., 4. \t Add egg yolk and extract; mix well. Set aside., 5. \t Combine flour, baking soda, baking powder, and salt in a medium bowl;, mix well., 6. \t Add oil mixture to flour mixture; mix well., 7. \t Fold in chocolate chips., 8. \t Roll into Tbsp.-sized balls and place on prepared baking sheets., 9. \t Bake for 10 to 12 minutes, or until golden brown., RECIPE NOTE:, Cookies can be stored in an airtight container for up to 3 days., NUTRITIONAL INFORMATION (per serving): Calories: 102  Total Fat: 5 g  Saturated Fat: 4 g  Cholesterol: 12 mg  Sodium: 40 mg  Carbohydrates: 14 g  Fiber: 1 g, Sugars: 8 g  Protein: 1 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: "
    }
}