{
    "ingredients": {
        "Peanut Butter Chocolate Icecream": "banana,cocoa powder,peanut butter,dark chocolate",
        "Oat milk icecream": "oat milk, nut butter, sweetener",
        "Vegan Mint Chocolate chip icecream": "Coconut milk, coconut cream, sugar, maple syrup, peppermint extract, vegan chocolate chips",
        "Vegan Fudgesicles": "Cocoa powder, coconut milk, vanilla extract, maple syrup",
        "Almond Milk Chocolate Banana Ice cream": "Banana, almond milk, cocoa powder, maple syrup",
        "Vegan Chocolate icecream": "coconut milk, tapioca starch, vanilla extract, instant coffee, cocoa powder, sugar, maple syrup",
        "Cauliflower Icecream": "riced cauliflower,cashews,coconut milk,maple syrup,coconut milk,coconut oil,vanilla extract",
        "Banana Peanut butter chocolate chunk ice cream": "bananas,peanut butter,almond milk,dark chocolate,almonds",
        "Melon Sorbet": "cantaloupe,lemon juice,honey",
        "Strawberry Cheesecake Pops": "cream cheese, coconut milk,maple syrup,greek yogurt,vanilla extract,strawberries,lemon juice"
    },
    "recipe_url": {
        "Peanut Butter Chocolate Icecream": "http://www.joannasoh.com/foods/recipes-1/creamy-low-calorie-vegan-ice-cream-100-natural",
        "Oat milk icecream": "https://chocolatecoveredkatie.com/oat-milk-ice-cream-recipe/",
        "Vegan Mint Chocolate chip icecream": "https://lovingitvegan.com/vegan-mint-chocolate-chip-ice-cream/",
        "Vegan Fudgesicles": "https://www.veganblueberry.com/vegan-fudgesicles/",
        "Almond Milk Chocolate Banana Ice cream": "https://ilonaspassion.com/almond-milk-chocolate-banana-ice-cream/",
        "Vegan Chocolate icecream": "http://www.cearaskitchen.com/vegan-chocolate-ice-cream/",
        "Cauliflower Icecream": null,
        "Banana Peanut butter chocolate chunk ice cream": "fixate_recipes\\Dessert\\FXR_Banana_Peanut_Butter_Chocolate_Chunk_Ice_Cream_R_03.19.18.pdf",
        "Melon Sorbet": "fixate_recipes\\Dessert\\FXR_Melon_Sorbet_R_03.19.18.pdf",
        "Strawberry Cheesecake Pops": "fixate_recipes\\Dessert\\FXR-EN-Strawberry_Cheesecake_Pops-10.1.20-Recipe.pdf"
    },
    "Recipe": {
        "Peanut Butter Chocolate Icecream": "Ingredients:  Instructions: ",
        "Oat milk icecream": "Ingredients: , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Skip to primary navigation, Skip to main content, Skip to primary sidebar, Get two new, free, healthy recipes each week., Sign Up, Chocolate Covered Katie, Search, Menu, Brownies, , Breakfast, , Pies & Cakes, , Chocolate, , Bars, , Cookies, , Meals, , All Recipes, , Videos, , About Katie, , FAQ, , , , , Search for, , , , , , , , , Search for, , , , , , Healthy Ice Cream Recipes, Oat Milk Ice Cream, , by, , Katie, 4.99, from, 131, votes, Facebook, Pin, Email, , Creamy, dreamy, smooth, classic, and completely dairy free homemade oat milk ice cream, ., , , , Vegan, , Gluten free, , Egg free, , Super creamy, , , Making your own nondairy oat milk ice cream at home is so easy, you might never want to go out for ice cream ever again., , Also Try This:, Chocolate Peanut Butter Nice Cream, , , , Oat Milk Ice Cream Flavors, , Chocolate:, Add 1/4 cup cocoa powder to the base recipe below., , Banana:, Sub half a cup of the oat milk for one ripe mashed banana., , Cookie Dough:, Make up the base recipe below, and stir in your favorite cookie dough or this, Chickpea Cookie Dough Dip, !, , Chocolate Fudge Swirl:, Carefully melt 1/2 cup chocolate chips. Stir in 3 tbsp canned coconut milk until smooth. Let cool before swirling into ice cream., , Coffee:, Add 2 tsp instant coffee to the base recipe before freezing. After blending into ice cream, you can also add chopped chocolate or the swirl idea above., , Leftover Oats? Make These, Oatmeal Muffins, , , , What’s your dream oatmilk ice cream?, , I am a mint chocolate chip girl, all the way., , To make mint chocolate chip, simply follow the base recipe below using a neutral nut butter such as raw cashew or, coconut butter, ., , Add 1/8 tsp pure peppermint extract (not regular mint or imitation peppermint), or more for a stronger flavor., , Trending Now:, Vegan Cheesecake Recipe, – NO Cashews, , , , Ice Cream Topping Ideas, , Sliced banana or strawberries, , Crumbled, Vegan Chocolate Chip Cookies, or, Vegan Brownies, , Sprinkles, shredded coconut, or mini chocolate chips, , Chocolate syrup, cherries or raspberries, and, Coconut Whipped Cream, !, , , Above – Watch the video how to make oat milk ice cream, , , , , Pin it now to save for later, Pin Recipe, , , Oat Milk Ice Cream, , How to make creamy dairy free and vegan oat milk ice cream at home the easy way., , , , , Leave a Review, , Print Recipe, , , , Prep Time, 5, minutes, , minutes, , Total Time, 5, minutes, , minutes, , Yield, 4, , – 6 servings, , 5, from, 131, votes, , , , 2, , cups, , store-bought or homemade, oat milk, , 1/2, , cup, , nut butter of choice, or allergy-friendly sub, 1/3, , cup, , sweetener of choice, 1/4, , + 1/8 tsp, , salt, optional add ins, , (see earlier in this post for flavor ideas),  Instructions: *If you don’t have an ice cream maker or high-speed blender, see, ., pour into ice cube trays and freeze, then blend the ice cubes until smooth, using the tamper to blend evenly. Either serve straight from the machine or freeze up to an hour for a firmer texture. Because of the lack of preservatives, homemade ice cream is best the day it’s made, although you can technically freeze up to a month and thaw before serving., View Nutrition Facts, , Notes, Be sure to watch the recipe video above showing how easy it is to make this ice cream. And if oat milk isn’t available, try this, Almond Milk Ice Cream, ., , , , , Have you made this recipe?, , Tag, @chocolatecoveredkatie, on Instagram, , , , More Ice Cream Recipes, , , Dairy Free Coconut Ice Cream, , , , Mint Chocolate Chip Nice Cream, , , , Dole Whip, – a homemade version of the Disney classic, , , , Keto Ice Cream, , , , Banana Ice Cream, – 10 NEW flavors, , , , Vegan Coffee Ice Cream, , , , Healthy Ice Cream Recipes, , You are here:, Home, , /, , Healthy Ice Cream Recipes, , /, Oat Milk Ice Cream, Published on May 20, 2020, Banana Chocolate Chip Cookie Bars, Protein Bars, Facebook, Pin, Email, Meet Katie, Chocolate Covered Katie is one of the top 25 food websites in America, and Katie has been featured on The Today Show, CNN, Fox, The Huffington Post, and ABC's 5 O'clock News. Her favorite food is chocolate, and she believes in eating dessert every single day., , Learn more about Katie, , banana, , chocolate, , Coconut Butter, , coffee, , gluten-free, , healthy recipes, , no-bake, , oatmeal, , peanut butter, , soy-free, , sugar-free, , Vitamix, Get Free Recipes, Don’t Miss Out On The NEW Free Healthy Recipes, Sign up below to receive exclusive & always free healthy recipes right in your inbox:, , , , , Sign me up!, , , Popular Right Now, Nice Cream, Strawberry Sorbet, Healthy Chocolate Fudgsicles, Peanut Butter Ice Cream, Reader Interactions, 70 Comments, Leave a comment or review, Leave a rating, , , , , , Erin, , says, , , 3rd July 2024 at 8:06 pm, , , , I am making this tomorrow! I have one of those old fashioned ice cream makers that’s not electric. Any idea how long it should churn for?, , , Reply, , , , , , , , Nicole, , says, , , 4th April 2025 at 4:08 am, , , , Could I sub cacao butter for nut butter (instead of nut, seed, or coconut butter)?, , , Reply, , , , See More Comments, , , , 4.99 from 131 votes (, 124 ratings without comment, ), , , , Leave A Reply, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Notify me via e-mail if anyone answers my comment., , , , , Δ, , , Primary Sidebar, Meet Katie, Chocolate Covered Katie is one of the top 25 food websites in America, and Katie has been featured on The Today Show, CNN, Fox, The Huffington Post, and ABC's 5 O'clock News. Her favorite food is chocolate, and she believes in eating dessert every single day., , Learn more about Katie, , Strawberry Crisp, Vegan Carrot Cake Recipe, Chocolate Peanut Butter Eggs, Carrot Cake Bars, , I want to make, , , , Search for, , , , , , Copyright © 2025  ·  Chocolate Covered Katie  ·  All Rights Reserved  ·  An Elite CafeMedia Food Publisher  ·, Privacy Policy, , Recipe Index, , , , Get Free Recipes, Don’t Miss Out On The NEW Free Healthy Recipes, Sign up below to receive exclusive & always free healthy recipes right in your inbox:, , , , , Sign me up!, , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Vegan Mint Chocolate chip icecream": "Ingredients: , Heating then blending., creamiest ice cream texture is guaranteed., , Ice cream machine., I seriously love my, Cuisinart Ice Cream Maker, . It gets your ice cream mix to a soft serve consistency super fast (usually in about 25 minutes)., , , ▢, 14, , ounces, , Canned, Coconut Milk, , (400ml) Full Fat, Unsweetened, ▢, 14, , ounces, , Can, ned Coconut Cream, , (400ml) Unsweetened, ▢, ½, , cup, , White Granulated Sugar, , (100g), ▢, ¼, , cup, , Golden Syrup, , (60ml) or Maple Syrup, ▢, ¼, , teaspoon, , Peppermint Extract, ▢, ¼, , teaspoon, , Green Food Coloring, ▢, ⅔, , cup, , Vegan Chocolate Chips, , (115g) or Chopped Vegan Chocolate, , Cook Mode, Prevent your screen from going dark,  Instructions: , Keep it stored in the freezer and enjoy within 1-2 weeks for the best taste and texture. If it stores much longer than this then ice crystals may start to develop., , , More Vegan Ice Cream Recipes, , Vegan Peanut Butter Ice Cream, Salted Caramel Ice Cream, Mango Ice Cream, , Vegan Chocolate Ice Cream, Vegan Vanilla Ice Cream, Vegan Coconut Ice Cream, , Did you make this recipe? Be sure to leave a comment and rating below!, , , , , Vegan Mint Chocolate Chip Ice Cream, , , This vegan mint chocolate chip ice cream is the richest, creamiest, perfectly textured melt-in-the-mouth ice cream ever!, , , 5, from, 7, votes, , , Print, , Pin, , Rate, , , Course:, Dessert, Ice-Cream, Cuisine:, American, Diet:, Vegan, , Prep Time:, 15, minutes, , minutes, Churning Time:, 25, minutes, , minutes, Total Time:, 40, minutes, , minutes, , Servings:, 8, , Calories:, 386, kcal, , Author:, Alison Andrews, , , The day before you want to make ice cream, place the freezer bowl of your ice cream maker into the freezer to freeze completely., Then place your coconut cream, coconut milk, sugar and syrup into a pot on the stove and bring to a simmer, stirring constantly., Once it reaches a gentle simmer, remove from the heat, and using an immersion blender, blend it in the pot for 30 seconds., If you don’t have an immersion blender, then you can transfer the mixture to your blender jug and blend it there, but just make sure the lid is on properly, as the mixture will of course be very hot. Then transfer the mixture to a covered container and keep in the refrigerator overnight., The next day, remove the mixture from the refrigerator and stir in the green food coloring and the peppermint extract., it will usually be 20-40 minutes., As soon as it reaches soft serve consistency, add the chocolate chips or chopped chocolate to the ice cream maker while it's churning and allow it to mix in for around 1 minute., Then transfer the ice cream to a freezer safe loaf pan and smooth it down., Cover with foil and place it into the freezer to set for at least 6 hours (preferably overnight), When you’re ready to serve scoop it with a hot scoop (dipped in hot water) for the easiest serving., , , Notes, , Depending on the brand of peppermint extract you use, you may need to use more to get enough mint flavor. So taste test to see if the flavor is strong enough., , Prep time does not include chilling the mixture or time spent setting in the freezer., , Keep it stored in the freezer and enjoy within the first 1-2 weeks for the best texture., , , Nutrition, Serving:, 1, Serve, |, Calories:, 386, kcal, |, Carbohydrates:, 35, g, |, Protein:, 3, g, |, Fat:, 29, g, |, Saturated Fat:, 24, g, |, Polyunsaturated Fat:, 0.3, g, |, Monounsaturated Fat:, 1, g, |, Sodium:, 15, mg, |, Potassium:, 261, mg, |, Fiber:, 3, g, |, Sugar:, 31, g, |, Vitamin C:, 3, mg, |, Calcium:, 36, mg, |, Iron:, 3, mg, , , , , , DID YOU MAKE THIS RECIPE?, Rate it & leave your feedback in the comments section below, or tag, @lovingitvegan, on Instagram and hashtag, #lovingitvegan, , Get Your Copy! It's FREE!, «, Creamy Vegan Cheese Sauce (Nut Free), Easy No-Fail Whole Wheat Bread, », , , , 1.9K, , shares, , , , , , , , , , , , , , , , , About the Author, Hi I'm Alison Andrews, I'm the voice and cook behind Loving It Vegan. I love making, delicious, vegan food and creating vegan versions of all your old favorites, so that you’ll never feel like you’re missing out. Find out more about me, here, ., , , Loving It Vegan is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. This site may contain some of these links to Amazon.com. If you make a purchase through one of those links, Loving It Vegan will receive a small commission from the purchase at no additional cost to you., , , , Reader Interactions, Comments, , , , , , Steph Morgan, , says, , , December 26, 2024 at 8:58 pm, , , , Tried this recipe out with my son who has recently started to be dairy intolerant- we love it!! As I had bought some dairy free mint ice cream as a back up, we then did a taste comparison between this recipe and the shop bought one. Our home made ice cream actually tasted better, and it is not heavily processed, but natural. Clear winner!, , , Reply, , , , , , , , Nadine @ Loving It Vegan, , says, , , January 29, 2025 at 10:10 am, , , , Yay! Happy to hear you and your son enjoyed the recipe Steph. Thanks for sharing and for your great review!, , , Reply, , , , , , , , , , Eric, , says, , , December 31, 2020 at 12:32 am, , , , Love this recipe! I omitted the green color, and since I only had coconut milk on hand (no cream), I used two cans of coconut milk, discarding the thin liquid from one of the cans, and added a quarter cup of coconut oil for fat. I ended up using about 3/4 tsp of peppermint extract to get the taste right. The frozen texture is light and very smooth. Just as good as any store bought vegan mint ice cream!, , , Reply, , , , , , , , Alison Andrews, , says, , , December 31, 2020 at 10:09 am, , , , Fantastic! Thanks for sharing Eric!, , , Reply, , , , , , , , , , Melanie, , says, , , November 17, 2020 at 1:48 am, , , , Can u make this without an ice cream maker?, , , Reply, , , , , , , , Alison Andrews, , says, , , November 17, 2020 at 12:22 pm, , , , Hi Melanie, yes you can! The best way to do this is to beat the ice cream mixture in your stand mixer before freezing. And then before it’s frozen, bring it out a couple more times and beat it again. This will come closest to what you’ll get from an ice cream machine. Alternatively you can just freeze it! It will still be really good, just not as fluffy., , , Reply, , , , , , , , , , Michelle, , says, , , July 19, 2020 at 1:05 am, , , , Can I make this with your cashew milk process from Cashew Ice Cream?, , , Reply, , , , , , , , Alison Andrews, , says, , , July 20, 2020 at 9:00 am, , , , Sure, , , Reply, , , , , , , , , , Jaafar Awadallah, , says, , , June 26, 2020 at 2:24 am, , , , Which coconut did you use silk or full fat canned coconut milk?, , , Reply, , , , , , , , Alison Andrews, , says, , , June 26, 2020 at 10:24 am, , , , Full fat canned coconut milk. 🙂, , , Reply, , , , , , , , , , Snailz, , says, , , May 31, 2020 at 8:45 am, , , , Delicious! Needed a little more peppermint extract and was a little sweet for me so next time I think I’ll use less sugar or syrup., , , Reply, , , , , , , , Nicola Chandler, , says, , , June 26, 2018 at 9:33 am, , , , Just made this this morning with my new Cuisinart ice cream maker – never made ice cream before and it’s turned out beautifully. Mint choc chip is my very favourite flavour  – I am a vegan so thank you so much Alison for sharing this wonderful recipe. Can’t wait to try more!, , , Reply, , , , , , , , Alison Andrews, , says, , , June 26, 2018 at 9:38 am, , , , That’s wonderful! This is totally my favorite flavor too! So glad you liked it. Thanks for posting Nicola! 🙂, , , Reply, , , , , , , , , , Elisabeth B., , says, , , July 26, 2017 at 6:58 pm, , , , Hello! My family and I have been vegan for several years now. I discovered your website by accident when looking for a good vegan vanilla cake recipe, which I made and it was divine. I have now made several of your recipes and the results have made me love being vegan. Your ice cream recipes are wonderful! I was wondering if you would consider making a recipe for coffee ice cream?? Or do you know of a good recipe?, Thank you so much for posting and sharing such fabulous culinary creations!, , , Reply, , , , , , , , Alison Andrews, , says, , , July 27, 2017 at 5:32 am, , , , Hi Elisabeth! This is so great to hear, thank you so much! Made my day. 🙂 I will definitely make a coffee ice cream – just added it to my list! In the meantime I don’t know of any particular recipe, but off the top of my head, what I would probably do is a basic coconut ice cream (, like this one, ) and just add either instant coffee powder or finely ground espresso powder in at the blending part of the recipe. Thanks so much for posting!, , , Reply, , , , , , , , , , Amber, , says, , , May 13, 2017 at 3:59 pm, , , , Have you tried using spinach for the color? I got the idea for it from a BlendTec recipe for mint and chop ice cream, and it works pretty well for the green color. It’s a little darker than with food coloring, but that certainly wouldn’t be “puke green”. Spinach also adds almost no extra flavor. I also like to add in fresh mint., , , Reply, , , , , , , , Tami, , says, , , June 23, 2019 at 1:12 pm, , , , Love this idea Amber!, , , Reply, , , , , , , , , , Jill, , says, , , January 28, 2017 at 2:33 pm, , , , Just made this in my Cuisinart ice cream maker this morning! Gave my 2 boys a taste, and it was a thumbs up all around! I have a dairy allergy so this is a great recipe for me! Yum!, , , Reply, , , , , , , , Alison Andrews, , says, , , January 29, 2017 at 10:09 am, , , , Awesome Jill! 🙂, , , Reply, , , , , , , , , , John, , says, , , March 15, 2016 at 6:42 pm, , , , Looks amazing!, , , Reply, , , , , , , , Alison Andrews, , says, , , March 15, 2016 at 6:56 pm, , , , Thanks John! I actually can’t wait to make it again myself 🙂, , , Reply, , , , , , , , Comment Policy:, Your feedback is really appreciated! Please do us a favor and rate the recipe as well as this really helps us! The most helpful comments are the ones that give useful feedback for others who might make the recipe, tell about substitutions you made or adjustments you made and how it turned out, or assisting other commenters. Rude or insulting comments will not be accepted., , , , , 5 from 7 votes (, 3 ratings without comment, ), , , , Leave A Comment & Review, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , Primary Sidebar, , , , Hi I’m, Alison Andrews!, I love making delicious vegan food and creating delicious vegan versions of all your old favorite dishes, so you can have your vegan cake and eat it too!, , More about me →, , , Facebook, , Twitter, , Instagram, , YouTube, , Pinterest, , , Popular Posts, , Vegan Tuna, The Best Vegan Mac and Cheese (Classic, Baked), Vegan Burrito, Super Eggy Vegan Tofu Scramble, Sliceable Cashew Cheese, Homemade Vegan Butter, , , Veganuary, , Vegan Chop Suey, Vegan German Potato Salad, Vegan Italian Dressing, Vegan Thai Peanut Noodles, Vegan Halloumi, Vegan Stuffed Mushrooms, , See all, Veganuary Recipes →, , , Footer, , ↑ back to top, , As Seen In, , , , , About, , Privacy Policy, Terms & Conditions, , , , Follow Us, , Facebook, , Twitter, , Instagram, , YouTube, , Pinterest, , , , Contact, , About, Contact, , , , Copyright © 2022, Loving It Vegan, , , Get 10 fabulous dinner recipes!, Absolutely free! Sign up below!, Get Your Copy! It's FREE!, , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Vegan Fudgesicles": "Ingredients: , , Of all popsicles, the Fudgesicle has always been the queen for me; it can be licked or bit or slurped - whatever your heart desires, and still each taste yields pure chocolatey richness., Yummmm, !, , Added bonuses with this dairy-free Vegan Fudgesicle recipe -, , , Coconut milk makes these vegan popsicles even creamier than their dairy nemesis, , No refined sugar is needed, , They're gluten-free, , , Did I mention how crazy easy these are to throw together?!, , , Related recipe:, Vegan Mango Popsicles, , , Related recipe:, Chocolate Cherry Vegan Ice Cream, , , , ½ cup, cocoa powder, , 1 cup, coconut milk, (use canned for the creamiest fudgsicles), , ⅓ cup, maple syrup, , ½ teaspoon, vanilla extract, , Optional: pinch of, salt, , or, cayenne pepper, (to balance the sweetness, or for a spicy kick!), , , You'll also need:, A whisk and a bowl (or a blender), and of course -, popsicle molds, ! I use, these, , and I think they have the best classic popsicle shape and they are pretty easy to get the popsicles out of the molds (more tips on that below!), , How to make Vegan Fudgesicles:, , Add Cocoa powder, canned coconut milk, maple syrup, vanilla extract, and a pinch of salt to a medium sized mixing bowl (Photos 1 & 2)., , popsicle mold, (Photo 4).  Freeze for at least 4 hours or overnight.  Enjoy!, , , Related recipe:, Vegan Mint Chip Ice Cream, , How many popsicles does this recipe make?, , This recipe makes about 1 ½ cups of vegan Fudgesicle mixture - just enough to fill five popsicle sections in my popsicle mold., , What is the best popsicle mold?, , I actually have a couple of different kinds of popsicle molds.  I waffle between liking the re-usable plastic stick molds, and the replaceable wooden stick mold as pictured in this recipe.  I'm currently using this Norpro Frozen Ice Pop Maker, and I like it because it is compact, and yet I can make ten pops at a time if I want!!  Oh, and it's, cheap, - that's always good, right?, , , Related recipe:, , Vegan Ice Cream Cups, , How to get your popsicles out of the mold:, , Getting your popsicles to release from the mold can sometimes be a trick.  You can:, , , A) Fill a dish large enough to hold the popsicle mold with hot tap water.  Immerse the popsicle mold into the water most of the way (don't let water seep into the top of the mold and spoil everything!) and hold it there for about 30 seconds.  Attempt to remove a popsicle from mold gently, returning to the water for a few more seconds if necessary., , B) Run the lower part of the mold under hot running water for 2+ minutes to loosen the ice pops.  Test for release and repeat for a few more seconds if necessary., , , Related recipe:, Vegan Chocolate Milkshake, , How to store your popsicles:, , The best part is that you can make these vegan fudgesicles up to a month ahead, and just keep them in your freezer until ready!  Voila!  Usually my fudgesicles are a bit moist after removing them from the mold.  If you want to freeze them for later, you can lay them out on a tray covered in parchment or wax paper, return to the freezer to solidify for 10 minutes or so, and then put them all in a bag or container together once they are frozen solid., , , Here are some other yummy vegan desserts you might enjoy:, , , Fresh peach pie, , Amazing Vegan Cheesecake, , Vegan Key Lime Pie, , , If you’ve tried this Vegan Fudgesicle or any other recipe on my blog then don’t forget to rate the recipe and let me know how you got on in the comments below, I LOVE hearing from you! You can also, FOLLOW ME, on, FACEBOOK, ,, INSTAGRAM, and, PINTEREST, to see more delicious food!!!, , Recipe, , , , , Vegan Fudgesicles, , , These ultra creamy Vegan Fudgesicles are 4 ingredient wonders created with a coconut milk and cocoa powder base.  Aside from a simple popsicle mold, no actual cooking or fancy tools required!!  Gluten-free and refined sugar-free., , , 4.62, from, 63, votes, , , Print recipe, , Leave a comment, , , Course:, Dessert, Cuisine:, American, Diet:, Gluten Free, Vegan, Vegetarian, , Prep Time:, 5, minutes, , minutes, Total Time:, 5, minutes, , minutes, , Servings:, 5, , people, , Calories:, 168, kcal, , Author:, Kate, , , ▢, ½, , cup, , Cocoa Powder, ▢, 1, , cup, , Coconut Milk, , , canned, ▢, ½, , teaspoon, , Vanilla Extract, ▢, ⅓, , cup, , Maple Syrup, ▢, pinch, , Salt, , , (or try a pinch of cayenne pepper for a kick of spice!), , Special equipment, Popsicle molds, , Freeze for at least 4 hours or overnight.  Enjoy!, , , , , , Notes, Total time in the recipe does not include time to freeze., , I love these, popsicle molds, ., , HOW MANY POPSICLES DOES THIS RECIPE MAKE?, , This recipe makes about 1 ½ cups of vegan Fudgesicle mixture – just enough to fill five popsicle sections in my popsicle mold., , HOW TO GET YOUR POPSICLES OUT OF THE MOLD:, , Getting your popsicles to release from the mold can sometimes be a trick.  You can:, , , A) Fill a dish large enough to hold the popsicle mold with hot tap water. Immerse the popsicle mold into the water most of the way (don’t let water seep into the top and spoil everything!) and hold it there for about 30 seconds. Attempt to remove a popsicle from mold gently, returning to the water for a few more seconds if necessary.... or, , B) Run the lower part of the mold under hot running water for a few seconds to loosen the ice pops. Test for release and repeat for a few more seconds if necessary., , , HOW TO STORE YOUR POPSICLES:, , The best part is that you can make these vegan fudgesicles up to a month ahead, and just keep them in your freezer until ready!  Voila!  Usually my fudgesicles are a bit moist after removing them from the mold.  If you want to freeze them for later, you can lay them out on a tray covered in parchment or wax paper, return to the freezer to solidify for 10 minutes or so, and then put them all in a bag or container together once they are frozen solid., , Nutrition, Serving:, 1, g, |, Calories:, 168, kcal, |, Carbohydrates:, 21, g, |, Protein:, 3, g, |, Fat:, 11, g, |, Saturated Fat:, 9, g, |, Sodium:, 10, mg, |, Potassium:, 279, mg, |, Fiber:, 3, g, |, Sugar:, 13, g, |, Vitamin C:, 0.4, mg, |, Calcium:, 43, mg, |, Iron:, 2.7, mg, , , More Vegan Dessert Recipes, Vegan Mocha Mug Cake, Vegan Apple Sticky Buns, 25 Vegan Halloween Recipes, Vegan Blueberry Muffins, , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , , 4.62 from 63 votes (, 60 ratings without comment, ), , , , Questions? Feedback? I love to hear from you!, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Sign me up for the newsletter!, , , , , , , , , , Nicole Madsen, , , May 18, 2023 at 5:50 pm, , , , These turned out so good! I used a can of coconut cream and had very little cocoa powder left (less than 1/4 cup) so I used cacao powder as well (about 2-3 tablespoons). I subbed agave for maple syrup. These are so creamy and chocolatey! I had a 2 extra popsicle molds to I mashed a banana and mixed it with some cream, cinnamon and vanilla for our baby., Thanks for the awesome recipe!, , , Reply, , , , , , , , Sue Sexton, , , October 26, 2021 at 12:49 am, , , , Can I use sweetened condensed coconut milk, omitting the sugar? Just wondering, thanks!, , , Reply, , , , , , , , Kate, , , October 27, 2021 at 12:03 am, , , , Yes, that should work! I'm just not sure about the amounts/proportions, since it might be too sweet if you only use sweetened condensed coconut milk. Give it a try and let me know how much of the sweetened coconut milk you used., , , Reply, , , , , , , , , , Jamie, , , June 03, 2021 at 2:24 am, , , , Wow! These are amazing! I love how simple this recipe is. Definitely satisfied my chocolate craving 😉💯, , , Reply, , , , « Older Comments, Primary Sidebar, , , , , , Welcome to Vegan Blueberry!, Here you'll find veganized versions of your favorite comfort food, amazing, vegan desserts, , and the best, vegan cheese recipes, on the internet., , More about Vegan Blueberry →, , , , , Reader favorites:, , Vegan Garlic Ginger Glazed Meatballs, Butter Bean Stew, Butter Bean Hummus, Vegan Parsnip Soup, , , Footer, , Find Out What's Cookin', , Email, Facebook, Instagram, Pinterest, YouTube, , Who's behind Vegan Blueberry?, , Hi! I'm Kate. Welcome to Vegan Blueberry, where you'll find easy, delicious vegan recipes that are family-friendly and super satisfying!, Read more, , , My Favorites:, , , , See the Vegan Blueberry, Web Stories, , , , , , Footer, , ↑ back to top, , , , About, , , About Vegan Blueberry, , , , , Newsletter, , , Sign Up!, for emails and updates, , , , , Contact, , , Contact, , , , , , , , As an Amazon Associate I earn from qualifying purchases. See my full, disclosure and privacy policy., , Copyright © 2025 · MAMA IS WORKING LLC, VEGAN BLUEBERRY |, Privacy Policy, , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: Add cocoa powder, canned coconut milk, maple syrup, vanilla extract, and a pinch of salt to a medium sized mixing bowl.",
        "Almond Milk Chocolate Banana Ice cream": "Ingredients: Meal Type, :, dessert,, , ice cream., , , , , , Bananas, – to add sweetness and creamy texture., , Almond Milk, – the almond milk will help to smooth everything out and give our dessert a luscious consistency. You can substitute with soy, rice, cashew, oat etc., , Cacao Powder, – to add rich chocolaty flavor., , Maple Syrup, – maple syrup adds a touch of natural sweetness that perfectly complements the chocolatey goodness. You can substitute for honey., , , How to Make Almond Ice Cream, , , (Full recipe below). Begin by slicing the bananas into coins and placing them in the freezer for about half an hour to an hour. Freezing the bananas will give our frozen dessert a wonderfully creamy texture., , Add the frozen banana slices to the blender along with almond milk, cacao powder and maple syrup., , an there are no lumps remaining., , Once the mixture is thoroughly blended, pour it into a suitable container, ensuring it is evenly spread. Cover the container and place it back in the freezer for at least 5 to 6 hours. Allowing ample time for freezing will result in a firm and beautifully textured frozen dessert., , , , , , , Banana Chocolate Ice Cream Tips, , , You need to freeze bananas for up to 1 hour before blending., , If the ice cream is to hard to scoop just remove from the freezer and leave it on countertop for few minutes before serving., , After patiently waiting for the freezing process to complete, it’s time to indulge in your homemade frozen banana and cacao delight! Take it out of the freezer, scoop out a generous portion into a bowl or cone, and savor the creamy, chocolatey goodness., , You can add toppings: nuts, for example sliced almonds, fruits or sprinkles., , , , , Almond Milk Chocolate Ice Cream FAQ’s, , What is almond milk ice cream made of?, , any sweetener, flavorings and optional add on., , , What is banana ice cream?, , Banana ice cream, also known as “nice cream,” is a popular dairy-free and healthy alternative to traditional ice cream. Banana ice cream is made primarily from frozen bananas, , , Is this ice cream vegan?, , Yes, bananas, maple syrup and cacao powder., , , , Other Ice Cream Recipes, , , 4 No Churn Ice Cream Recipes, , Strawberry Banana Ice Cream Cake, , Vegan Chocolate Ice Cream, , Strawberry Ice Cream, , , , , Would you like to see more?, SUBSCRIBE, to receive recipes & party themes in your inbox, !, Follow, on, Instagram,, , Facebook, and, Pinterest., , , Pin Recipe, , Facebook, , , , Print Recipe, , LEAVE A STAR RATING!, , No ratings yet, , SAVE RECIPE, , Saved!, , , Almond Milk Chocolate Banana Ice Cream, , The perfect balance of sweetness and creaminess in every spoonful of almond milk chocolate banana ice cream., , , , Prep Time, 10, minutes, , mins, Freezing, 7, hours, , hrs, Total Time, 7, hours, , hrs, , 10, minutes, , mins, , , Servings:, 3, , Calories:, 155, kcal, , Author:, Ilona, , 3, , bananas, 1, , cup, , almond milk, 1, , Tbsp., , cacao powder, 2 – 3, , Tbsp., , maple syrup, US Customary, –, Metric, , Once the mixture is thoroughly blended, pour it into a suitable container, ensuring it is evenly spread. Cover the container and place it back in the freezer for at least 5 to 6 hours., , Course:, Dessert, Cuisine:, American, Diet:, Low Fat, Vegan, , , Notes, , , You need to freeze bananas for up to 1 hour before blending., , , , If the ice cream is to hard to scoop just remove from the freezer and leave it on countertop for few minutes before serving., , , , After patiently waiting for the freezing process to complete, it’s time to indulge in your homemade frozen banana and cacao delight! Take it out of the freezer, scoop out a generous portion into a bowl or cone, and savor the creamy, chocolatey goodness., , , , You can add toppings: nuts, for example sliced almonds, fruits or sprinkles., , , , Nutrition, Serving:, 3, g, Calories:, 155, kcal, Carbohydrates:, 37, g, Protein:, 3, g, Fat:, 2, g, Saturated Fat:, 1, g, Polyunsaturated Fat:, 1, g, Monounsaturated Fat:, 1, g, Sodium:, 111, mg, Potassium:, 519, mg, Fiber:, 5, g, Sugar:, 20, g, Vitamin A:, 76, IU, Vitamin C:, 10, mg, Calcium:, 123, mg, Iron:, 1, mg, , , , , Did you make this recipe?, Make a picture and share it with, @ilonaspassion, and tag, #ilonaspassion, !, , Update Notes:, The recipe was originally posted in June 2015, it was updated with new tips in August, 2023., , , , , , , , , , Ilona, , , An owner of ilonaspassion.com website with food recipes, party inspirations, and entertaining., , , , , Facebook, , , , , Instagram, , , , , YouTube, , , , , Pinterest, , , , , , , , Post navigation, , Previous, , Previous, Parmesan Broccoli Baked Lemon Fish, Next, Continue, , Lemon Ricotta Pancakes, , , , , , Similar Posts, , , , , , , , , Peppermint Chocolate Mousse Brownies, , , , , , , , , , Banana Bread with Chocolate Chips, , , , , , , , , , , , , , , Honey Almond Chia Granola, , , , , , , , , , , , , , , Basil Spinach Almond Pesto, , , , , , , , , , Gooseberry Jam, , , , , , , , , , , , , , , Frosted Cut Out Sugar Cookies, , , , , , , , , , , , , , 2 Comments, , , , , , , , Thalia @ butter and brioche, , says:, , , , July 8, 2015 at 3:22 AM, , , , , Who knew chocolate and banana ice cream could be so healthy and still stay delicious. Yum!, , , Reply, , , , , , , , , Ilona, , says:, , , , July 8, 2015 at 8:52 PM, , , , , I’m surprised too Thalia, Long time ago we didn’t even think about ice cream made from banana., , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , Website, , , , , Δ, , , , , , , , , , , , , Meet ILONA, , ,  Instructions: Slice bananas into coins and place them in the freezer for about half an hour to an hour., 3 bananas, Remove from freezer and add bananas to the blender together with almond milk, cacao powder and maple syrup., 1 cup almond milk, , 1 Tbsp. cacao powder, , 2 – 3 Tbsp. maple syrup, , , , About Ilona, , Search, , , , , , , , , Other Reader Favs, , , , , , , , , , Spaghetti Squash with Roasted Cauliflower, , , , , , , , , , , , , , Non Alcoholic Mojito Mocktail, , , , , , , , , Dill, Parmesan and Cream Cheese Stuffed Mushrooms, , , , , , , , , , , , , , Baked Pork Chops with Apples and Plums, , , , , , , , , , , , , , Cream Cheese Corn Dip, , , , , , , , , , , , , , White Chocolate Raspberry Muffins, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Grab your, Free, copy, , , Get Delights in Your Inbox, , Join our newsletter to receive an e-book featuring 7 yummy cupcake recipes, guaranteed to be delicious. Sign up now and get beautiful things straight to your inbox!, , , , , , , , , , , , , , , , , , , , , Recipe Index, , About Ilona’s Passion, , Work with Me, , Privacy Policy, , Contact, , , , , , , , , Facebook, , Instagram, , YouTube, , Pinterest, , , , , , , , , © 2025 Ilona's Passion, , , , , , , , , , , , , , , , , , , , , , , , , , , , Scroll to top, , Scroll to top, , , , , , , , , , , , , , , , All Recipes, Toggle child menu, Expand, , , , Breakfast, , Lunch, , Appetizer, , Dinner, , Dessert, , Drink, , Party Food, , Meal Prep, , Polish Recipes, , , , Entertain, , DIY, Toggle child menu, Expand, , , , Gift Ideas, , Party Ideas, , Printables, , Free Stuff, , , , About, Toggle child menu, Expand, , , , About Ilona, , Work with Me, , Contact, , , , Recipe Index, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , ,",
        "Vegan Chocolate icecream": "Ingredients: , , Do you own an ice cream maker? Okay, if I knew that homemade ice cream was so incredibly easy to make, I would’ve started making it ages ago. I actually borrowed by mom’s ice cream maker to make sure it’s an appliance I, actually, need. J and I moved into our new apartment in Toronto early March (and back to Canada last September) and my new kitchen is already splitting at the seams with kitchen gadgets and appliances. After a couple weeks of ice cream making, I’m convinced an ice cream maker is definitely worth the investment., , , I mean look at that silky, creamy, fluffy and superrr chocolatey Vegan Chocolate Ice Cream. Just heavenly., , One thing I never do in my, recipes, is skimp on the chocolate. Because it’s good for you, my partner J is, Belgian, , and I’m a, chocoholic, . I used, cacao, powder in this Vegan Chocolate Ice Cream but a high-quality cocoa powder also works great. Cacao powder is a bit more expensive than cocoa powder but it is slightly less refined and the chocolate flavor is so just oh-so-rich and decadent. I love using it when I bake and it worked like magic in this homemade ice cream., , , snap a photo and tag me, #CearasKitchen, on, Instagram, ., , , Print, , , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , Vegan Chocolate Ice Cream, , , , , ★, ★, ★, ★, ★, , 4.5, from, 4, reviews, , , , , , Author:, , Ceara, , , , Total Time:, , 45 mins, , , , , , , , , , Print Recipe, , , , , Description, , , , , , , , , , , , , , Scale, , 1x, 2x, 3x, , , , , , , 3 cups, full fat coconut milk (, 2, cans), , 2 tsp, tapioca starch, , 1 tbsp, vanilla extract, , 1 tbsp, instant coffee, , 1/2 tsp, sea salt, , 3/4 cup, cacao powder (or cocoa powder), , 1/2 cup, cane sugar, , 1/4 cup, maple syrup, , , , , , , , vanilla extract, cacao powder, coffee, sea salt, cane sugar, and maple syrup). Whisk over medium heat until the mixture starts to lightly simmer. Add the tapioca starch mixture and whisk until the mixtures begins to thicken (about 5 minutes)., , Pour mixture into a bowl and cover. Leave to cool in the fridge overnight or for an hour in the freezer. The ice cream mixture should be completely cool before mixing it in the ice cream maker., , Add the mixture to your (frozen – see note) ice cream maker and mix for about 20-30 minutes until your ice cream turns into a soft serve consistency. Do not over-mix (if you notice your ice cream has begun to melt it is time to freeze it) or else your ice cream will become icy and will not be as creamy., , Scoop ice cream into a glass dish (or loaf pan lined with parchment paper), cover and freeze for an hour or two until the ice cream is completely frozen. Scoop onto an ice cream cone, cover with chocolate sauce and enjoy!, , , , , , Notes, , , 1) Use only full-fat coconut milk in this recipe. Low-fat coconut milk will make icy (and not creamy) ice cream., 2) Make sure that your ice cream maker bowl is completely frozen before using it to make ice cream. It should be kept in the freezer overnight and there should not be any sloshing sound when you pick it up., 3) For the perfect ice cream scoop, take the ice cream out of the freezer and leave to soften for 2 minutes. Run your ice cream scoop under warm water and scoop by pressing hard into the ice cream – this guarantees a perfect scoop every time!, , , , , , Prep Time:, , 45 mins, Category:, , Dessert, , , , , , , , Did you make this recipe?, , Share a photo and tag us — we can't wait to see what you've made!, , , , , , , , , , , , Post Tags:, , #, chocolate, #, cream, #, Vegan, , , , , , , , Post navigation, , Previous, , Previous, Vegan Avocado Pesto Pasta, Next, Continue, , Avocado Cucumber Salad, , , , , , Similar Posts, , , , , , , , , , , , , , , , 20 minutes or less, |, All Recipes, |, Cheese, |, Fall, |, Gluten Free, |, Oil Free, |, Refined Sugar Free, |, Savory Eats, |, Spring, |, Summer, , , , Vegan Parmesan, , By, Ceara, , , February 27, 2017, July 28, 2023, , , , , , potatoes, and use as a topping for casseroles., , , , , , Read More, Vegan Parmesan, Continue, , , , , , , , , , , , , , , , , , , , Appetizers, |, All Recipes, |, Fall, |, Gluten Free, |, Oil Free, |, Refined Sugar Free, |, Savory Eats, |, Snacks, |, Spring, |, Summer, |, Vegetables, |, Winter, , , , Vegan Avocado Fries, , By, Ceara, , , June 10, 2016, July 28, 2023, , , , , , Baked Vegan Avocado Fries. Ripe, sliced avocado is tossed in a flavorful bread crumb mixture and baked until golden brown and crispy. These healthy fries make the perfect appetizer dipped in my Smokey Tangy Avocado Dip., , , , , , Read More, Vegan Avocado Fries, Continue, , , , , , , , , , , , , , , , , , , , All Recipes, |, Desserts, |, Fall, |, Gluten Free, |, Nut Butter, |, Oil Free, |, Refined Sugar Free, |, Snacks, |, Sweet Eats, |, Winter, , , , Pure Magic Mixed-Nut Butter, , By, Ceara, , , November 4, 2013, July 28, 2023, , , , , , A bit of magic happened with this nut butter. The nuts turned and turned in the food processor until they finally formed a smooth, creamy and yummy butter. I encourage you to eat it by the spoonful pre or post workout or to enjoy it on some pumpkin banana bread for a great energy-boosting snack! This…, , , , , , Read More, Pure Magic Mixed-Nut Butter, Continue, , , , , , , , , , , , , , , , , , , , All Recipes, |, Breads, |, Breakfast, |, Chocolate, |, Desserts, |, Fall, |, Healthy Living, |, Low Fat, |, Pumpkin, |, Refined Sugar Free, |, Winter, , , , Vegan Dark Chocolate Pumpkin Bread with Dark Chocolate Chunks, , By, Ceara, , , October 23, 2013, July 28, 2023, , , , , , I love everything about chocolate.   The richness, the wonderful taste and the ways it melts in my mouth.   So coincidentally when I moved to Belgium I entered into the land of chocolate. High-end delicious chocolate is never far away for a moment of sheer, blissful, beautiful indulgence!    One of the best parts…, , , , , , Read More, Vegan Dark Chocolate Pumpkin Bread with Dark Chocolate Chunks, Continue, , , , , , , , , , , , , , , , , , , , All Recipes, |, Gluten Free, |, Grain Free, |, Low Fat, |, Mains, |, Oil Free, |, Pasta, |, Refined Sugar Free, |, Savory Eats, |, Spring, |, Summer, |, Uncategorized, |, Vegetables, , , , Vegan Rose Sauce, , By, Ceara, , , April 6, 2015, July 28, 2023, , , , , , Happy Easter friends! How was your Easter weekend? Okay, so maybe Vegan Rose Pasta is not really that Easter friendly but when you are a vegetarian/vegan you tend to break all the food rules for holidays anyways. Like eating Mac + Cheese with Christmas dinner because… why not? What did you eat for Easter dinner? J and…, , , , , , Read More, Vegan Rose Sauce, Continue, , , , , , , , , , , , , , , , , , , , 20 minutes or less, |, All Recipes, |, Breakfast, |, Fall, |, Gluten Free, |, Grain Free, |, Oil Free, |, Refined Sugar Free, |, Smoothie, |, Spring, |, Summer, |, Sweet Eats, |, Winter, , , , Creamy Vanilla Avocado Smoothie, , By, Ceara, , , October 28, 2015, July 28, 2023, , , , , , Are you an AVOCADOOO fan?!  I could put avocado in everything. Avocado in my guacamole, burritos, dressing and SMOOTHIES. One of my favorite ways to enjoy avocado is in this pretty light green CREAMY Avocado Smoothie., , , , , , Read More, Creamy Vanilla Avocado Smoothie, Continue, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , © 2025 Ceara's Kitchen, Wordpress Support, , , , , , , , , , , , , , , , , , , , , , , , , , Recipes, Toggle child menu, Expand, , , , Sweet Eats, Toggle child menu, Expand, , , , Chocolate, , Cookies, , Breads, Toggle child menu, Expand, , , , Banana Bread, , , , Smoothies, , , , Savory Eats, Toggle child menu, Expand, , , , Mains, Toggle child menu, Expand, , , , Pasta, , , , Salads, , Sides, , Appetizers, , Soups & Stews, , , , Gluten Free, , Oil Free, , 20 minutes or less, , Breakfast, , Snacks, , , , Live Happy, Toggle child menu, Expand, , , , Travel, , WIAW, , Running, , , , Shop, Toggle child menu, Expand, , , , Kitchen Appliances, , Pantry, , Blogging, , , , Contact, , , , , , , , , , Instructions: , , , , In a small bowl",
        "Banana Peanut butter chocolate chunk ice cream": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., NUTRITIONAL INFORMATION (per serving): Calories: 182   Total Fat: 9 g   Saturated Fat: 2 g   Cholesterol: 0 mg   Sodium: 57 mg   Carbohydrates: 25 g, Fiber: 4 g   Sugars: 13 g   Protein: 5 g, BANANA PEANUT BUTTER CHOCOLATE CHUNK ICE CREAM, SERVES: 4 (approx. ¼ cup each)    Prep Time: 15 min.    Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, 3½, 3, ripe medium bananas, , cut into chunks, 3 Tbsp., all-natural peanut butter, 1 to 2 Tbsp.\t unsweetened almond milk (optional), 4 tsp., chopped dark chocolate, 4 tsp., sliced raw almonds, 1.\t Place bananas in plastic bag; freeze for 4 hours, or until completely frozen., 2.\t Place bananas and peanut butter in blender (or food processor); cover., Blend until smooth. Add almond milk, if needed, for creamier texture., 3.\t Divide ice cream evenly between four serving bowls; top evenly with, chocolate and almonds., 4.\t Serve immediately., TIP:, If you are preparing ice cream ahead of time and freezing it for later, make, sure to transfer it to the refrigerator for 10 to 20 minutes or until soft, enough to scoop., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Melon Sorbet": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., MELON SORBET, SERVES: 5 (1 cup each)  Prep Time: 20 min. + 4 hours to freeze  Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, Here’s a fun and simple way to whip up a quick sorbet. We used cantaloupe for this recipe, but it works just as well with other melons like, honeydew and watermelon. You can also switch between lemon and lime as your acid, and try herb additions, like mint, tarragon, or basil., This is so easy to make, it’s worth experimenting!, 1, medium cantaloupe, cut into, 1-inch cubes, 2 Tbsp., fresh lemon juice, 3 Tbsp., raw honey, 3 Tbsp., water, 1 pinch, sea salt (or Himalayan salt), SPECIAL EQUIPMENT:, Parchment paper, 1. \t Line baking sheet with parchment paper. Place cantaloupe on baking, sheet; spread out so that there is a little space between each piece., 2. \t Place baking sheet in freezer overnight or until cantaloupe is frozen solid, (minimum 4 hours)., 3. \t Place frozen cantaloupe in food processor; pulse until crumbly., 4. \t Add lemon juice, honey, water, and salt; pulse until mixture forms texture, of soft sorbet. (If sorbet is too thick, add 1 tsp. of water at a time. Make, sure it does not become a slushy.), 5. \t Serve immediately, or store in an airtight container, in the freezer, for up to, 3 months., RECIPE NOTE:, For a vegan version, omit honey. Heat 3 Tbsp. water and 3 Tbsp. coconut, sugar until sugar is dissolved. Chill before adding to the sorbet., NUTRITIONAL INFORMATION (per serving): Calories: 75  Total Fat: 0 g  Saturated Fat: 0 g   Cholesterol: 0 mg  Sodium: 46 mg  Carbohydrates: 20 g  Fiber: 1 g, Sugars: 18 g  Protein: 1 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Strawberry Cheesecake Pops": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., STRAWBERRY CHEESECAKE POPS, SERVES: 6 (1 pop each) Prep Time: 5 min. + 3 hours to freeze Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, 1, ¼ cup + 2 Tbsp., cream cheese, ½ cup, , , canned coconut milk, , , (shake well before, , , opening), ¼ cup, , , pure maple syrup, , , , divided use, ¼ cup, , , reduced-fat (2%) plain, , , Greek yogurt, 1 tsp., , , pure vanilla extract, 1 cup, , , chopped strawberries, 2 tsp., , , fresh lemon juice, SPECIAL EQUIPMENT:, Ice pop molds, 1.\t\t Place cream cheese, coconut milk, 2 Tbsp. maple syrup, yogurt, and, extract in blender; cover and blend until smooth. Pour into a medium, mixing bowl; set aside., 2.\t\t Rinse out blender. Add remaining 2 Tbsp. maple syrup, strawberries, and, lemon juice to blender; cover and blend until smooth., 3.\t\t Pour strawberry mixture into cream cheese mixture; gently swirl the two, together using a butter knife., 4.\t\t Evenly divide mixture among 6 ice pop molds and insert mold sticks; freeze for, 3 hours, or until solid., NUTRITIONAL INFORMATION (per serving): Calories: 140  Total Fat: 9 g  Saturated Fat: 7 g  Cholesterol: 15 mg, Sodium: 55 mg  Carbohydrates: 13 g  Fiber: 1 g  Sugars: 10 g  Protein: 2 g, RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 24, Instructions: "
    }
}