{
    "ingredients": {
        "Vegan Lemon Loaf": "self raising flour,caster sugar,baking power,powdered sugar,almond milk",
        "Vegan Sticky Gingerbread": "vegan butter,dark muscovado sugar,black treacle,soya milk,ACV,flour,baking soda,cinnamon, ginger powder",
        "Vegan Apple Pie Bread": "vegan butter,maple syrup,applesauce,vanilla extract,all purpose flour,baking powder and soda,apple pie spice,almond milk,apples",
        "Banana Bread": "bananas,coconut oil,eggs,vanilla extract,all purpose flour,almond flour,baking powder,sugar",
        "Cloud Bread": "eggs,cream of tartar,greek yogurt",
        "Vegan Banana Bread": "Bananas, sugar, oil, cinnamon,nutmeg,vanilla extract,whole wheat flour, baking powder, baking soda",
        "Pumpkin Bread": "whole wheat flour,all purpose flour,cinnamon,cloves,nutmeg,baking soda and powder,sugar,pumpkin puree,eggs,ghee,coconut milk",
        "Vegan Lemon Bread": "flour,baking powder,baking soda,sugar,milk,yogurt,applesauce,lemon juice,lemon zest,vanilla extract",
        "Peanut Butter Apple Crumble": "peanut butter,coconut oil,brown sugar,maple syrup,oat flour,rolled oats,baking powder,apples,maple syrup,lemon juice,corn starch,cinnamon"
    },
    "recipe_url": {
        "Vegan Lemon Loaf": "https://www.pinterest.co.uk/pin/496592296426702762/",
        "Vegan Sticky Gingerbread": "https://thinlyspread.co.uk/vegan-sticky-gingerbread-easy-and-delicious/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=470875640_16277768_394072",
        "Vegan Apple Pie Bread": "https://www.rabbitandwolves.com/vegan-apple-pie-bread/#recipe",
        "Banana Bread": "fixate_recipes\\Dessert\\FXR_Banana_Bread_R_03.19.18.pdf",
        "Cloud Bread": "fixate_recipes\\Dessert\\FXR_Cloud_Bread_R_03.19.18.pdf",
        "Vegan Banana Bread": "https://www.vegrecipesofindia.com/banana-bread-eggless-vegan-recipe/",
        "Pumpkin Bread": "fixate_recipes\\Dessert\\FXR-EN-Pumpkin_Bread-1.14.21-Recipe.pdf",
        "Vegan Lemon Bread": "https://chocolatecoveredkatie.com/vegan-lemon-bread-recipe/",
        "Peanut Butter Apple Crumble": "https://www.texanerin.com/peanut-butter-apple-crumble/"
    },
    "Recipe": {
        "Vegan Lemon Loaf": "Ingredients:  Instructions: ",
        "Vegan Sticky Gingerbread": "Ingredients: no weird magic – it’s just a traditional gingerbread recipe, made vegan. I don’t think even my Granny would notice the difference and she is the one who taught me to make her, traditional ginger cake, all those years ago!, Here are a few tips to help you on your way:, I’ve used soya milk combined with a little vinegar to create a vegan buttermilk which reacts with the bicarbonate of soda to give the rise we all look for in a good cake., It is important to allow the heated butter, sugar and treacle mixture to cool so make sure you have made time for this step., This cake keeps well in an airtight tin but it will be stickier on day two than on day one – a bonus in my book!, Looking For More Vegan Cakes and Bakes? Try My:, Easy Vegan Victoria Sponge Cake, Brownies with Pumpkin and Pecans, Chocolate Fudge Cake, Traditional Syrupy Flapjack, If you make my recipe I’d love to hear how it turns out for you. Please leave a comment and a star rating below and share your pictures with me on social media. Tag me @thinlyspread and include the hashtag #thinlyspread so I can see them!, Follow me on, Pinterest, ,, Facebook, ,, Twitter, and, Instagram, where I share recipe ideas, links to vegan events and articles and where I natter on about my favourite subject – vegan food, Easy Sticky Ginger Cake, A simple recipe for traditional sticky ginger cake, made vegan., , 4.95, from, 17, votes, , Print, , Pin, , Rate, Course:, Baked Goods, Cake, Cuisine:, English, Keyword:, ginger cake, gingerbread, sticky ginger cake, vegan sticky gingerbread, Prep Time:, 20, minutes, , minutes, Cook Time:, 1, hour, , hour, Cooling Time:, 20, minutes, , minutes, Total Time:, 1, hour, , hour, , 40, minutes, , minutes, Servings:, 16, , (1 large cake), Calories:, 262, kcal, Author:, Chris Mosler | Thinly Spread, 225, , g, , vegan butter, 225, , g, , dark muscovado sugar, 225, , g, , black treacle, 235, , ml, , soya milk, 1, , tbsp, , cider vinegar, 340, , g, , plain flour, 2, , heaped tsp, , ground ginger, 1, , tsp, , ground mixed spice, 1, , tsp, , ground cinnamon, 2, , tsp, , bicarbonate of soda, pinch, , salt, UK Measurements, -, US Measurements, Cook Mode, Prevent your screen from going dark, Pour the mixture into your prepared tin and bake in the preheated oven for about an hour. The cake is cooked when a skewer inserted into the centre comes out clean., Leave to cool in the tin, turn out, cut into squares and store in an airtight container., Notes, Nutrition, Calories:, 262, kcal, |, Carbohydrates:, 40, g, |, Protein:, 3, g, |, Fat:, 10, g, |, Saturated Fat:, 2, g, |, Sodium:, 260, mg, |, Potassium:, 277, mg, |, Fiber:, 1, g, |, Sugar:, 23, g, |, Vitamin A:, 595, IU, |, Vitamin C:, 1, mg, |, Calcium:, 108, mg, |, Iron:, 3, mg, , , , Like this recipe?, Follow, @ThinlySpread, or tag, #thinlyspread, !, , , , , , 34 Comments, , Zoe, , on October 16, 2018 at 12:23 pm, This recipe is fantastic! SO simple and you’re right – they look so fluffy and delicious. Thanks for sharing Chris 🙂, , Reply, , Jodie, , on January 29, 2019 at 1:13 pm, I made this yesterday and it is the best vegan cake I have made so far. Everything else has come out quite dry or just not the cake texture I’m used to but this is fabulous. I don’t think anyone would guess there are no eggs or dairy in it., , Reply, , Chris Mosler, , on January 29, 2019 at 2:15 pm, That’s wonderful to hear Jodie, I’m delighted it worked so well for you! I think it’s my favourite quick cake, so simple and reliable 🙂, , Reply, , Phee, , on January 13, 2021 at 6:47 pm, Can I freeze this or use a round cake tin? Thank you!, , Reply, , Chris Mosler, , on January 14, 2021 at 9:43 am, You can definitely use a round cake tin and it will freeze but will lose some of its characteristic stickiness in the process, it is much better fresh! I hope that helps 🙂, , Reply, , Asha, , on July 10, 2023 at 5:48 pm, Nice cake but when I followed the recipe I found it had a bicarb flavour, the treacle was a bit overwhelming, and it wasn’t nearly gingery enough. I made it again with 1 tsp bicarb, 2 tbs ginger, 1tbs cinnamon, 1tbs allspice, and I substited half the treacle with golden syrup. It came out great and colleagues were very happy! Enough spices this, way, but could handle more., , Reply, , Angie jackson, , on October 20, 2019 at 9:33 am, I made it and put vegan lemon butter frosting in top….it went perfect and tasted absolutely delicious, , Reply, , Chris Mosler, , on October 20, 2019 at 11:19 am, Fabulous idea Angie, lemon and ginger are a match made in heaven 🙂 I’m so glad you enjoyed it 🙂 Chris (Thinly Spread) x, , Reply, , Wuby, , on March 19, 2019 at 7:27 pm, Lovely cake! I made two smaller cakes in loaf tins, we ate one as soon as it had cooled and left the other in an airtight tin for two days…….even stickier and just as lush!, , Reply, , Chris Mosler, , on March 22, 2019 at 10:25 am, Fabulous, I’m so pleased! I do actually wonder if this cake might be slightly addictive! 🙂, , Reply, , Dee Ellis, , on September 1, 2019 at 6:17 pm, Love the flavour and the stickiness that develops, however my cake always seems slightly sunken in the middle and I’ve made it a few times now.  Any idea what I’m doing wrong?, , Reply, , Chris Mosler, , on September 5, 2019 at 2:16 pm, Hi Dee, I’m so glad you’re enjoying the cake! A sunken cake could be one of three things – either the oven door has been opened before the cake is cooked through, it could be that the cake sat for a bit before going in or it could be that you have a bit too much raising agent in the mix. I would trouble shoot the first two and, if they don’t work, I’d reduce the bicarbonate of soda by maybe a 1/4 teaspoon and see if that helps. I would say, however, that if it has sunk a bit but it still tastes great I’d probably just stick with it! Hope that helps 🙂 x, , Reply, , Hazel, , on September 21, 2019 at 10:12 am, This sounds delicious but do you think it would work with gluten free flour please?, 🙂, , Reply, , Chris Mosler, , on September 22, 2019 at 9:46 am, Hi Hazel, I haven’t tried it with gluten free flour myself so I can’t vouch for it working. However, it’s got to be worth a go, this cake is delicious! If you’re baking with gluten free flour make sure it is one which contains Xanthan Gum. I think I’d add a bit more milk to the mixture and the cake might need a few extra minutes in the oven. Thanks for asking this question – I have a coeliac friend who would love this cake so I’m going to give it a go gluten free myself – if you try it before I do, please let me know how you get on! Chris x, , Reply, , Tony, , on December 3, 2019 at 7:06 pm Instructions: Preheat the oven to 150C/300F., Grease and line a 23cm square cake tin with baking parchment., Melt the butter, treacle and sugar in a saucepan over gentle heat and leave to cool., Stir the vinegar into the soya milk and leave to stand for 5 minutes until curdled., Sift the flour, bicarbonate of soda, salt and spices into a large bowl., my GF prefers not to eat eggs so I bake to suit her – mostly 🙂, , Reply, , Pixie, , on December 9, 2019 at 8:24 am, Never left a rating on a recipe before… but this was too delicious!! I’m going to have to break my ‘no cakes during the week’ rule to finish it off., , Reply, , Chris Mosler, , on December 9, 2019 at 9:29 am, How lovely of you! You made me giggle too! Thanks Pixie! x, , Reply, , E, , on January 12, 2020 at 1:20 pm, This was delicious!, My tin is a bit smaller than the one stated so made 3/4 of the mixture instead. However, I only added half a cup of sugar, rather than 3/4 cup. I used a mix of golden caster sugar and dark soft brown because that was all I had. I also have a fan oven so it was done in 45 minutes. It was perfect!! Will definitely make again 🙂 🙂 Thank you!, , Reply, , Chris Mosler, , on January 12, 2020 at 7:43 pm, Fantastic! I’m so glad you liked it and thank you for popping by to share your adaptations and adjustments 🙂 x, , Reply, , Frances, , on June 25, 2020 at 9:55 pm, Very glad to find this recipe., , Reply, , Chris Mosler, , on June 29, 2020 at 12:15 pm, Thank you 🙂, , Reply, , Lorraine, , on November 2, 2020 at 4:38 pm, Beautiful recipe,so tasty!!, , Reply, , Chris Mosler, , on November 3, 2020 at 10:22 am, Excellent news!, , Reply, , Gilly, , on November 28, 2020 at 4:38 pm, This is lush., No plain flour so used SRF., Didn’t have enough brown sugar so just used what was in the packet., Used cows milk., I’m not vegan but don’t eat eggs., Put lemon icing on the top. Perfect!, , Reply, , Chris Mosler, , on November 29, 2020 at 3:34 pm, Excellent! Thanks for dropping by to let me know! x, , Reply, , Jenny A, , on December 6, 2020 at 6:54 pm, Amazing!! Perfect for a cold Sunday evening. My only problem was that my cake tin was a bit small and the middle sank slightly., , Reply, , Abigail @ OhMyVegan, , on March 29, 2021 at 2:35 am, Such a delicious and rich cake recipe!, It’s so decadent and sweet. Perfect for when you are having some serious sugar cravings., Goes perfectly with a cup of tea as well., , Reply, , Chris Mosler, , on March 30, 2021 at 9:17 am, Thank you! It certainly does go very well indeed with a cup of tea!, , Reply, , Lisa, , on June 14, 2022 at 1:50 pm, I don’t usually leave reviews on internet recipes because they’re usually ok but nothing you could say were exceptional., I had to come back and leave a review on this one  because it’s not just ok, it’s amazing!, We’ve used an old family recipe for decades for sticky gingerbread but this one knocks the spots off it and it’ll be the only one used in our house from now on., Thank you so much for sharing., , Reply, , Chris Mosler, , on June 27, 2022 at 10:41 am, Oh this has made me smile widely, thank you so much for taking the time to come back and comment!, , Reply, , Denise, , on December 27, 2022 at 6:28 pm, Easy recipe to follow and great sticky traditional ginger cake.  Went down a storm on Christmas Day and I was able to make it a few days ahead., , Reply, , Denise, , on January 9, 2023 at 4:54 pm, This recipe is delicious and so easy. I made it two days before Christmas and those who tried it Christmas Day couldn’t believe it was vegan.  Two weeks later my son-in-law asked if there was any left.  I’d kept it in an airtight container and it was even more sticky and delicious so to his pleasure he got the last pieces.  My husband is now hankering after me baking it again.  I can see that this will be a regular bake for our family.  Thank you for sharing your recipe., Have you got a recipe for vegan parkin?  This used to be one of my favourite cakes before I became egg intolerant., , Reply, , Chris Mosler, , on January 10, 2023 at 10:16 am, Hi Denise, how fabulous, thank you! It is defintely our favourite family cake – I made it again last week for my youngest’s 17th birthday (surrounded by ninjabread men – hilarious!). It just hits the right spot! I do have a parkin recipe, I will have to make and photograph it and then I’ll pop it up for you! It probably won’t be for a while as I have a long list of recipes I’m  working through – are you on my email list? I am about to relaunch my newsletter and I pop my latest recipes on there., , Reply, , Denise, , on January 16, 2023 at 12:10 pm, Thanks Chris.  I will be watching for the Parkin and other recipes you share and have just subscribed to your newsletter., , Reply, Submit a Comment, , Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , Website, , , , Δ, This site uses Akismet to reduce spam., Learn how your comment data is processed., Connect With Me, , , , , , , , , , , , , , , , , Hello and welcome to Thinly Spread!, I’m Chris, mum to 4, professional blogger and freelance food and lifestyle writer., I’m on a mission to make vegan cooking easy and delicious!, Read More…, , Contact Me, chris@thinlyspread.co.uk, Copyright Notice, All content in this website is copyright © 2010-2025, Privacy, Privacy Policy, Follow Me, , , , , , , , , , , , , , , , , Designed by, Elegant Themes, | Powered by, WordPress, , Pin It on Pinterest, , , , , , , , , , , , , , , , , , , , , , , ,",
        "Vegan Apple Pie Bread": "Ingredients: , , Vegan Apple Pie Bread will be a new fall favorite for you! Get a nice bag of apples and bake a bunch of loaves. You will want more than one, I promise. If you give some to other people, they may want to be your friend. Or you can bribe them to leave you alone, whatever your preference is., , , , , , Vegan Apple Pie Bread, , , , , Print Recipe, , , , , Course, Dessert, , Prep Time, 10, minutes, , mins, Cook Time, 45, minutes, , mins, Total Time, 55, minutes, , mins, , Servings, 1, , Loaf, Author, Lauren Hartmann, , , 1/2, , C., , Vegan butter, room temperature I used Earth Balance, 1/2, , C., , Maple syrup, 1/2, , C., , Apple sauce, 1, , tsp., , Vanilla, 2, , C., , All purpose flour, 2, , tsp., , Baking powder, 1, , tsp., , Baking soda, 1, , tsp., , Salt, 2, , tsp., , Apple pie spice, 1/4, , C., , Almond milk or non-dairy milk of choice, 2, , Large, , Apples, chopped I used Granny Smith, , , , Reply, , , , , , , , Claudia Crase, , , October 13, 2019 at 2:35 pm, , , , In the cookbook Happy Food (a vegan cookbook), the author includes a mix of various flours for gluten-free baking. I’ve used it and been quite pleased., , , , , , , , , Meg, , , October 31, 2019 at 1:09 am, , , , Thank you, everyone, for your very valuable comments & the name of that cookbook!!! 🙂, , , , , , , , , Carolyn, , , January 29, 2021 at 5:10 pm, , , , thank you, lovelies! You’ve already asked the questions and received the answers I needed to know. 🙂, , , , , , , , , , , cara hoppis, , , October 27, 2019 at 2:12 pm, , , , cassava flour is very starchy; it is best mixed with another gluten-free flour such as brown rice, buckwheat, or oat., , , Reply, , , , , , , , Kim, , , November 1, 2019 at 7:17 pm, , , , Wow! Delicious! I used 1/4c canned coconut milk as my dairy free alternative. This bread was so light and moist, almost dissolved like cotton candy. Yum!, , , Reply, , , , , , , , Amber Wild, , , March 20, 2020 at 8:51 pm, , , , When I bake with cassava I find it works really well if I do my own all-purpose blend of 1C cassava, 1C quinoa flour and 1-2tbsp coconut flour 👍🏻 Sometimes you need to add a little more liquid with this mix as both cassava and coconut are basically pure fiber and soak up a lot of moisture. The quinoa adds protein too so it makes baked goods a little more nutritionally balanced if eating for breakfast or a snack 🙌🏻 Happy baking!, , , Reply, , , , , , , , , , Stephanie Collins, , , October 2, 2021 at 11:36 am, , , , Bob’s Red Mill 1-1 gluten free flour is PERFECT for baking. No added xanthan gum needed. I’m baking this bread tomorrow! Yay, Apples, Spices, Fall!, , , Reply, , , , , , , , , , Mindy Grusin, , , February 8, 2021 at 12:34 pm, , , , I have the same question!, , , Reply, , , , , , , , Florencia, , , June 18, 2022 at 8:32 am, , , , Can I use coconut oil ir vegetables oil instead of the butter?, , , Reply, , , , , , , , , , , , Abby, , , May 18, 2018 at 12:28 am, , , , Can you use coconut oil instead of butter?, , , Reply, , , , , , , , Lauren Hartmann, , , May 18, 2018 at 3:08 pm, , , , Yes, I think that would work fine!, , , Reply, , , , , , , , Puja, , , June 26, 2021 at 1:51 am, , , , Can I use regular butter instead of vegan?, , , Reply, , , , , , , , , , Julie, , , May 23, 2018 at 10:13 pm, , , , can I use almond flour instead of regular flour?, , , Reply, , , , , , , , Lauren Hartmann, , , May 23, 2018 at 10:33 pm, , , , You should be able to, you may want to use some xanthan gum and/or more apple sauce for binding. I hope that helps!, , , Reply, , , , , , , , , , Kaitlin, , , May 30, 2018 at 2:20 am, , , , What kind apples did you use?!, Thank you!, , , Reply, , , , , , , , Lauren Hartmann, , , May 30, 2018 at 1:52 pm, , , , I used Granny Smith, but any kind would do. If you want something sweeter, that would work. I just like the tangy green ones for desserts., , , Reply, , , , , , , , Matti, , , October 4, 2019 at 12:23 pm, , , , Did you sprinkle extra spices on top, how did you finish it? The combination of maple syrup and the dark speckles on top make it look really delicious!, , , Reply, , , , , , , , Lauren Hartmann, , , October 6, 2019 at 12:40 pm, , , , I do usually sprinkle a little on top so it looks pretty:), , , Reply, , , , , , , , , , , , Ashley Odom, , , May 31, 2018 at 1:00 am, , , , I baked this today, and it was delish! It was very moist, and not too sweet, which was nice. The whole family loved it too. They suggested I add pecans next time. Thank you for sharing such a great recipe!, , , Reply, , , , , , , , Lauren Hartmann, , , May 31, 2018 at 5:33 pm, , , , That is so wonderful to hear! I’m glad you liked it!, , , Reply, , , , , , , , , , N L, , , September 9, 2018 at 3:08 pm, , , , Sounds delicious! What spices are in Apple pie spice?, , , Reply, , , , , , , , Lauren Hartmann, , , September 9, 2018 at 10:14 pm, , , , Usually cinnamon, nutmeg, allspice, and ginger!, , , Reply, , , , , , , , Kelly, , , January 1, 2020 at 4:56 pm, , , , I always make my own Apple pie spice. Easy to to do and you dont have to buy another spice., , , Reply, , , , , , , , , , Beth Kim, , , March 22, 2020 at 8:58 pm, , , , so you could also just use that., , , Reply, , , , , , , , , , Sarah, , , September 15, 2018 at 7:26 am, , , , I’m baking this right now, and boy does it smell great- think it’s going to be a keeper and definitely a family favorite! Thank you for the recipe 😝, , , Reply, , , , , , , , trena, , , September 17, 2018 at 12:09 am, , , , 5 minutes to go and then another few more minutes to cool down and then finally this amazing smelling loaf 🙂 will be in my very happy belly 🙂 thank you for all your amazing recipes!!, , , Reply, , , , , , , , ktown61215, , , September 25, 2018 at 7:44 am, , , , Is the apple sauce used in place of eggs?? If so would an egg replacer work??, , , Reply, , , , , , , , Lauren Hartmann, , , September 25, 2018 at 3:34 pm, , , , Yes, the applesauce is used as an egg replacer. So, you could use an egg replacer, it just won’t have as much of an apple flavor, but would still taste great!, , , Reply, , , , , , , , , , Kathleen @ Produce On Parade, , , September 26, 2018 at 11:48 pm, , , , I made this last week and it was awesome! My mom and husband loved it!, , , Reply, , , , , , , , Amanda, , , October 9, 2018 at 1:20 pm, , , , Can this be out in freezer after baked?, , , Reply, , , , , , , , Lauren Hartmann, , , October 10, 2018 at 1:13 pm, , , , Yes, you should be able to freeze this bread after baking!, , , Reply, , , , , , , , , , Kimber, , , October 17, 2018 at 4:12 pm, , , , This was sooo delicious! I had an issue after the recommended baking time & temp, it was still gooey in the center. I used a metal loaf pan. Any ideas or suggestions? Thank you 😊, , , Reply, , , , , , , , Lauren Hartmann, , , October 17, 2018 at 10:31 pm, , , , I’m glad you liked it! Your oven may just run a little lower than mine. I would just recommend making sure you bake it until a toothpick comes out of the center clean. You may just have to bake it a bit longer!:), , , Reply, , , , , , , , , , Radhika, , , October 18, 2018 at 12:34 pm, , , , How do you make apple sauce? Is it just puréed apples? I’ve not seen it here in the UK x, , , Reply, , , , , , , , Lauren Hartmann, , , October 18, 2018 at 1:57 pm, , , , I’m sorry, it is really common in the U.S, I didn’t realize it wasn’t available in the UK. It is cooked apples that are then pureed. The apple sauce is used as an egg replacer, and for flavor. However,if you don’t want to have to make apple sauce, you could use a different egg replacer, it just won’t have as much apple flavor. A mashed banana would work, or a flax egg. I hope that helps!, , , Reply, , , , , , , , Emma, , , March 1, 2020 at 4:37 pm, , , , I know this comment is ancient now, but I’m just making this for the first time, and if anyone else from the UK is looking for applesauce you can get it here. Confusingly it’s usually in the savoury sauces section of supermarkets as in the UK people traditionally have apple sauce with roast pork (ew). You’ll find it by the redcurrant jelly and mustard etc. Usually called Bramley apple sauce., , , Reply, , , , , , , , Luisa, , , October 26, 2020 at 7:52 pm, , , , You should be able to find apple sauce in big shops next to condiments like mint sauce in the UK., , , Reply, , , , , , , , , , Adelenne, , , October 29, 2018 at 12:12 pm, , , , I love this. I used coconut oil instead of vegan butter and the smell is awesome. Definitely making it again., , , Reply, , , , , , , , Debbie, , , November 4, 2018 at 5:37 pm, , , , Did you use a 9×5 pan or 8×4?, , , Reply, , , , , , , , Lauren Hartmann, , , November 4, 2018 at 8:55 pm, , , , I use a 9×5 pan., , , Reply, , , , , , , , Diana, , , January 30, 2021 at 10:56 pm, , , , Thanks. That’s the info I was looking for in the comments. Not just for thanksgiving but I imagine making this all winter long!, , , Reply, , , , , , , , , , , , Joanne, , , November 9, 2018 at 1:18 pm, , , , Can this be made with oat flour?, , , Reply, , , , , , , , Lauren Hartmann, , , November 9, 2018 at 4:43 pm, , , , I have not tested that myself, but I have had a few people tell me they used oat flour and it worked great! So, I think oat flour works!, , , Reply, , , , , , , , , , Linda York, , , November 9, 2018 at 6:06 pm, , , , Made this yesterday. It will be gone by tonight. DELICIOUS!! Everybody needs this bread in their life!! Thank you so much for this recipe.  🙂, , , Reply, , , , , , , , Emily Fletcher Davis, , , November 12, 2018 at 2:44 pm, , , , Ok, i just made this and had high hopes but  it came out very mealy/mushy.  I used spelt flour because that’s all I had.  Also I used  Myoko’s cultured vegan butter.  I really want this tecipe to work.  Any advice on what I might have done wrong?, , , Reply, , , , , , , , Lauren Hartmann, , , November 12, 2018 at 9:09 pm, , , , So, I wouldn’t recommend replacing all purpose flour with spelt flour using a 1:1 ratio. I have not tried using spelt flour in this recipe, but I have done some research for ways to use it, and nothing I have seen replaces more than half of all purpose flour in a recipe. I think it is best with a blend. I also think for the best outcome adding xanthan gum is a good idea. Spelt flour doesn’t have the same structure as all purpose flour and can make things very mushy, so I also always reduce the amount of liquid in a recipe. Have you used just spelt flour to replace all purpose flour with success? Anyways, I recommend using a gluten free baking blend and some xanthan gum if you are looking for a gluten free alternative. I hope this was helpful and sorry it was so long!, , , Reply, , , , , , , , , , Courtney R, , , January 7, 2019 at 5:51 pm, , , , I just made this bread and not only was it delicious but it was very easy!! It has been husband approved by a fairly picky eater. And the fact that it is oil free AND refined sugar free…awesome! Thanks for yet another great recipe! Oh and just a note for others trying this..I baked it for 55 minutes., , , Reply, , , , , , , , Barbara Gude-Realtor, , , October 8, 2019 at 11:08 pm, , , , Yes I love the no oil and refined sugar free as well., , , Reply, , , , , , , , Cori, , , December 16, 2019 at 2:03 am, , , , There is 1/2 cup vegan butter in the recipe. What is your vegan butter made from if not oil?, , , Reply, , , , , , , , Courtney R, , , January 23, 2023 at 5:05 pm, , , , Okay that’s true! Haha I guess I didn’t think of it like that!, , , Reply, , , , , , , , , , , , Jessica, , , October 11, 2020 at 3:27 pm, , , , Just made this and it’s delicious! And so easy to make. My toddler had a blast helping. One question – could this be done with part or all whole wheat flour?, , , Reply, , , , , , , , Julie Grace, , , October 15, 2020 at 4:29 pm, , , , Haven’t tested it yet but we’d recommend half and half., , , Reply, , , , , , , , DTurndr, , , December 14, 2021 at 11:19 am, , , , I made this for Thanksgiving 2021 and it’s was DELICIOUS!  I think I took it out to soon though because even after it cooled, it was so moist that it was falling apart….even though the toothpick came out clean. QUESTION though: how did you get it to look crusted and kinda gooey on the top? Did you add maple syrup after dinner baking and use the broil?, , , Reply, , , , , , , , DTurnrr, , , December 14, 2021 at 11:21 am, , , , *some* not dinner, , , Reply, , , , , , , , , , , , , , Valerie, , , January 23, 2019 at 2:52 pm, , , , Made this last night and I was extremely impressed. The natural sweetness of the apples more than made up for no sugar. I used agave /maple syrup and bananas (since I didn’t have enough apples to make applesauce) and it still had an amazing apple flavor. My husband couldn’t believe there was no oil or sugar and requested another one made with honey. Guess I’m off to the store for more apples!, , , Reply, , , , , , , , Bob, , , February 21, 2019 at 11:56 pm, , , , Maple syrup? Good, Applesauce? Good, No stevia? AWESOME!!!, Thank you! It looks like a fantastic recipe. I’m looking forward to making it once I’m back on my feet!!, , , Reply, , , , , , , , Lindsay, , , July 26, 2021 at 4:40 pm, , , , This gave me Joey vibes. lol, , Meat? Good!, Jam? Good!, Custard? Goooood!, , , Reply, , , , , , , , Courtney R, , , September 28, 2022 at 9:06 pm, , , , 😂, , , Reply, , , , , , , , , , , , Sharon Martally, , , February 22, 2019 at 12:51 am, , , , Did you use unsweetened applesauce or sweetened?, , , Reply, , , , , , , , Lauren Hartmann, , , February 22, 2019 at 2:55 pm, , , , I usually use unsweetened. However, if you want it a bit sweeter, using sweetened applesauce is fine too!, , , Reply, , , , , , , , Courtney R, , , February 22, 2019 at 3:16 pm, , , , I made my own from scratch. Just blended apples in my Vitamix. No sweetener. Turned out great!, , , Reply, , , , , , , , , , Di@Bibbyskitchen, , , February 28, 2019 at 2:39 pm, , , , It looks amazing. I love the chunky bits of apple, too. I’m gong to be trying this loaf on the weekend. Perfect for lazy Sunday brunching., , , Reply, , , , , , , , Erin, , , March 1, 2019 at 4:11 pm, , , , This bread is amazing! I added 1 tsp of maple extract and it’s moist and comforting! Thank you so much for the recipe😍, , , Reply, , , , , , , , Heather, , , April 2, 2019 at 12:51 am, , , , Could I use crisco or vegetable oil in place of the vegan butter? It’s hard to find vegan butter in sticks where I live., , , Reply, , , , , , , , Lauren Hartmann, , , April 2, 2019 at 9:09 pm, , , , I think any vegetable oil would work. I haven’t tested it, but I don’t think that would be a problem., , , Reply, , , , , , , , , , Denice, , , April 21, 2019 at 2:21 am, , , , Anyone know how I can convert the oven time to make these into muffins?, , , Reply, , , , , , , , Evelyn Mae Raymond, , , August 3, 2019 at 5:49 pm, , , , Just reduce the cooking time to half, check the muffins to see if they are dine, and give more time or take em out.  Super easy.  Follow baking time for a similar muffin recipe., , , Reply, , , , , , , , , , Cathy, , , April 26, 2019 at 3:49 pm, , , , Yum looks delish….my diet is oil free would I be able add more applesauce in place of oils?, , Thanks!!, , , Reply, , , , , , , , Lauren Hartmann, , , April 27, 2019 at 8:17 pm, , , , I haven’t tried an oil free version, but I do think replacing the oil with more applesauce would probably work out!, , , Reply, , , , , , , , Edyta, , , November 9, 2019 at 7:02 pm, , , , Hey Cathy did the oil free extra applesauce work out ? I would like to make this but don’t want to use the oil 😋your feedback would help me out”, , , Reply, , , , , , , , , , Ruth, , , May 13, 2019 at 10:22 pm, , , , Hi Lauren,, , I love your page…i tried the pancakes…they are delicious…i love them. I will try this apple pie too. I am sure it tastes great., Thank you for answering all the questions. It is a great help., , Thank you again for all these amazing dishes!!!, A big hug!!!!, , Ruth, , , Reply, , , , , , , , Suzanne, , , June 21, 2019 at 8:13 pm, , , , This looks so good! Do you use this dough for any other recipes?, , , Reply, , , , , , , , Lauren Hartmann, , , June 21, 2019 at 10:18 pm, , , , I like to use the base recipe for all kinds of sweet breads. Banana, cranberry orange in the fall, blueberry, chocolate chip, it works with really anything you want!, , , Reply, , , , , , , , , , Vanessa, , , June 21, 2019 at 8:15 pm, , , , Thanks for sharing! Does it keep it long?, , , Reply, , , , , , , , Lauren Hartmann, , , June 21, 2019 at 10:17 pm, , , , It keeps pretty well in the fridge for about a week or so. I just slice what I want and toast it to freshen it up!, , , Reply, , , , , , , , , , Pamela Fawcett, , , August 11, 2019 at 10:00 am, , , , This is so very delicious. I will make it, often. Thank You, , , Reply, , , , , , , , Maria, , , September 3, 2019 at 2:48 am, , , , I made the apple pie bread recipe and it turned out pretty well.  So easy to make!  It was lacking in flavor a bit.  Perhaps I need to add more of the apple pie spice or use more flavorful apples.  The bread was moist.  I also added some walnuts which improved the flavor., , , Reply, , , , , , , , Shera Miner, , , September 6, 2019 at 7:51 pm, , , , Would whole wheat flour work?, , , Reply, , , , , , , , Lauren Hartmann, , , September 8, 2019 at 12:44 pm, , , , I haven’t tested it with whole wheat flour, but yes, I think it would work out fine!, , , Reply, , , , , , , , Rhi, , , September 10, 2019 at 2:41 am, , , , Wow, this is my new favourite fall baking treat! Thanks for the awesome recipe 🙂, I made them as 12 muffins (for easier portability to work) and baked them for 35 min and they came out perfect., I subbed 1/4 cup of the flour for oat flour, and used a combo of vegan butter/coconut oil/applesauce as the 1/2 cup of vegan butter in an attempt to make them slightly healthier.  But yeah, still basically a salad. :p, Can’t wait to make these again. Perfect for a delicious weekend breakfast with coffee on a crisp fall morning. Plus it made the house smell SO good, better than a fall candle!, , , Reply, , , , , , , , , , , , Linda H, , , October 10, 2019 at 2:18 pm, , , , Absolutely DELICIOUS! I didn’t have a bread pan, so I made 12 regular-sized muffins (filled almost to the rim) and had enough mixture to make 6 additional regular-sized muffins with pecans (for mom) — at 350F for 30 minutes! The most time-consuming part of the prep for me was chopping up my two Granny Smiths to smaller “cubes” in an attempt to “hide” them from my 7-year old, lol, but other than that, it was super easy, and my family loved them! I will definitely be making these on a regular basis!! THANK YOU!, , , Reply, , , , , , , , Angela Campbell, , , October 12, 2019 at 6:45 pm, , , , What does the “C” mean as a measurement in the recipe?, , , Reply, , , , , , , , Lauren Hartmann, , , October 13, 2019 at 11:31 am, , , , C stands for Cup, , , Reply, , , , , , , , , , Christine Baker, , , October 17, 2019 at 8:31 am, , , , Hi, what size tin did you use ?, , , Reply, , , , , , , , Lauren Hartmann, , , October 17, 2019 at 4:46 pm, , , , I use a standard loaf pan, which is 9 x 5., , , Reply, , , , , , , , , , JoAnn, , , October 20, 2019 at 4:07 pm, , , , I made this for my daughters friends who were over for dinner and served them this for dessert (only my daughter is vegan). Everyone went crazy for this bread. This is a bunch of 16 year old who’s diet is like kid food. Well a couple asked for the recipe. She is a picky eater. Needless to say I’ve made this several times and it’s so easy and fast. Love your recipes. Keep up the good work., , , Reply, , , , , , , , Jess, , , October 26, 2019 at 11:39 pm, , , , Do you an approximate measure of the weight or volume of the chopped apples used? Thank you!, , , Reply, , , , , , , , Barbara Rozenburgh, , , October 28, 2019 at 1:05 pm, , , , Delicious 😋 would pears work too?, Thankyou for all of your amazing recipes Lauren 💕, , , Reply, , , , , , , , Lauren Hartmann, , , October 28, 2019 at 3:18 pm, , , , Yes! I think pears would work great!, , , Reply, , , , , , , , , , Brooke Salas, , , November 6, 2019 at 8:45 pm, , , , Oh my word, BEST apple bread I have ever tasted! I have no idea how I’m going to not eat this whole loaf in a day. Haha. Definitely making more for the holidays!, , , Reply, , , , , , , , Danielle, , , November 16, 2019 at 6:09 pm, , , , Can I make this without a mixer?, , , Reply, , , , , , , , Lauren Hartmann, , , November 17, 2019 at 1:50 pm, , , , I actually don’t use a mixer to make this a lot! It is super simple to just stir together in a large mixing bowl. I just do it the same way the recipe says, but mix by hand., , , Reply, , , , , , , , , , Kirsten Ness, , , November 25, 2019 at 12:53 am, , , , Hi Lauren. This recipe looks delicious and I can’t wait to try it! May I ask which brand of apple pie spice you use? Thanks!, , , Reply, , , , , , , , Lauren Hartmann, , , December 2, 2019 at 3:04 pm, , , , I usually use McCormick!, , , Reply, , , , , , , , , , Kirsten Ness, , , December 2, 2019 at 8:23 pm, , , , Thanks! I couldn’t find Apple Pie spice where I live so I made something up from a recipe online. The bread turned out delicious! I may or may not have eaten the entire loaf in one day!, , , Reply, , , , , , , , Lauren Hartmann, , , December 5, 2019 at 4:04 pm, , , , I’m glad you found something that worked, and I’m so glad you enjoyed!!:), , , Reply, , , , , , , , , , Katrina, , , December 23, 2019 at 3:58 am, , , , I made this with gluten free oat flour and it is amazing!!, , , Reply, , , , , , , , Mark F, , , January 25, 2020 at 8:26 pm, , , , Just oat flour?, , , Reply, , , , , , , , , , Tara O'Brien, , , December 23, 2019 at 6:24 pm, , , , This looks amazing! Thank you for sharing it. Did you peel the apples?, , , Reply, , , , , , , , Lauren Hartmann, , , December 27, 2019 at 4:14 pm, , , , I don’t peel the apples because I’m lazy 🙂 But you certainly can if you prefer, but it turns out delicious with the peels left on!, , , Reply, , , , , , , , , , Shawna, , , December 25, 2019 at 3:15 pm, , , , It was a huge hit with friends and family! Had a slice served warm with maple syrup and it was better than fabulous. I’m thinking I’ll add some walnuts next time!! Thank you for sharing the recipe with us., , , Reply, , , , , , , , Shawn Radford, , , January 4, 2020 at 4:53 pm, , , , My whole family loved this., I added chopped pecans and it was Delish!!!, , , Reply, , , , , , , , Sarah, , , March 2, 2020 at 3:10 am, , , , I’d make this again just for the smell wafting through my place while it baked! Absolutely delicious bread! I added some walnuts and made my own apple spice mix. Fantastic recipe! Thank you!, , , Reply, , , , , , , , Lee, , , March 21, 2020 at 5:18 am, , , , Made this bread today.  We love it!, , , Reply, , , , , , , , , , Laurin Thorud, , , March 29, 2020 at 7:58 pm, , , , I made this today and the only differences I made were using coconut oil instead of vegan butter and I used 3 medium apples instead of 2 large. It was a LOT of apples. It was really delicious aside from the fact that it falls apart when you slice it. I am hoping that if I leave it in the fridge tonight it will become firm and not fall apart as easily. Overall, really yummy and super easy!, , , Reply, , , , , , , , Roberta, , , March 16, 2021 at 8:11 am, , , , Hi Laurin, I also used 3 medium apples and had the same issue with it falling apart. And I had to cook, it longer. Going to try again though with less apples because, I agree, it was yummy., , , Reply, , , , , , , , , , Layne, , , April 6, 2020 at 1:44 am, , , , Kid approved! So delicious and comforting!, , , Reply, , , , , , , , Emily, , , May 5, 2020 at 4:59 am, , , , I just made this and legit this is the best thing I’ve ever eaten 🥰, , , Reply, , , , , , , , Aimee B., , , May 8, 2020 at 7:26 pm, , , , This was an incredibly lovely bread. It wasn’t sweet at all, but so light and fluffy! We ate it slathered with peanut butter. Next time, I think I’ll add more apple pie spice, but this is really perfect as is. I baked mine in a mini loaf pan tray. It made 6 loaves, and I baked them for 20 minutes in my toaster oven. Oh, and I peeled and shredded my apples., , , Reply, , , , , , , , Suzanne, , , May 9, 2020 at 6:54 pm, , , , This looks so good! It’s so nice to have a quick, convenient, tasty recipe to throw together in a pinch!, , , Reply, , , , , , , , Mandy, , , May 12, 2020 at 4:15 am, , , , This is a great recipe!  Made it this evening with a few adjustments. I added 1/2 tbsp apple cider vinegar to the almond milk and let it sit for 10 minutes to make a buttermilk before adding to the mixture. I also added a handful of pecan nuts to the batter, and topped with a sprinkle of brown sugar before baking. I had to bake it for almost an hour too. The whole family really enjoyed it and we finished off the whole loaf in one evening! Thank you for such a great recipe!, , , Reply, , , , , , , , Mel, , , May 18, 2020 at 7:27 pm, , , , What can I use instead of the vegan butter?, , , Reply, , , , , , , , Lauren Hartmann, , , June 13, 2020 at 9:53 pm, , , , I like to use coconut oil when I don’t have vegan butter!, , , Reply, , , , , , , , , , Lizzie, , , May 18, 2020 at 11:30 pm, , , , Hi! Love the recipe as I try to stay away from refined sugar. However, I had a problem with how mine turned out. It was quite dense/mushy in the middle when I cut into it. The only difference is that I used regular butter instead of vegan butter. Do you think that could have caused it? I will try the recipe again as it looks amazing…do you think it could have not been cooked through enough? I’m not a very experienced baker so I’m not sure how to troubleshoot this problem. Thank you 🙂, , , Reply, , , , , , , , Lauren Hartmann, , , May 22, 2020 at 1:04 pm, , , , Yup, sounds like it just needed to bake longer! A lot of times ovens run lower than you think. It may just need a bit longer in your oven. I hope that helps!, , , Reply, , , , , , , , , , T, , , May 26, 2020 at 5:51 am, , , , THIS IS AMAZING!! so moist and light not dense at all so addictive just sweet enough!, , My alterations:, coconut oil instead of vegan butter creamed with light brown sugar!, half oat flour half all purpose(sifting them is a must)!!, I added a bit of ACV to the almond milk!!!, I also only used one large apple and added slivered almonds!!!!, , I’m sorry for all the exclamation points!It’s just that good, , , Reply, , , , , , , , Amanda, , , July 12, 2020 at 4:14 pm, , , , This apple bread was so yummy.  I, Substituted creamy peanut butter in place of the vegan butter and a, Mashed banana instead of the apple sauce.  It turned out great, Although I thought it would never bake all the way thru, I ended up baking it for an hour., , , Reply, , , , , , , , Jessie R, , , September 30, 2020 at 1:45 pm, , , , I’m making this for the first time and I’m wondering if you’d recommend agave syrup or our lovely famous US “Pancake syrup” that they sell for 1.29 everywhere. I do not have the real stuff right now! Thanks so much! I love what you do!, , , Reply, , , , , , , , Margie, , , October 10, 2020 at 3:01 am, , , , Can I use regular milk if I do no need to worry about staying vegan? This recipe sounds delicious., , , Reply, , , , , , , , Lauren Hartmann, , , October 11, 2020 at 12:16 pm, , , , Yes! Regular milk should work just fine!, , , Reply, , , , , , , , Julie Grace, , , October 15, 2020 at 4:34 pm, , , , Yes you can!, , , Reply, , , , , , , , , , Margie, , , October 10, 2020 at 3:05 am, , , , I need to fix email address., , Can you use regular milk if you are not concerned about vegan?, , , Reply, , , , , , , , Nani, , , October 12, 2020 at 7:40 pm, , , , This is fantastic! I have fibromyalgia so gluten = inflammation which = pain so I used 2 2/3 cups oat flour in place of all purpose. I only had honey crisp apples which were perfect in this recipe. It’s just sweet enough but not overly sweet. Great for dessert or breakfast. This will be a frequent bake in my kitchen. Thank you, , , Reply, , , , , , , , Flora, , , October 13, 2020 at 6:34 pm, , , , I love using ground oat or flax in combination with Gf flours..makes it healthier and also lighter, as well as acting as a natural binding agent . 🧚🏻💚, , , Reply, , , , , , , , JennyL, , , October 15, 2020 at 3:01 pm, , , , Made as written and LOVED this! I used oatmilk and two huge gala apples. Thank you for introducing me to Apple Pie Spice. Really delicious and easy to do!, , , Reply, , , , , , , , Julie Grace, , , October 15, 2020 at 4:08 pm, , , , Thanks! So glad you enjoyed!, , , Reply, , , , , , , , , , Jamie, , , October 17, 2020 at 12:13 am, , , , Hi! Do you think I can double this recipe and make a Bundt cake??, , , Reply, , , , , , , , Julie Grace, , , November 5, 2020 at 2:44 pm, , , , Yes, we think so!, , , Reply, , , , , , , , , , Alison, , , October 17, 2020 at 3:53 pm, , , , Thanks for this recipe! I made it into muffins and that worked great. I’ve tried so many healthy muffin recipes on my family over the years and they usually don’t like. They all love this! It’s light, just sweet enough and has great flavor. Only change I made was using coconut oil instead of vegan butter and added 1/4 c more maple syrup., , , Reply, , , , , , , , Lucy, , , October 24, 2020 at 1:30 am, , , , Made this last weekend for my husband and I. Turning right around and making another one this weekend because it was so good! I like my slice warmed in the microwave with a little apple butter on top. SO GOOD!!, , , Reply, , , , , , , , Yvonne, , , December 16, 2020 at 8:51 pm, , , , This bread is amazing!  Thank you for sharing these great recipes., , , Reply, , , , , , , , Maya, , , December 21, 2020 at 5:55 pm, , , , Awesome! Thank you, , , Reply, , , , , , , , Lola, , , January 30, 2021 at 1:50 pm, , , , I make this often and it is so so so delicious. Thank you!, , , Reply, , , , , , , , Shirley, , , January 30, 2021 at 7:52 pm, , , , Excellent recipe! I substituted 1/2 cup puréed butter beans for the butter and the loaf was perfect. I may try adding a cinnamon streusel swirl through it next time., , , Reply, , , , , , , , Shirley, , , January 30, 2021 at 7:53 pm, , , , Forgot to mention I also used 2 2/3 cup oat flour and a tsp of xanthum gum., , , Reply, , , , , , , , Ann F Smitt, , , February 3, 2021 at 7:48 am, , , , I made this bread for the first time last week as a gift to my neighbor’s dad. He loved it and so do I. It tastes just like apple pie. Thanks for the great recipes., , , Reply, , , , , , , , greg vallot, , , February 3, 2021 at 2:59 pm, , , , This was excellent! One question though. I might have missed it, but should this be stored in the fridge?, , , Reply, , , , , , , , Roberta, , , March 16, 2021 at 8:28 am, , , , Even though mine fell apart, I’m still giving it 5 stars because it’s so easy and really delish., My non-vegan family loved it. Lauren, It would be helpful if you gave an amount in cups or grams/oz for, the apples because my idea of apple size must be different from yours…lol, I’m sure that’s why it fell apart – too much apple. This probably caused additional moisture so, I had to keep putting it back in the oven at 5-10 minute increments. I too am a bit lazy so I partially, peeled the apples with a veggie peeler. Leaving a little skin on makes me feel like I’m making it, more nutritious (Said while wearing my rose-colored glasses). Thanks, Lauren – I’m not a great baker, and this was right up my ‘difficult-level’ alley., , , Reply, , , , , , , , moe, , , June 29, 2021 at 10:09 am, , , , Hi!, I made this over the weekend.  It was very good but I will make some changes.  Next time I will toss the apples in the apple pie mix before adding to batter.  I also skipped the vegan butter and used coconut milk from a can for the fat which I have learned from Vegan8.  It was very tasty. !  I have shared the recipe w/ others.  Love your cookbook!!, , , Reply, , , , , , , , Kathi, , , September 18, 2021 at 3:05 pm, , , , loved it! perfect for autumn!, , , Reply, , , , , , , , Mary, , , September 27, 2021 at 2:19 pm, , , , Looks delicious!, , , Reply, , , , , , , , Roz, , , October 16, 2021 at 8:45 pm, , , , Made this delicious cake with gluten-free flour and only one apple. Finished with slivered almonds and dusting of cinnamon. It’s more cake than bread but sooo delicious. Thankyou 😋, , , Reply, , , , , , , , Anna D, , , October 20, 2021 at 1:15 pm, , , , Has anyone tried this with whole wheat flour ? Does it affect the flavor?, , , Reply, , , , , , , , Lola, , , November 21, 2021 at 5:22 pm, , , , One of my favorites! I make it again and again. I do have to cook it for closer to 55 minutes so it’s not raw, but it’s so damn good!, , , Reply, , , , , , , , Meg, , , November 21, 2021 at 8:53 pm, , , , Did you peel the apples?, , , Reply, , , , , , , , Natasha, , , December 3, 2021 at 6:28 pm, , , , Made this for Thanksgiving. Loved how quickly it came together and wasn’t overly sweet. I did have to bake mine longer but I’m still getting used to baking with this electrical oven.  Will definitely be making again., , , Reply, , , , , , , , Mary, , , December 13, 2021 at 2:42 pm, , , , Can’t wait to try this out. Looks so tasty., , , Reply, , , , , , , , Kelly, , , January 17, 2022 at 10:27 pm, , , , This was delicious. I made it as written (added some chopped walnuts). I did find it salty though, and I only used a half teaspoon of salt. But I dont see any other mentions of this…maybe its just me.  But super yum, another R&W hit., , , Reply, , , , , , , , Blanca, , , September 5, 2022 at 4:02 pm, , , , Looks delicious!, , , Reply, , , , , , , , Blanca, , , September 5, 2022 at 4:03 pm, , , , I love this recipe!, , , Reply, , , , , , , , Liz, , , September 28, 2022 at 9:31 pm, , , , Holy moly good!  This is all my kid has wanted to eat for the last few days. It’s gotten thumbs up from everyone.  I was out of maple, so i used agave. Otherwise followed the recipe! (and add TINY amt of glaze), , , Reply, , , , , , , , nyl, , , October 27, 2022 at 3:17 pm, , , , Any suggestions for high altitude baking? I’m in Flagstaff and we are @ 7000 FT. Baking can be iffy. Thank you., , , Reply, , , , , , , , Kathie Brown, , , November 10, 2022 at 9:21 pm, , , , I don’t have apple pie spice. Is cinnamon okay as a substitute?, , , Reply, , , , , , , , Lynda, , , January 7, 2023 at 11:02 am, , , , This bread was amazing!!! I took it to dinner at my non-vegan family’s house while it was still warm. Half of the bread was gone before dinner! Thanks for sharing!, , , Reply, , , , , , , , Rehoboth, , , February 26, 2023 at 8:57 am, , , , Awesome post, , , Reply, , , , , , , , Alia, , , August 12, 2024 at 7:33 am, , , , Delicious!!! I brought this cake (with 2 others) to a camping trip for breakfast and my friends loved it. The texture is amazing, extremely moist and fluffy. I used some homemade cinnamon apple sauce. Next time I think I will reduce the salt to 1/2 tsp; Thanks a lot!, , , Reply, , , , , , , , Pamela Fawcett, , , January 3, 2025 at 2:45 pm, , , , I would like to make this recipe as muffins. Would I need to make any changes?, , , Reply, , , , , , , , Lauren Hartmann, , , January 5, 2025 at 11:40 am, , , , I think the only change would possibly be the baking time. The bread takes 35-45 minutes, so I would check muffins around 20 minutes and see how they are., , , Reply, , , , , , , , Pamela a Fawcett, , , January 6, 2025 at 10:49 am, , , , Thank You. I just Love this recipe and have made it soooo many times.as the bread. I really love keeping muffins in the freezer, and did not want to try another apple recipe other than this one., , , Reply, , , , , , , , Trackbacks, , , , , , Vegan Thanksgiving Round Up - Rabbit and Wolves, , says:, , , , November 17, 2017 at 3:51 pm, , , , , […] Vegan Apple Pie Bread! Super quick and easy, serve with vegan butter and or maple syrup. So good and feeds a crowd! […], , , Reply, , , , , , , , 19 LOVELY-SMELLING Apple Bread Recipes, , says:, , , , October 11, 2018 at 9:34 pm, , , , , […] (via Rabbit and Wolves) […], , , Reply, , , , , , , , 30 Delicious Vegan Christmas Desserts -, , says:, , , , November 28, 2018 at 10:44 pm, , , , , […] 19. Vegan Apple Pie Bread […], , , Reply, , , , , , , , The Best Vegan 4th Of July Recipes - Rabbit and Wolves, , says:, , , , July 1, 2019 at 7:24 pm, , , , , […] Vegan Apple Pie Bread […], , , Reply, , , , , , , , Collection Of Best Vegan Bread Recipes – Daily Easy Recipes, , says:, , , , November 18, 2019 at 4:48 am, , , , , […] Full recipe here. […], , , Reply, , , , , , , , 24 Delicious Vegan Breakfasts | Clementine County, , says:, , , , March 3, 2020 at 11:31 pm, , , , , […] Vegan Apple Pie Bread  – Rabbit and Wolves […], , , Reply, , , , , , , , 32 Cozy Vegan Apple Dessert Recipes (Dairy-free, Egg-free) | The Green Loot, , says:, , , , June 19, 2020 at 11:14 am, , , , , […] 30. Apple Pie Bread […], , , Reply, , , , , , , , Vegan Recipes For Kids – GetVeganFood.com, , says:, , , , July 21, 2020 at 4:36 am, , , , , […] Vegan Apple Pie Bread can be breakfast, snack or dessert, but toasting it for breakfast and slathering with vegan butter […], , , Reply, , , , , , , , 12 Delicious Apple Recipes for your Apple Orchard Stash - Weightless Chronicles, , says:, , , , October 10, 2020 at 4:03 pm, , , , , […] Vegan Apple Pie Bread […], , , Reply, , , , , , , , Kid-Friendly Snacks that Aren't Full of Sugar - Weightless Chronicles, , says:, , , , October 27, 2020 at 5:57 pm, , , , , […] apples in the form of applesauce or apple butter in muffins, vegan bread, grain-free pancakes, or crackers […], , , Reply, , , , , , , , The Best Vegan Fall Desserts - Rabbit and Wolves, , says:, , , , November 5, 2021 at 5:39 pm, , , , , […] Vegan Apple Pie Bread is so simple it seems impossible for it to be this delicious, but man it is! It’s been a popular recipe for years now! […], , , Reply, , , , , , , , Peanut Butter Chocolate Chunk Vegan Banana Bread - Rabbit and Wolves, , says:, , , , July 20, 2022 at 9:00 am, , , , , […] So, the other day, I just happened to have bananas sitting on the counter, staring me down. Begging to be used. So, I decided to make this peanut butter chocolate chunk vegan banana bread, without much intention of sharing it with you guys, But, after I tasted it, I just had to! I try not to do recipes that have been done, especially ones I have seen repeatedly. However, this banana bread is not like the others. This banana bread is special. It is the most delicious thing you will do with bananas probably this century! If you love sweet bread, try my Vegan Apple Pie Bread! […], , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , , , Δ, , , Primary Sidebar, , , , Hi, I'm Lauren!, Welcome to the magical land of delightful vegan comfort food. I'm the Creatrix of Rabbit & Wolves and I'm thrilled to have you here., , More about me →, , , SUBSCRIBE TO OUR NEWSLETTER, , , Popular Recipes, , Vegan Banana Split Cookies, Incredible Vegan French Onion Garlic Bread, The Best Vegan Gnocchi with Creamy Pesto and Crispy Tofu, The Best Vegan Lasagna Primavera, , , see more, freebies, →, , , © Lauren Hartmann and Rabbit and Wolves, 2021. Unauthorized use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Lauren Hartmann and Rabbit and Wolves with appropriate and specific direction to the original content., , , , Footer, Search, , Footer, , ↑ back to top, , , , About, , Privacy Policy, , , , Newsletter, , Sign Up!, for emails and updates, , , , FAQ, , FAQ, , , , As an Amazon Associate I earn from qualifying purchases., , , Copyright © 2025 Rabbit and Wolves on the, Foodie Pro Theme, , , , , , Instructions: Preheat oven to 350 degrees., In a large mixing bowl, using a hand mixer or stand mixer. Combine the vegan butter and maple syrup., Now add the apple sauce and vanilla. Stir together until combined., Now sift in the flour, baking powder, baking soda, salt and apple pie spice., Begin stirring and adding the almond milk at the same time. Stir scraping down the sides as needed until fully combined., Now fold in the chopped apples., Next, spray a bread pan with non stick spray. Pour the batter into the pan and bake at 350 degrees for 35-45 minutes or until a toothpick comes out clean., Let cool before slicing. Serve plain, with vegan butter and maple syrup or whatever your heart desires. It's good bread, my friend., , Cook Mode, Prevent your screen from going dark, , , , , , , Other popular recipes:, The Best Vegan Gnocchi with Creamy Pesto and Crispy Tofu, by Lauren Hartmann, 0, Incredible Vegan French Onion Garlic Bread, by Lauren Hartmann, 0, Vegan Banana Split Cookies, by Lauren Hartmann, 0, Filed Under:, Breakfast, , , Desserts, , , Easy, , Tagged With:, apple pie bread, , , refined sugar free, , , vegan, , , vegan apple pie bread, , , vegan bread, , , vegan dessert, Reader Interactions, Comments, , , , , , Nancy, , , October 12, 2017 at 7:07 pm, , , , Can it be made with gluten free flour?, , , Reply, , , , , , , , Lauren Hartmann, , , October 12, 2017 at 7:11 pm, , , , Yes, I think gluten free all purpose flour would work! I would just add 1/2 tsp of xanthan gum as well., , , Reply, , , , , , , , Jessica, , , October 25, 2018 at 5:05 pm, , , , I tried with cassava flour and it came out all gooey, not bread like :(. It was my first time using that flour, do I need to add that xanthum gum? What exactly does it do, , , Reply, , , , , , , , Lauren Hartmann, , , October 25, 2018 at 11:34 pm, , , , I have never worked with cassava flour, however, I have never had success with gluten free baking without using xanthan gum. Xanthan gum provides elasticity which is present in gluten. So, you need it help bind and give it good structure!, , , Reply, , , , , , , , Susan, , , February 9, 2019 at 3:23 pm, , , ",
        "Banana Bread": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., Bob’s Red Mill is a trademark of Bob’s Red Mill Natural Foods, Inc., BANANA BREAD, SERVES: 8 (1 slice each) Prep Time: 10 min. Cooking Time: 45 min., CONTAINER EQUIVALENTS (per serving):, ½, 1, ½, 1½, Banana bread is one of those foods that sounds healthy but is often loaded with fat and sugar. Not a problem with our Fixate version!, It’s made with a Fix-approved dose of healthy coconut oil, unrefined coconut sugar, fully gluten-free, AND vegan (optional). What more, could you ask for? Oh yeah, taste! Trust us, you won’t be missing any., 3, large very ripe bananas, mashed, ¼ cup, melted extra-virgin organic, coconut oil, 1, large egg, 1 tsp., pure vanilla extract, 1 cup, gluten-free all-purpose flour, (preferably Bob’s Red Mill®), ½ cup, almond flour, 1 tsp., baking powder, gluten-free, 3 Tbsp., coconut sugar, ½ tsp., sea salt (or Himalayan salt), SPECIAL EQUIPMENT:, Nonstick cooking spray, 1. \t Preheat oven to 350º F., 2.\t \t Lightly coat 4 x 8-inch loaf pan with spray. Set aside., 3. \t Combine bananas, oil, egg, and extract in a medium mixing bowl; mix well., Set aside., 4. \t Combine flour, almond flour, baking powder, sugar, and salt in a large, mixing bowl; mix well., 5. \t Add banana mixture to flour mixture; mix until a smooth batter forms., 6. \t Place batter into prepared loaf pan. Bake for 35 to 45 minutes, or until a, toothpick inserted into the center comes out clean., 7. \t Cool for 5 minutes. Turn loaf out onto cooling rack; let cool completely, before slicing into eight equal slices., RECIPE NOTES:, •\t The riper the bananas, the more natural sweetness they provide., •\t If Bob’s Red Mill is unavailable, select a gluten-free all-purpose flour, with chickpea (garbanzo bean) flour listed as first ingredient., •\t To make this recipe vegan, substitute 1 Tbsp. ground flaxseed and, 2 Tbsp. water for the egg. Mix flaxseed and water before measuring, and set aside until you are ready to use them., •\t Wrap leftover slices individually and freeze for up to 3 months., NUTRITIONAL INFORMATION (per serving): Calories: 223  Total Fat: 12 g  Saturated Fat: 6 g  Cholesterol: 23 mg  Sodium: 196 mg  Carbohydrates: 29 g, Fiber: 3 g  Sugars: 12 g  Protein: 4 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Cloud Bread": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., CLOUD BREAD, O, SERVES: 3 (2 pieces each)   Prep Time: 10 min.   Cooking Time: 30 min., CONTAINER EQUIVALENTS (per serving):, ½, 3, large eggs, 1 dash, cream of tartar, 1 dash, sea salt (or Himalayan salt), (to taste; optional), 1⁄3 cup, reduced-fat (2%) plain, Greek yogurt, SPECIAL EQUIPMENT:, Nonstick cooking spray, Parchment paper, Silpat (optional), 1. \t Heat oven to 300° F., 2. \t Lightly coat large baking sheet with spray, then cover it with parchment, paper. Set aside., 3. \t Separate egg yolks from egg whites. Place egg whites in a medium bowl., Place egg yolks in a separate medium bowl. Set aside., 4. \t Add cream of tartar to egg whites. Beat with a mixer on high until stiff, peaks form, about 4 minutes. Set aside., 5. \t Add salt, if desired, and yogurt to egg yolks. Beat with a mixer on medium, until blended., 6. \t Gently fold ⅓ of egg white mixture into egg yolk mixture. Fold in the, remaining egg white mixture until just incorporated, being careful not to, overmix., 7. \t Using a large spoon, transfer a scoop of egg mixture onto prepared baking, sheet, gently spreading into a thick pancake shape about 3 inches in, diameter. Repeat with remaining batter., 8. \t Bake for 25 to 30 minutes, or until golden brown and exterior is crispy to, the touch. Immediately loosen each cloud bread with a spatula; allow to, cool on the baking sheet for 3 minutes, then transfer to a wire rack to cool, completely., 9. \t Serve immediately, or store in an airtight container., NUTRITIONAL INFORMATION (per serving): Calories: 94  Total Fat: 6 g  Saturated Fat: 2 g   Cholesterol: 184 mg  Sodium: 167 mg  Carbohydrates: 2 g  Fiber: 0 g, Sugars: 2 g   Protein: 9 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Banana Bread": "Ingredients: but it just never came to that perfect, moist bread. The loaf kept ending up dry and soft, but a bit dense and even crumbly at times., , So one day, , I even realized that I could puree bananas and use that as an egg substitute — which works perfectly for, banana, bread. Well, I added just bananas, light, and soft eggless banana bread., , , Flour:, I have made the bread with organic whole wheat flour, but if you want you can make the bread with all-purpose flour or half-half of both the flours. You can also use cake flour or pastry flour., , Sugar:, You can use brown sugar, organic unrefined cane sugar or granulated white sugar — all work well in this recipe., , Oil:, You can use any neutral flavored oil for this recipe. I have made this bread on various occasions with a variety of oils, including coconut oil, safflower oil, sunflower oil, rice bran oil and even olive oil., , Flavorings:, I added cinnamon powder, nutmeg, and vanilla extract to this vegan banana bread, but both the cinnamon and nutmeg are optional., , Sunflower Seeds:, I have added sunflower seeds in the bread to make it more nutritious. However, you can easily skip adding them or add your favorite edible seeds or nuts., , Step-by-Step Guide, , How to make Banana Bread, , Prep Oven and Make Banana Puree, , 1. First preheat your oven to 180 degrees Celsius (350 degrees Fahrenheit) for 20 minutes. Next, while the oven is preheating, slice your ripe or overripe medium to large bananas into a mixing bowl., , Tip:, , I typically use about 4 medium or 2 large bananas for this recipe. In weight, the bananas (with their peels) are 300 grams or 10.5 ounces., , , , 2. Then, add ⅓ to ½ cup sugar, depending on the sweetness of your bananas. Here I have used raw sugar, but feel free to add brown sugar, white sugar, coconut sugar, palm sugar, maple syrup or, jaggery, (Indian unrefined cane sugar)., , With palm sugar, coconut sugar, maple syrup and jaggery the flavors will be different., , , , 3. Next, use a masher or fork to mash the bananas into a smooth consistency. If you prefer, you could also puree the bananas with sugar in a blender., , , , Tip:, , There should be no chunks left in the puree. However, fine threads of bananas in the mixture are fine., Additionally, you can use a blender to mash the bananas if needed., , , , 5. Add ½ cup of oil to the mashed banana mixture. Use a neutral flavored oil, so that the after taste of oil is not felt in the bread. I prefer to use sunflower oil., , On various occasions I have also used coconut oil. But with coconut oil, on refrigeration the texture becomes dense as the coconut oil solidifies. So keep a note of this., , , , 6. Now, stir briskly for about 2 to 3 minutes with a wired whisk or a spatula so that the oil mixes evenly with the banana puree., , , , 7. Finally, stir in the following flavorings to your oil and banana puree:, , ¼ teaspoon cinnamon powder (ground cinnamon), , 2 to 3 pinches or ⅛ teaspoon of grated nutmeg or ground nutmeg powder, , ½ teaspoon vanilla powder or 1 teaspoon vanilla extract, , Tip: That being said, both the cinnamon powder and nutmeg powder are optional., , , , 8. Next, combine the flavoring spices and vanilla with the banana oil mixture. Stir and mix well!, , , , Make Banana Bread Batter, , 9. Sieve 1.5 cups whole wheat flour (about 180 grams), ½ teaspoon baking soda, 1.5 teaspoon baking powder and a pinch of salt directly in the bowl., , , , 10. Make sure the sieved dry mixture sits evenly on top of the wet mixture (pictured below)., , , , 11. After that, , Tip: This folding step is most important — you want the whole bread mixture to be combined into one and mixed evenly, but you also want to avoid stirring because that will deflate the batter., , , , 12. The folded batter should be fully combined but not flat (pictured below) and will have a thick consistency., , Note 1: Ensure that you do not overwork the batter as this will cause gluten strands to form in the batter which result in a doughy texture after baking. The batter should have volume and not look flat or stringy., , Note 2: If in case the batter looks very thick or dry then add about ¼ to ⅓ cup of water or preferred nut milk. Depending on the type of wheat flour, sometimes more liquids will be needed to get the right consistency., , , , 13. This step is optional, but I always like the extra flavors nuts, seeds, , For this recipe, I included about 2 tablespoons of sunflower seeds, but you can also add chopped walnuts, chocolate chips or any dry fruit or nuts of your choice like I have done in the video., , , , 14. Fold the batter gently once again until the sunflower seeds are fully incorporated., , , , Bake Eggless Banana Bread, , 15. Pour the batter into a greased or lined loaf pan (8 x 4 x 2.5 inches) or a round cake pan (8 x 2 inches). Bake at 180 degrees Celsius (350 degrees Fahrenheit) for 30 to 40 minutes or until a toothpick inserted in the bread comes out clean., , Tip:, , The temperature varies from oven to oven, so keep a close eye on your banana bread. Be careful NOT to open the oven until the bread is ¾ done., , When in doubt, use a skewer or toothpick — the benchmark is that a bamboo skewer inserted in the bread should come out clean with no wet or sticky batter clinging on it., , , , 16. Place the loaf pan on a wired rack for the bread to cool. When the bread cools down, then remove the loaf from the pan., , , , 17. Slice and serve your Eggless Banana Bread as is with tea or coffee or as a sweet snack., , The remaining loaf, you can wrap in a cling film or keep in an air-tight box in the fridge for about more than a week. Warm the bread before serving., , , , Expert Tips, , Warm before serving:, If coconut oil is added to the bread, it solidifies when refrigerated, hence the bread also becomes dense when you refrigerate it. So before serving just warm up the bread, and it will have its natural texture back., , Adjust sweetness:, Sweetness of the bread can be adjusted as per your preferences., , Keep it simple:, You can skip adding sunflower seeds., , Flour options:, I have made the banana bread with whole wheat flour, but if you want you can make it with all purpose flour or half-half of both the flours., , Bake time:, The timing varies from oven to oven. Depending on the temperature in your oven and the size of your pan, the bread might take less or more time than what I have listed in this recipe., , FAQs, , Why didn’t you use flax meal as an egg replacer?, , , , How long will does banana bread stay fresh?, , Your banana bread can last 1 to 2 days after baking if properly stored. Simply wrap your loaf in plastic wrap and leave it on the counter. In the fridge it will last for more than a week., , , Why do you recommend folding instead of whisking?, , you preserve more of the volume and will have a fuller banana bread., , , What bananas should I use?, , Banana bread is the perfect recipe to use when your bananas are past eating raw. I generally use overripe bananas — it’s better to mash and make a delicious loaf of banana bread than waste bananas that are too brown to eat!, , , What is the difference between banana bread and banana cake?, , Banana bread comes under the category of sweet breads. Unlike a banana cake that is more sweeter with a light and soft crumb, a banana bread is less sweeter with a slightly denser crumb., , , , More Sweet Breads To Try!, Bread Recipes, Eggless Pumpkin Bread Recipe, Bread Recipes, Chocolate Chip Banana Bread, Bread Recipes, Chocolate Zucchini Bread (Eggless & Vegan), Bread Recipes, Eggless Donut Recipe (Cinnamon & Chocolate), , Please be sure to rate the recipe in the recipe card or leave a comment below if you have made it. For more vegetarian inspirations, , Sign Up, for my emails or follow me on, Instagram, , , Youtube, , , Facebook, , , Pinterest, or, Twitter, ., , , Eggless Banana Bread Recipe (+ Vegan & Whole Wheat), , , By, Dassana Amit, , , An easy Banana Bread that is both eggless and vegan. Made with wholemeal flour this delicious banana bread is light, soft, and perfectly sweet. One of my most popular baking recipes tried successfully by many of our readers., , , 4.90, from, 384, votes, , , , Print, , Pin, , Save, Saved!, , Rate, , , , , Prep Time, 5, minutes, , mins, , Cook Time, 40, minutes, , mins, , Total Time, 45, minutes, , mins, , , , , Cuisine, World, , Course, Breakfast, Brunch, , Diet, Vegan, Vegetarian, , Difficulty Level, Moderate, , , Share, Email, Facebook, Tweet, , , Servings, 12, , banana bread slices, , Units, US Customary, Metric, , , , For making banana puree, ▢, 4, , , bananas, , ripe or overripe, medium sized – 300 grams (with peels), ▢, ½, , cup, , raw sugar, , or brown sugar or granulated white sugar, ▢, ½, , cup, , sunflower oil, , or coconut oil or any neutral flavored oil, ▢, ¼, , teaspoon, , cinnamon powder, , (ground cinnamon) – optional, ▢, 2 to 3, , pinches, , grated nutmeg, , or ⅛ teaspoon ground nutmeg powder – optional, ▢, ½, , teaspoon, , vanilla powder, , or 1 teaspoon vanilla extract, ▢, 1.5, , cups, , whole wheat flour, , – 180 grams, ▢, 1.5, , teaspoon, , baking powder, ▢, ½, , teaspoon, , baking soda, ▢, 1, , pinch, , salt, , – optional, ▢, 1 to 2, , tablespoons, , sunflower seeds, , – optional, , Cook Mode, Prevent your screen from going dark while making the recipe, , This folding step is important as you want the whole bread mixture to be one and mixed evenly., Keep in mind not to overwork the batter as this will result in gluten strands being formed in the batter, that will make for a doughy texture in the bread. The batter should have volume and not look flat or stringy., If the batter looks very thick or dry then add about  ¼ to ⅓ cup of water or preferred nut milk and gently fold again., Lastly add the sunflower seeds and fold once again., Pour the bread mixture into the loaf pan., Baking Banana Bread, Bake at 180 degrees Celsius (350 degrees Fahrenheit) for 30 to 40 minutes or till a toothpick or a bambook skewer inserted in the bread comes out clean., The timing varies from oven to oven. Depending on the temperature in your oven and the size of your pan, the bread might take less or more time than mentioned here., So take your call and keep an eye on the bread. However don't open the oven untill the bread is ¾ done., The benchmark is that a tooth pick inserted in the bread should come out clean., Place the loaf pan on a wired rack for it to cool. When the bread cools down, gently remove the banana bread from the pan., Slice and serve banana bread., The remaining banana loaf, you can wrap in a cling film or keep in a box in the fridge. You can choose to warm the banana bread before serving., , Video, , , , , Notes, If coconut oil is added to the bread, it solidifies when refrigerated, hence the bread also becomes dense when you refrigerate it. So before serving just warm up the bread and the bread will have its natural texture back., , Sweetness of the bread can be adjusted as per your preferences., , You can skip adding sunflower seeds. You can also choose to add nuts or edible seeds  or dry fruits of your choice. Walnuts, almonds, cashews, pecans, pistachios, raisins, flaxseeds, pumpkin seeds are some good options., , I  have made the banana bread with whole wheat flour, but if you want you can make it with all purpose flour or half-half of both the flours., , Note that the approximate nutrition info is for 1 slice of banana bread made with sunflower oil and raw sugar., , , , Nutrition Info (Approximate Values), , Nutrition Facts, , Eggless Banana Bread Recipe (+ Vegan & Whole Wheat), , , Amount Per Serving, , , Calories, 206, , Calories from Fat 90, , , , , % Daily Value*, , , Fat, 10g, 15%, Saturated Fat 1g, 6%, Polyunsaturated Fat 1g, Monounsaturated Fat 8g, Sodium, 50mg, 2%, Potassium, 254mg, 7%, Carbohydrates, 29g, 10%, Fiber 3g, 13%, Sugar 13g, 14%, Protein, 3g, 6%, , , Vitamin A, 27IU, 1%, Vitamin B1 (Thiamine), 1mg, 67%, Vitamin B2 (Riboflavin), 1mg, 59%, Vitamin B3 (Niacin), 1mg, 5%, Vitamin B6, 1mg, 50%, Vitamin C, 3mg, 4%, Vitamin E, 4mg, 27%, Vitamin K, 1µg, 1%, Calcium, 31mg, 3%, Vitamin B9 (Folate), 16µg, 4%, Iron, 1mg, 6%, Magnesium, 35mg, 9%, Phosphorus, 103mg, 10%, Zinc, 1mg, 7%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , This Eggless Banana Bread post from the archives was first published on October 2012. It has been updated and republished on November 2022., , Share This Recipe:, WhatsApp, Facebook, Pin, Tweet, Email, Shares, 28k, Meet Dassana, Welcome to Dassana's Veg Recipes. I share vegetarian recipes from India & around the World. Having been cooking for decades and with a professional background in cooking & baking, I help you to make your cooking journey easier with my tried and tested recipes showcased with step by step photos & plenty of tips & suggestions., , Learn More about Dassana, Get My Secrets to Great Indian Food, Sign up for my FREE Beginners Guide to Delicious Indian Cooking, Please enable JavaScript in your browser to complete this form., First Name, *, Email, *, Email, SIGN UP, , More Vegetarian Recipes You'll Love, , Bread Recipes, Whole Wheat Bread | Wholemeal Bread (Atta Bread), Bread Recipes, Pizza Recipe | Homemade Vegetarian Pizza, Bread Recipes, Pita Bread Recipe (Whole Wheat, Oven & Stovetop), Bread Recipes, Homemade Bread | White Bread, , , , Leave a Comment, Cancel reply, Your email address will not be published. We moderate comments and it takes 24 to 48 hours for the comments to appear. We thank you for your understanding and patience. If you have made the recipe, then you can also give a star rating., , Your Recipe Rating, , , , Your Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Your Name, *, , , Your Email, *, , , , , , Δ, , , 692 Comments, , , , , , , Isai, , says:, , , , Apr 10, 2025 at 6:03 pm, , , , , Hi, can I use melted butter in the place of oil?, Thanks for the recipe., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Apr 11, 2025 at 1:13 am, , , , , Yes you could try with melted butter., , , Reply, , , , , , , See More Comments, , , Meet Dassana, Hi, I am Dassana. Running the kitchen for decades, I share tried and tested Vegetarian recipes on my food blog since 2009, with a step-by-step photo guide & plenty of tips so that your cooking journey is easier. I also have a professional background in cooking & baking., , Learn More about Dassana, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, , Popular, Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Breakfast Recipes, Upma Recipe, Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Paneer Recipes, Paneer Butter Masala Recipe, , Snacks Recipes, Samosa Recipe (With Potato & Green Peas), Dal (Lentils) & Legumes, Rajma Recipe | Rajma Masala (Restaurant Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), As Seen In:, Dassana's Veg Recipes, Recipe Glossary, , Press & Media, , Privacy Policy, , Terms & Conditions, , Accessibility Statement, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, © Dassana’s Veg Recipes 2009-2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , Instructions: , Preparation, Preheat the oven to 180 degrees Celsius (350 degrees Fahrenheit) for 20 minutes., Grease a bread loaf tin or a rectangular cake pan with oil. You can use the rectangular cake pan of size ( 7.5 x 4 x 2.5 inches) or round cake pan (7.5 x 2 inches)., Making Banana Puree, Take sliced bananas and sugar in a mixing bowl., Mash the bananas well with a vegetable masher or puree them with a hand blender or a regular blender., Now add the oil, vanilla, cinnamon powder, nutmeg powder to the banana. Mix thoroughly with a wired whisk or spatula so that the oil is mixed evenly with the banana puree., Sieve the whole wheat flour with baking soda, baking powder, salt directly in the bowl containing the mashed bananas.",
        "Pumpkin Bread": "Ingredients:  Instructions: ",
        "Vegan Lemon Bread": "Ingredients: comes together without much fuss, and can be enjoyed all week long. Leftovers can also be frozen for later., , Also be sure to try these, Vegan Chocolate Chip Cookies, , , This iced lemon bread recipe has been a long time in the making., , It was inspired by reader feedback I received on a, Healthy Lemon Cake, I posted a few years ago. People loved the subtly tart and sweet flavor of that cake, but many of you were saying the same thing: that you wanted a lemon cake that was taller, with a much lighter and fluffier texture., , So here it finally is – a bigger, fatter, bolder vegan lemon loaf!, , I feared this might make things way too acidic., , So I played around and was even able to cut down the oil in the process., , Currently Trending:, Almond Milk Ice Cream, – 5 Flavors, , , , I made the recipe for a brunch last Sunday, because of course I did., , You know how much I love brunch!, , (For the record, brunch is always lunch for me. No way I can go until after noon before eating any food.), , Our potluck brunch also included english muffins, frosted donuts, roasted potatoes, , Vegan Mac And Cheese, , and vegan lasagna soup… so, um, lots of carbs., , While I do love all of the, Keto Dessert Recipes, on the blog, we also really love carbs over here., , This secretly vegan lemon bread recipe can be soy free, gluten free, and oil free (although I personally prefer the version with oil)., , Because so many readers ask about using almond flour in my recipes, I did go ahead and test it here. The results were delicious but not very attractive., , , The recipe will also work as, Vegan Lemon Cupcakes, : Preheat the oven to 350 F, and bake 17 minutes or until the cupcakes have risen and a toothpick inserted into the center of a cupcake comes out mostly clean., , If you make the lemon bread, please feel free to leave a comment or share photos and let me know your thoughts., , When you guys make my recipes, it is my favorite part of what I do., , , Watch the vegan lemon bread recipe video above, , , , Pin it now to save for later, Pin Recipe, , , Vegan Lemon Bread, , Light, soft, and irresistibly moist, this easy vegan lemon bread is sure to be a hit with family and friends!, , , , , Leave a Review, , Print Recipe, , , , Cook Time, 50, minutes, , minutes, , Total Time, 50, minutes, , minutes, , Yield, 10, , – 13 slices, , 5, from, 414, votes, , , , 2, , cups, , flour, , (For flourless, make this, Keto Lemon Bread, ), 1 1/2, , tsp, , baking powder, 3/4, , tsp, , salt, 1/4, , tsp, , baking soda, 1, , cup, , sugar,, , or xylitol for sugar free, 3/4, , cup, , milk of choice, 1/2, , cup, , plain yogurt,, , such as almondmilk yogurt, 1/4, , cup, , oil,, , or sub applesauce for fat free, 1/4, , cup, , lemon juice, zest of 1 large or 2 small lemons, , (1 tbsp total – don’t omit), 1, , tsp, , pure vanilla extract, , combine wet and dry, then stir until just evenly mixed. Spread into the pan. Bake 50-55 minutes, or until loaf has risen and a toothpick inserted into the center comes out clean. If desired, frost with either melted, Coconut Butter, or 1/2 cup powdered sugar combined with 1 tbsp milk of choice., View Nutrition Facts, , Notes, Also be sure to try this vegan, Chocolate Banana Bread, ., , , , , Have you made this recipe?, , Tag, @chocolatecoveredkatie, on Instagram, , , , , , Currently Trending Vegan Recipes:, , , Breakfast Meal Prep, , (20 Healthy Recipes), , , , Applesauce Muffins, , , , Coconut Bread, , , , Healthy Chocolate Chip Cookies, , , , Chickpea Cookie Dough Dip, , , , Healthy, , Chocolate Cake, , You are here:, Home, , /, , Healthy Breakfast Recipes, , /, Vegan Lemon Bread, Published on April 12, 2022, Gluten Free Carrot Cake Cupcakes, Carrot Cake Baked Oats, Facebook, Pin, Email, Meet Katie, Chocolate Covered Katie is one of the top 25 food websites in America, and Katie has been featured on The Today Show, CNN, Fox, The Huffington Post, and ABC's 5 O'clock News. Her favorite food is chocolate, and she believes in eating dessert every single day., , Learn more about Katie, , healthy recipes, , soy-free, Get Free Recipes, Don’t Miss Out On The NEW Free Healthy Recipes, Sign up below to receive exclusive & always free healthy recipes right in your inbox:, , , , , Sign me up!, , , Popular Right Now, Vegan Danish, Vegan Irish Soda Bread, Blueberry Protein Muffins, Breakfast Granola Cups, Reader Interactions, 462 Comments, Leave a comment or review, Leave a rating, , , , , , Candace, , says, , , 2nd June 2024 at 11:27 pm, , , , This was an amazing recipe! Couldn’t have been easier to make or to eat!, , , Reply, , , , , , , , Jenisis, , says, , , 8th June 2024 at 1:00 am, , , , I don’t have yogurt. Can I substitute it? or skip it, , , Reply, , , , , , , , Britt Kloehn, , says, , , 8th June 2024 at 2:13 pm, , , , Made this recipe into cupcakes last week for my family, and they were FABULOUS! I didn’t change much: I used soy milk (for “milk of choice”) and Silk soy milk yogurt. I added blueberries to half of them. This was an A+ recipe!, , , Reply, , , , , , , , Zoe, , says, , , 3rd October 2024 at 4:03 pm, , , , How could I leave out the yogurt or substitute it? I’ve been to the store twice today and forgot it both times! Can’t bring myself to make another trip., , , Reply, , , , , , , , Sienna, , says, , , 3rd January 2025 at 2:56 pm, , , , I made this. Subbed apple sauce for the oil., , Came  out delicious. The texture is perfect. Light and fluffy!, , , Reply, , , , , , , , Gwendolyn Kazemi, , says, , , 24th January 2025 at 7:08 pm, , , , What oil do you use? Olive oil ok?, , , Reply, , , , , , , , Barbara Alexander, , says, , , 17th March 2025 at 11:36 pm, , , , I made the lemon loaf today and OMG it’s so good!!  The yogurt makes it very moist.  My husband said he could eat this every day of the week and couldn’t believe it was vegan.  Definitely a keeper & will be on repeat., , , Reply, , , , See More Comments, , , , 4.99 from 414 votes (, 376 ratings without comment, ), , , , Leave A Reply, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Notify me via e-mail if anyone answers my comment., , , , , Δ, , , Primary Sidebar, Meet Katie, Chocolate Covered Katie is one of the top 25 food websites in America, and Katie has been featured on The Today Show, CNN, Fox, The Huffington Post, and ABC's 5 O'clock News. Her favorite food is chocolate, and she believes in eating dessert every single day., , Learn more about Katie, , Strawberry Crisp, Vegan Carrot Cake Recipe, Chocolate Peanut Butter Eggs, Carrot Cake Bars, , I want to make, , , , Search for, , , , , , Copyright © 2025  ·  Chocolate Covered Katie  ·  All Rights Reserved  ·  An Elite CafeMedia Food Publisher  ·, Privacy Policy, , Recipe Index, , , , Get Free Recipes, Don’t Miss Out On The NEW Free Healthy Recipes, Sign up below to receive exclusive & always free healthy recipes right in your inbox:, , , , , Sign me up!, , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: The recipe works with spelt, white, or oat flour. It technically works with almond flour (and tastes delicious) but won’t rise or look pretty. Gluten free all purpose flour can work but will be much denser. I prefer the oil version’s flavor and texture, but if you’re used to the texture of oil free baked goods it’s fine to sub applesauce., Preheat oven to 350 F. Grease a 9×5 loaf pan. In a large bowl",
        "Peanut Butter Apple Crumble": "Ingredients: , Press, , Contact, , , , , Home, », Recipes, », Desserts, », Fruit Desserts, », Peanut Butter Apple Crumble (gluten-free, Vegan, Whole Grain), , , , , September 3, 2015, ·, ♥♥♥♥♥, Rating: 5.0 from 3 reviews, ·, Print Recipe, , , Peanut Butter Apple Crumble (gluten-free, vegan, whole grain), , , , Jump to Recipe, This peanut butter apple crumble has a delicious, natural peanut butter based topping and is incredibly simple to put together. Gluten-free, vegan, dairy-free and 100% whole grain., , This recipe actually started off as peanut butter apple crumb bars. But that got complicated. My choice was to either most likely attempt it another 3 times before giving up and feeling defeated OR I could just turn it into a crumble. I obviously decided to take the easy way out and am so thankful that I did because there’s no way that bars could have beat these peanut butter crumbles!, , , I originally had a whole wheat topping, but then I saw a big bag of oat flour just sitting there and thought that the gluten-free folks may appreciate me using that. So now my gluten-free friends and my whole grain loving friends can be happy together (since oats are also whole grain!), , You can use four ramekins or two 5″ tart dishes. The sides of my dishes were about 1″ high. If yours are a lot smaller, then maybe divide the crumble between 2 tart dishes and a small ramekin. The recipe can easily be doubled or even quadrupled if you want a larger amount. Just be sure to refrigerate it to prevent the topping from becoming soft overnight., , , The first time I made this, I didn’t add any cinnamon. I thought that peanut butter and maple syrup were too perfect together to mess with, but… the apple portion didn’t taste like anything. The peanut butter topping, which is almost like a crumbly peanut butter cookie, totally overwhelmed it. So the next time, I added a little cinnamon., , With the cinnamon addition, they were perfect. But when I starting taking the pictures, I realized that the crumbles looked boring on their own and figuring that ice cream would perhaps be a strange combination (and not wanting to go to the grocery store), I chose to go the peanut butter route., , , These, no-bake peanut butter cookies, that I posted a few months ago are made by boiling peanut butter, maple syrup, vanilla and coconut oil and tossing in some oats. Leave out the oats and coconut oil and that’s what we’ve got on top of these crumbles! The only difference is that I added a little more maple syrup. The sauce was just too thick without it., , If you’re used to my somewhat reduced sugar treats, don’t be surprised when you take a bite of these peanut butter crumbles. They’re sweet. As sweet as regular desserts. Especially with the added peanut butter maple sauce! I know some of you are going to feel compelled to reduce the sugar, but remember that you’re likely going to affect the shape and structure of the crumbles. If you do experiment, let us know how it goes because I could always do with less sugar!, , ❀, Peanut Butter Apple Crumble (gluten-free, vegan, dairy-free, 100% whole grain), ♥♥♥♥♥, Rated, 5.0, by, 3, readers, Print, Prep Time:, 30 min, Cook Time:, 30 min, Ready in:, 1 h, Yield:, 3-4 servings, For the peanut butter topping:, 1/4 cup (64 grams) salted natural peanut butter, room temperature, 2 tablespoons (28 grams) coconut oil, 1 tablespoon + 1 teaspoon (17 grams) light brown sugar, 1 tablespoon maple syrup, 1/4 cup + 1 tablespoon (29 grams) oat flour (use, gluten-free oat flour, , if necessary), 1/4 cup (22 grams) rolled oats (use, gluten-free oats, , if necessary), 1/16 teaspoon baking powder, 1/16 teaspoon salt, For the apples:, 3 cups (350 grams) peeled, cored and diced apples (about 3 medium apples / 555 grams apples pre-coring and peeling), 2 tablespoons maple syrup, 1 1/2 teaspoons lemon juice, 2 1/2 teaspoons cornstarch, 1/2 teaspoon cinnamon (or more, if desired), pinch of salt, For the peanut butter maple sauce:, 2 tablespoons maple syrup, 1 tablespoon + 1 teaspoon salted natural peanut butter (the kind with just salt and peanuts), 1/4 teaspoon vanilla extract, Preheat the oven to 350 °F (175 °C) and grease two 5\" tart dishes., Divide the apple mixture between the two dishes. Top with the peanut butter topping., Place the crumbles on a baking sheet to catch any possible spills. Bake for 30 minutes or until the topping is firm and the apples have started to bubble lightly., Let cool for about 20 minutes before serving. Cover and keep at room temperature for up to 12 hours and then refrigerate (which prevents the topping from softening) for up to 3 days., Before serving, prepare the peanut butter maple sauce. In a saucepan, bring to a boil and while continuing to stir constantly, boil for about 30 seconds. It should have thickened a bit and should you have any leftovers after pouring it over your crumbles, will continue to thicken while cooling. The sauce will be too firm to pour at room temperature. To liquefy it again, reheat it on the stove over low heat, while stirring constantly, until liquid., Permalink:, https://www.texanerin.com/peanut-butter-apple-crumble/, Recipe by, Texanerin Baking, |, www.texanerin.com, Like what you see and want more?, Join over 12,400 readers and sweeten up, your inbox with new posts for free!, Your information will not be shared with or sold to a third party., This subscription is free of charge and can be canceled at any time., , , , , Posted by, Erin, in:, Dairy-free, , , Desserts, , , Fall Recipes, , , Fruit Desserts, , , Gluten-free, , , Seasonal Recipes, , , Special Diets, , , Vegan, , , , Like this post? Help others find out about it:, , Pin post on Pinterest, , Share post on Facebook, , Share post on Twitter, , Share post on Google+, , , Recommended Posts, , Pumpkin Cream Cheese Muffins (gluten-free, whole grain, all-purpose options), , Keto Peanut Butter Cookies, , Vegan Pumpkin Muffins (gluten-free, whole grain options), , Gluten-free Oatmeal Cookies (no funky texture! perfect texture), , , , , , 58 comments on “Peanut Butter Apple Crumble (gluten-free, vegan, whole grain)” —, Add one!, , , , , , Connie, , says, , September 8, 2018 @ 5:52 am, , , This sounds amazing! Would it be ok to substitute regular peanut butter for the natural peanut butter if I don’t have it on hand? Thank you so much for all of the great recipes!, , , Reply, , , , , , , Erin, , replies to, Connie, , September 9, 2018 @ 8:49 pm, , , You’re welcome for the recipes! :) I’ve never tried regular peanut butter in this so I’m not sure. Natural peanut butter (at least the kind I use) is so much runnier than the regular kind so I’m not really positive. Sorry I can’t give you a better answer! Thanks for your comment. :), , , Reply, , , , , , , , , Donna, , says, , April 5, 2018 @ 4:26 am, , , My family loved this!  I was so happy to find a gluten free/vegan dessert that everyone loves!  The second time I made it I had to double it, because one batch disappeared way too fast!!  Thank you!!!, , , Reply, , , , , , , Erin, , replies to, Donna, , April 5, 2018 @ 11:15 am, , , You’re welcome! I’m happy you enjoyed it. :) I can also recommend this, gluten-free apple crisp, which is also vegan and should please everyone. It’s one of my favorites! Thanks for your comment., , , Reply, , , , , , , , , Hannah, , says, , October 16, 2017 @ 9:27 pm, , , I LOVE PB and Apples. BUT – Is there a suggestion for subbing coconut oil in this? Maybe avacado oil? I wish I did not dislike coconut flavor so anytime a recipe calls for coconut anything I need to sub it out., , Thank yoU!!, , , Reply, , , , , , , Erin, , replies to, Hannah, , October 17, 2017 @ 4:34 am, , , Can you have butter? If so, I think that should work! I wouldn’t recommend any kind of oil that’s liquid at room temp. I don’t think it’d come out well (though I could be wrong!)., , , Reply, , , , , , , , , Uli, , says, , October 11, 2017 @ 9:56 am, , , This was delicious, thanks for the great recipe! I used coconut flour instead of oat flour to mix with the oats. Used an extra apple as well. I’m in love! Very rich, so small ramekins would be wise for me ;) But extremely tasty combo. Topped it with whipped cream as I got a bit lazy with making the sauce…, , , Reply, , , , , , , Erin, , replies to, Uli, , October 11, 2017 @ 8:19 pm, , , That’s interesting that coconut flour worked as a sub! That’s great to know. :) Thanks for your feedback! I’m so happy you liked it., , , Reply, , , , , , , , , Ally shandrew, , says, , December 14, 2016 @ 7:34 am, , , Is there an alternative I can use for cornstarch ?😊 Maybe Patato starch ? What do you think?, , , Reply, , , , , , , Erin, , replies to, Ally shandrew, , December 14, 2016 @ 10:10 am, , , I’ve never used potato starch but I think 2 teaspoons arrowroot powder / starch would work well. :), , , Reply, , , , , , , , , KRPL, , says, , October 3, 2016 @ 4:33 pm, , , LOVE your recipes!!! This one looks DELISH too, and I can’t wait to try it!! I was just wondering, what could you bake this in if you don’t have tart dishes? Would an 8×8 dish work? Thank you so much!!, , , Reply, , , , , , , Erin, , replies to, KRPL, , October 3, 2016 @ 4:39 pm, , , Thanks so much! It’s not enough for an 8×8 so I’d recommend doubling it. I’m not sure of the baking time, though, so keep a close eye on it! I hope you’ll enjoy it. :), , , Reply, , , , , , , , , Alexia, , says, , September 29, 2016 @ 5:00 pm, , , Hi, I’m hoping to make this but the recipe says 1/16 tsp for baking powder and for salt…is this right? Seems too small an amount and impossible to measure!! Am I misreading it? Thanks, , , Reply, , , , , , , Erin, , replies to, Alexia, , September 29, 2016 @ 9:06 pm, , , It’s correct! My measuring spoons go down to 1/32 teaspoon. Do you have 1/4 teaspoon? Just try to do 1/4 of that. It won’t make a huge difference if you’re off a bit. Hope you’ll enjoy the crumbles! :), , , Reply, , , , , , , , , Henry Croft, , ♥♥♥♥♥, , says, , September 8, 2016 @ 7:11 pm, , , Apple crumble is my ALL TIME favourite desert so I’m defo going to give this a try, it looks so tasty, , , Reply, , , , , , , Erin, , replies to, Henry Croft, , September 8, 2016 @ 9:40 pm, , , I hope you’ll enjoy it! It’s definitely a tasty variation on the regular kind. :), , , Reply, , , , , , , , , Marie @ Not Enough Cinnamon.com, , ♥♥♥♥♥, , says, , September 11, 2015 @ 3:01 am, , , OMG Erin this dessert has all my favorite things combined. I am obsessed with apple desserts. With cinnamon, obviously! This crumble looks amazing, seriously!, , , Reply, , , , , , , Erin, , replies to, Marie @ Not Enough Cinnamon.com, , September 11, 2015 @ 3:08 pm, , , Thanks so much, Marie! I’m obsessed with apple desserts, too. I can’t get enough!, , , Reply, , , , , , , « Older Comments, , , Comments? I’d love to hear from you!, Cancel Reply, , , Your email address will not be published. Required fields are marked with *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, Your Name, *, , Your Email, *, , Comments are moderated. If you don’t see your comment immediately, don’t panic… it went through! Thank you so much for taking time to leave feedback!, ♥, , Please help others by rating the recipe:, 5, ♥, , 4, ♥, , 3, ♥, , 2, ♥, , 1, ♥, , , , , Notify me of replies to my comment via e-mail, Subscribe me to new posts via email, , , , , Scroll to top, , , , I’m a baking obsessed Texan named Erin. Here you’ll find a mix of gluten-free, grain-free, paleo and some 100% whole grain treats that have been made healthier but don’t taste like it!, More », , , , , Sign up for Email Updates, , , , , , , , facebook, instagram, pinterest, rss, stumbleupon, twitter, , , Like me on Facebook!, , Follow me on Pinterest!, , Follow me on Instagram!, , Follow me on Twitter!, , Subscribe to new posts!, , , , , My Favorites!, , , , , Popular Posts, , , The Original Peanut Butter Chocolate Chip Cookie Dough Bites Recipe (aka Chickpea Cookies), , Perfect Paleo Chocolate Chip Cookies (vegan / keto options), , Almond Flour Carrot Muffins, , Gluten-free Brownies – Super fudgy and dairy-free!, , Zucchini Brownies (gluten-free, dairy-free options), , Gluten-free Lemon Cookies (vegan, paleo), , Paleo Chocolate Banana Muffins (grain-free, gluten-free, dairy-free), , , , , , Erin on Pinterest, , , , , , Browse Posts by Month, , , Select Month, , March 2025  (4), , February 2025  (4), , January 2025  (4), , December 2024  (11), , November 2024  (9), , October 2024  (6), , September 2024  (5), , August 2024  (9), , July 2024  (3), , June 2024  (7), , May 2024  (4), , April 2024  (1), , March 2024  (4), , February 2024  (4), , January 2024  (5), , December 2023  (7), , November 2023  (11), , October 2023  (3), , September 2023  (6), , August 2023  (8), , July 2023  (8), , June 2023  (9), , May 2023  (5), , April 2023  (9), , March 2023  (7), , February 2023  (4), , January 2023  (5), , December 2022  (9), , November 2022  (7), , October 2022  (10), , September 2022  (7), , August 2022  (7), , July 2022  (5), , June 2022  (7), , May 2022  (4), , April 2022  (3), , March 2022  (4), , February 2022  (4), , January 2022  (3), , December 2021  (10), , November 2021  (9), , October 2021  (8), , September 2021  (7), , August 2021  (5), , July 2021  (4), , June 2021  (4), , May 2021  (3), , April 2021  (6), , March 2021  (5), , February 2021  (4), , January 2021  (5), , December 2020  (8), , November 2020  (6), , October 2020  (7), , September 2020  (7), , August 2020  (3), , July 2020  (4), , June 2020  (1), , May 2020  (3), , April 2020  (4), , March 2020  (4), , February 2020  (3), , January 2020  (4), , December 2019  (6), , November 2019  (5), , October 2019  (5), , September 2019  (4), , August 2019  (2), , July 2019  (5), , June 2019  (5), , May 2019  (3), , April 2019  (3), , March 2019  (1), , February 2019  (2), , January 2019  (2), , December 2018  (2), , November 2018  (4), , September 2018  (2), , August 2018  (2), , July 2018  (4), , June 2018  (2), , May 2018  (1), , April 2018  (3), , March 2018  (3), , February 2018  (4), , January 2018  (3), , December 2017  (2), , November 2017  (2), , October 2017  (5), , September 2017  (2), , August 2017  (1), , July 2017  (1), , June 2017  (1), , May 2017  (3), , April 2017  (6), , March 2017  (2), , February 2017  (4), , January 2017  (5), , December 2016  (4), , November 2016  (7), , October 2016  (6), , September 2016  (4), , August 2016  (6), , July 2016  (3), , June 2016  (6), , May 2016  (3), , April 2016  (4), , March 2016  (5), , February 2016  (3), , January 2016  (6), , December 2015  (6), , November 2015  (5), , October 2015  (5), , September 2015  (7), , August 2015  (2), , July 2015  (3), , June 2015  (4), , May 2015  (2), , April 2015  (5), , March 2015  (4), , February 2015  (3), , January 2015  (6), , December 2014  (5), , November 2014  (8), , October 2014  (7), , August 2014  (1), , July 2014  (4), , June 2014  (4), , May 2014  (5), , April 2014  (3), , March 2014  (5), , February 2014  (5), , January 2014  (4), , December 2013  (5), , November 2013  (2), , October 2013  (7), , September 2013  (4), , August 2013  (7), , July 2013  (4), , June 2013  (3), , May 2013  (5), , April 2013  (2), , March 2013  (6), , February 2013  (5), , January 2013  (2), , December 2012  (4), , November 2012  (3), , October 2012  (3), , September 2012  (2), , August 2012  (5), , July 2012  (4), , June 2012  (3), , May 2012  (4), , April 2012  (3), , March 2012  (1), , February 2012  (1), , January 2012  (2), , December 2011  (2), , November 2011  (1), , October 2011  (3), , September 2011  (2), , , , , , , , , , , , , , Subscribe via Email, , Sign up for free email notifications and you’ll receive an email whenever I post something new., , , , , , , , Subscribe via RSS, , , Raw RSS feed, , BlogLovin, , Feedly, , , , , Follow Me, , Add me to your social network to discover more yummy goodness and see what else I am up to!, , , Like me on Facebook!, , Follow me on Pinterest!, , Follow me on Instagram!, , Follow me on Twitter!, , , , , , , , Readers’ Comments, , “Interesting brownie. I made it with raw almond butter from TJ’s, since I was low on PB. I also used …”, “Oh yes! I did some research to verify that I could use tofu instead of applesauce. Your cookies are …”, “I heart this recipe! It’s my very first time making them. I don’t have applesauce so I used silken t…”, “Could someone use the whole can of pumpkin to make the whole thing pumpkin flavored instead of doing…”, “delicious!!!!”, , , , , , Recent Posts, , Almond Flour Carrot Muffins, Posted on March 23, 2025, Lemon Tartlets, Posted on March 17, 2025, Eggless Banana Muffins, Posted on March 11, 2025, , , , , , , Home, , About, , Press, , Contact, , Photo & Recipe Policy, , Disclosure & Privacy Statement, , , , Copyright © 2025 Texanerin Baking, , , , , , , , , Like what you see and want more?, Join over 12,400 readers and sweeten up, your inbox with new posts for free!, Your information will not be shared with or sold to a third party., This subscription is free of charge and can be canceled at any time., , , Instructions: In a small mixing bowl, stir together the peanut butter, melted coconut oil, sugar and maple syrup. Add in the oat flour, oats, baking powder and salt and stir until well combined. Place in the refrigerator for at least 30 minutes while preparing the rest of the recipe."
    }
}