{
    "ingredients": {
        "Vegan Quinoa Chili": "onion, garlic, tomatoes, quinoa, green chillies, cocoa powder, hot sauce, red kidney beans, black beans, corn",
        "Tofu Chili": "onion,bell pepper,garlic,firm tofu,tomato puree,black beans, worcestershire sauce vegan",
        "Butternut Squash Stew": "onion, red bell pepper, garlic, green onions, butternut squash, black beans, thyme, coconut milk, veg broth, vegan bouillon, collard greens, allspice",
        "Cheesy Potato Taco Casserole": "impossible meat, gold potatoes petite, onion, taco seasoning, tomatoes, vegan cheddar, green onions",
        "Corn Casserole": "corn kernels,creamed corn,vegan cheddar,cornmeal,sour cream,egg,chives,vegan butter,baking soda",
        "Vegan Chickpea Pot Pie": "non dairy milk, nutritional yeast,besan,chickpeas,yellow onion,celery,carrots,onion,yellow potatoes,frozen peas,thyme",
        "Vegan Holiday Roast": "onions,white mushrooms,garlic,soy sauce,cannellini beans,nutritional yeast,better than bouillon-no chicken base,vegan worcestershire sauce vegan,onion powder.dried rosemary, dried thyme,vital wheat gluten,soy sauce,brown sugar",
        "Vegan meatloaf": "veg broth,brown lentils, quinoa,onion,celery, carrot,garlic,tomato paste, dried thyme,worcestershire sauce vegan,bread crumbs,flaxseed powder,nutritional yeast,soy sauce,ketchup",
        "Southern Style Vegan Meatloaf": "chickpeas,black beans,rolled oats,corn meal,liquid smoke, aquafaba chickpea liquid,veg broth,white onion,worcestershire sauce vegan,toamto sauce,apple cider vinegar,dark molasses,brown sugar,onion powder,lime juice, chipotle peppers in adobo sauce, cornstarch",
        "Tempeh BBQ Ribs": "tempeh,onion powder,Vegan BBQ Sauce",
        "Vegan Pulled Pork": "jackfruit in brine, coconut oil,onion,garlic,sugar,instant espresso powder,cocoa powder,cinnamon,allspice,veg broth,banana BBQ sauce",
        "Vegan Crab Cakes": "chickpeas,hearts of palm, mayo,dijon mustard,worcestershire sauce vegan,old bay seasoning,green onions,bread crumbs",
        "Au Gratin Potato Cups": "ghee,onion,soy milk,nutmeg,cornstarch,potatoes,vegan cheddar",
        "Tomato Cobbler": "onions,garlic,tomatoes,thyme,sugar,cherry tomatoes,balsamic vinegar,cornstarch,all purpose flour,baking powder,vegan butter,coconut milk",
        "Vegan BBQ Chickpea Pizza": "Vegan Mozarella,chickpeas,vegan BBQ sauce,pizza dough,tomato sauce,red onion,hot banana peppers",
        "Slow cooker 3 bean vegetarian chili": "onion,bell peppers,tomatoes,chickpeas,kidney beans,black beans,garlic",
        "Mushroom Bourguignon": "dried mushrooms,onion,carrots,peas,cloves,onion powder,soy sauce,veg broth,almond milk,corn starch,coconut milk,potatoes,nutmeg"
    },
    "recipe_url": {
        "Vegan Quinoa Chili": "https://chefsavvy.com/vegetarian-quinoa-chili/#wprm-recipe-container-27423",
        "Tofu Chili": "fixate_recipes\\Lunch\\FXR_Recipes_Tofu-Chili.pdf",
        "Butternut Squash Stew": "https://healthiersteps.com/recipe/black-bean-butternut-squash-stew/",
        "Cheesy Potato Taco Casserole": "https://www.pinterest.co.uk/pin/496592296426650156/",
        "Corn Casserole": "fixate_recipes\\Lunch\\FXR-EN-Corn_Casserole-09.07.21-Recipe.pdf",
        "Vegan Chickpea Pot Pie": "https://frommybowl.com/vegan-chickpea-pot-pie/#tasty-recipes-4996",
        "Vegan Holiday Roast": "https://veganhuggs.com/vegan-holiday-roast/",
        "Vegan meatloaf": "fixate_recipes\\Lunch\\Fixate_Recipes_Vegan-Meatloaf.pdf",
        "Southern Style Vegan Meatloaf": "https://www.veganosity.com/smoky-southern-style-meatless-meatloaf/#recipe",
        "Tempeh BBQ Ribs": "fixate_recipes\\Lunch\\FXR_Tempeh-BBQ-Ribs_R_05.30.19.pdf",
        "Vegan Pulled Pork": "fixate_recipes\\Lunch\\FXR_Vegan_Pulled_Pork_R_02.2021.pdf",
        "Vegan Crab Cakes": "fixate_recipes\\Lunch\\FXR_Vegan-Crab-Cakes_R_05.30.19.pdf",
        "Au Gratin Potato Cups": "fixate_recipes\\Lunch\\FXR-EN-AU_Gratin_Potato_Cups-11.19.20-Recipe.pdf",
        "Tomato Cobbler": "fixate_recipes\\Lunch\\FXR-EN-Tomato_Cobbler-6.7.21-Recipe.pdf",
        "Vegan BBQ Chickpea Pizza": "https://itdoesnttastelikechicken.com/vegan-bbq-chickpea-pizza/#recipe",
        "Slow cooker 3 bean vegetarian chili": "https://theschmidtywife.com/slow-cooker-vegetarian-chili-recipe/",
        "Mushroom Bourguignon": "https://elavegan.com/vegan-mushroom-bourguignon/#recipe"
    },
    "Recipe": {
        "Vegan Quinoa Chili": "Ingredients: About, Facebook, Instagram, Pinterest, YouTube, TikTok, Newsletter, Toggle Search, , , , , , , , , Close Search, , Search, , , , Search, , Search, , , , , , , , , , Home, , , Recipe Index, , , Main Dish, , , Vegetarian Quinoa Chili, , Vegetarian Quinoa Chili, , , , Kelley Simmons, , January 26, 2024, , 4.67, from, 6, votes, , 44 comments, , , , , , , , , , , , , Jump to Recipe, , Save this Recipe, Saved Recipe, , Leave a Review, , , , , This super healthy Vegetarian Quinoa Chili is loaded with three different types of beans, corn, and quinoa. It’s hearty, thick, filling, and full of flavor — so much so that you won’t miss the meat. Serve it with some, Homemade Cornbread, or, Homemade Tortilla Chips, to complete the meal!, , If you like this, vegetarian dish, , then try my, Best Fried Rice, and my, Chickpea Curry, !, , , , , Email this Recipe, , Enter your email to get it straight in your inbox! Plus, receive new recipes weekly!, , , , , , , , , Save, , , , , , , , , Vegetarian Quinoa Chili, , I love a good, chili, especially one that’s healthy and loaded with fiber. So, I packed this chili with three types of beans, , quinoa, , corn, onions and garlic. Trust me — you will, not, miss the meat in this vegetarian version!, , Other than being a healthy spin on this classic cold-weather dish, perhaps the best part of this vegetarian chili is that it’s super easy to throw together and only requires 10 minutes of prep time. Then, you just let the Dutch oven and stovetop do the rest of the work. This chili also yields tons of leftovers and is freezer friendly!, , This chili recipe is loaded with filling and hearty flavor. I threw in some chili powder and paprika for added spice, which helps it taste similar to the chili of your childhood. I also like to add a couple dashes of hot sauce. That can be omitted if you don’t like a lot of spice., , This dish makes for the perfect super bowl party meal, weeknight supper, or made-ahead lunches for the work week. Don’t forget to whip up some of my favorite, Homemade Cornbread, or my easy, Homemade Tortilla Chips, for dipping!, , , , , Veggies:, One large onion (diced) and four cloves garlic (minced) sautéed. Then two 14.5-oz cans fire roasted diced tomatoes, two cups crushed tomatoes, and one 7-oz can diced green chiles added., , Quinoa:, One cup cooked total for this stovetop vegetarian chili recipe. Leave uncooked if using a slow cooker or, Instant Pot, ., , Dry Seasonings:, Two tablespoons chili powder, two teaspoons ground cumin, one teaspoon unsweetened, cocoa powder, , two teaspoons paprika, kosher salt, and freshly cracked pepper., , Beans:, One 15-oz can red kidney beans, one 15-oz can light red kidney beans, and one 15-oz can black beans — all drained and rinsed., , Corn:, One cup from frozen (thawed), , Optional toppings:, Shredded cheese, sour cream, green onions, sliced peppers, and/or avocado, if desired., , , , TIP:, diced potatoes, ,, or even my, grilled sweet potato wedges, . Just add them before you simmer everything together to ensure they are cooked thoroughly., , , How to Make Vegetarian Quinoa Chili, , , Heat olive oil in a large pot until shiny. Add the diced onion, and sauté until tender, approximately 3-4 minutes. Then, add the garlic, and cook for an additional minute, until fragrant., , , , , Next, add the diced tomatoes, crushed tomatoes, cooked quinoa, water, green chiles, chili powder, cumin, cocoa, paprika and hot sauce. Season with salt and pepper to taste. Cover pot, and allow chili to simmer for 30 minutes., , , , , Add in all of the beans and corn. Cook for another 5-10 minutes, until heated through., , , , , Serve warm with any of the optional toppings below and enjoy!, , , , , TIP:, Toast the dry quinoa in the pot with a little olive oil before boiling and cooking. This gives it a nutty, rich flavor., , , , , Optional Toppings, , , Shredded Mexican Cheese, , Avocado, , Cilantro, , Sliced Green Onions, , Sour Cream, , Sliced Peppers, , , , , , TIP:, Make it, vegan, by using plant-based toppings, including nut “cheeses” and coconut cream!, , , , , What To Serve with This Vegetarian Quinoa Chili, , , , , , , , , , , , Bacon Cheddar Biscuits, , , , , , , , , , , , Homemade Tortilla Chips, , , , , , , , , , , , The BEST Cornbread, , , , , , , , , , , , Cucumber Avocado Salad, , , , , , , , , , , , Focaccia Muffins, , , , , , , , , , , , Homemade Pico de Gallo, , , , , , , , , , , , Frequently Asked Questions, , , , Can This Vegetarian Chili Be Made in the Slow Cooker or Instant Pot?, , , Yes!, To turn this into a, slow cooker vegetarian chili recipe, , cook on low for 4-5 hours or on high for 2-3 hours. Serve warm with desired toppings, and enjoy!, , You can also make this in the, Instant Pot, by sautéing the onion and garlic with olive oil in the insert, making sure to scrape any cooked bits off the bottom. Cover with the lid, seal, and cook on manual (HIGH) pressure for 8 minutes. Immediately release the pressure, then open the, Instant Pot, . Stir in the beans and corn, then close the lid and allow the chili to thicken for a couple minutes. Adjust taste as needed, serve hot with desired toppings, and enjoy!, , One key difference in these versions and making the chili on the stovetop is that you do not cook the quinoa ahead of time. Allow the slow cooker or, Instant Pot, to do that for you., , , , , How to store and reheat this chili, , , , To Store:, Leftover vegetarian chili will stay good in the refrigerator for 5 days. Allow them to cool completely, then store them in an airtight container or plastic bag., , To Reheat:, Place cold chili in a large pot on the stove over medium heat until warmed through, adding splashes of broth or water as needed if it is too thick. You can also reheat this chili in the microwave (covered) in 30-second intervals., , To Freeze:, This is a great, freezer meal, ! Store leftover vegetarian chili in an airtight freezer-safe storage container or Ziplock bag in the freezer for up to 3 months. Allow it to thaw overnight in the refrigerator before reheating., , , , , , , , , More Recipes To Try, , If you enjoyed my, Vegetarian Quinoa Chili, , then you’ll love these other soup recipes:, , , Instant Pot Chicken Noodle Soup, , Slow Cooker Turkey Chili, , Italian Meatball Soup, , Stuffed Pepper Soup, , Slow Cooker Minestrone Soup, , , , , , , , , Recipe, , Vegetarian Quinoa Chili, , 4.67, from, 6, votes, , A super healthy Vegetarian Quinoa Chili loaded with three different types of beans, corn and quinoa. Hearty, thick, filling and full of flavor!, , , , Author:, Kelley Simmons, Prep Time:, 10, minutes, , mins, Cook Time:, 35, minutes, , mins, Total Time:, 45, minutes, , mins, , , Serves, 6, , , Rate, , Save, Saved, , Print, , , , , , , , , , , , , , , Email this Recipe, , Enter your email to get it straight in your inbox! Plus, receive new recipes weekly!, , , , , , , , , Save, , , , , , , , , , Cook Mode, Prevent your screen from going dark, , , 1, , tablespoon, , extra virgin olive oil, 1, , large onion, , , diced, 4, , cloves, , garlic, , , minced, 2, , 14.5 oz cans fire roasted diced tomatoes, 2, , cups, , crushed tomatoes, 1, , cup, , cooked quinoa, 1, , cup, , water, 1, , 7 oz can diced green chiles, 2, , tablespoons, , chili powder, 2, , teaspoons, , ground cumin, 1, , teaspoon, , unsweetened cocoa powder, 2, , teaspoons, , paprika, a couple dashes of hot sauce, salt and pepper, 1, , 15 ounce can red kidney beans, drained and rinsed, 1, , 15 ounce can light red kidney beans, drained and rinsed, 1, , 15 ounce can black beans, drained and rinsed, 1, , cup, , frozen corn, , , thawed, shredded cheese, , , sour cream, green onions and avocado for serving, if desired,  Instructions: Heat olive oil in a large pot. Add in onion and saute until tender, 3-4 minutes. Add in garlic and cook for an additional minute., , Add in diced tomatoes, crushed tomatoes, cooked quinoa, water, green chiles, chili powder, cumin, cocoa, paprika and hot sauce. Season with salt and pepper to taste. Cover pot and simmer for 30 minutes., , Add in all of the beans and corn. Cook for a couple of minutes until heated through., , Serve immediately with shredded cheese, sour cream, green onions and avocado for serving, if desired!, , , , Nutrition Information, Calories:, 133.67, kcal, Carbohydrates:, 23.49, g, Protein:, 4.56, g, Fat:, 4.04, g, Saturated Fat:, 0.57, g, Sodium:, 160.38, mg, Potassium:, 484.14, mg, Fiber:, 4.81, g, Sugar:, 4.9, g, Vitamin A:, 1300.93, IU, Vitamin C:, 11.38, mg, Calcium:, 55.51, mg, Iron:, 2.81, mg, , , , , , , , Did You Make This?, , I’d love to hear your feedback! Leave a, review, and make sure to share your pictures on social media! Don’t forget to follow, @thechefsavvy, ., , , Leave a Review, , Follow Chef Savvy, , , , , , , , , , , , , Kelley Simmons, , With over 20 years of culinary experience Kelley has worked in various restaurants over the years and graduated from culinary school back in 2009. Since 2014 she has been sharing her families favorite recipes to over 1 million people ever month!, , Learn more, , , , , , , Leave a Comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Notify me of replies to my comment via e-mail., , , , Δ, , , , , Comments, , , , , , , , , Bethany Curnow, , October 10, 2024, , , , Is the nutritional info based on per serving? And is the serving size based on 6 servings? Thank you., , , , , Reply, , , , , , , , , , , , Kelley Simmons, , October 10, 2024, , , , Hi! Yes the nutrition info is per serving and the serving size is divided by 6 servings. Thanks!, , , , , , , , , , , , , Whitney, , January 9, 2024, , , , Tastes just as delicious as a meat chili! Easy and makes a ton. I used a cup of uncooked quinoa, double the corn, and did a whole 28 oz can of crushed tomatoes. Turned out great, and could feed a small army. 👌, , , , , Reply, , , , , , , , , , , , Kelley Simmons, , January 9, 2024, , , , Yah so happy you enjoyed this!!, , , , , , , , , , , , , TnN Fjeld, , January 5, 2023, , , , Tried recipe in slow cooker on high for 2 hours and slow cooked for 3 hours adding 1/2 cup of barley to calm down the cumin. Went 75% of cumin and chili powder and felt it still over powered tge tomato flavor. Liked it so well probably be my go to after we complete 21 day daniel fast…., , , , , Reply, , , , , , , , , , , , Kelley Simmons, , January 9, 2023, , , , Yah! I am so happy to hear that! Thank you so much for trying my recipe and leaving feedback it means so much to me!, , , , , , , , , , , , , Stephen, , November 6, 2020, , , , Use unsweetened bakers chocolate squares (better use Mexican chocolate) not cocoa powder. And replace water with two bottles of  Negra Modelo beer., , , , , Reply, , , , , , , , , , , , Kelley Simmons, , November 9, 2020, , , , Sounds delicious Stephen! Thanks for making my recipe!, , , , , , , , , , , , , Sapana Behl, , October 7, 2020, , , , looks so delicious ! Love it!, , , , , Reply, , , , , , , , , , , , Cindy, , April 10, 2020, , , , We recently started a plant based eating lifestyle, so I have been looking for recipes that are plant based options of our favs. This chili was amazing, very filling and one I will definitely make again!, , , , , Reply, , , , , , , , , , , , Kelley Simmons, , April 11, 2020, , , , So glad you enjoyed this recipe Cindy! Thank you for sharing!, , , , , , , , , , , , , Tammy Sullivan, , March 9, 2020, , , , , , Delicious! Just wondering how big is a serving size? Just want to make sure I’m calculated the correct calories., , , , , Reply, , , , , , , , , , , , Kelley Simmons, , March 9, 2020, , , , Hi Tammy!, , There are 6 servings in this chili so one serving would be 133 calories., , Thanks!, , Kelley, , , , , , , , , , Load More, , , , , , , , , , , , Hi, I’m Kelley, , I’m a classically trained chef with a passion for cooking. I share delicious, easy, quick weeknight meals that your family will love. Every recipe is very clear, concise and easy to follow., , , Learn more, , , , , , Follow Chef Savvy, , Facebook, Instagram, Pinterest, YouTube, TikTok, Newsletter, , , , , , Get my copy, , , , , Trending, , , , , , , , , , , , 1, , Crockpot Chicken Alfredo, , , , , , , , , , , , 2, , Mongolian Beef, , , , , , , , , , , , 3, , Honey Garlic Salmon, , , , , , , , , , , , 4, , Easy Fried Rice, , , , , , , , , , , Featured on, , , , , , , , , , , , , , , , , Download my free book, :, , Get 15 Easy Takeout Recipes to Make at Home!, , Subscribe to get new recipes each week PLUS my FREE eBook:, , , , , , , , , , © 2025 Chef Savvy, Privacy, Collaborate, Contact, Site by cre8d, , , , , , , , , , , , , , , , Our Easter Menu, , , Email address..., , , , First name..., , , , Get The Recipes, , , I'd like to receive more recipes from Chef Savvy., , What I'm Making For Easter!, , (Brunch / Sides / Dinner / Desserts), , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Subscribe to get new recipes each week PLUS my FREE eBook:, , , Close, , , , ,",
        "Tofu Chili": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., TOFU CHILI, SERVES: 4 (1 cup each) Prep Time: 10 min.  Cooking Time: 39 min., CONTAINER EQUIVALENTS (per serving):, ½, 1, ½, 1, 1, VEGAN CONTAINER EQUIVALENTS (per serving):, ½, 1, 1, 1, 1 Tbsp., olive oil, 1 cup, \u0007chopped onion (approx. 11⁄3, medium), 1 cup, \u0007chopped bell pepper (approx. 11⁄3, medium), 4 cloves, garlic, finely chopped, 1½ cups, \u0007extra-firm organic tofu, drained, , crumbled, 2 Tbsp., chili powder, 2 tsp., ground cumin, 2 tsp., \u0007ground smoked paprika, 1 tsp., \u0007sea salt (or Himalayan salt), ½ tsp., \u0007ground cayenne pepper, ½ tsp., ground black pepper, ¼ tsp., ground allspice, 2 cups, all-natural tomato puree, 1½ cups, \u0007canned black beans, drained, rinsed, 1 cup, light beer, gluten-free, 2 Tbsp., \u0007Worcestershire sauce, vegan, , gluten-free, 2 tsp., \u0007chopped fresh cilantro (for garnish;, optional), 1.\t\t Heat a large pot over medium heat; add oil and heat until fragrant., 2.\t\t Add onion, bell pepper, and garlic and cook, stirring frequently, until onion, is translucent, approximately 3 to 5 minutes., 3.\t\t Add tofu, chili powder, cumin, paprika, salt, cayenne pepper, black pepper, , and allspice. Turn heat to medium-high and cook until tofu is lightly, browned and spices smell toasty, about 2 to 3 minutes., 4.\t\t Add tomato puree, beans, beer, and Worcestershire sauce. Bring to a, simmer and cook for 30 minutes, or until slightly reduced and thickened., 5.\t\t Divide evenly among four serving bowls. Top each with ½ tsp. cilantro, (if desired)., 6.\t\t Serve immediately, or store refrigerated in an airtight container for up, to 5 days., \u0007RECIPE NOTE:, , This is a spicy recipe. To make it less spicy cut the cayenne pepper in half, or leave it out., NUTRITIONAL INFORMATION (per serving): Calories: 298  Total Fat: 10 g  Saturated Fat: 0.5 g  Cholesterol: 0 mg  Sodium: 268 mg, Carbohydrates: 37 g  Fiber: 10 g  Sugars: 9 g  Protein: 18 g, Instructions: ",
        "Butternut Squash Stew": "Ingredients: , I decided to make up my own creation using black beans and butternut squash because I really wanted to put those two things together. I mixed two fall soup/stew staples (butternut squash and black beans) and came up with a tasty recipe that marries the flavors of the two classics. This butternut squash black bean stew is so good and filling!, , This healthy winter squash stew is just what you need when the weather turns cool. The recipe is vegan, gluten free, and filled with warm spices to keep you cozy on a cold night. However, I love to eat hearty stews year-round, and I’ve recently been using this stew as my lunch. As if it needed another appealing point, this stew comes together in a snap!, , SCROLL TO SEE THE RECIPE CARD AT THE END. BUT BEFORE YOU SCROLL CHECK THE IMPORTANT INFORMATION THAT IS INCLUDED IN THE BLURB., , Also, check out, , How To Cook Canned Black Beans, , , Black Bean, And Millet Salad, , and, Quinoa Veggie Bowl., , , Florida Relocation And Black Bean Butternut Squash Stew, , I just want to update my readers about the latest in my journey. We just moved from Ohio to Florida this past week., , I never dreamed of living in Florida, but I couldn’t be happier about this move!, , It is so gorgeous here; we are surrounded by beautiful lakes and lovely tropical scenery. I’m still pinching myself., , I must say I really enjoy being a missionary’s wife; we get to live in some of the most beautiful countryside., , I will be sharing photos as soon as I’m more settled. Our dog Macho did very well on the long ride, and he was very calm throughout our 13-hour drive., , We stopped part of the way for a night so that it wasn’t too much for my daughter, who drove one of our vehicles., , We are still waiting for May Flower to deliver our belongings, but fortunately, we are staying in a fully furnished home while our future home is being renovated., , Comforting Black Bean Butternut Stew, , Although I miss my friends in Ohio, I’m always excited to make new friends and see what God has in store for us., , My husband loves his new job as manager of a much larger facility for the same organization, my daughter was fortunate to get a job transfer, and Daevyd can’t wait to meet new friends., , I will have to take a little break from soap-making until I’m all settled, but I will continue to share recipes with you. I’m overjoyed on being able to grow tropical fruits and vegetables here. I am eager to begin my garden., In a nearby health food store, I purchased some lovely collard greens that were so vibrant and tender. I added some to this butternut squash and black beans, , This black bean stew reminds me of my, Brazilian Black Bean Stew, , recipe,, Lentil Stew, ,, Yellow Yam Stew, ,, and, Chickpea Stew, , which are so flavorful., , Why Should You Try This Stew?, , , This Black Bean Butternut Squash Stew is so easy, satisfying, and delicious., , It’s an ideal weeknight meal that comes together quickly and packs a lot of flavors., , I love the combo of black beans, butternut squash, and collard greens in this stew because it has such a nice balance of flavors and textures. The stew is thickened with coconut milk and flavored with garlic, cayenne pepper, and Italian seasoning for a nice flavor kick., , It is a healthy, vegetarian dish. Black beans give this stew a lot of protein, vitamins, and minerals without adding many calories. The butternut squash gives it some extra nutrition., , This recipe makes about 6 servings, so it’s great for leftovers too!, , , , , , Coconut Oil:, I use coconut oil. Coconut oil was chosen because of the numerous health benefits it provides. If you don’t have coconut oil, olive or avocado oil will work., , Onion, – Gives flavor to your beans. Yellow, white, or red onions work great in this recipe., , Red Bell Pepper:, Red bell pepper offers a citrusy and sweet flavor. They add beautiful colors. If you want your dish to be visually more appealing, you can use red, yellow, and green peppers., , Garlic:, Garlic is an essential ingredient in almost every savory dish, and the same is the case with this stew. It brings in an intense savory flavor which makes this stew more tasteful. I added 3 cloves for maximum flavor., , Green onion:, You get a grassy yet savory flavor by adding green onion., , Butternut Squash:, Butternut squash is the main ingredient in this stew. Butternut squash, like pumpkin, is a winter vegetable. It has a matte beige exterior and a dark orange inside. Butternut squash is widely available in supermarkets. Make sure to use fresh produce. It was peeled, split in half, deseeded, and chopped equally into ½ inch cubes., , Black beans, : You can use cans of black beans or dried ones. Sort through the debris and discard any broken dry black beans. Soak black beans for eight hours or overnight in water after rinsing. The next day, drain the water from the pot, but keep the black beans there and top them off with fresh water, approximately an inch above the beans’ surface. Bring it to a boil, then reduce the flame to low heat and let it simmer for about 40 minutes. Alternatively, , make Instant Pot Black Beans, ., , Tender collard greens:, Kale would be an excellent substitute for the collard greens– or if you can’t eat kale for any reason, try a handful of spinach instead!, , Coconut Milk, – Coconut milk is an essential component of this stew and many other Jamaican dishes. Coconut milk gives a creamy texture to this stew. You can substitute coconut milk with unsweetened soymilk or any other plant-based milk., , , The Seasonings, , , Italian seasoning:, Italian seasoning is a dried herb blend that gives this stew taste as well as aroma., , Thyme, – A must ingredient for this black bean butternut squash stew. Gives a lovely earthy flavor. If you do not have fresh thyme, you can use ½ teaspoon of dried thyme instead., , Vegetable Broth:, You can use any broth you have on hand and even make your own with vegetable peelings. If you are not vegan, you can use beef or chicken broth for a more rich and deep flavor. You can use water if you don’t have any broth on hand., , Vegan bouillon cubes:, These cubes are magical. They are made from vegetable stock and have a savory umami flavor. Adding bouillons means you don’t have to worry about adjusting the flavors of this stew. It is a shortcut to perfect taste. I used Edward & Son’s Not-Chick’n Bouillon Cubes., , Cayenne pepper:, I have used cayenne pepper to get a bit of heat from this stew. You can, however, use scotch bonnet pepper or paprika powder as per your liking., , Allspice:, This spice blend adds aroma and flavor to the stew., , , How To Make Black Bean Butternut Squash Stew?, , Making black bean butternut squash stew is quite simple and easy. But the results were simply amazing, a perfect blend of sweet, spicy, and just full of flavor., , , Heat oil in a large pot over medium-high heat. Cook onion, garlic, bell pepper, and green onions., , Add butternut squash, black beans, Italian seasoning, and thyme, and stir to coat. Stir in coconut milk and vegetable broth. Bouillon cube, allspice, and cayenne pepper and bring to a boil, then reduce heat to simmer for 20 minutes., , Stir in greens and cook for about 4 minutes., , Serve warm, and enjoy!, , , Serving suggestions, , It’s hearty enough to serve as a main dish on its own. However, this Black Bean Butternut Squash Stew would be deliciously served over, brown rice, or, quinoa, or my, Cauliflower Rice, Recipe, which is another favorite side dish option around here!, , Serve with fluffy and buttery, vegan mashed potatoes, ., , Delicious when served with, gluten-free garlic knots, ., , Recipe Notes:, , , Check out the video on, How To Peel And Chop Butternut Squash, ., , I added coconut milk and used a pinch of allspice for a more tropical twist., , I called it a stew, but it’s slightly different from, say, a typical chili and the consistency is much thicker than a soup., , It’s super versatile, so it works well with pinto or kidney beans if you don’t have black beans., , You can also add a nice kick from the jalapeño pepper., , When purchasing butternut squash, ensure that it is firm to the touch. It should be neither too stiff nor too soft. The skin should also be matte. Make sure the vegetable doesn’t have any dark patches., , , , Frequently Asked Questions:, , Are Black Beans Healthy?, , Black beans have been and still are the staple of many Latin-American diets, and these frijoles negros have been the fuel source for generations of farmers., , It comes as no surprise that black beans have been continuously eaten in these cultures because it is an amazing, nutritiously compact food. In only a cup of black beans, there are 15 grams each of protein and fiber. This isn’t the first time I’ve extolled the virtues of foods that combine fiber and protein., , , A well-balanced diet with protein and fiber will keep you full and energized, making sure your body can function while keeping you from overeating. Beans of any kind, but specifically black beans, are such good food for anyone wanting to healthily maintain or lose weight, or stay away from “empty calories.”, , A particular feature of black beans is resistant starch, which is a type of indigestible fiber that passes through the small intestine without being turned into sugar, perfect for people with diabetes who need to keep their blood sugar under control., , Black beans’ vitamin and mineral content hasn’t yet been mentioned, and it can’t be missed. Black beans have large amounts of thiamine, iron, magnesium, and folate, all vitamins and minerals that many are deficient in and take supplements for., , , Is Butternut Squash Healthy?, , Yes! Butternut squash is a wellspring of fiber, vitamins, minerals, and antioxidants. This is low in calories but high in vitamins A, C, B, potassium, and magnesium. All of which provide different health benefits., , Antioxidants help prevent or decrease cellular damage and inflammation, lowering your risk of developing various chronic diseases., , , According to some research, diets rich in the antioxidants inherent in butternut squash may help, reduce the risk of some cancers, . A, meta-analysis of 18 research, found that a high antioxidant intake (having vitamins C and B-carotene) was linked to a lower risk of pancreatic cancer., , Butternut squash’s antioxidants may also, protect against mental decline, . A, , 13-year study, examined the relationship between carotenoid consumption and cognitive performance. The findings reveal a correlation between the carotenoid-rich dietary pattern and the maintenance of cognitive function during aging., , This has also been linked to a, lower risk of heart disease, due to its ability to control blood pressure and reduce inflammation. According to, research, ,, Carotenoids’ antioxidant and anti-inflammatory properties may help to protect against heart disease risks such as inflammatory indicators, high cholesterol, obesity, and hypertension., , Diets high in fiber may, help people lose weight, over time. It is a source of both soluble and insoluble fiber. Soluble fiber, in particular, has been linked to, fat loss, and has been demonstrated to suppress appetite, which is imperative when trying to regulate your calorie intake., , , How to Store Leftover Black Bean Butternut Squash Stew?, , This stew can be refrigerated for up to 5 days if stored in an airtight container. It can be kept for a longer period of time in the freezer, but when thawed, the coconut milk may get curdled., , If you’re making a large amount to freeze, you may skip the coconut milk and use water instead. While reheating, add the coconut milk. Then serve with boiled rice or avocado slices., , , Other Delicious Black Bean Recipes To Try:, , , Best Black Bean Burritos, , Easy Black Bean Tacos, , Vegan Black Bean Nachos, , Black Bean Hummus, , Black Bean Enchiladas, , Butternut Squash Recipes, , , , , If you like and enjoy this recipe, please leave a comment to let me know your feedback., , If you enjoyed this post about the Black Bean Butternut Squash Stew and would love to see more, join me on, Youtube, ,, Instagram, ,, Facebook, &, Twitter, !, , Join Our, Facebook Juice Support Group, , Love seasonal recipes? Don’t miss out on my special offer for a limited time!, Grab all three of my cookbooks for just $19.99!, They’re filled with delicious, healthy dishes that are perfect for every season. Hurry and get your set before the offer ends!, , , , , , , , , , , , , , , Want to Save This Recipe?, , Enter your email & I’ll send it to your inbox., Plus, get great new recipes from me every week!, , , Save Recipe, Email, SAVE, , , By submitting this form, you consent to receive emails from Healthier Steps., , , , , , , Black Bean Butternut Squash Stew, , , Black bean with sweet butternut squash and collard greens make this healthy stew so hearty and comforting!, , , 4.98, from, 190, votes, , , Print, , Pin, , Rate, , , Course:, Entrée, Lunch, Main Course, Cuisine:, American, Keyword:, Black Bean Butternut Squash Stew, , Prep Time:, 15, minutes, , minutes, Cook Time:, 25, minutes, , minutes, , Servings:, 4, , servings, , Calories:, 200, kcal, , , 1, , tablespoon, , coconut oil, 1, , medium onion, , chopped, 1/2, , medium red bell pepper, , diced, 3, , cloves, , garlic, , minced, 2, , green onions, , chopped, 2, , cups, , butternut squash, , peeled, and cut into 1/2 inch cubes, 1, , 15-ounce can black beans, drained and rinsed, 1/2, , teaspoon, , Italian seasoning, 2, , sprigs thyme, 1, , cup, , coconut milk, 1, , cup, , vegetable broth, 1, , vegan bouillon, , (I used Edward & Son’s Not-Chick’n Bouillon Cubes), 1, , cup, , tender collard greens, , or kale or spinach, chopped (optional), 1/4, , teaspoon, , Cayenne pepper, Pinch, , of allspice, , (optional),  Instructions: Heat oil in a large pot over medium-high heat. Add onions and bell peppers cook and cook until onions are soft, about 3 minutes. Stir in garlic and spring onion and cook for 1 minute, Add butternut squash, black beans, Italian Seasoning, thyme and stir to coat. Stir in coconut milk, vegetable broth. bouillon cube, allspice, cayenne pepper and bring to a boil, then reduce heat to simmer for 20 minutes., Stir in leafy greens and cook for about 4 minutes, delicious served with brown rice and avocado., , , Nutrition, Calories:, 200, kcal, |, Carbohydrates:, 16, g, |, Protein:, 3, g, |, Fat:, 16, g, |, Saturated Fat:, 14, g, |, Polyunsaturated Fat:, 0.3, g, |, Monounsaturated Fat:, 1, g, |, Cholesterol:, 0.03, mg, |, Sodium:, 315, mg, |, Potassium:, 498, mg, |, Fiber:, 3, g, |, Sugar:, 4, g, |, Vitamin A:, 8624, IU, |, Vitamin C:, 42, mg, |, Calcium:, 87, mg, |, Iron:, 3, mg, , , , , , , , , , Michelle Blackwood, RN, , , Hi, I’m Michelle, I’m the voice, content creator and photographer behind Healthier Steps. I share vegan and gluten-free recipes because of past health issues. My goal is to help you make healthier choices and show you how healthy eating is easy and delicious., , , , , Facebook, , , , , X, , , , , Instagram, , , , , Linkedin, , , , , Pinterest, , , , , , , , Post navigation, , Previous, , Previous, Jamaican Festival Recipe, Next, Continue, , Star Fruit Juice, , , , , , Similar Posts, , , , , , , , , , , , , , BBQ Cauliflower Wings, , , , , , , , , , , , , , , How To Freeze Brussels Sprouts?, , , , , , , , , , , , , , , Vegan Pumpkin Soup (Pureed), , , , , , , , , , , , , , , Miso Hummus, , , , , , , , , , , , , , , Vegan Fudge, , , , , , , , , , , , , , , Cassava Dumplings, , , , , , , , , , , , , , 529 Comments, , , Comments navigation, , Older comments, , , , , , , , , PK, , says:, , , , January 13, 2025 at 4:31 pm, , , , , Made this yesterday. It was delicious over brown rice. A great comfort food dish., , , Reply, , , , , , , , , Michelle Blackwood, RN, , says:, , , , January 14, 2025 at 12:53 pm, , , , , PK, I’m so happy you enjoyed it and found it comforting. Thank you very much for sharing your feedback with us., , , Reply, , , , , , , , , , , Maritza, , says:, , , , November 29, 2024 at 7:00 pm, , , , , Absolutely delicious. Family told me to put this one on rotation!, , , Reply, , , , , , , , , Susan Howard, , says:, , , , October 16, 2024 at 7:12 pm, , , , , Excellent. Colorful, easy to make, healthy, flavorful. Can’t wait to make again., , , Reply, , , , , , , , , Michelle Blackwood, RN, , says:, , , , November 1, 2024 at 11:11 am, , , , , Susan, I’m so happy you enjoyed it., , , Reply, , , , , , , , , , , Kristine S, , says:, , , , October 15, 2024 at 5:46 am, , , , , This stew has so much flavor!  It’s perfect any time of the year.  I’m glad I made it and I can’t wait to serve it to friends., , , Reply, , , , , , , , , Michelle Blackwood, RN, , says:, , , , November 1, 2024 at 11:11 am, , , , , Kristine, I appreciate your feedback. I’m so happy you enjoyed it. Thank you., , , Reply, , , , , , , , , , , Sheryl, , says:, , , , October 14, 2024 at 11:04 am, , , , , I have made this so many times and it’s always amazing. I do use my immersion blender to make it all smooth and creamy…a soup instead of a stew. So good and perfect on a brisk fall day., , , Reply, , , , , , , , , Michelle Blackwood, RN, , says:, , , , October 14, 2024 at 2:10 pm, , , , , Sheryl, I’m so happy you love it. I love how you made it smooth and creamy, great tip thank you!, , , Reply, , , , , , , , Comments navigation, , Older comments, , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , , , , , , , , , , , , , , , , , , Hi, I'm Michelle, , , , Registered Nurse, Content Creator + Visionary behind Healthier Steps, and devoted wife + mom to 2 amazing kids. I share gluten-free + plant-based recipes that equal parts healthy and full of flavor., , , , About Michelle, , , , , , , , , , , , , , , , , Reader Favorites, , , , , , , , , , Black Bean Salad with Creamy Avocado Cilantro Dressing, , , , , , , , , , , , , , Creamy Broccoli Salad, , , , , , , , , , , , , , Roasted Brussels Sprouts And Carrots, , , , , , , , , , , , , , Jamaican Jerk Butternut Squash Fries, , , , , , , , , , , , , , , , , , , , , , , , , , , , Let's Connect, , , , , Instagram, , , , , YouTube, , , , , Facebook, , , , , Pinterest, , , , , , , Recipes, , , Recipe Index, Ethnic Cuisine, By Course, Terms of Use, , , , , Explore, , , About, Contact, Shop, Privacy Policy, , , , , , , , , , , , , Delicious Freebies, , , Want free recipes delivered straight to your inbox? Click the button below now., , , Grab Your Freebies!, , , , , , , , , , , Featured In, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Search, , , , , , , , , , , , , , , , , , , © 2025 Healthier Steps • Custom Site Design by, Jennifer Holt Designs, ♡, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Search for:, , , , , Search, , , , , , Recipe Index, , Ethnic Cuisine, Toggle child menu, Expand, , , , Jamaican, , Caribbean, , Indian, , Mediterranean, , African, , Mexican, , Asian, , Italian, , Soul Food, , , , Recipes by Course, Toggle child menu, Expand, , , , Breakfast, , Appetizer, , Salad, , Soups and Stews, , Side Dish, , Entrée, , Dessert, , Snack, , Condiments, , Beverage, , , , , , , , , Instagram, , Facebook, , Pinterest, , YouTube, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Cheesy Potato Taco Casserole": "Ingredients:  Instructions: ",
        "Corn Casserole": "Ingredients: 100% gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case. , Instructions: ",
        "Vegan Chickpea Pot Pie": "Ingredients: then, simmer, , whisking constantly, until thickened. Set aside., , Melt, the butter or olive oil in a large sauté pan, then, sauté, , Stir, in the thickened sauce until evenly distributed., , Fill, the par-baked crust with the pot pie filling, then lay the top crust over the filling., Crimp, the two pie edges together and cut an “X” in the center of the pie dough., , Bake, , lightly tented with foil, until the crust is golden brown., , Cool, for 5 minutes, then, slice, and, serve, warm, as desired., , , , , Caitlin’s Cooking Tips, , , Use a rich and creamy plant-based milk., Not all plant-based milks are made equal. As much as I love the convenience of store-bought non-dairy milk, they are often thin and lacking in flavor. For the best creamy filling, use a rich and creamy, homemade milk, or a store-bought soy milk or canned coconut milk., , Thaw your pie crust in advance., If you are using a store-bought, frozen pie crust, make sure to thaw it in the refrigerator until soft and easy to roll out. It is easiest to do this the night before, but typically can thaw in 4-6 hours., , The longer it cools, the easier it is to slice., You can slice after just 5 minutes, but if you wait longer (15-20 minutes), the filling will continue to thicken and make it easier to cut nice slices for serving. This can be ideal when hosting or serving this pot pie for special occasions., , , , , Serving Suggestions, , I love serving thick, warm slices of this vegan pot pie as a hearty main dish. It’s the perfect weeknight dish to complete simpler sides such as, Kale & Cranberry Salad, , , Winter Kale Salad with Pomegranate Vinaigrette, , or a, Fall Roasted Vegetable Casserole, ., , Or, when serving this vegan pot pie as a holiday main, browse my, 60+ Vegan & Gluten-Free Thanksgiving Guide, and make a complete meal the whole family will love., , If you’re looking for more cozy vegan recipes, you’ll also love this, One Pot Vegan Mushroom Stroganoff, , this, Easy Vegan Chili, , and this, Marvelous Mushroom Pot Pie, ., , , US Customary, Metric, , 1x, 2x, 3x, 2, , layers, , pie crust or 1 layer puff pastry,, , homemade, or store-bought; see notes, For the Sauce:, 2, , cups, , unsweetened non-dairy milk, 2, , tablespoons, , nutritional yeast, 2, , tablespoons, , chickpea flour*, 1, , teaspoon, , kosher salt, , plus more to taste, For the Chickpea Filling:, 1, , tablespoon, , vegan butter or oil, 1/2, , yellow onion, , fine dice, 2, , sticks celery, , fine dice, 1/2, , cup, , carrots, , fine dice, 3-5, , cloves, , garlic, , minced, 1, , teaspoon, , fresh thyme leaves, 1/2, , teaspoon, , smoked paprika, 1/2, , teaspoon, , black pepper, , plus more to taste, 2/3, , cup, , gold potatoes, , peeled and diced, 2/3, , cup, , frozen peas, , thawed, 1 1/2, , cup, , chickpeas, , drain and rinse if using canned, , , , , , FREE Guide: 5 Secrets to Fast & Delicious Vegan Dinners, My best tips on how to save time while still eating healthy and tasty food., Please enable JavaScript in your browser to complete this form., First name, *, Email, *, Yes, I want this!, , , , , , , Recipes, , About, , Shop, , Contact, , , , , , © 2025 From My Bowl. All rights reserved., Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , Air Fryer, , Grill, , Instant Pot, , No-Bake, , Oven, , Slow Cooker, , Stovetop, , , , , , Dinner, , One Pot, , Dump & Bake, , Soups, , Dessert, , About, , Shop, , Cookbook, , SUBSCRIBE, , , , Search for, , , , , , , , Search for, , , , , , Home, , /, , RECIPES, , /, , Main Dishes, , /, , Vegan Pot Pie with Chickpeas, Vegan Pot Pie with Chickpeas, by, , Caitlin Shoemaker, updated on, , October 4, 2024, GF, Gluten Free, GR, Grain Free, OF, Oil Free, V, Vegan, 4.98, from, 101, votes, Jump to Recipe, Rate This Recipe, Pin Recipe, Disclosure: This post may contain affiliate links. I may earn a small commission for my endorsement, recommendation, testimonial, and/or link to any products or services from this website., , , This Vegan Pot Pie combines a flaky pie crust, heart-healthy chickpeas, and a creamy vegetable and potato filling for a mouth-watering main dish everyone will go back for seconds of. Vegan, Gluten-Free, Oil-Free option., , Hearty and cozy, this, Vegan Pot Pie, is simple enough to serve on weeknights, yet impressive enough to replace a meaty main for a special occasion like Thanksgiving or Christmas. It’s made with a, simple pie crust, that’s filled with protein-rich chickpeas, classic veggies, and a homemade cream sauce that’s thick and creamy. It’s the perfect satisfying main course for chilly and rainy days, but is surprisingly packed with veggies, so it won’t weigh you down too much!, , Table of Contents, A Healthier, Cozy Pot Pie, What You Need for Vegan Pot Pie, How to Make Vegan Pot Pie, Serving Suggestions, Substitutions and Variations, Yoast FAQs, Vegan Pot Pie with Chickpeas Recipe, , , , A Healthier, Cozy Pot Pie, , Is it just me, or is Pot Pie pretty much the ultimate comfort food? It’s pretty hard to beat a, buttery, flaky crust, filled with a, creamy, , , hearty, , and, flavorful, filling. It’s a perfect cozy day food to snuggle up with or share with your loved ones during the holiday season. This recipe is my take on a vegan chicken pot pie; with just a few simple swaps, we can make a vegetable pot pie that’s made entirely from plants! Not only that, but it’s just as yummy and cozy as the ones I remember eating in my childhood., , , What You Need for Vegan Pot Pie, , There are just 4 main components when it comes to making a great pot pie:, , , , Pie crust:, I opted to use my, Vegan Pie Crust Recipe, , but feel free to use another homemade pie crust or your favorite store-bought brand. If making my homemade recipe, make sure to, double the recipe, – one crust for the bottom, and one for the top., , Creamy sauce:, Traditional pot pies are typically made with heavy cream or canned soups. Instead, we’re making a healthy, homemade sauce from non-dairy milk, nutritional yeast, and chickpea flour., , Fresh veggies:, I like to keep things classic and use celery, peas, carrots, and gold potatoes for a nice and hearty bite. If you’re short on time or prefer to make things even easier, use a frozen blend of mixed vegetables with green beans., , Seasonings:, Most of the nostalgic flavor and aroma in a classic pot pie can be attributed to the spices and seasoning. All that’s required for this mouth-watering effect is freshly chopped thyme, smoked paprika, and freshly cracked black pepper., , , How to Make Vegan Pot Pie, , , , , Par-bake, , Whisk, , Leftover pot pie will keep for up to 5 days in the refrigerator. When storing, tightly cover the pot pie with a layer of plastic wrap or aluminum foil, or transfer slices to an airtight container. Leftovers reheat best in the toaster oven or oven, covered with foil, but can be reheated in a pinch., , Freezing vegetarian pot pie is also possible, but is difficult to do without the crust becoming soggy and/or taking forever to bake from frozen. Instead, I would recommend freezing the pot pie filling and crust separately for up to 3 months. Then, thaw the two components separately in the refrigerator, assemble, and bake., , , Substitutions and Variations, , , Gluten-free option:, Make this vegetable pot pie using my, 3 Ingredient Pie Crust recipe, . It’s naturally vegan, gluten-free, and grain-free., , Oil-free option:, Replace the melted butter with water or vegetable broth and use an oil-free pie crust. Again, , 3-Ingredient Pie Crust, would work well!, , Chickpea flour substitution:, Replace the chickpea flour with, all-purpose flour, or brown rice flour, if gluten-free., , , , , , Yoast FAQs, , Which store-bought pie crusts are vegan?, , It can be tricky to know which store-bought pie crusts are made without animal products, but thankfully, most of the widely available options are vegan friendly., Marie Callender’s pie crusts, are one of the most popular, widely available options., , , Can I make this pot pie without a pie crust?, , While pot pie is traditionally baked in a flaky pie crust, it can be enjoyed without crust with a side of vegan mashed potatoes (very similar to, Vegan Shepherd’s Pie, ), flaky biscuits, or a store-bought puff pastry crust (use my, Marvelous Mushroom Pot Pie, for Inspiration!). Or, make my quick and easy, No-Boil Chickpea Noodle Casserole, for a fun twist on the classic recipe., , , What replaces chicken in vegan pot pie?, , In this particular recipe, the classic chicken is replaced with wholesome, plant-based chickpeas. They’re a great source of protein and have just the right hearty texture. Some readers have also shared success making this pot pie using hydrated soy curls. If you’re an experienced home-cook, feel free to experiment and find your favorite vegan protein alternative., , , I am preparing this vegan pot pie for a holiday. Can I make it in advance?, , Both the pie crust and chickpea pot pie filling can be prepared up to one day in advance, but should be refrigerated separately until ready to assemble. Then, when ready to serve, fill the pie crust with the easy pot pie filling, top with the top layer of pie crust, and bake as, , , , , , , , , , , , Enjoy! If you make this recipe and decide to share it on, Facebook, or, Instagram, , don’t forget to tag me, @FromMyBowl, + #FromMyBowl! I would also love it if you could leave a comment below with a recipe rating! Thank you for the support 😊, , , , , Vegan Pot Pie with Chickpeas, , 4.98, from, 101, votes, , , , , , Prep Time, 15, minutes, , minutes, Cook Time, 45, minutes, , minutes, Total Time, 1, hour, , hour, , , Servings, 8, , Servings, , , , , , , This Vegan Pot Pie combines a flaky pie crust, heart-healthy chickpeas, and a creamy vegetable and potato filling for a mouth-watering main dish everyone will go back for seconds of. Vegan, Gluten-Free, Oil-Free option., , Rate Recipe, Pin Recipe, Print Recipe, , , , , , , , , , Prep:, Make the Sauce:, Whisk the flour, nutritional yeast, salt, and milk together in a small saucepan over medium-high heat. Bring the mixture to a simmer, then reduce the heat to medium and simmer for 3 minutes, whisking constantly, until the sauce has thickened. Set aside; the sauce will thicken further., Aromatics:, Melt the butter in a large sauté pan with a lid over medium heat. Add the onion, celery, and carrot and sauté for 3 minutes, until the onion is translucent. Add the garlic, thyme, smoked paprika, and black pepper; sauté for an additional 2 minutes, to toast the spices., Cook the Potatoes:, Add the potatoes to the pan and mix well, then add 1/4 cup (60 ml) water to the pan and cover. Cook for 5 minutes, to steam the potatoes., Make it Saucy:, Uncover the pan and add the chickpeas and peas. Mix well, then turn off the heat. Add in the prepared sauce and mix until evenly distributed to complete the pie filling., Assemble:, then top with the remaining crust. Use a fork to crimp the two pie edges together, then use a sharp knife to cut a “X” in the center of the pie dough to allow for ventilation., Bake:, Bake in the middle rack of the oven for 15 minutes. Check on the pie; if if the crust is already golden, loosely tent with foil to prevent burning. Bake for an additional 10-12 minutes, checking for doneness every 5 minutes or so, until the crust is golden brown., Serve:, Let the pie sit for 5 minutes, then slice and serve warm. Store any leftovers in the refrigerator for up to 5 days., , Recipe Video, , , , , , , , , , Recipe Notes, , Pie Crust:, I like to make this, all-butter pie crust, (just use vegan butter!), or you can make my, 3-Ingredient Pie Crust, if you are gluten-free. The GF pie crust burns more easily, so you may need to tent the top of the pie with foil if it starts to get too brown. You can also use your preferred store-bought crust!, , Puff Pastry:, , Chickpea Flour:, Chickpea flour can be replaced with, all-purpose flour, or brown rice flour., , Make-Ahead:, Both the pie crust and chickpea filling can be prepared up to one day in advance; store in the fridge until ready to use., , Gluten-Free:, This recipe is both gluten-free and grain free if made with chickpea flour and my, 3-Ingredient Pie Crust, , , Nutrition, Calories:, 27, kcal, Carbohydrates:, 2, g, Protein:, 2, g, Fat:, 1, g, Saturated Fat:, 0.1, g, Polyunsaturated Fat:, 1, g, Monounsaturated Fat:, 0.2, g, Sodium:, 30, mg, Potassium:, 83, mg, Fiber:, 0.2, g, Sugar:, 1, g, Vitamin A:, 232, IU, Vitamin C:, 4, mg, Calcium:, 83, mg, Iron:, 0.3, mg, , Course:, Main, Oven, Stovetop, Cuisine:, American, , , , Did you make this recipe?, , Tag, @frommybowl, on Instagram and hashtag it, #FromMyBowl, !, , , , , Facebook, Tweet, Pin, , , About the Author, Hey there, I’m Caitlin! I make easy-to-follow, wholesome, and budget-friendly vegan recipes that are mostly gluten-free and refined sugar-free. I’m also an avid yogi, love the great outdoors, am chocolate-obsessed, and enjoy eating almond butter straight off of the spoon., , Learn More, , , , , , FREE GUIDE: 5 Tips for Quick & Easy Vegan Dinners, , Plus, get all of my recipes sent straight to your inbox!, , Please enable JavaScript in your browser to complete this form., First name, *, Email, *, Yes, I want this!, , , , You May Also Like, Diet, Pasta with Peas and Herb Gremolata, One Pot, Gochujang Ramen Casserole, Sheet Pan, Sheet Pan Broccoli Cheddar Quesadillas, Soups & Stews, White Bean Puttanesca, , , , Leave a Comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , Comments, , , , , , , Gabrielle Boilard, , says:, , , , February 3, 2025 at 3:14 pm, , , , , This was delicious!! Me AND my two non-vegetarian roomates loved it ❤️, , I was worried the nutritional yeast would taste too strong for people who aren’t used to it, but it turned out perfectly balanced., , I served it with some roasted beets. Idk if “fits”, but we all liked it., , It took me a while to make this pie though, so I won’t be making it from scratch on a weeknight anymore. (Maybe I just cook slow, though 😂), Next weekend, I will make the dough and filling in advance, freeze it as suggested, and assemble on a weeknight. 😁, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , February 3, 2025 at 7:35 pm, , , , , Thanks for the review Gabrielle! This recipe is a little more time-consuming, so I’d recommend following the make-ahead tips for a weeknight 🙂, , , Reply, , , , , , , , , , Lindsey Durham, , says:, , , , December 15, 2024 at 8:27 pm, , , , , Big hit! Every once & a while I bless my future self by chopping a bunch of veg & freezing. Made this so easy to throw together. Adding this to our winter rotation., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , December 16, 2024 at 2:50 pm, , , , , love that idea!!, , , Reply, , , , , , , , , , Taylor Beam, , says:, , , , October 15, 2024 at 11:17 pm, , , , , Yum yum yum yum! We added red pepper flakes. Thank you for sharing., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , October 17, 2024 at 9:47 am, , , , , So happy you enjoyed!, , , Reply, , , , , , , , , , Aubrey, , says:, , , , October 14, 2024 at 5:42 pm, , , , , This is SO good.  It’s healthy, hearty, and comes together beautifully.  It’s my go-to cozy fall recipe., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , October 17, 2024 at 9:48 am, , , , , So happy you love it, Aubrey!, , , Reply, , , , , , , , , , Barbara Girard, , says:, , , , September 30, 2024 at 12:22 pm, , , , , I’m a private chef to one client. This is super easy and she will love it thanks for the recipe, , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , September 30, 2024 at 1:48 pm, , , , , I’m so glad!, , , Reply, , , , , , , , , , Jessica E., , says:, , , , April 28, 2024 at 8:03 pm, , , , , Trying this recipe tomorrow! Just curious, , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , May 17, 2024 at 10:12 am, , , , , Hi Jessica, you should initially bake the pie without foil and check after 15 minutes. If the crust is already golden brown at that point, then loosely tent it with foil to prevent it from burning and continue baking. If it’s not golden yet, continue baking without foil and check every 5 minutes, tenting with foil only if it starts to brown too much. This ensures the crust gets perfectly golden without burning. Enjoy your pot pie!, , , Reply, , , , , , , , Evan, , says:, , , , October 2, 2024 at 1:17 pm, , , , , How long is a par bake?, , , , , , , , , , Caitlin Shoemaker, , says:, , , , October 4, 2024 at 4:58 pm, , , , , , , , , , , , , , , , , Bunny, , says:, , , , April 7, 2024 at 4:44 pm, , , , , Mouthwatering and comforting 💜☺️, , , Reply, , , , , , , , Emma, , says:, , , , March 16, 2024 at 5:32 pm, , , , , Tried this yesterday for the first time and it was SO GOOD. My non-vegetarian friends even liked it too!, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , March 18, 2024 at 3:44 pm, , , , , Love to hear that! Thanks for the review Emma 🙂, , , Reply, , , , , , , , , , Christine, , says:, , , , February 9, 2024 at 9:38 pm, , , , , Delicious! I am a garlic fanatic and was super tempted to add some but glad I held off as the balance of flavors is perfect without it., I only did a crust on the top because I was feeling lazy but it still turned out great and everything came together in under 30 min!, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , February 12, 2024 at 2:01 pm, , , , , Love the top-only crust hack! Thanks for the review!, , , Reply, , , , , , , , Adria Calnon, , says:, , , , October 14, 2024 at 7:49 pm, , , , , Am i losing my mind or is the step for garlic missing? I just put it in with the celery and carrots! Great recipe!, , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , October 17, 2024 at 9:53 am, , , , , Oops it is! Thank you for flagging this 🙂 So glad you enjoyed!!, , , , , , , , , , , , , Maegan, , says:, , , , February 6, 2024 at 3:07 pm, , , , , So good!, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , February 6, 2024 at 7:52 pm, , , , , Thanks for the review!, , , Reply, , , , , , , , , , Lona, , says:, , , , January 29, 2024 at 4:27 pm, , , , , I made this filling today and froze it in individual 2-cup ramekins for later use. After the filling defrosts I’ll top it with a round of the GF crust and bake it as a one-crust pot pie., , Since I don’t like cooked celery or smoked paprika, I added 2 large, minced garlic cloves, 1 tsp of chopped rosemary, 1 TB of Vegetable Better Than Bouillon, and 2/3 cup of diced turnip along with the potatoes., , It’s delicious! One of my favorite childhood foods (one of the two that Dad made), was SOS from his Navy days. I no longer eat meat BUT I can imagine using the filling instead, to top whole grain toast. I’m so happy I found your recipe., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , January 30, 2024 at 9:31 am, , , , , Thank you so much for the review, Lona! We’re happy you found the recipe, too, and enjoyed it!, , , Reply, , , , , , , , , , Annie, , says:, , , , January 22, 2024 at 7:47 pm, , , , , Absolutely delicious! It’s become a winter staple for me :). I don’t even mind eating it multiple days in a row! I live alone so it makes a ton of leftovers and it reheats well., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , January 23, 2024 at 9:07 am, , , , , Thank you, Annie!, , , Reply, , , , , , , , , , Rachel Drobnak, , says:, , , , January 21, 2024 at 11:03 am, , , , , Overall a great easy soup recipe and very customizable – I used leftover macaroni noodles. The liquid level was perfect! Sometimes lentil soups soak up too much liquid but this one has been ideal., , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , February 5, 2024 at 4:35 pm, , , , , Thanks Rachel!, , , Reply, , , , , , , , , , MF, , says:, , , , January 6, 2024 at 11:44 am, , , , , Quick, easy, very tasty.  Definitely will make this again., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , January 8, 2024 at 1:17 pm, , , , , Glad you liked it, Morah!, , , Reply, , , , , , , , , , Émilie Bouchard, , says:, , , , January 2, 2024 at 12:25 pm, , , , , Good quick, one pot, healthy breakfast 👍🏻, , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , January 3, 2024 at 12:55 pm, , , , , Thank you, Émilie!, , , Reply, , , , , , , , , , Andrew Bauld, , says:, , , , December 6, 2023 at 2:06 am, , , , , I have only just finished making this pie…it is cooling on my kitchen bench. Looks great, smells great, I’ve tried the extra filling that was left over…nice. I added a bit of sriracha to the bit that I tried, and THAT was good, too., I’ll take the advice below and make some gravy just in case. I’d send a picture, but I’m not on instagram., , , Reply, , , , , , , , , Team @ From My Bowl, , says:, , , , December 6, 2023 at 7:45 am, , , , , Glad you liked it, Andrew!, , , Reply, , , , , , , , , , Barbara H, , says:, , , , December 4, 2023 at 11:14 am, , , , , I made this a few days ago and it was great!  I used Marie Callander’s frozen pie shells rather than making them from scratch because I am not a baker, and it still turned out perfect.  I did add some poultry seasoning (which is accidentally vegan) to the sauce to mimic the flavors from childhood, and it was a hit.  For the leftovers, I whipped up a quick gravy as the filling had seized up a little – and who ever said no to more gravy?  It was a little time-consuming to make, but well worth it.  I can see this being on repeat all winter long.  Cheers!, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , December 4, 2023 at 7:35 pm, , , , , Thank you so much, Barbara! Never a thing as too much gravy 🙂, , , Reply, , , , , , , , , , Cazzy, , says:, , , , December 1, 2023 at 8:35 am, , , , , Delicious, easy, and incredibly popular with my family! I made this with Caitlin’s 3 ingredient pie crust and doubled that recipe for the top layer. I prebaked only the bottom crust and let the top bake with the contents of the pie. So easy and impressive!, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , December 1, 2023 at 3:13 pm, , , , , Thanks for the review, Cazzy!, , , Reply, , , , , , , , , , Monica, , says:, , , , November 30, 2023 at 9:50 pm, , , , , I love love love this recipe! I actually made the pot pie for Friendsgiving! It was my first time making any type of pie, so it was a little intimidating, , , Reply, , , , , , , , , Caitlin Shoemaker, , says:, , , , December 1, 2023 at 3:13 pm, , , , , Thank you so much, Monica! I’m so glad everyone enjoyed it!, , , Reply, , , , , , , Comment navigation, Older Comments, , , , , Hey there, I’m Caitlin!, , I make easy-to-follow, wholesome, and budget-friendly vegan recipes that are mostly gluten-free and refined sugar-free. I’m also an avid yogi, love the great outdoors, am chocolate-obsessed, and enjoy eating almond butter straight off of the spoon., , Learn More, , , Popular Recipes, Healthy Vegan Banana Bread | Gluten-Free, Vegan Mushroom Stroganoff (One Pot), Buffalo Cauliflower & Chickpea Casserole (Dump-and-Bake), Vegan Pot Pie with Chickpeas",
        "Vegan Holiday Roast": "Ingredients: , , , , , Olive oil, - you can also use avocado, sunflower, grapeseed, etc., , Onion, - I used a yellow onion, but you can use white if that's what you have. Shallots will work nicely, too., , White mushrooms, - you can use any type of mushrooms, just note that the brown mushrooms will create a slightly darker roast., , Garlic, - lots of fresh garlic will provide wonderful flavor., , Soy sauce, - it adds umami flavor. You can also use tamari or coconut aminos., , Cannellini beans, - any white beans will work such as great northern or navy beans., , Nutritional yeast, - adds lots of umami flavor., , Better Than Bouillon - no chicken base, - yields tons of savory flavor and I highly recommend it, but if you can't find the 'no chicken base', you can use their regular vegetable broth. This will darken the loaf slightly and will taste a little different, but it will still be delicious., , Vegan Worcestershire sauce, - If you can't find it, you can use barbeque sauce or vegan steak sauce. You can also use a combination of 2 teaspoons of ketchup, 1.5 teaspoons of balsamic vinegar, and 1 teaspoon of low-sodium soy sauce., , Seasoning, - granulated garlic, granulated onion, rosemary, thyme, ground sage, smoked paprika, ground white pepper. Feel free to switch it up here, but don't omit too much or it won't be as flavorful., , Vital wheat gluten, - this is essential for the recipe and cannot be substituted with anything else., , Water, , , , How to make a Vegan Holiday Roast, , Here are step-by-step photos to show you the entire process. It's easy!, , , , , Sauté the onion, in oil over medium heat until translucent then add garlic and sauté until fragrant., , Add the mushrooms, and cook until they have released their water, have reduced in size, and are lightly golden. Pour in the soy sauce and stir into the mushrooms. Remove from heat and let cool for a few minutes., , To a food processor, , add 2 cups of mushroom/onion mixture, scraping down sides as needed until everything is broken down and combined., , To a large mixing bowl, , add the vital wheat gluten and the mixture from the food processor. Stir until it just starts to come together (about 30-60 seconds)., , , , , Using your hands keep combining, , sweeping up all the vital wheat gluten in the bowl (about 30-60 seconds). Now knead for 5 minutes. The dough should be thick, slightly elastic, and somewhat fibrous looking., , Let the dough rest for 5 minute, s then knead for 30-60 seconds and shape the dough into a loaf shape about 8 inches long and 3.5\" inches wide., , Roll the loaf in a piece of parchment paper, , then roll in a piece of foil that's about 20\" long, and twist the ends like a candy wrapper, securing in place. Bake for 80 minutes, flipping halfway through. Now remove from oven and allow the roast to sit undisturbed for 20 minutes. Remove from foil and parchment. You can slice and serve now OR prepare the loaf for glazing., , Preheat your oven broiler to the low setting., In a small bowl, combine the brown sugar, oil, and soy sauce until the sugar has dissolved. Now, place the loaf back in the roasting pan and brush the top and sides with the glaze. Broil for 2-3 minutes until you see the glaze start to caramelize. Now brush one more layer on the top and sides and broil for another 2-3 minutes, watching carefully to prevent burning., , , Success Tips, , , It's best to dry-brush the mushrooms, instead of rinsing them. They absorb a lot of water and this can make it difficult to brown them., , US Customary, Metric, ▢, 3, , tablespoons, , olive oil, , , divided, ▢, 1, , medium, , onion, , (about 1 cup), ▢, 16, , ounces, , white mushrooms, , , chopped (see note #1), ▢, 5, , cloves, , garlic, , , minced, ▢, 1 ½, , tablespoons, , soy sauce, , , low sodium, ▢, ½, , cup, , water, ▢, ½, , cup, , cannellini beans, , , rinsed and drained (or any white beans), ▢, ¼, , cup, , nutritional yeast, ▢, 2, , tablespoons, , Better Than Bouillon - no chicken base, , (see note #2), ▢, 1 ½, , tablespoons, , vegan Worcestershire sauce, , (see note #3), ▢, 1 ½, , teaspoons, , granulated garlic, ▢, 1 ½, , teaspoons, , granulated onion, ▢, 1 ½, , teaspoons, , dried rosemary, ▢, 1 ½, , teaspoons, , dried thyme, ▢, 1, , teaspoon, , ground sage, ▢, 1, , teaspoon, , smoked paprika, , (optional), ▢, ¼, , teaspoon, , ground white pepper, , (sub black pepper), ▢, 280, , grams, , vital wheat gluten, , (2 ¼ cups) *see note #4 & #5, Glaze (optional), ▢, 1, , tablespoon, , soy sauce, , , low sodium, ▢, 1, , tablespoon, , avocado oil, , or any oil, ▢, 1, , tablespoon, , light brown sugar, , (sub maple or agave), , Recommended Equipment, Food Processor, Large Baking Dish, Large Skillet, Large Mixing Bowl, , Cook Mode, Prevent your screen from going dark,  Instructions: , For an accurate measurement, , you can weigh the vital wheat gluten to get exactly 280 grams. If you don't have a kitchen scale, don’t scoop the VWG with a measuring cup directly from the container. Instead, aerate it first, then scoop it out of your container with a spoon and then into a measuring cup. Don’t pack or tap the cup. After filling, lightly sweep a butter knife across the top to remove the excess., , Kneading is very important, and should be done for 5 minutes. Any less and the loaf can turn out spongy. Also, if you over knead, the loaf can turn out tough and rubbery. If you feel you may have over kneaded, you can let the dough rest for 15 minutes before shaping it into a loaf., , The loaf should be wrapped snugly, but not super tight or it won't expand., , , What should I serve with a Vegan Holiday Roast?, , You can serve just about anything with this delicious seitan roast, but here are some of my faves:, , , Mashed Potatoes & Mushroom Gravy, , Sautéed Green Beans, , Apple Cranberry Sauce, , A Festive Salad, , Baked Vegan Mac and Cheese, , Roasted Brussels Sprouts, , Vegan Cornbread, , , The best way to reheat leftovers, , Preheat your oven to 350 °F (177 °C). Place the portion you'll be eating in a covered baking dish. It will get too dry if you leave it uncovered. You can top it with some gravy for extra moisture. Cook until heated throughout., , , I'd love to hear from you, , If you make this recipe, let me know what you think by ★ star rating it and leaving a comment below. It would really make my day. You can also follow me on Instagram and share your creation with me. Just tag me @veganhuggs and hashtag #veganhuggs so I don’t miss it., , Recipe, , , , Print Recipe, , Pin Recipe, , Rate this Recipe, , 5, from, 27, votes, , , Vegan Holiday Roast, , , Make your festive dinner complete with this Vegan Holiday Roast. It's filled with savory stuffing and finished with a mouth-watering glaze., , , Prep Time, 20, minutes, , mins, Cook Time, 1, hour, , hr, , 43, minutes, , mins, Resting Time, 30, minutes, , mins, Total Time, 2, hours, , hrs, , 33, minutes, , mins, , , Course:, Main Course, Cuisine:, American, Vegan, , Servings:, 8, , people, , Calories:, 202, kcal, , Author:, Melissa Huggins, , Preheat oven, to 400 °F (200 °C)., Heat, , 2 tablespoons, of oil in a large pan over medium heat. Add the onion and sauté until translucent about 2-3 minutes., Add garlic, and sauté until fragrant about 30-60 seconds., Now add the mushrooms, and cook for 10-12 minutes until they have released their water, have reduced in size, are lightly golden and the pan is dry. Stir only occasionally so they have time to brown., Pour in the soy sauce, and stir into the mushrooms. Cook for 30-60 seconds, scraping up any bits on the bottom of the pan. Remove from heat and let cool for a few minutes. Measure out 2 exact cups of mixture, (you may have a few tablespoons left over, just save for another recipe or add to toast), ., To a food processor, , add the 2 cups of mushroom/onion mixture, the remaining 1 tablespoon of oil, water, beans, nutritional yeast, bouillon, Worcestershire sauce, granulated garlic, granulated onion, rosemary, thyme, sage, smoked paprika, and pepper. Process for 2-3 minutes, scraping down sides as needed until everything is broken down and combined. It won't be completely smooth., To a large mixing bowl, , add the vital wheat gluten and the mixture from the food processor, scraping everything out with a spatula. Stir until it just starts to come together (about 30-60 seconds). Now, using your hands, continue to combine while sweeping up all the vital wheat gluten in the bowl (30-60 seconds)., Now knead the dough for, , 5 minutes (no less), . The dough should be thick, slightly elastic, and somewhat fibrous looking. (, * if your bowl is large enough, you can knead the dough in there, otherwise, knead on a clean flat surface, )., Let the dough rest for 5 minutes, then knead for 30-60 seconds and shape the dough into a loaf shape about 8 inches long and 3.5\" inches wide. Roll the loaf in a piece of parchment paper, then roll in a piece of foil that's about 20\" long, and twist the ends like a candy wrapper, securing in place., Bake for 80 minutes, , flipping halfway through. Now remove from oven and allow the roast to sit undisturbed for 20 minutes (no less). Remove from foil and parchment. You can slice and serve now OR prepare the loaf for glazing (next step)., Preheat your oven broiler, to the low setting. In a small bowl, combine the brown sugar, oil, and soy sauce until the sugar has dissolved. Now, place the loaf back in the roasting pan and brush the top and sides with the glaze. Broil for 2-3 minutes until you see the glaze start to caramelize. Now brush one more layer on the top and sides and broil for another 2-3 minutes, watching carefully to prevent burning. (, *if your broiler doesn't have a low setting, use the high setting and reduce the time. Watch very carefully)., , , Notes, , It's best to dry-brush the mushrooms, instead of rinsing them. They absorb a lot of water and this can make it difficult to brown them., , If you can't find Better Than Bouillon, - no chicken base, you can use their no beef broth. This will darken the loaf slightly and the flavor will vary but it will still be delicious. You can also use their regular broth if that's all you can find., , If you can't find, vegan Worcestershire sauce, , you can use barbeque sauce or vegan steak sauce. You can also use a combination of 2 teaspoons of ketchup, 1.5 teaspoons of balsamic vinegar, and 1 teaspoon of low-sodium soy sauce., , Vital Wheat Gluten, - this is essential for the recipe and cannot be substituted with anything else., , Measuring Vital Wheat Gluten, - For an accurate measurement, you can weigh the VWG to get exactly 280 grams. If you don't have a kitchen scale, don’t scoop the VWG with a measuring cup directly from the container. Instead, aerate it first, then scoop it out of your container with a spoon and then into a measuring cup. Don’t pack or tap the cup. After filling, lightly sweep a butter knife across the top to remove the excess., , , Kneading is very important, and should be done for 5 minutes. Any less and the loaf can turn out spongy. Also, if you over knead, the loaf can turn out tough and rubbery. If you feel you may have over kneaded, you can let the dough rest for 15 minutes before shaping it into a loaf, , The loaf should be wrapped snugly, but, not super tight or it won't expand., , Glaze:, this adds nice color with a slight sheen and crisps the surface slightly for a better table presentation, but it's completely optional. If you want a thick, sticky glaze, you can use a thick teriyaki sauce or barbeque sauce, or a blend of both and broil it the same way., , Serving Ideas:, serve with, Vegan Gravy, , Sautéed Green Beans, and, Cranberry Sauce, or with all the traditional holiday sides., , , Nutrition, Serving:, 1, slice, |, Calories:, 202, kcal, |, Carbohydrates:, 18, g, |, Protein:, 27, g, |, Fat:, 3, g, |, Sodium:, 621, mg, , , , Tried this recipe?, Follow me, @veganhuggs, and mention, #veganhuggs, !, , , , , , , , , Vegan Huggs Weekly Newsletter, , Receive the tastiest vegan recipes straight to your inbox! Join now and get my Fan Favorites ebook FREE!, , , SUBSCRIBE, , , , , , , , , , , , , , , , , , , , , , , , , , , , , More Vegan Thanksgiving Recipes, Vegan Pumpkin Mac and Cheese, Vegan Thanksgiving Recipes, Vegan Pumpkin Pancakes, Vegan Cornbread, , , , , , , , Pinterest, , , , , , , Facebook, , , , , , , Twitter, , , , , , , Yummly, , , , , , About Melissa, I’m Melissa Huggins – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, Read more..., , , , , , , , Reader Interactions, Comments, , , , 5 from 27 votes (, 18 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , Michelle, , , November 25, 2024 at 5:18 am, , , , I gave the roast a trial run before Thanksgiving. The roast was delicious! My son who carefully critiques my cooking said, \"Mom, you hit it out of the ballpark!\" After we had dinner, I found him slicing another piece for a sandwich. The next morning he grilled some onions, added a slice on top and covered it with a lid to warm it up. He then added it to some toast with fixings (spinach and tomato). He's a big fan and so am I. This recipe will be our go-to for future family celebrations! Thank you Vegan Huggs!, , , Reply, , , , , , , , Melissa Huggins, , , December 19, 2024 at 12:38 pm, , , , Hi Michelle, this made my day! I'm so happy it was a hit and your son found other ways to use it. Thank you for trying it and sharing wonderful feedback. 🙂, , , Reply, , , , , , , , , , Aziza, , , December 11, 2023 at 6:40 pm, , , , I’m in the process of making this and I’m pretty sure your Metric measurements are off…might want to have a look at this 🤔, , , Reply, , , , , , , , Melissa Huggins, , , December 29, 2023 at 10:15 am, , , , Hi Aziza, thank you for bringing that to my attention. Not sure what happened there. It's all fixed now. 🙂, , , Reply, , , , , , « Older Comments, Primary Sidebar, , , , I’m Melissa Huggins, – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, , More about me →, , , Search, Search, , vegan huggs facebook, , vegan huggs Instagram., , vegan huggs pinterest, , YouTube, , My Most Popular, , Vegan Crab Cakes, Easy Vegan Quiche, Sticky Sesame Cauliflower, Creamy Vegan Potato Leek Soup, Cheesy Vegan Cauliflower Casserole, Grilled Portobello Mushroom Steaks, Footer, , SEEN ON, , , ^ back to top, , , , About, , About Me, Privacy Policy, Recipe Index, , , , Newsletter, , Sign Up!, for emails and updates, , , Contact, , Contact, Subscribe, , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2020, Vegan Huggs, , We use cookies to ensure that you have the best experience possible on our website. By continuing on the site you agree to the use of your cookies by www.veganhuggs.com, , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Vegan meatloaf": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., VEGAN MEATLOAF, SERVES: 4 (one 2-in. slice each) Prep Time: 15 min.  Cooking Time: 1 hr. 9 min., CONTAINER EQUIVALENTS (per serving):, 1, 3, 1, VEGAN CONTAINER EQUIVALENTS (per serving):, 1, ½   A  1   B  1, 1, 2½ cups, \u0007reduced-sodium vegetable, broth, divided use, ½ cup, dry brown lentils, rinsed, 1⁄3 cup, dry quinoa, rinsed, drained, 1 cup, \u0007chopped onion (approx. 11⁄3, medium onion), ½ cup, \u0007chopped celery (approx. 1, medium stalk), ½ cup, \u0007chopped carrot (approx. 1, medium carrot), 3 cloves, garlic, 1 Tbsp., olive oil, 1 Tbsp., tomato paste, 1 tsp., dried thyme, 1 tsp., chili powder, ¾ tsp., sea salt (or Himalayan salt), ½ tsp., ground black pepper, 2 Tbsp., \u0007Worcestershire sauce, vegan, , gluten-free, ½ cup, gluten-free bread crumbs, 2 Tbsp., ground flaxseed, 2 Tbsp., nutritional yeast, 1 Tbsp., \u0007reduced-sodium tamari soy, sauce, ½ cup, all-natural ketchup, SPECIAL EQUIPMENT:, Parchment paper, Nonstick cooking spray, 1., Preheat oven to 375° F. Line loaf pan or small baking dish with, parchment paper. Coat with cooking spray., 2., Add 2¼ cups broth and lentils to a large saucepot. Bring to a boil, then, reduce to a low boil; cook for 20 minutes., 3., Stir in quinoa; simmer, partially covered, for 12 minutes., 4., Add onion, celery, carrot, and garlic to a blender or food processor; cover., Pulse until finely chopped., 5., Heat oil in large skillet over medium-high heat; cook vegetable mixture, 4 to 5 minutes, or until lightly browned. Add tomato paste, thyme, chili, powder, salt, and pepper. Cook, stirring frequently, for 1 to 2 minutes., 6., Remove from heat; stir in remaining ¼ cup vegetable broth and, Worcestershire sauce. Set aside to cool for 5 minutes., 7., Combine lentil mixture, vegetable mixture, bread crumbs, flaxseed, , nutritional yeast, and tamari in a large mixing bowl (be sure everything is, cool enough to handle). With clean hands, , moldable mixture forms., 8., Add mixture to prepared loaf pan or baking dish, packing mixture in, tightly to ensure no air pockets and a smooth level surface. Spread, ketchup over top. Cover with foil; bake for 30 minutes., 9., Remove foil; bake for 5 minutes. Rest 15 minutes before slicing., 10., Serve immediately, or store refrigerated in an airtight container for, up to 3 days., NUTRITIONAL INFORMATION (per serving): Calories: 354  Total Fat: 9 g  Saturated Fat: 1 g  Cholesterol: 0 mg  Sodium: 528 mg, Carbohydrates: 58 g  Fiber: 9 g  Sugars: 13 g  Protein: 12 g, Instructions: ",
        "Southern Style Vegan Meatloaf": "Ingredients: , , 9.Spread the BBQ sauce evenly over the top and bake it for an hour and twenty minutes, or until a wooden toothpick is inserted and comes out clean. Let it cool and remove from the pan to slice., , , If you want to spoon extra BBQ sauce on top, go for it! Can you ever eat enough BBQ sauce?, , , Notes on the BBQ Sauce, – You can buy a vegan sauce or make mine. Click, here, for the recipe., , Tips for Making the Perfect Vegan Meatloaf, , , Remember to reserve the juice from the chickpeas. Aquafaba/bean juice is the main binder for this bean loaf., , Be sure to process the chickpeas and half of the black beans until they're nice and creamy. This will help the loaf bind together instead of crumble., , Leave some whole pieces when you process the second half of the black beans. This gives the loaf texture., , Taste the mixture before you put it in the bread pan. Adjust the salt and spices to suit your tastes., , Every oven is calibrated differently. Check the loaf with a toothpick to make sure it's done. It may take more or less time to make yours depending on the elevation, humidity, or oven., , , Can You Make it in Advance?, , Yes!, , You can prepare it up to three days in advance., , Cover it and store it in the refrigerator until you're ready to make it., , Don't add the barbecue sauce to the top until you're ready to bake it., , Can You Freeze It?, , Yes!, , Wrap in freezer safe packaging and freeze for up to 3 months., , Thaw in the refrigerator overnight and reheat in a 350˚F (176˚C) oven until it's hot in the middle., , How to Serve It, , We love to serve our BBQ meatloaf with Garlic Mashed Potatoes, Spicy Green Beans, and, Vegan Cornbread., , It also goes great with our, creamy potato salad, , , cucumber salad, , and, macaroni salad, ., , Leftovers, , Crumble it and add it to, spaghetti sauce, ., , Slice it and make a meatloaf sandwich on toasted bread with crisp lettuce, tomato, and extra BBQ sauce., , Crumble it and use it for, taco filling, ., , More Vegan Loafs and Mains You'll Love, , Vegan Lentil and Vegetable Loaf, , Crispy Baked BBQ Tofu, , Vegan Seitan Ham, , Jackfruit Pulled BBQ Chicken, , Vegan Seitan Chicken, , Seitan BBQ Ribs, , Make our Smoky Southern-Style Meatless Meatloaf and let us know what you think. We love to hear from you! And, don’t forget to take a picture of your gorgeous creation and tag us, @veganosity on Instagram., , Let’s connect! Hop on over to our, Facebook, page and give it a like, and follow us on, Instagram, and, , Twitter, , and follow us and share this and other, Veganosity, recipes on, , Pinterest, . We'd be so grateful if you did. If you like this recipe and can't wait to see what we're going to share next, subscribe to, Veganosity, . Just fill in the subscription box above our picture in the top right corner of the page. And, Alex and I love hearing from you, please leave a comment and let us know what you think of our recipes., , This post may contain affiliate links which won’t change your price but will share some commission., , , , , Smoky Southern-Style Meatless Meatloaf, , , Smoky and delicious meat free meatloaf with a tangy BBQ top. Made with black beans and chickpeas and a spicy homemade BBQ sauce. This is something that even meat eaters will love!, , , 3.98, from, 177, votes, , , Print, , Pin, , Rate, , , Course:, Main Course, Cuisine:, American, Southern, Diet:, Vegan, , Prep Time:, 15, minutes, , minutes, Cook Time:, 1, hour, , hour, , 20, minutes, , minutes, Total Time:, 1, hour, , hour, , 35, minutes, , minutes, , Servings:, 10, , servings, , Calories:, 392, kcal, , Author:, Linda & Alex, , Cost:, $10, , , Equipment, ▢, 1 food processor, ▢, 1 bread pan, ▢, 1 Oven, , ▢, 15, , ounce, , chickpeas, , drain and reserve the bean liquid (aquafaba) for later - rinse the beans well, ▢, 30, , ounce, , black beans, , Drained and rinsed, ▢, 1, , cup, , rolled oats, , coarsely ground in a food processor, ▢, 1, , cup, , corn meal, ▢, 3, , tablespoon, , liquid smoke, ▢, ½, , cup, , aquafaba chickpea liquid from the can, ▢, 2, , teaspoon, , olive oil or 2 tablespoon (30 ml) vegetable broth if you don’t cook with oil, ▢, 1, , medium yellow or white onion, , finely diced, ▢, 1, , tablespoon, , dried Italian seasoning, ▢, 2, , teaspoon, , ground sea salt, , or to taste, ▢, 1, , teaspoon, , ground black pepper, , or to taste, ▢, 2, , tablespoon, , vegan Worcestershire sauce, , We use Annie’s brand, ▢, ½, , cup, , low-sodium vegetable broth, ▢, ⅓, , cup, , ketchup, ▢, 1, , cup, , BBQ sauce, For the BBQ sauce:, ▢, 1, , cup, , tomato sauce, ▢, 3, , cloves, , garlic, ▢, ¼, , cup, , apple cider vinegar, ▢, 1, , tablespoon, , dark molasses, ▢, ¼, , cup, , brown sugar, ▢, 1, , teaspoon, , salt, ▢, 1, , teaspoon, , paprika, ▢, 1, , teaspoon, , onion powder, ▢, ¼, , teaspoon, , cumin, ▢, ¼, , teaspoon, , cayenne pepper, , if you don't like spicy food omit this, ▢, ¼, , teaspoon, , white pepper, ▢, 1, , tablespoon, , lime juice, ▢, 1, , pepper in adobo sauce, , – remove the seeds the pepper is optional, this will make the sauce extra spicy, if you use it make sure to remove the seeds, Note, : Don't add this if you don't like really spicy food., ▢, 1, , teaspoon, , olive oil, , extra virgin, ▢, 1, , tablespoon, , cilantro, , minced, ▢, 1, , tablespoon, , cornstarch plus ¼ cup (60 ml) water, , - mixed together in a small cup until dissolved, US Customary, -, Metric, , Cook Mode, Prevent your screen from going dark, , use your clean hands to mix. If the mixture feels too wet, add more cornmeal by the tablespoon until it holds together and is firm. Spoon into the bread pan and press the mixture until it's evenly distributed throughout the pan, Evenly spread the 1 cup of BBQ sauce on top of the loaf and bake for 1 hour and 20 minutes, or until a wooden toothpick is inserted and comes out clean. NOTE: If you're baking this in a convection oven, check on it at 50 minutes to see if it's done. Convection ovens cook faster than traditional ovens. Additionally, the calibration of your oven will affect the cook time. Please use a long wooden toothpick or even a chopstick to test the center of the loaf., Cool for fifteen to 20 minutes to allow it to set before cutting., BBQ Sauce:, Mix the cornstarch and water together and set aside., stir occasionally to avoid scorching the sauce.Add the cornstarch mixture and stir until fully combined and cook for five more minutes., Enjoy!, , , Notes, NUTRTION DISCLAIMER, , We use Quaker yellow cornmeal because the consistency works best for this recipe., , Wrap in foil and store in the refrigerator for up to one week. Freeze in a freezer safe container for up to 3 months. Thaw in the refrigerator and cover in foil to reheat in a 350˚F (176˚C) oven for approximately 30 minutes., , Nutrition, Serving:, 180, g, |, Calories:, 392, kcal, |, Carbohydrates:, 75, g, |, Protein:, 15, g, |, Fat:, 5, g, |, Saturated Fat:, 1, g, |, Polyunsaturated Fat:, 1, g, |, Monounsaturated Fat:, 2, g, |, Sodium:, 1308, mg, |, Potassium:, 775, mg, |, Fiber:, 14, g, |, Sugar:, 22, g, |, Vitamin A:, 389, IU, |, Vitamin C:, 5, mg, |, Calcium:, 92, mg, |, Iron:, 5, mg, , , , , Tried this Recipe? Tag me Today!, Mention, @Veganosity, or tag, #Veganosity, !, , , , , , , «, The Best Vegan Chicken & Waffles, Creamy Vegan  Au Gratin Potatoes, », , , , 44411, , shares, , , , , , , Share, , , , , Tweet, , , , , Pin, , , , We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites., , , , Consult your doctor before trying any of our favorite fitness work outs. We are not responsible for any allergic reactions, weight gain, weight loss, or other physical issue that may result from making our recipes. Please do not use our pictures or recipes unless you ask our permission. Thank you!, , PRIVACY POLICY, , , , Reader Interactions, Comments, , , , , , Heather, , says, , , January 04, 2024 at 11:22 am, , , , Hello, it looks great.  If I cook my own chick peas from dried (normal for me to do so) what would i use rather than the aqua fava from the tinned chickpeas.. Many thanks!, , , Reply, , , , , , , , Linda & Alex, , says, , , January 19, 2024 at 3:05 am, , , , Hi Heather, you can use an egg replacer, such as Bob's Red Mill, or you can use JUST egg. The equivalent of one large egg will work., , , Reply, , , , , , , , , , Pam, , says, , , January 14, 2023 at 4:14 am, , , , I'm just about best in realized I have no black beans! I'm going to try it with kidney beans, hope that's okay. Will update after with how it turned out!, , , Reply, , , , , , , , Linda & Alex, , says, , , January 18, 2023 at 2:29 am, , , , Hi Pam, please let us know what you think. The texture should be similar, although the flavor won't be the same., , , Reply, , , , , , , , , , Kim, , says, , , August 14, 2022 at 9:24 pm, , , , Is there any substitute for the cornmeal?, , , Reply, , , , , , , , Linda & Alex, , says, , , August 20, 2022 at 2:30 am, , , , Hi Kim, you can substitute with plain breadcrumbs. We don't recommend using gluten-free breadcrumbs because they tend to become too mushy and ruin the texture., , , Reply, , , , , , , , , , Robbi O, , says, , , July 21, 2022 at 10:35 pm, , , , Thank you for this recipe! Was looking for a dish to take for our church's potluck!, , , Reply, , , , , , , , Linda & Alex, , says, , , July 27, 2022 at 12:36 am, , , , You're welcome, Robbi. We hope you enjoy it., , , Reply, , , , , , , , , , April, , says, , , January 10, 2022 at 8:20 pm, , , , Made this last night, so so good!, I added some finley chopped (maybe 1/2 cup) mushrooms to the onion mix., Mixed some bbq sauce that I had with some ketchup, a little brown sugar and apple cider vinegar for the topping., cooked in a counter top convection oven 50 min let rest 30. was perfect. It held together and wasnt mushy like so many bean burger type recipes., served with mashed potatoes, gravy and green beans., , , Reply, , , , , , , , Linda & Alex, , says, , , January 11, 2022 at 12:39 am, , , , Hey April, Thanks so much for letting us know how it went! We're so happy that you loved the meatless meatloaf : ) Also, the side dishes sound amazing and you definitely have us wanting to make some mashed potatoes and gravy tonight!, , Alex & Linda, , , Reply, , , , , , , , , , Alisa Warshay, , says, , , January 06, 2022 at 3:39 am, , , , What is the other half of the chickpea liquid used for? Or is it not used?, , , Reply, , , , , , , , Linda & Alex, , says, , , January 06, 2022 at 8:41 pm, , , , Hi Alisa, the aquafaba is used as an egg replacer. You can toss the remaining liquid. 🙂, , , Reply, , , , , , , , EJL, , says, , , May 09, 2022 at 6:37 am, , , , You can also freeze any leftover aquafaba in an ice cube tray, (good to do 2 or 3 tbsp per cube section -since 2 tbsp is the equivalent of 1 egg white and 3 tbsp is the equivalent of 1 whole egg). Pop them out the next day and wrap them in plastic wrap, then in a (labeled) zipper plastic bag or freezer safe container. Then if you have a recipe that uses aquafaba, but not chickpeas, you're ready to go.  The cubes are pretty easy to thaw in a little dish at room temp (don't microwave them to thaw), , , Reply, , , , , , , , Linda & Alex, , says, , , May 09, 2022 at 10:28 pm, , , , Great tips, thank you!, , , , , , , , , , , , , Shenita, , says, , , December 24, 2021 at 10:45 am, , , , Linda, oh my delicious! I'm working nights for the holiday.  I started cooking tonight for my Christmas meal. I may have overcooked or put in to much polenta, I used polenta because that's what in I had on hand. I questioned if it was too wet so I kept putting in extra polenta. Nevertheless, this is crazy good. The BBQ sauce is amazing. This is going in meal rotation. Thank you. I'm sharing this with all I know., , , Reply, , , , , , , , Linda & Alex, , says, , , December 28, 2021 at 2:48 am, , , , Hi Shenita! Thank you so much, I'm so happy you like it. 🙂 Polenta was a good substitute. It's possible that you added a bit too much polenta, but as long as it tasted good, it's a win!, , Thanks for taking the time to comment and for telling your friends and family. We really appreciate it. Have a wonderful 2022!, , , Reply, , , , , , , , , , Sapna, , says, , , November 24, 2021 at 9:34 pm, , , , Hi,, Can I make this the night before and bake it the next day?, , , Reply, , , , , , , , Linda Meyer, , says, , , November 25, 2021 at 7:28 am, , , , Hi Sapna! Yes, you absolutely can. I do that often. Just make sure that you cover it and refrigerate., , , Reply, , , , , , , , , , Janet, , says, , , March 04, 2021 at 10:40 pm, , , , I made this meatloaf for a weekday dinner party and it turned wonderful and tastes great. Really good recipe!  It also looks exactly like the photo which is a bonus. I also made the mushroom gravy recipe on this site because I served it with mashed pototoes (and roasted broccoli). I want a total comfort food experience and the meatloaf and gravy did just that. Thank you for great recipes!, , , Reply, , , , , , , , Linda Meyer, , says, , , March 05, 2021 at 4:54 am, , , , Hi Janet! Thank you so much for the awesome comment. We're always so happy when our readers make our recipes for friends and family. You definitely created a total comfort food meal for your guests. 🙂, , , Reply, , , , , , , , , , Lori, , says, , , February 18, 2021 at 5:04 am, , , , Is it mushy? I don't like the one's that are mushy, , , Reply, , , , , , , , Linda Meyer, , says, , , February 18, 2021 at 8:57 pm, , , , Hi Lori,, , This is not mushy at all, as long as you bake it until it's done and let it set in the pan as instructed. Ovens can be calibrated differently, the humidity or the amount of liquid in the beans can make a difference in the moisture level of the loaf. This is why we recommend using a long wooden skewer to test the loaf. If it comes out clean, it's done, if not, bake it another 10 minutes and test again. Also Instructions: Preheat the oven to 350°F (176˚C) and line a 9” bread pan with parchment paper or grease the pan., Heat a large skillet on medium heat and add the oil or the 2 tablespoons of vegetable broth if you don’t cook with oil. When the oil or broth is hot add the onions and reduce the heat to medium-low. Stir well. Add 1 tablespoon Italian seasoning, and salt and pepper to taste, stir well, and cook until the onions are soft and translucent. Don’t let them brown. Approximately five minutes., Add the 2 tablespoon Worcestershire sauce, ½cup of vegetable broth, and ⅓ cup of ketchup to the onions and stir until the ketchup dissolves. Set aside., Process the 15 oz of drained and rinsed (reserve the liquid) chickpeas in a food processor until creamy. Put in a large bowl., Process 15 oz of drained and rinsed black beans in the processor until creamy. Put in the bowl with the chickpeas., Pulse the remaining 15 oz of drained and rinsed black beans until lightly ground into small pieces. Put in the bowl with the chickpeas and other can of black beans., Process the 1 cup of rolled oats until it turns into a course flour. Add to the bowl with the beans., Add the 1 cup of cornmeal, 3 tablespoon of liquid smoke, and add half of the ½ cup of aquafaba to the bowl with the beans. If the mixture is too dry once you mix everything together, add 1 tablespoon of broth or water to the mixture and stir. Add more as needed., the size of the loaf pan will definitely alter the cook time., , Additionally, when you're making the batter, if it feels too wet, add a little more cornstarch until it sticks together. If it feels to dry and crumbly, add a little more aquafaba or water until it becomes sticky., , We hope this helps you make a great loaf. It's one of our most popular recipes and overwhelmingly loved by our readers. 🙂, , , Reply, , , , , , , , Denise C., , says, , , December 08, 2021 at 4:04 am, , , , I think you meant you should add more flour rather than cornstarch if the batter is too wet. There is no cornstarch in the meatloaf part of your recipe., , , , , , , , , Linda Meyer, , says, , , December 09, 2021 at 2:03 am, , , , Hi Denise, this recipe doesn't call for cornstarch. 🙂, , , , , , , , , , , , , David Watson, , says, , , January 01, 2021 at 3:40 am, , , , Great flavor and texture, so definitely giving you five stars, even though I screwed it up! LOL! Way too much sauce over the top - followed the measurements, but still wound up with so much that most of it just tasted like BBQ! Oops #1. #2 was...too much cornmeal. Very dense, and dry. Salvageable, though. Oops #3 - I have a small propane stove. Its thermometer is obviously WAY off. 350°F for 1 hour 20 minutes? Nope. Let's go 20 more. Still no. Turned up the temp and went for 15 - DON'T EVER DO THIS!!!, , Oh well, live and learn, and like I said, it's all salvageable. Cut it thin, baste with a little low-sodium veggie broth in the microwave for a minute, or back in the oven at whatever that actual temperature is for about 10-15 while basting, and it's all good. Or, cut it into thick chunks and toss it into fried rice! It won't go to waste, and next time? I'm having a calibrated thermometer and cutting back on the sauce and cornmeal!, , , Reply, , , , , , , , Linda Meyer, , says, , , January 02, 2021 at 5:52 pm, , , , Oh my! Thank you for the 5 star review, especially after all of that! LOL! Baking any kind of loaf is tricky, because of so many variables. I'm happy you were able to salvage it and enjoyed the flavor and texture. 🙂, , , Reply, , , , , , « Older Comments, , , , 3.98 from 177 votes (, 169 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , I have read and accepted the, Privacy Policy, *, , , , , , , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Primary Sidebar, , , , Welcome to Veganosity!, We're Linda and Alex, the mother-daughter duo who love creating vegan comfort food to impress the masses!, , More about us →, , , Plant Based BBQ, , Vegan Pulled BBQ Chicken, Easy Vegan Ribs Recipe, Pulled BBQ Carrots, Easy Southern-Style Vegan BBQ Bowls, , Vegan Chocolate Cakes, , , , Vegan Black Forest Ice Cream Cake, Vegan Chocolate Peppermint Pound Cake, Vegan Chocolate Cake, Vegan Chocolate Coconut Cupcakes, , , , Footer, , ↑ back to top, , , , , About, , Privacy Policy, , , , Newsletter, , Sign Up!, for emails and updates, , , , Contact, , About, Contact, , , , We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites., , Copyright © 2022, Veganosity, , , , , 44411, , shares, , , , , , , , , , , , , , , , , Healthy vegan recipes that will keep you strong, fit, and satisfied., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Tempeh BBQ Ribs": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., TEMPEH BBQ “RIBS”, SERVES: 4 (approx. 4 oz. tempeh each) Prep Time: 10 min.  Cooking Time: 22 min., CONTAINER EQUIVALENTS (per serving):, 1, ½, 1, VEGAN CONTAINER EQUIVALENTS (per serving):, 1    B  ½, 1, 16 oz., organic tempeh (approx. 3 cups), 1 Tbsp., chili powder, 1 tsp., ground smoked paprika, ½ tsp., garlic powder, ½ tsp., onion powder, ½ tsp., ground cumin, ¼ tsp., sea salt (or Himalayan salt), 1 Tbsp., olive oil, ¾ cup, \u0007Vegan BBQ Sauce, divided use, (see separate recipe for, Vegan BBQ Sauce), SPECIAL EQUIPMENT:, Parchment paper, Nonstick cooking spray, 1. \t Preheat oven to 400° F., 2. \t Line a baking sheet with parchment paper. Coat with cooking spray., Set aside., 3. \t Place tempeh in large skillet and add enough water to cover tempeh; cover., Bring to a low boil over medium heat. Cook for 10 minutes. Remove from, water and set aside., 4. \t Mix together chili powder, paprika, garlic powder, onion powder, , cumin, and salt in a small bowl. Rub outside of tempeh liberally with, spice mixture., 5. \t Wipe out pan with a paper towel. Heat olive oil over medium-high heat, until fragrant. Cook tempeh, 1 to 2 minutes per side, until golden brown., 6. \t Coat tempeh with ¼ cup Vegan BBQ Sauce and place on prepared pan., Bake for 10 minutes, or until tempeh is cooked through., 7. \t Cut tempeh into rib-sized portions and serve with remaining ½ cup Vegan, BBQ Sauce (2 Tbsp. per portion)., RECIPE NOTE:, Tempeh is often gluten-free. Be sure to check the nutrition label to, ensure you purchase a gluten-free product., NUTRITIONAL INFORMATION (per serving): Calories: 303  Total Fat: 12 g  Saturated Fat: 2 g  Cholesterol: 0 mg  Sodium: 130 mg  Carbohydrates: 26 g  Fiber: 13 g, Sugars: 8 g  Protein: 22.5 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., GF, V, VG, Recipes containing the GF  icon are designed to be Gluten-Free and contain no gluten. If you are following a gluten-free diet, since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN BBQ SAUCE, SERVES: 12 (2 Tbsp. each) Prep Time: 7 min. Cooking Time: 23 min., CONTAINER EQUIVALENTS (per serving):, ½, VEGAN CONTAINER EQUIVALENTS (per serving):    B  ½, 2 Tbsp., apple cider vinegar, 2 Tbsp., pure maple syrup, 1 cup, reduced-sodium vegetable broth, 1 cup, all-natural ketchup, gluten-free, 1 Tbsp., orange marmalade, 1 Tbsp., Worcestershire sauce, vegan, , gluten-free, 1 tsp., onion powder, 1 tsp., garlic powder, 1 tsp., ground smoked paprika, ½ tsp., ground black pepper, ½ tsp., chili powder, ½ tsp., ground cumin, ¼ tsp., ground allspice, ¼ tsp., sea salt (or Himalayan salt), 1. \t Combine vinegar and maple syrup in medium saucepan over medium-high, heat; cook for 3 minutes, until liquid just begins to caramelize., 2. \t Whisk in broth, ketchup, marmalade, Worcestershire sauce, onion, powder, garlic powder, paprika, pepper, chili powder, cumin, allspice, , and salt. Reduce heat to medium-low; cook for 20 minutes, or until, mixture slightly thickens., NUTRITIONAL INFORMATION (per serving): Calories: 46  Total Fat: 0 g  Saturated Fat: 0 g  Cholesterol: 0 mg  Sodium: 136 mg  Carbohydrates: 10 g  Fiber: 0 g, Sugars: 9 g  Protein: 0 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Pulled Pork": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., VEGAN PULLED PORK, O, SERVES: 8 (approx. ½ cup each)  Prep Time: 15 min.  Cooking Time: 57 min., CONTAINER EQUIVALENTS:, 1, ½, 1, VEGAN CONTAINER EQUIVALENTS:, 1    B  ½, 1, This Vegan Pulled Pork is a real mindblower. You won’t believe just how much it tastes like the real thing, tangy, , smoky, meaty, and satisfying. AND it doesn’t take 8 hours to make, win-win! The secret ingredient is jackfruit, a, tropical fruit that has a meaty, heavy-grained flesh similar to pork. It absorbs the flavors of smoke and BBQ sauce, beautifully and comes out tasting just like the real deal. We use the canned variety here, which you can find at most Asian markets or order, online. It’s important to use the young, unripe fruit for this, so be careful if buying fresh, as most fresh fruits are sold ripened., 3 cans, young green jackfruit in brine (NOT, (20-oz. each) \tin syrup), drained, rinsed, cored, , and seeds removed and discarded, 1 Tbsp., extra-virgin organic coconut oil, 1 cup, \u0007chopped onion, (approx. 1½ medium), 5 cloves, garlic, finely chopped, 2 tsp., coconut sugar, 1 tsp., ground cumin, 1 tsp., ground coriander, 2 tsp., chili powder, 2 tsp., ground smoked paprika, ¼ tsp., instant espresso powder, ¼ tsp., unsweetened cocoa powder, ¼ tsp., ground cinnamon, ¼ tsp., ground allspice, ½ tsp., ground black pepper, ½ tsp., \u0007smoked sea salt (or Himalayan salt), ¼ tsp., \u0007ground cayenne pepper (optional), 2 cups, low-sodium organic vegetable broth, ½ cup, Banana BBQ Sauce (see separate, recipe for Banana BBQ Sauce) or, all-natural barbecue sauce of, your choice, SPECIAL EQUIPMENT:, Aluminum foil (optional), 1 cup wood chips for smoking (optional), Parchment paper, 1. \t If you would like to pre-smoke your jackfruit, line bottom of large stock, pot with aluminum foil. Add wood chips. Top with colander (or steamer, basket). Add jackfruit. Cover pan with firmly crimped foil. Poke a pinhole, in foil; turn burner to high and wait until you see smoke coming from the, hole. Turn heat to medium-low and let stand, covered, for 10 minutes., Taste the jackfruit. If you would like it smokier, turn the heat on again and, repeat the process. This step is optional., 2. \t Preheat oven to 400º F., 3. \t Line large baking sheet with parchment paper. Set aside., 4. \t Heat oil in large nonstick skillet over medium high heat., 5. \t Add onion; cook, stirring frequently, for 3 to 5 minutes, or until onion, is translucent., 6. \t Add garlic; cook, stirring frequently, for 1 minute., 7. \t Add jackfruit, sugar, cumin, coriander, chili powder, paprika, espresso, powder, cocoa powder, cinnamon, allspice, black pepper, salt, cayenne, pepper (if desired), and broth; mix well. Bring to a boil. Reduce heat to, medium-low; gently boil, uncovered, for 10 to 15 minutes, or until liquid, is absorbed., 8. \t Transfer jackfruit to prepared baking sheet. Mash with a spatula until, fibers divide and take on the appearance of pulled pork., 9. \t Bake for 10 minutes., 10.\t Add BBQ sauce; mix well to coat fruit. Bake for an additional 7 to 10, minutes, or until fruit is lightly browned., RECIPE NOTE:, •\t Canned young green jackfruit in brine can be found in specialty Asian, markets or online., NUTRITIONAL INFORMATION (per serving): Calories: 156  Total Fat: 3 g  Saturated Fat: 2 g   Cholesterol: 0 mg  Sodium: 354 mg  Carbohydrates: 32 g  Fiber: 3 g, Sugars: 24 g  Protein: 3 g, RECIPES, © 2021 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., GF, V, VG, Recipes containing the GF  icon are designed to be Gluten-Free and contain no gluten. If you are following a gluten-free diet, since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., BANANA BBQ SAUCE, O, SERVES: 8 (approx. ¼ cup each) Prep Time: 10 min.  Cooking Time: 32 min.., CONTAINER EQUIVALENTS:, ½, ½, VEGAN CONTAINER EQUIVALENTS:    B  ½, ½, 1 Tbsp., extra-virgin organic coconut oil, 1, large banana, sliced, 2 Tbsp., apple cider vinegar, 1 cup, low-sodium organic vegetable broth, 1 cup, all-natural ketchup, no sugar added, 1 Tbsp., orange marmalade, 1 Tbsp., Worcestershire sauce, gluten-free, , vegan, ½ tsp., ground black pepper, 1 tsp., onion powder, 1 tsp., garlic powder, ½ tsp., mustard powder, ¼ tsp., ground allspice, ½ tsp., ground cumin, ½ tsp., ground coriander, ¼ tsp., ground cayenne pepper (optional), ½ tsp., smoked sea salt (or Himalayan salt), 1 tsp., ground smoked paprika, ½ tsp., chili powder, 1.\t Heat oil in medium saucepan over high heat., 2.\t Add banana; cook, stirring occasionally, for 3 to 4 minutes, or until banana, is dark brown and mushy. Reduce heat to medium., 3.\t Add vinegar; cook, stirring frequently, for 1 to 2 minutes, or until pan is, almost dry., 4.\t Add broth, ketchup, marmalade, Worcestershire sauce, black pepper, , onion powder, garlic powder, mustard powder, allspice, cumin, coriander, , cayenne pepper (if desired), salt, paprika, and chili powder. Whisk to, blend. Bring to a gentle boil over medium heat., Reduce heat to low; gently boil, stirring occasionally, for 20 minutes, , or until sauce thickens., RECIPE NOTE:, •\t Refrigerate leftover sauce in an airtight container for up to 4 to 5 days., NUTRITIONAL INFORMATION (per serving): Calories: 66  Total Fat: 2 g  Saturated Fat: 2 g  Cholesterol: 0 mg  Sodium: 590 mg  Carbohydrates: 9 g  Fiber: 1 g, Sugars: 6 g  Protein: 0 g, RECIPES, © 2021 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Crab Cakes": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN CRAB CAKES, SERVES: 4 (approx. 3 crab cakes each)  Prep Time: 15 min.  Cooking Time: 19 min., CONTAINER EQUIVALENTS (per serving):, ½, 1, 1½, VEGAN CONTAINER EQUIVALENTS (per serving):, ½, ½, 1½, 1¼ cups, \u0007canned chickpeas (garbanzo, beans), drain reserving, liquid, rinsed, 1¼ cups, hearts of palm, 2 Tbsp., vegan mayonnaise, 2 tsp., Dijon mustard, 2 tsp., Worcestershire sauce, vegan, , gluten-free, 1 tsp., Old Bay Seasoning®, ¼ tsp., sea salt (or Himalayan salt), ¼ cup, thinly sliced green onions, 2 Tbsp., chopped fresh parsley, ½ cup, gluten-free panko bread crumbs, SPECIAL EQUIPMENT:, Olive oil cooking spray, 1. \t Place chickpeas and hearts of palm in food processor; pulse until flaky., Set aside., 2. \t Place 3 Tbsp. reserved chickpea liquid in a medium mixing bowl; whisk, until foamy., 3. \t Add mayonnaise, mustard, Worcestershire sauce, seasoning, salt, green, onions, and parsley; mix until thoroughly combined., 4. \t Combine chickpea mixture and bread crumbs in a medium bowl., 5. \t Gently fold in mayonnaise mixture; mix until just combined (try not to, overmix). Form mixture into twelve patties (approx. ¼ cup each). Set aside., 6. \t Heat large cast-iron (or nonstick) skillet, lightly coated with spray, over, medium-high heat., 7. \t Add 3 to 4 patties, taking care not to overcrowd skillet; cook for 3, minutes on each side, or until golden brown and crispy. Repeat with, remaining patties., RECIPE NOTE:, Serve 3 crab cakes with 2 Tbsp. vegan tartar sauce (if desired). Make, sure you add 1, Orange Container (Seeds & Dressings) and ½, , tsp. (Oils & Nut Butters) to your containers if you’re using 2 Tbsp. of, vegan tartar sauce., NUTRITIONAL INFORMATION (per serving): Calories: 165  Total Fat: 6 g  Saturated Fat: 1 g  Cholesterol: 0 mg  Sodium: 844 mg  Carbohydrates: 22 g  Fiber: 5 g, Sugars: 2 g  Protein: 5 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Au Gratin Potato Cups": "Ingredients: gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., AU GRATIN POTATO CUPS, Serves: 4 (2 cups each), GF VG, Total Time: 1 hr., Prep Time: 17 min., Cooking Time: 43 min., 1 Tbsp., ghee (organic grass-fed, if possible), 2 Tbsp., chopped onion, 1 clove, garlic, finely chopped, ¾ cup, unsweetened organic soy milk, ¼ tsp., sea salt (or Himalayan salt), ¼ tsp., ground black pepper, 1 dash, ground nutmeg, 1½ tsp., cornstarch + 1½ tsp. water (combine to make a slurry), 2 cups, russet potatoes (approx. 3 medium), peeled, cut into ¼-inch cubes, 1 cup, shredded Gruyère cheese (or cheddar cheese), divided use, SPECIAL EQUIPMENT: Muffin papers/liners  •  Nonstick cooking spray, 1., Preheat oven to 350° F., 2., Line muffin pan with eight muffin papers; lightly coat with spray., 3.\t Heat ghee in a large nonstick skillet over medium heat., 4.\t Add onion and garlic; cook, stirring frequently, for 2 to 3 minutes, or until onion is translucent., 5.\t Add soy milk, salt, pepper, and nutmeg; stir to combine. Bring to a simmer; reduce heat to low., 6.\t Add cornstarch slurry; whisk to combine. Cook for 1 minute, or until lightly thickened. Remove from heat., 7., Add potatoes and ½ cup cheese to a large mixing bowl; toss to combine., 8.\t Evenly divide potato mixture among prepared muffin cups (approx. ¼ cup per muffin cup)., 9., Add 1½ Tbsp. soy milk mixture to each muffin cup., 10.\t \u0007Bake for 35 minutes, or until potatoes are tender-crisp. Sprinkle remaining ½ cup cheese evenly on top of potato, mixture; place under broiler. Cook for an additional 5 minutes, or until cheese is golden and potatoes are tender., Instructions: ",
        "Tomato Cobbler": "Ingredients: 100% gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case. , Instructions: ",
        "Vegan BBQ Chickpea Pizza": "Ingredients: I don't judge). My Favorite BBQ Sauce (page 209), Go-To Pizza Dough (page 211), Life Changing Mozzarella (page 200) -both mozzarella recipes work great here so whichever you prefer, and My Family Favourite Tomato Sauce (page 156)., , , To make Vegan BBQ Chickpea Pizza:, in a small bowl mix together the chickpeas and BBQ sauce., , , On a lightly floured surface, stretch the pizza dough until it fits the pizza pan. Spread the tomato sauce evenly across the pizza dough., , , Pour the cheese on top of the tomato sauce, and use a spatula to spread it evenly., , When preparing the, Melty Stretchy Gooey Vegan Mozzarella,, , ½, 1x, 2x, ▢, 1, , recipe, , Melty Stretchy Gooey Vegan Mozzarella, , , , My Favorite BBQ Sauce (page 209), , Go-To Pizza Dough (page 211), , Life Changing Mozzarella (page 200) -both mozzarella recipes work great here so whichever you prefer., , My Family Favourite Tomato Sauce (page 156), , Nutrition, Calories:, 475, kcal, |, Carbohydrates:, 79, g, |, Protein:, 16, g, |, Fat:, 11, g, |, Saturated Fat:, 2, g, |, Sodium:, 1261, mg, |, Potassium:, 262, mg, |, Fiber:, 6, g, |, Sugar:, 16, g, |, Vitamin A:, 240, IU, |, Vitamin C:, 3.2, mg, |, Calcium:, 40, mg, |, Iron:, 5.7, mg, , , , , , Did You Make This Recipe?, Tag, @itdoesnttastelikechicken, on Insta and let the world see just how amazing plant-based creations can be!, , , , , Author:, Sam Turnbull, , Cuisine:, American, Canadian, Italian, , Course:, Main Course, , Bon appetegan!, , Sam., , , , , , , , , , , , , , , , , , , , , , , , , «, Vegan Peppermint Patties, 30 Vegan Candy and Chocolate Bar Recipes, », Reader Interactions, Comments, , , , , , Eta, , says, , , March 29, 2025 at 4:09 pm, , , , Hi Sam, how do we prepare the chickpea? Do we cook it first or pour straight out the bag? Thank you!, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , March 31, 2025 at 2:19 pm, , , , Hi Eta, sorry for the confusion! I have updated the recipe so that it is a bit clearer. The chickpeas should be cooked (I usually used canned). I hope that helps!, , , Reply, , , , , , , , , , Mimi, , says, , , January 25, 2025 at 1:53 pm, , , , This looks awesome!  Are you working on a vegan BBQ sauce?  I've been looking for the perfect low sodium version. I haven't perfected any that my vegetarian household likes., , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , January 26, 2025 at 12:39 pm, , , , Thanks Mimi! I have a BBQ sauce recipe in my cookbook, Fuss-Free Vegan, 🙂, , , Reply, , , , , , , , , , Lilly, , says, , , December 20, 2023 at 8:44 am, , , , I very much wanted to love this but it came out a bit bland... the positives: very nice combination, perfect (!!!) cheese. I'll definitely be sticking with this cheese! Somehow every single thing tasted great on its own but the whole pizza was lacking in flavour. Maybe it needs more salt in the cheese and also more of the barbecue sauce... otherwise, great!, , , Reply, , , , , , , , Lois, , says, , , January 25, 2022 at 9:27 pm, , , , Hi Sam, I am an oil-free kind of gal and saute with water or broth. You use oil in the pizza crust and I wondered if I left out the oil from the crust would it be okay or do you suggest to use something to replace it. Thanks!, , , Reply, , , , , , , , Daria, , says, , , July 28, 2022 at 7:29 pm, , , , Yes, it works with no oil just fine . I made it recently and it was perfect !!, , , Reply, , , , , , , , , , Zabrascrap, , says, , , October 08, 2019 at 11:27 am, , , , I didn't know what banana peppers were so I used red, yellow and green bell peppers, and used Sriracha sauce as I was out of BBQ sauce... I also used a store bought cauliflower pizza base... and added some mushrooms and tomato... My hubby and I loved it! The cheese was enough for both bases, and combined deliciously with the tomato sauce and topping flavors... Definitely a new favourite, , , Reply, , , , , , , , Sam Turnbull, , says, , , October 16, 2019 at 5:19 pm, , , , Yay! So happy you loved it 🙂, , , Reply, , , , , , , , , , Megan, , says, , , April 07, 2018 at 8:41 pm, , , , Sam.... This is seriously the best pizza and I don't even like BBQ. Even the meat eating husband went for seconds 🙂 Thank you for this recipe!, , , Reply, , , , , , , , Sam Turnbull, , says, , , April 14, 2018 at 3:46 pm, , , , Haha! That's awesome, thrilled you enjoyed it so much, Megan!, , , Reply, , , , , , , , , , Sofia, , says, , , February 25, 2018 at 12:08 am, , , , Hi Sam! I am thinking of making your pizza but don't have the cookbook for the dough. How much dough would you recommend making? A recipe with around 3-4 cups of flour in it, perhaps? Or one of the bigger ones? Thanks!, , , Reply, , , , , , , , Sofia, , says, , , February 25, 2018 at 12:15 am, , , , Also, would it be ok to make the cheese in a food processor? I know you can usually make subs like that, but I want to make sure it doesn't come out gritty. My high-powered blender broke down and I would rather not wait! 🙂, , , Reply, , , , , , , , Sam Turnbull, , says, , , February 25, 2018 at 9:43 am, , , , Hi Sofia! My pizza dough recipe uses 2 1/2 cups of flour which makes 2 pizza doughs. Unfortunately, I don't think a food processor will work too well as I don't think it will be able to turn the cashews into a completely smooth creamy, and usually food processors don't work well with liquids. Hope that helps!, , , , , , , , , , , , , Suzy, , says, , , February 17, 2018 at 9:50 am, , , , I've been looking for a vegan pizza that still felt and tasted \"cheesy\" and this fit the bill!  Instead of tomato sauce, I smeared just a tad of bbq sauce on the crust first.  My cheese didn't come out very gooey though, did I not cook it long enough?  It spread fairly easily; I used my fingers to push it around toward the edges and I didn't add the extra 1/3 cup of water to the blender.  I topped with shallots (out of red onions?!).  I know I'll be making this again using the cheese but sure would like to find a way to get that mozzy stretch out of it!  Thanks for this great recipe!, , , Reply, , , , , , , , Sam Turnbull, , says, , , February 18, 2018 at 3:53 pm, , , , Hi Suzy, so happy you enjoyed it so much! I would definitely add the extra 1/3 cup of water which will not only help the cheese spread more but it will help it from drying out too much in the oven so it will hopefully maintain the stretchiness. Hope that helps!, , , Reply, , , , , , , , , , Jaime, , says, , , February 08, 2018 at 9:59 pm, , , , This looks beyond amazing. When I was a meat eater BBQ chicken pizza was one of my favorites, so for me this is a must try!!, , , Reply, , , , , , , , Sam Turnbull, , says, , , February 09, 2018 at 8:34 am, , , , That's where I took the inspiration from! I hope you love this pizza, Jamie 😀, , , Reply, , , , , , , , , , Wanda, , says, , , January 24, 2018 at 6:25 pm, , , , Hi Sam!  Looking forward to trying this and several other pizza recipes you have, but I have one general question if I may.    For the pizza dough recipe in your cookbook, page 211, and referred to in the recipes, it says it will make enough for 2 pizzas but doesn't say what SIZE of pizza.   Could you please give us the diameter of the pizza dough that the recipe will make?  Thanks sooooo much!, , , Reply, , , , , , , , Sam Turnbull, , says, , , January 26, 2018 at 9:39 am, , , , My pizza pan is 14 inches across, but you could make your pizza bigger or smaller depending on how thick or thin you like your crust 🙂, , , Reply, , , , , , , , , 5 from 18 votes (, 13 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me via e-mail if anyone answers my comment., , , , , , , Primary Sidebar, , , , Hi Friends!, , I'm Sam Turnbull. 3x bestselling cookbook author and passionate vegan recipe writer! I LOVE vegan food, but it didn't start that way. Coming from a family of hunters, butchers, and chefs, I'm the last person I thought would go vegan., , , Here's My Story, , , , , JOIN THE NEWSLETTER, , Get a FREE cookbook with 30 of our best vegan recipes!, , , , , , Bestselling Cookbooks, , Take your vegan cooking to the next level with our fan-favorite cookbooks!, , , BUY NOW, , , , , , , Footer, , , , , , , , On the Site, , , Start Here, , About, , Recipe Index, , Tips to Use This Site, , Dietary Preferences, , Cookbooks, , Cooking Courses, , FAQ's About Veganism, , Easy Vegan Meal Plan, , Seitan School, , Contact, , Press, , , , , Shop Bestselling Cookbooks, , , Amazon, •, Barnes & Noble, •, Indigo, •, Walmart, •, Target, •, BAM, •, Bookshop, •, , , , Join Our Newsletter, , Get a, FREE, eCookbook of the top 30 fan-favorite, vegan recipes., , , , , Affiliate Link Disclosure, , On this site, I sometimes use affiliate links. This means that if you were to make a purchase through one of these links, It Doesn't Taste Like Chicken would receive a small cut, at no cost to you., , Privacy Policy, , COPYRIGHT © 2025 -, IT DOESN'T TASTE LIKE CHICKEN, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Leave a Comment, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Post Comment, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: it will be less gooey than normal which will make it easier to spread on the pizza., , *I have a new recipe for, grateable mozzarella, so if you prefer, feel free to use the new recipe, both work great!, , , Top the pizza with red onion, banana peppers, and the BBQ chickpeas. Bake for 18 to 22 minutes until the crust is golden brown. Remove from the oven then garnish by adding an extra drizzle of BBQ sauce across the pizza and sprinkling with cilantro., , , , , , 5, from, 18, votes, , (click stars to vote), , , Vegan BBQ Chickpea Pizza, , , Made with a homemade vegan mozzarella that only takes 15 minutes to make. Layered with spicy and smoky BBQ chickpeas for the ultimate hearty cheeseless pizza., , , Prep:, 20, minutes, , mins, Cook:, 22, minutes, , mins, Total:, 42, minutes, , mins, , Servings:, 4, , , PRINT, , PIN, , , Save, Saved!, , , , , COMMENT, , , ▢, ⅓, , cup, , water, ▢, 1, , cup, , cooked or canned chickpeas, , , drained and rinsed, ▢, ¼, , cup, , vegan BBQ sauce (plus more for drizzling), , , *see notes, ▢, 1, , pizza dough, , , *see notes (gluten-free if preferred), ▢, ½, , cup, , tomato sauce, , , *see notes, ▢, ⅛, , red onion,, , , thinly sliced, ▢, several slices, , hot banana peppers, ▢, 1, , handful, , cilantro,, , , roughly chopped, US Customary, -, Metric, , , Preheat your oven to 425F (220C). Lightly grease a pizza pan., it will be less gooey than normal which will make it easier to spread on the pizza., In a small bowl mix together the chickpeas and BBQ sauce., On a lightly floured surface, stretch the pizza dough until it fits the pizza pan. Spread the tomato sauce evenly across the pizza dough. Pour the cheese on top of the tomato sauce, and use a spatula to spread it evenly. Top the pizza with red onion, banana peppers, and the BBQ chickpeas. Bake for 18 to 22 minutes until the crust is golden brown. Remove from the oven then garnish by adding an extra drizzle of BBQ sauce across the pizza and sprinkling with cilantro., , , Notes, If you have a copy of, Fuss-Free Vegan",
        "Slow cooker 3 bean vegetarian chili": "Ingredients: , Growing up the chili my mom made never had meat in it, she filled it with a ton of vegetables and flavors, it wasn’t until I was older that I realized that a lot of people will typically make chili with meat., , So I relied on my memory of what my mom made along with what I thought would taste good, here is what happened:, , Texture, : I really wanted to make sure that my vegetarian chili had the right consistency, some (not all) tend to not have a lot of structure. So I ended up adding not 1 or 2 types of beans but 3. Three different beans to add to the texture I wanted., , and, , Peppers, : This chili ended up with quite a bit of peppers including jalapeños. I balanced out the sweet bell peppers with the jalapeño to get a flavorful mix!, , These are what I built this chili around. Together it makes a wonderful yet filling meal!, , , Supplies, , This recipe is an easy one:, , Typical Kitchenware such as knifes, measuring spoons, can opener. spoon, Slow Cooker, , See so easy right?!?, , , onion, –, white or yellow works in the recipe, bell peppers, –, I use a red and a yellow, you can really use any color you would like though, jalapeños, –, the recipe calls for 3, if you remove the light colored middle and seeds this will stop your chili from being spicy, if you are really worried about it you could use only 2 jalapeños, if you want more spicy keep some of the light colored insides and seeds attached, diced tomatoes, –, the large 28 ounce sized can, or two of the 15 ounce ones, chickpeas, , – aka garbanzo beans, , drained and rinsed, kidney beans, –, drained and rinsed, black beans, –, drained and rinsed, minced garlic, –, I opted for actually garlic instead of garlic powder like I have done in the past here for that fresh flavor, chili powder, –, have to have this for chili right?, kosher salt, –, I think kosher is the best salt for cooking but you could use seat salt here too, cayenne pepper, , powder, –, Just a little bit, not enough to make the whole thing spicy, although you can add more if you wish…, cumin, –, another classic chili spice, , , , How to Make Slow Cooker Vegetarian Chili, , I swear this has to be one of my easiest recipes, the hardest part is dicing up the peppers., , Dice the onion, bell peppers, and jalapeños. With the jalapeños ensure to remove the seeds and light colored insides, the easiest way to do this is to cut the jalapeño in half the long way and use a small spoon to scoop everything out, then you can dice the green part of the vegetable for the chili discarding the seeds and center part., , Once that is done add the diced vegetables, tomatoes, rinsed beans, garlic, chili powder, salt, cayenne, and cumin to the crock of a slow cooker stir to combine., , Cook on low 7-8 hours or high 3-4 hours. Serve with garnishes such as sour cream/greek yogurt, cheddar cheese, cilantro, green onions, or any of your favorite chili toppings., , , , Tips, Tricks, and Questions, , The spiciness of the jalapeño is all in the white insides and seeds, so if they are removed you get the jalapeño flavor without the spiciness (even my spicy sensitive kid will eat this). If you are making this for yourself and others that love spicy feel free to leave some of the insides/seeds attached to the jalapeños., This can easily be made on the stove top. Start by sautéing the diced vegetables until the start to become tender, then add everything to the pot and bring to a simmer. Simmer together until the vegetables are soft., , Is this Vegan?, , Yes, If you do not add any animal products as garnishes such as cheese or sour cream., , , , You might also like:, , Secret Ingredient Turkey Chili, Crockpot Creamy Pumpkin Chili, Classic Crockpot Chili, Slow Cooker Black Bean Tortilla Soup, Slow Cooker Clam Chowder, , , , , , , Yield: 4 servings, , 3 Bean Vegetarian Chili, , , , , , , , , Print, , , , , A hearty slow cooker vegetarian chili, made with three different beans and plenty of vegetables. This meatless meal is one that everyone will enjoy, it is full of bold flavors and textures plus it isn't too sweet like many vegetarian chilis., , , , , , Prep Time, , 5 minutes, , , , , Cook Time, , 8 hours, , , , , Total Time, , 8 hours, , 5 minutes, , , , , , , , , 1 onion, , 2 bell peppers (red & yellow), , 3 jalapeños, , 1 (28oz) can diced tomatoes, , 1 (15oz) can chickpeas, drained & rinsed, , 1 (15oz) can kidney beans, drained & rinsed, , 1 (15oz) can black beans, drained & rinsed, , 2 teaspoons minced garlic, , 2 tablespoons chili powder, , 1 teaspoon kosher salt, , 1/4 teaspoon cayenne pepper, , 1 teaspoon cumin, , , , , , , , , , , , , , , , Did you make this recipe?, , Please leave a comment below on the blog or share a photo with me tag @the_schmidty_wife! Can't wait to see what you made!, , , , , , , © Lauren Schmidt, , , , Cuisine:, American, , /, , Category:, Crockpot, , , , , , , , And make sure you are following me on, TikTok, , , Instagram, , and, Pinterest, , for all the latest recipes!, , , , , , , , Healthy Leftover Turkey Soup, , < PREVIOUS, , , , , , , , , , , , Cozy Hot Toddy Recipe with Tea, , NEXT >, , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Comments, , , , , , Heather W, , says, , , March 14, 2024 at 9:50 am, , , , Hi there. I absolutely love this recipe it’s on my meal plan list. However I want to try adding some meat in it for extra protein. Have you tried making it with ground beef? Not sure how to navigate adding it into the recipe…. Thanks so much!!, , , Reply, , , , , , , , Lauren Schmidt, , says, , , March 15, 2024 at 11:12 am, , , , I think the addition of ground beef would work really well, although I haven’t tried it personally. I think my one tip would be to add extra seasoning for the ground beef, I think if you are adding that much more volume you would want more spices as well to make up for it., , , Reply, , , , , , , , Brandie Davis, , says, , , April 25, 2024 at 10:08 am, , , , I have been using impossible to keep it vegan friendly., , , Reply, , , , , , , , , , Jeff, , says, , , March 18, 2024 at 6:25 am, , , , Could I use chili beans instead of kidney, chickpea, and black beans?, , , Reply, , , , , , , , Lauren Schmidt, , says, , , March 18, 2024 at 10:23 am, , , , Yes you can., , , Reply, , , , , , , , , , Emily, , says, , , August 14, 2024 at 1:07 pm, , , , This looks great, and I’m eager to make it. However, I’m surprised that there is no liquid/broth. Does this still come out soupy? Or could I add a little broth to make it more so? Thanks!, , , Reply, , , , , , , , Lauren Schmidt, , says, , , August 19, 2024 at 10:59 am, , , , This isn’t that soupy, it is more thick like a chili. The veggies all release quite a bit of liquid so the end result isn’t too thick but if you like a more soupy chili feel free to add broth or tomato juice to make it soupier., , , Reply, , , , , , , , , , Tracy, , says, , , September 2, 2024 at 11:00 am, , , , This is a family favorite. Even my carnivore husband loves this recipe., , , Reply, , , , , , , , Melissa F, , says, , , October 28, 2024 at 6:53 pm, , , , I usually only like red Chilli with meat. But this recipe was delicious and is my new favorites! It is hearty and packed with flavor!, , , Reply, , , , , , , , Brandie, , says, , , December 2, 2024 at 2:57 pm, , , , This is really good. Thought to add more protein, I add some impossible meat to the dish., , , Reply, , , , , , , , Marcia, , says, , , January 28, 2025 at 1:45 pm, , , , Everyone loves this recipe. It’s tasty and has the right amount of spice. I usually add three impossible burgers, chopped to give it texture in additional flavor. Thanks for sharing this recipe with us!You, , , Reply, , , , , , , , Christine, , says, , , February 16, 2025 at 8:42 am, , , , I have used this recipe several times as my “bringer” dish.  It’s been consistently a hit with all ages.  I am bringing it again tonight to a cast party.  Tuesday I’m making it for a bunch of hungry teens during a “tech week” rehearsal at the high school.  I have done so for the past couple of years and they demolish it.  It’s especially great for the kids who are vegetarians (who don’t always have an option when it’s a group feast) but all of them love it even if they aren’t vegetarians.  I tend to double the recipe and it works perfectly.  Thank you!, , , Reply, , , , , , , , Lauren Schmidt, , says, , , February 17, 2025 at 1:27 pm, , , , Thank you for the lovely comment, it made me so happy! I love that you and those around you enjoy it!, , , Reply, , , , , , , , , , Erin, , says, , , February 19, 2025 at 1:20 pm, , , , This recipe turned out perfect! My picky 6 and 7 year old boys loved it too and that is the highest praise! Thank you!, , , Reply, , , , « Older Comments, , , i’m lauren, , Welcome to my food blog, The Schmidty Wife. I’m all about making Real Fresh Food for Real Fun Families. Here you can find delicious recipes to bring the family together at the table. My recipes are for any home cook, to easy chicken recipes, fun pizzas, and drinks everyone will find something to love!, , More About Lauren, , , , Facebook, Instagram, Pinterest, Twitter, , , , , , , sign up for, 5 days of meals, , , Get 5 days of fresh dinner plans for free,, straight to your inbox!, , , , , , , , , , , , , , , Subscribe, , , , , , latest recipes, , Sheet Pan Easter Dinner, Shrimp and Crab Sushi Bake, Sheet Pan Balsamic Chicken Thighs, Crockpot Chicken Corn Chowder, , spring recipes, , Grilled Buffalo Chicken Sandwich, Irish Lemonade, Grilled Artichokes Recipe, Crockpot Guinness Corned Beef and Cabbage, More Spring Recipes, , Browse by Category, , Appetizers, , Breakfast, , Desserts, , Drinks, , Main Dishes, , Side Dishes, , , Browse by Protein, , Chicken, , Beef, , Turkey, , Pork, , Meatless, , Seafood, , , never miss a new recipe, , , , , , , , , , , , , , , Subscribe, , , , , , Instagram, Pinterest, TikTok, , 2022 © The Schmidty Wife, Privacy Policy, , Site Credits, , , Back to Top, , , , , , , , Skip to Recipe, , , , , , , , , , , , , , , , Instructions: , Dice the onion, bell peppers, and jalapeños. With the jalapeños ensure to remove the seeds and light colored insides, the easiest way to remove the insides and seeds is to cut the jalapeño in half the long way and use a small spoon to scoop everything out, from there dice the green part of the vegetable., Add the diced vegetables, tomatoes, chickpeas, kidney beans, black beans, garlic, chili powder, salt, cayenne, and cumin to the crock of a slow cooker stir to combine., Cook on low 7-8 hours or high 3-4 hours. Serve with garnishes such are sour cream/greek yogurt, cheddar cheese, cilanto, green onions, or any of your favorite chili toppings., , , , Notes, , , The spiciness of the jalapeño is all in the white insides and seeds, so if they are removed you get the jalapeño flavor without the spiciness (even my spicy sensitive kid will eat this). If you are making this for yourself and others that love spicy feel free to leave some of the insides/seeds attached to the jalapeños., This can easily be made on the stove top. Start by sautéing the diced vegetables until the start to become tender, then add everything to the pot and bring to a simmer. Simmer together until the vegetables are soft., , , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , Hamilton Beach 6-Quart Slow Cooker, , , , , , , , , Anolon Japanese Stainless Steel Knife Set with Sheaths, , , , , , , , Nutrition Information:, , Yield:, 4, , Serving Size:, 2 cups, , Amount Per Serving:, , Calories:, 233, Total Fat:, 3g, Saturated Fat:, 0g, Trans Fat:, 0g, Unsaturated Fat:, 2g, Cholesterol:, 0mg, Sodium:, 706mg, Carbohydrates:, 43g, Fiber:, 13g, Sugar:, 7g, Protein:, 13g, , , Nutritional data is automated",
        "Mushroom Bourguignon": "Ingredients: , since I’m all about healthy and plant-based foods, but not all about lacking flavor, while garlic, onion powder, and fresh thyme ensure that the taste of this dish is unforgettable., , , , Mushrooms, – Used in place of meat and prepared to be a highlight of flavor within the dish., , Vegetable Broth, – Used in place of beef broth to give that classic bourguignon flavor while maintaining the cruelty-free aspect., , Peas, – The addition of multiple vegetables gives an array of flavor points within the dish and only makes it more nutrient-dense and protein-rich., , Plant-Based Milk, – Perfect for making a dish creamy without worrying about dairy., , , Check the, recipe card below, amounts, etc., , , How to Make Vegan Mushroom Bourguignon?, , STEP 1:, Prepare your mushrooms and potatoes by soaking dried mushrooms then peeling and chopping potatoes before placing them in a pot to boil., , STEP 2:, Once potatoes are finished, , , STEP 3:, Heat oil in a pan and sauté the onions for a few minutes before adding in the mushrooms, carrots, peas, garlic, thyme, and the rest of the spices. Sauté a bit longer., , STEP 4:, Add in the red wine, tamari, and vegetable broth. Cover and let simmer until vegetables have softened. Combine the plant-based milk and cornstarch before adding it to the pan., , STEP 5:, Taste your sauce and adjust seasonings if need be. Pour the sauce over the mashed potatoes, garnish with a touch of fresh thyme, and enjoy!, , , Helpful Tips and Variations, , , Use sweet potatoes instead of white potatoes, – This will change up the flavor aspect of the mashed potatoes considerably. However, if you enjoy the taste of sweet potatoes, it can be a delicious change., , Other plant-based milk options in the mashed potatoes, – Any plant-based milk option is definitely fine to use. However, coconut milk is higher in fat content which means it will be creamier than options such as almond milk, oat milk, etc. In order to counteract this, simply add a tablespoon of oil or vegan butter., , How to Store, – This mushroom bourguignon should be stored in an airtight container in the fridge for up to 3 days. It can also be frozen in an airtight container and kept for up to 3 months. To reheat from the freezer, let it sit and come to a warmer state on its own – overnight is best. Then, reheat on the stove on a lower setting., , Red Wine Substitute, – The red wine is actually quite important in this recipe, however, if you prefer not to use red wine, simply replace the amount of red wine with vegetable broth., , , , How To Serve Mushroom Bourguignon?, , I love to serve mushroom bourguignon over mashed potatoes, however, you can also serve it over rice or pasta if you like. It’s such a versatile dish that will always taste very delicious!, , , You might want to check out my other delicious, vegan mushroom recipes, :, , , Vegan Mushroom Stroganoff, , Vegan Mushroom Risotto, , Portobello Steaks, , Vegan Baked Ziti With Mushrooms, , Pasta Bake With Mushrooms, , Creamy Ramen With Mushrooms, , Green Bean Casserole, , Vegan Gravy With Mushrooms, , , If you make this tasty vegan mushroom bourguignon, do let me know in the comments below and tag me in your Instagram/Facebook posts with, @elavegan, and #elavegan., , , , , Vegan Mushroom Bourguignon, , , Author:, Michaela Vais, , , Rich and flavorful vegan mushroom bourguignon, perfect for any night of the week. A creamy and hearty vegetarian dish, with all the aspects of a supreme comfort food. This recipe is naturally gluten-free, dairy-free, and easy to make., , , 4.99, from, 81, votes, , , Servings, 3, , , Prep, 15, minutes, , mins, Cook, 35, minutes, , mins, Total, 50, minutes, , mins, , , , Rate recipe, , Print recipe, , Pin recipe, , , , , , , , , , Video, , , , , , , , , , , 1x, 2x, 3x, Mushroom Bourguignon, ▢, 1, , oz, , , (, 28, , g, ), , dried mushrooms, , OR 10 oz fresh sliced mushrooms, ▢, 1, , tbsp, , , , oil, ▢, ½, , large, , , , onion, , diced, ▢, 2, , small/medium, , , (, 140, , g, ), , carrots, , chopped, ▢, ⅔, , cup, , , (, 100, , g, ), , peas, , frozen (optional), ▢, 3, , , , garlic cloves, , minced, ▢, ¾, , tbsp, , , , fresh thyme, , or 1 tsp dried thyme, ▢, 1, , tsp, , , , onion powder, ▢, ¾, , tsp, , , , sea salt, , or to taste, ▢, ¼, , tsp, , , , black pepper, , or to taste, ▢, ¼, , tsp, , , , smoked paprika, ▢, ⅓, , cup, , , (, 80, , ml, ), , red wine, , (see notes), ▢, ½, , tbsp, , , , tamari, , or soy sauce, ▢, ¾, , cup, , , (, 180, , ml, ), , vegetable broth, , + 1/4 cup more if needed, ▢, ¼, , cup, , , (, 60, , ml, ), , plant-based milk, ▢, ¾, , tbsp, , , , cornstarch, , or arrowroot flour, Mashed Potatoes:, ▢, 4, , medium-sized, , , (, 600, , g, ), , potatoes, ▢, ¼, , cup, , , (, 60, , ml, ), , coconut milk, , canned (*see notes), ▢, ½, , tsp, , , , nutmeg, , or to taste, ▢, , , Black pepper & sea salt, , to taste,  Instructions: , Soak dried mushrooms in warm water for about 15-20 minutes, then drain. Skip this step if you are using fresh mushrooms., Meanwhile, peel and chop potatoes, add them to a pot with water and salt. Bring to a boil. Cook on medium heat for about 15 minutes or until tender, drain. Transfer back to the pot, add coconut milk, nutmeg, black pepper, and sea salt to taste and mash with a potato masher (don't use a food processor or blender). Set aside., Heat oil in a pan over medium heat. Add onion and sauté for 4-5 minutes. Add drained mushrooms, carrot, peas, garlic, thyme, and all spices. Sauté for a further one minute, stirring frequently., Add red wine. Cook for about 2 minutes. Then add tamari (or soy sauce), and vegetable broth., Let simmer over low/medium heat with a lid on for about 10-12 minutes or until the carrots and peas are softened., Combine plant-based milk and cornstarch in a bowl, stir with a whisk until there are no lumps. Add the mixture to the pan and stir (the sauce will thicken). Let simmer for a few more minutes., Taste and adjust seasonings. Add more salt/pepper/spices if needed. Serve mushroom bourguignon with mashed potatoes and enjoy! Store leftovers covered in the refrigerator for up to 3 days., , , Notes, , Red wine:, I would NOT recommend skipping, however, if you can't have red wine, simply use vegetable broth instead., , Mashed potatoes:, You can use any other plant-based milk, however, I would recommend adding at least 1 tbsp of oil or vegan butter if you use e.g. almond milk, oat milk or rice milk since canned coconut milk is higher in fat., , Recipe serves 2-3. Nutrition facts are for one serving., , , , , Nutrition Facts, Vegan Mushroom Bourguignon, Amount per Serving, Calories, 376, % Daily Value*, Fat, , 10, g, 15, %, Saturated Fat, , 4, g, 20, %, Carbohydrates, , 60, g, 20, %, Fiber, , 12, g, 48, %, Sugar, , 6, g, 7, %, Protein, , 12, g, 24, %, * Percent Daily Values are based on a 2000 calorie diet., , Nutrition information is an estimate and has been calculated automatically, , , , , , , Simple and Delicious Vegan Cookbook by ElaVegan, CLICK HERE to order!, , If you are using Pinterest, feel free to pin the following photo:, , , , Share this post:, , Share on, Pinterest, , Share on, Facebook, , Share on, X (Twitter), , , Previous Post:, « Vegan Ricotta Cheese (No Tofu!), Next Post:, German Pan-Fried Potatoes (Bratkartoffeln) », Reader Interactions, Comments, , , , , , Char, , , 27. December, 2024 at 16:38, , , , , , , This was easy and delicious! Thank you!!, , , Reply, , , , , , , , Ela, , , 28. December, 2024 at 10:55, , , , So glad it turned out well, Char. Thanks for your comment. 🙂, , , Reply, , , , , , , , , , Noelle, , , 13. November, 2024 at 22:39, , , , , , , Absolutely deeelish!!! on the top faves list now, so scrumptious!, , , Reply, , , , , , , , Ela, , , 14. November, 2024 at 04:10, , , , Hi Noelle, I am so glad it came out delicious! Thanks for your great feedback. 🙂, , , Reply, , , , , , , , , , Becka, , , 28. September, 2024 at 18:49, , , , , , , This was really good! I didn’t have any red wine since I don’t drink it but I made a couple substitutions to add more flavor. I used coconut aminos in lieu of soy sauce and gave a little more than the recipe called for. I also added in some vegan worcestershire sauce and used a “not beef” broth in place of vegetable broth. I will use this recipe again in the future, thank you!, , , Reply, , , , , , , , Ela, , , 29. September, 2024 at 05:10, , , , You are most welcome, Becka. I am glad it turned out yummy! 🙂, , , Reply, , , , , , « Older Comments, , , , 4.99 from 81 votes (, 28 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , Primary Sidebar, Facebook, Instagram, Pinterest, RSS, YouTube, , About Me, , , Welcome to my blog ElaVegan. My name is Michaela Vais, I’m a passionate food blogger, recipe developer, food photographer, and author of the cookbook, Simple and Delicious Vegan, . Being creative in the kitchen and eating healthy vegan food is my passion., Read More…, , , , , Order My Cookbook, , , AMAZON ASSOCIATES DISCLOSURE, , This website is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com., The affiliate links are marked with an asterisk (*)., , , , Copyright © 2025 · Elavegan.com, Privacy Policy, ·, Disclosure, , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,"
    }
}