{
    "ingredients": {
        "Vegan BBQ Sauce": "apple cider vinegar,maple syrup,veg broth,ketchup,orange marmalade,worcestershire sauce vegan,onion powder,allspice",
        "Banana BBQ Sauce": "coconut oil,banana,apple cider vinegar,veg broth,ketchup,orange marmalade,worcestershire sauce vegan,onion powder,mustard",
        "Vegan French Onion Spread": "firm tofu, almond milk,apple cider vinegar,soy sauce,green onion,nutritional yeast",
        "Cranberry Sauce": "orange peel,cloves,cranberries,honey,ginger",
        "Fixate Tartar Sauce": "greek yogurt,dill pickle,mustard,chives,lemon juice,lemon peel,capers,dill weed",
        "Lemon Garlic Sauce": "lemon juice,egg yolk,garlic,dijon mustard,mustard seeds",
        "Vegan BBQ sauce": "apple cider vinegar,maple syrup,veg broth,orange marmalade,ketchup,allspice,worcestershire sauce vegan,onion powder",
        "Vegan Worcestershire Sauce": "apple cider vinegar,soy sauce,brown sugar,mustard,allspice,onion powder",
        "Vegan Buffalo Tofu Dip": "extra firm tofu,soy sauce,vegan BBQ sauce,cashews,hot sauce,white miso paste,onion powder,tortilla chips"
    },
    "recipe_url": {
        "Vegan BBQ Sauce": "fixate_recipes\\Sauce and Dressing\\FXR_Vegan-BBQ-Sauce_R_05.30.19.pdf",
        "Banana BBQ Sauce": "fixate_recipes\\Sauce and Dressing\\FXR-EN-Banana_BBQ_Sauce-3.26.21-Recipe.pdf",
        "Vegan French Onion Spread": "fixate_recipes\\Lunch\\FXR-EN-Ultimate_Vegan_Sando_with_Vegan_French_Onion_Spread-05.29.20-Recipe.pdf",
        "Cranberry Sauce": "fixate_recipes\\Sauce and Dressing\\FXR_Cranberry_Sauce_R_03.19.18.pdf",
        "Fixate Tartar Sauce": "fixate_recipes\\Sauce and Dressing\\FXR_FIXATE-Tartar-Sauce_R_04.16.18.pdf",
        "Lemon Garlic Sauce": "fixate_recipes\\Sauce and Dressing\\FXR_Lemon_Garlic_Sauce_R_03.19.18.pdf",
        "Vegan BBQ sauce": "fixate_recipes\\Sauce and Dressing\\FXR_Vegan-BBQ-Sauce_R_05.30.19.pdf",
        "Vegan Worcestershire Sauce": "https://www.karissasvegankitchen.com/vegan-worcestershire-sauce/",
        "Vegan Buffalo Tofu Dip": "https://itdoesnttastelikechicken.com/vegan-buffalo-tofu-dip-buffalo-chicken-dip/#recipe"
    },
    "Recipe": {
        "Vegan BBQ Sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN BBQ SAUCE, SERVES: 12 (2 Tbsp. each) Prep Time: 7 min. Cooking Time: 23 min., CONTAINER EQUIVALENTS (per serving):, ½, VEGAN CONTAINER EQUIVALENTS (per serving):    B  ½, 2 Tbsp., apple cider vinegar, 2 Tbsp., pure maple syrup, 1 cup, reduced-sodium vegetable broth, 1 cup, all-natural ketchup, gluten-free, 1 Tbsp., orange marmalade, 1 Tbsp., Worcestershire sauce, vegan, , gluten-free, 1 tsp., onion powder, 1 tsp., garlic powder, 1 tsp., ground smoked paprika, ½ tsp., ground black pepper, ½ tsp., chili powder, ½ tsp., ground cumin, ¼ tsp., ground allspice, ¼ tsp., sea salt (or Himalayan salt), 1. \t Combine vinegar and maple syrup in medium saucepan over medium-high, heat; cook for 3 minutes, until liquid just begins to caramelize., 2. \t Whisk in broth, ketchup, marmalade, Worcestershire sauce, onion, powder, garlic powder, paprika, pepper, chili powder, cumin, allspice, , and salt. Reduce heat to medium-low; cook for 20 minutes, or until, mixture slightly thickens., NUTRITIONAL INFORMATION (per serving): Calories: 46  Total Fat: 0 g  Saturated Fat: 0 g  Cholesterol: 0 mg  Sodium: 136 mg  Carbohydrates: 10 g  Fiber: 0 g, Sugars: 9 g  Protein: 0 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Banana BBQ Sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., BANANA BBQ SAUCE, O, SERVES: 8 (approx. ¼ cup each) Prep Time: 10 min.  Cooking Time: 32 min.., CONTAINER EQUIVALENTS:, ½, ½, VEGAN CONTAINER EQUIVALENTS:    B  ½, ½, 1 Tbsp., extra-virgin organic coconut oil, 1, large banana, sliced, 2 Tbsp., apple cider vinegar, 1 cup, low-sodium organic vegetable broth, 1 cup, all-natural ketchup, no sugar added, 1 Tbsp., orange marmalade, 1 Tbsp., Worcestershire sauce, gluten-free, , vegan, ½ tsp., ground black pepper, 1 tsp., onion powder, 1 tsp., garlic powder, ½ tsp., mustard powder, ¼ tsp., ground allspice, ½ tsp., ground cumin, ½ tsp., ground coriander, ¼ tsp., ground cayenne pepper (optional), ½ tsp., smoked sea salt (or Himalayan salt), 1 tsp., ground smoked paprika, ½ tsp., chili powder, 1.\t Heat oil in medium saucepan over high heat., 2.\t Add banana; cook, stirring occasionally, for 3 to 4 minutes, or until banana, is dark brown and mushy. Reduce heat to medium., 3.\t Add vinegar; cook, stirring frequently, for 1 to 2 minutes, or until pan is, almost dry., 4.\t Add broth, ketchup, marmalade, Worcestershire sauce, black pepper, , onion powder, garlic powder, mustard powder, allspice, cumin, coriander, , cayenne pepper (if desired), salt, paprika, and chili powder. Whisk to, blend. Bring to a gentle boil over medium heat., Reduce heat to low; gently boil, stirring occasionally, for 20 minutes, , or until sauce thickens., RECIPE NOTE:, •\t Refrigerate leftover sauce in an airtight container for up to 4 to 5 days., NUTRITIONAL INFORMATION (per serving): Calories: 66  Total Fat: 2 g  Saturated Fat: 2 g  Cholesterol: 0 mg  Sodium: 590 mg  Carbohydrates: 9 g  Fiber: 1 g, Sugars: 6 g  Protein: 0 g, RECIPES, © 2021 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan French Onion Spread": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN FRENCH ONION SPREAD, SERVES: 9 (approx. 2 Tbsp. each) Prep Time: 5 min. Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, ½, VEGAN CONTAINER EQUIVALENTS (per serving):, ½, 4 oz., , , \u0007organic firm tofu, , drained, patted dry, 2 Tbsp., , , \u0007unsweetened almond, milk, 1 Tbsp. + 1½ tsp., apple cider vinegar, ½ tsp., , , \u0007reduced-sodium tamari, soy sauce, ¼ cup, , , sliced green onion, 1 Tbsp., , , onion powder, 2 tsp., , , garlic powder, 1 tsp., , , nutritional yeast, ¾ tsp., , , \u0007sea salt (or Himalayan, salt), ¼ tsp., , , ground black pepper, 1. \t Place tofu, milk, vinegar, tamari, green onion, onion powder, garlic powder, , nutritional yeast, salt, and pepper in blender; cover. Blend until smooth, , scraping down sides as needed., 2.\t\t Serve immediately, or store in the refrigerator in an airtight container for up, to 4 days., NUTRITIONAL INFORMATION (per serving): Calories: 18  Total Fat: 1 g  Saturated Fat: 0 g  Cholesterol: 0 mg  Sodium: 20 mg  Carbohydrates: 2 g  Fiber: 0 g, Sugars: 0 g  Protein: 1 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 19, Instructions: ",
        "Cranberry Sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., 2-inch slice, , orange peel, 2, , whole cloves, 3 cups, , fresh (or frozen) cranberries, ½ cup, , raw honey, ¾ cup, , water, ½-inch slice, fresh ginger, peeled, CRANBERRY SAUCE, O, SERVES: 8 (approx. ¼ cup each)    Prep Time: 10 min.    Cooking Time: 10 min., CONTAINER EQUIVALENTS (per serving):, 1, ½, 1.\t Stud orange peel with cloves., 2.\t Heat orange peel with cloves, cranberries, honey, water, and ginger in, medium saucepan over medium-high heat. Bring to a gentle boil. Reduce, heat to medium-low; cook, stirring occasionally, for 8 to 10 minutes, or, until cranberries are soft and sauce has slightly thickened., 3.\t Remove from heat. Remove orange peel with cloves and ginger from sauce;, discard. Cool (if desired) and serve!, TIP:, For a slightly thinner sauce, add ¼ cup water., NUTRITIONAL INFORMATION (per serving): Calories: 78   Total Fat: 0 g   Saturated Fat: 0 g   Cholesterol: 0 mg   Sodium: 1 mg   Carbohydrates: 22 g   Fiber: 2 g, Sugars: 18 g   Protein: 0 g, OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Fixate Tartar Sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., FIXATE TARTAR SAUCE, SERVES: 24 (1 Tbsp. each)  Prep Time: 10 min.  Cooking Time: None, CONTAINER EQUIVALENTS (per serving): Free, 1½ cups, reduced-fat (2%) plain, Greek yogurt, ¼ cup, coarsely chopped dill pickle, (approx. 1 small), 1 Tbsp., whole-grain mustard, 1 Tbsp., coarsely chopped chives, 1 dash, ground black pepper, ¼ tsp., sea salt (or Himalaya n salt), 2 Tbsp., fresh lemon juice, 1 tsp., finely grated lemon peel, (lemon zest), 1 Tbsp., capers, in brine, drained, 1 Tbsp., fresh dill weed, 1. \t Place yogurt, pickle, mustard, chives, pepper, salt, lemon juice, lemon, peel, capers, and dill in food processor; process until smooth., RECIPE NOTES:, •\t \t1 Tbsp. is a Free Food. If you eat 6 Tbsp., they would be counted, as, ½., •\t \tThis is great as a sauce on cooked veggies., NUTRITIONAL INFORMATION (per serving): Calories: 12  Total Fat: 0 g  Saturated Fat: 0 g   Cholesterol: 1 mg  Sodium: 66 mg  Carbohydrates: 1 g  Fiber: 0 g, Sugars: 1 g  Protein: 1 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Lemon Garlic Sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., GF, VG, PF, LEMON GARLIC SAUCE, O, SERVES: 5  (2 Tbsp. each)    Prep Time: 10 min.    Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, 2 Tbsp., fresh lemon juice, 1, large egg yolk, pasteurized*, 2 cloves, garlic, crushed, 1 Tbsp., Dijon mustard, 1 Tbsp., whole-grain mustard, gluten-free, , Sea salt (or Himalayan salt), and ground black pepper, (to taste; optional), 3 Tbsp., extra-virgin olive oil, 1. \t Combine lemon juice, egg yolk, garlic, and mustards in a small bowl;, mix well., 2. \t Season with salt and pepper, if desired., 3. \t Slowly add oil, whisking continuously until well blended., NUTRITIONAL INFORMATION (per serving): Calories: 92    Total Fat: 9 g    Saturated Fat: 1 g    Cholesterol: 37 mg    Sodium: 203 mg    Carbohydrates: 2 g, Fiber: 0 g    Sugars: 0 g    Protein: 1 g, OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan BBQ sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN BBQ SAUCE, SERVES: 12 (2 Tbsp. each) Prep Time: 7 min. Cooking Time: 23 min., CONTAINER EQUIVALENTS (per serving):, ½, VEGAN CONTAINER EQUIVALENTS (per serving):    B  ½, 2 Tbsp., apple cider vinegar, 2 Tbsp., pure maple syrup, 1 cup, reduced-sodium vegetable broth, 1 cup, all-natural ketchup, gluten-free, 1 Tbsp., orange marmalade, 1 Tbsp., Worcestershire sauce, vegan, , gluten-free, 1 tsp., onion powder, 1 tsp., garlic powder, 1 tsp., ground smoked paprika, ½ tsp., ground black pepper, ½ tsp., chili powder, ½ tsp., ground cumin, ¼ tsp., ground allspice, ¼ tsp., sea salt (or Himalayan salt), 1. \t Combine vinegar and maple syrup in medium saucepan over medium-high, heat; cook for 3 minutes, until liquid just begins to caramelize., 2. \t Whisk in broth, ketchup, marmalade, Worcestershire sauce, onion, powder, garlic powder, paprika, pepper, chili powder, cumin, allspice, , and salt. Reduce heat to medium-low; cook for 20 minutes, or until, mixture slightly thickens., NUTRITIONAL INFORMATION (per serving): Calories: 46  Total Fat: 0 g  Saturated Fat: 0 g  Cholesterol: 0 mg  Sodium: 136 mg  Carbohydrates: 10 g  Fiber: 0 g, Sugars: 9 g  Protein: 0 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Worcestershire Sauce": "Ingredients: , Now you can make all of the, Swedish meatballs, your heart desires., , , , , Vegan Worcestershire Sauce, , , Karissa's Vegan Kitchen, , , Homemade Worcestershire sauce made without fish sauce or anchovies., , , 4.85, from, 161, votes, , , , Print Recipe, , Pin Recipe, , , , , , Prep Time, 2, minutes, , mins, Cook Time, 5, minutes, , mins, Total Time, 7, minutes, , mins, , , , , , , Course, Condiment, Cuisine, Vegan, , , , , , , , , 1, , cup, , apple cider vinegar, 1/3, , cup, , soy sauce, 3, , tbsp, , brown sugar, 1, , tsp, , dijon mustard, 1/2, , tsp, , allspice, 1/2, , tsp, , garlic powder, 1/2, , tsp, , onion powder, 1/8, , tsp, , black pepper, , and cover. Turn the heat on low. Heat until it's just barely brought to a simmer., Remove from the heat and allow to cool to room temperature., Store in a jar in the fridge for up to 1-2 months. Use your best judgment., , , Notes, Makes about a cup and a half of sauce., , , , , , , , Did you try this recipe?, Let us know, how it was!, , , , , , , , , Karissa, , , , , , , , , Post navigation, , Previous, , Previous, One-Pot Vegan Sloppy Joes, Next, Continue, , The Easy Way to Make Homemade Nut Milk, , , , , , Similar Posts, , , , , , , , , , , , , , Vegan Instant Pot Mashed Potatoes, , , , , , , , , , , , , , , Vegan Shepherd’s Pie, , , , , , , , , , , , , , , Best Vegan Chocolate Chip Pancakes, , , , , , , , , , , , , , , Crumbled Tempeh Sausage, , , , , , , , , , , , , , , Grilled Corn on the Cob, , , , , , , , , , , , , , , Indulgent Instant Pot Vegan Mac and Cheese, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meet Karissa, , , , Welcome to Karissa's Vegan Kitchen! I’m happy you’re here! My name is Karissa and I’ve been cooking up delicious vegan food since going vegan in 2016. Not vegan and just want to eat more plants? We don't judge - everyone is welcome in our kitchen., , , , About Karissa, , Search, , , , , , , , Other Reader Favs, , , , , , , , , , Vegan Black Bean Tacos, , , , , , , , , , , , , , Creamy Vegan Potato Soup, , , , , , , , , , , , , , Chocolate Peanut Butter Granola, , , , , , , , , , , , ,  Instructions: , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Featured On, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Home, , Contact, , Amazon Affiliate Disclaimer, , Privacy Policy & Disclosures, , , , , , , , , , , © 2025 Karissa's Vegan Kitchen, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Recipes, Toggle child menu, Expand, , , , Appetizers, , Breakfast, , Lunch, , Dinner, , Side Dishes, , Dessert, , Snacks, , Soup, , Tofu Recipes, , One-Pot Recipes, , , , About, Toggle child menu, Expand, , , , Work With Me, , Contact, , , , eBooks, Toggle child menu, Expand, , , , 7-Day Meal Plan, , Vibrant Vegan Dinners, , Vegan Family Recipes, , , , Subscribe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , ,",
        "Vegan Buffalo Tofu Dip": "Ingredients: , ½, 1x, 2x, ▢, 1, , recipe, , Vegan BBQ Shredded Tofu, , , (see step 1 before preparing), ▢, 1 ½, , cups, , raw cashews, ▢, 1 ½, , cups, , water, ▢, ½, , cup, , Franks Red Hot, , , (or similar sauce), ▢, 1, , tablespoon, , white miso paste, ▢, ½, , teaspoon, , onion powder, ▢, ½, , teaspoon, , garlic powder, ▢, Tortilla chips and/or celery sticks, , , for serving, US Customary, -, Metric,  Instructions: stopping after step 4 is complete. In other words, bake the tofu, but do not mix it with the BBQ sauce and water., If you have a high-powdered blender you can skip straight to the next step. If you have a regular blender, you may want to soften the cashews first to ensure they blend smoothly. To do this add the cashews to a small pot and cover with water. Bring to a boil and cook for about 10 minutes until the cashews are very tender. Drain and rinse with cold water before using., Add the cashews, 1 ½ cups water, Franks Red Hot, miso paste, onion powder, and garlic powder to a blender, and blend until completely smooth and creamy, stopping to scrap the sides as needed., Add the prepared shredded tofu to an 8\" x 8\" baking dish (or similar sized dish). Pour over the cashew mixture and stir to combine. Bake for 20 - 25 minutes until the top has darkened slightly and the dip is heated through. Serve hot with tortilla chips and celery sticks. This Vegan Buffalo Chicken Dip is perfect for any game day, a BBQ, or when you need some spicy cheesy vegan dipping!, , , Common Questions:, , Can I make Vegan Buffalo Tofu Dip ahead of time?, The unbaked dip can be prepared ahead of time and kept in the fridge for up to 2 days. Then bake when you're ready to serve. If baking straight from the fridge, it may take a couple minutes longer to heat through., Can I freeze, , Vegan Buffalo Tofu Dip?, Yes, you can. As long as you let the dip cool before freezing and then freeze in an air-tight container. Be the dip is cooled as any condensation will result in a layer of frost on the dip. If stored properly, it should last approx. 2 months in the freezer.   If you try this recipe, let us know by leaving a comment, rating it, and don't forget to tag, @itdoesnttastelikechicken, on Instagram. Bon appetegan! Sam Turnbull., , , , , 5, from, 55, votes, , (click stars to vote), , , Vegan Buffalo Chicken Dip, , , Tastes just like the classic, but better because it's easy to make, dairy-free, gluten-free, way healthier, make-ahead, and super delicious. Creamy, cheesy, spicy goodness perfect for any game day, BBQ, party, or movie night., , , Prep:, 15, minutes, , mins, Cook:, 1, hour, , hr, Total:, 1, hour, , hr, , 15, minutes, , mins, , Servings:, 8, , (makes about 4 cups), , , PRINT, , PIN, , , Save, Saved!, , , , , COMMENT, , , , On, Off, Prepare the, Vegan BBQ Shredded Tofu, stopping after step 4 is complete. In other words, bake the tofu, but do not mix it with the BBQ sauce and water., , Preheat your oven to 350F (180C)., If you have a, high-powdered blender, you can skip straight to the next step. If you have a regular blender, you may want to soften the cashews first to ensure they blend smoothly. To do this add the cashews to a small pot and cover with water. Bring to a boil and cook for about 10 minutes until the cashews are very tender. Drain and rinse with cold water before using., , Add the cashews, 1 ½ cups water, Franks Red Hot, miso paste, onion powder, and garlic powder to a blender, and blend until completely smooth and creamy, stopping to scrap the sides as needed., , Add the prepared shredded tofu to an 8\" x 8\" baking dish (or similar sized dish). Pour over the cashew mixture and stir to combine. Bake for 20 - 25 minutes until the top has darkened slightly and the dip is heated through. Serve hot with tortilla chips and celery sticks., , , , Notes, Cashews:, raw cashews are my preferences as they have a mild flavour and are quite soft so they are easy to blend. For substitutions, you can try replacing the cashews with softened, blanched almonds, , or softened, raw sunflower seeds, ., , Miso paste, :, miso paste adds an aged umami taste which makes this dip taste cheesy. Miso is my preferred flavour wise, but you can try subbing sauerkraut, or olive juice for a similar briny flavour., , Make ahead:, The unbaked dip can be prepared ahead of time and kept in the fridge for up to 2 days. Then bake when you're ready to serve. If baking straight from the fridge, it may take a couple minutes longer to heat through., , Nutrition, Serving:, 1, serving without chips (recipe makes 8 servings), |, Calories:, 182, kcal, |, Carbohydrates:, 10, g, |, Protein:, 8, g, |, Fat:, 13, g, |, Saturated Fat:, 2, g, |, Sodium:, 706, mg, |, Potassium:, 246, mg, |, Fiber:, 1, g, |, Sugar:, 2, g, |, Vitamin A:, 210, IU, |, Vitamin C:, 1, mg, |, Calcium:, 26, mg, |, Iron:, 2, mg, , , , , , Did You Make This Recipe?, Tag, @itdoesnttastelikechicken, on Insta and let the world see just how amazing plant-based creations can be!, , , , , Author:, Sam Turnbull, , Cuisine:, American, , Course:, Appetizer, Snack, , , , , , , , , , , , , , , , , , , , , , «, Vegan Cashew Ranch Dressing, Easy Crispy Vegan Crackers, », Reader Interactions, Comments, , , , , , Catherine Milovina, , says, , , February 08, 2025 at 9:09 pm, , , , I made this recipe for a NYE potluck appetizer party. I served it with carrots, celery, and multigrain crackers. I was watching everyone try it, without them knowing I was vegan, and the reactions were unanimous! They all loved it!, I then let them know that it was vegan using tofu as the main ingredient! Thank goodness that I brought it, as it was the only vegan dish available!, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , February 09, 2025 at 1:13 pm, , , , Oh that's so amazing!! I'm so happy everyone loved it Catherine!!, , , Reply, , , , , , , , , , Brian Thomson, , says, , , February 08, 2025 at 7:18 pm, , , , Can the shredding be done using a food processor?, , , Reply, , , , , , , , Sam Turnbull @ It Doesn't Taste Like Chicken, , says, , , February 09, 2025 at 1:12 pm, , , , Hi Brian, yes if you have a grater attachment that will work great! I wouldn't recommend using a regular \"S\" blade, as this will turn the tofu into a spread texture. Enjoy!, , , Reply, , , , , , , , , , Blythe, , says, , , September 15, 2024 at 4:19 pm, , , , Always a crowd favorite among all types of eaters!, , , Reply, , , , , , , , Jess @ It Doesn't Taste Like Chicken, , says, , , September 16, 2024 at 11:01 am, , , , Yay!, , , Reply, , , , , , , , , , Bonnie, , says, , , February 18, 2024 at 7:16 pm, , , , This is so good! I’m made it for the Super Bowl last weekend and again today because I was craving it all week. I followed the recipe exactly as written and it is perfection!, , , Reply, , , , , , , , Jess @ IDTLC Support, , says, , , March 04, 2024 at 10:26 am, , , , Terrific!, , , Reply, , , , , , , , , , Tracy, , says, , , February 11, 2024 at 9:01 pm, , , , This was amazing. I can’t stop eating it. My sauce seemed a bit watery, so I added some nutritional yeast and let it blend for 5 minutes to heat/thicken. I never had the chicken and cheese version but always thought it looked amazing. I am so glad to have this animal free, healthier version!  Thank you so much!, , , Reply, , , , , , , , Jess @ IDTLC Support, , says, , , February 12, 2024 at 9:52 pm, , , , We're so thrilled you loved it so much!, , , Reply, , , , , , , , , , Karen, , says, , , February 11, 2024 at 3:53 pm, , , , Best ever I couldn't stop eating it!, , , Reply, , , , , , , , Jess @ IDTLC Support, , says, , , February 12, 2024 at 9:51 pm, , , , Yay!, , , Reply, , , , , , , , , , Elise, , says, , , February 10, 2024 at 4:40 pm, , , , If we wanted less “buffalo” and more “queso” would you just recommend removing the franks red hot and adding some nutritional yeast? Thank you!, Just bought your books, , , Reply, , , , , , , , Sam Turnbull, , says, , , February 13, 2024 at 8:28 am, , , , This would be a different recipe, so I don't know the exact measurements as I haven't tested it, but you could try substituting Franks with red salsa. I hope that helps!, , , Reply, , , , , , , , , , Sariah Gresham, , says, , , April 21, 2023 at 7:20 pm, , , , After blending, my mixture looks much more watery than yours. Is it because I soaked my cashews overnight?, , , Reply, , , , , , , , Jess @ IDTLC Support, , says, , , April 28, 2023 at 12:23 pm, , , , If they were rinsed, it shouldn't be too watery but if you like a thicker dip, you can cut the added water down., , , Reply, , , , , , , , , , Hadley, , says, , , April 29, 2022 at 2:33 pm, , , , Soooo… I haven’t baked it yet, but can’t stop tasting this sauce—incredibly delicious! I added a quarter cup of nutritional yeast because the Buffalo chicken dip we used to eat before we went vegan had cheddar cheese in it. I can’t believe how good this is and how similar it tastes to the real deal. Wow! Thanks for ANOTHER great recipe, Sam!, , , Reply, , , , , , , , Sam Turnbull, , says, , , May 26, 2022 at 10:12 am, , , , Yay! So happy ou love it Hadley 🙂, , , Reply, , , , , , , , , , Silver, , says, , , March 18, 2022 at 3:34 pm, , , , This recipe is insanely good!! Wow! Sam does it again (and again and again) ! Served it with some homemade pita breads and it was sooo good. Next time I won’t cook it so long because I would of preferred it to be runnier and I will double the crispy tofu! Thanks Sam 🙂, , , Reply, , , , , , , , Sam Turnbull, , says, , , March 23, 2022 at 2:04 pm, , , , Amazing! So happy you loved it 🙂, , , Reply, , , , , , , , , , Andrea, , says, , , February 13, 2022 at 6:32 pm, , , , Just made this today and it was outrageous! Made the recipe as is, because you are the expert, after all, and all of your recipes are amazing! This was no exception! This will be a regular in my repertoire for sure! Thanks for another great vegan and gluten free (un)guilty pleasure!, , , Reply, , , , , , , , in2insight, , says, , , February 11, 2022 at 12:34 pm, , , , This blew our socks off!, Super yummy with a great kick of heat (I LOVE spicy foods and this one was at the top limit for me...) 🙂, , Thank you for sharing this awesome treat., , , Reply, , , , , , , , Melanie, , says, , , January 11, 2022 at 9:43 pm, , , , This is wonderful. I followed the recipe as written but my tofu came out more crumbled than shredded even though I used a box grater.  I burned my mouth because I wanted to try this so bad. It's spicy, creamy, chewy and delicious. Thanks for this wonderful substitution to a SAD favorite., , , Reply, , , , , , , , Sam Turnbull, , says, , , January 25, 2022 at 4:12 pm, , , , You're most welcome Melanie! Different brands grate differently but as long as you enjoyed it, that's all that matters!, , , Reply, , , , , , , , , , Amanda, , says, , , December 26, 2021 at 6:49 pm, , , , This is delicious! I actually used a can of white beans instead of cashews to have a more affordable, nut-free option. Also my shredded tofu did get a bit over baked, so I will lessen the baking time or lower the temp next time on making the shredded tofu step, but overall, the dip turned out great!, , , Reply, , , , , , , , Sam Turnbull, , says, , , January 02, 2022 at 2:53 pm, , , , So happy you enjoyed it Amanda, and I will have to try it with beans 🙂, , , Reply, , , , , , , , , , Mark, , says, , , December 11, 2021 at 6:58 pm, , , , Just made this for the 4th time.  It's perfect.  Couldn't imagine a way to make it better.  I tend to bake it a wee bit longer (25-30 mins)...., , We are making this for Xmas Eve apps for the famjam.  Thank you again for this amazing recipe., , , Reply, , , , , , , , Sam Turnbull, , says, , , December 11, 2021 at 8:10 pm, , , , Awww! You're most welcome! I'm so happy you love it so much 🙂, , , Reply, , , , , , « Older Comments, , , , 5 from 55 votes (, 26 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me via e-mail if anyone answers my comment., , , , , , , Primary Sidebar, , , , Hi Friends!, , I'm Sam Turnbull. 3x bestselling cookbook author and passionate vegan recipe writer! I LOVE vegan food, but it didn't start that way. Coming from a family of hunters, butchers, and chefs, I'm the last person I thought would go vegan., , , Here's My Story, , , , , JOIN THE NEWSLETTER, , Get a FREE cookbook with 30 of our best vegan recipes!, , , , , , Bestselling Cookbooks, , Take your vegan cooking to the next level with our fan-favorite cookbooks!, , , BUY NOW, , , , , , , Footer, , , , , , , , On the Site, , , Start Here, , About, , Recipe Index, , Tips to Use This Site, , Dietary Preferences, , Cookbooks, , Cooking Courses, , FAQ's About Veganism, , Easy Vegan Meal Plan, , Seitan School, , Contact, , Press, , , , , Shop Bestselling Cookbooks, , , Amazon, •, Barnes & Noble, •, Indigo, •, Walmart, •, Target, •, BAM, •, Bookshop, •, , , , Join Our Newsletter, , Get a, FREE, eCookbook of the top 30 fan-favorite, vegan recipes., , , , , Affiliate Link Disclosure, , On this site, I sometimes use affiliate links. This means that if you were to make a purchase through one of these links, It Doesn't Taste Like Chicken would receive a small cut, at no cost to you., , Privacy Policy, , COPYRIGHT © 2025 -, IT DOESN'T TASTE LIKE CHICKEN, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Leave a Comment, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Post Comment, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,"
    }
}