{
    "ingredients": {
        "Tahini Sauce": "sesame seeds, olive oil",
        "Hummus at Home": "chickpeas, lemon juice, tahini, garlic, aquafaba",
        "Roasted Red Pepper Hummus": "red bell peppers, tahini, garlic, chickpeas",
        "Slow roasted tomato hummus": "cherry tomatoes,sugar,garlic,chickpeas,tahini,tomatoes,oregano,pita bread",
        "Green pea Hummus and Spring Mezze": "chickpeas,green peas,tahini,lemon,garlic,cucuber,carrot,strawberries,asparagus,radishes",
        "Baba Ghanoush": "eggplants,tahini paste,lemon juice,lemon peel",
        "Vegan Tzatziki": "cucumber, dahi, garlic, dill, lemon juice",
        "Morrocon Chermoula Sauce": "cumin, coriander, lemon juice,olive oil, parsley,garlic",
        "Muhammara": "red bell pepper, garlic, walnuts, breadcrumbs, lemon juice"
    },
    "recipe_url": {
        "Tahini Sauce": "https://www.inspiredtaste.net/26901/easy-tahini-recipe/",
        "Hummus at Home": "https://www.inspiredtaste.net/15938/easy-and-smooth-hummus-recipe/#itr-recipe-15938",
        "Roasted Red Pepper Hummus": "https://www.chilipeppermadness.com/recipes/roasted-red-pepper-hummus/",
        "Slow roasted tomato hummus": "https://www.howsweeteats.com/2019/03/slow-roasted-tomato-hummus/",
        "Green pea Hummus and Spring Mezze": "https://www.occasionallyeggs.com/green-pea-hummus/#wprm-recipe-container-7915",
        "Baba Ghanoush": "fixate_recipes\\Side and Snack\\FXR_Baba_Ghanoush_R_03.19.18.pdf",
        "Vegan Tzatziki": "https://minimalistbaker.com/6-ingredient-vegan-tzatziki/",
        "Morrocon Chermoula Sauce": "https://cooktoria.com/chermoula-sauce/",
        "Muhammara": "https://www.pinterest.co.uk/pin/496592296425852896/"
    },
    "Recipe": {
        "Tahini Sauce": "Ingredients: , , Chicken, , Pork, , Beef, , Seafood, , Shrimp, , Salmon, , Pasta, , Turkey, , Avocado, , View All », , , , , , Recipe Index, , Blog, , About Us, , Saved Recipes, , , , , , , , My Account, , , , , , , Search for, , , , , , , , , , , , Recipes, , , Latest Recipes, , Fan Favorites, , Recipes by Category, , , Recipe Videos, , Our Favorites, , Budget Friendly, , Meatless, , Dinner, , Soups and Stews, , Appetizers, , Side Dishes, , Breakfast, , Baking, , Quick, , Make Ahead, , Cocktails, , View All », , , , Recipes by Diet, , , Gluten-free, , Dairy-free, , Light, , Low-Carb, , Vegetarian, , Vegan, , View All », , , , Recipes by Season, , , Spring, , Summer, , Fall, , Winter, , Holiday, , Thanksgiving, , View All », , , , , , Chicken, , Pork, , Beef, , Seafood, , Shrimp, , Salmon, , Pasta, , Turkey, , Avocado, , View All », , , , , , Recipe Index, , Blog, , About Us, , Saved Recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , Easy Tahini, , , , , , , , , , , , , , , , , , , , , , 5.0 (94 reviews), , , , , , , , , Leave a review, , , , , , , Jump to Recipe + Video, , , , Pin, , , , Save, , , , , , , This homemade tahini recipe is so easy to make, , and it makes super creamy tahini that tastes much better than anything you can buy at the store. It’s ready in less than 15 minutes!, , , , Tahini is a paste made from sesame seeds, . It is a staple in many cuisines, especially in the Mediterranean and the Middle East. It’s vegan, gluten-free, tastes nutty, and is incredibly simple to make., , Store-bought jars of tahini can be expensive. Homemade tahini is not only cheaper, but it also tastes amazing. Use tahini to make, homemade hummus, ,, tahini dressing, ,, tahini sauce, , and more!, , , , , Sesame seeds:, I use hulled seeds (pictured below on the left) and toast them in a dry skillet to bring out their natural nuttiness., , Oil:, I add a few tablespoons of neutral-flavored oil to help the tahini turn into a creamy smooth paste. Try avocado oil, extra-virgin olive oil, or vegetable oil. Sesame oil (not toasted sesame oil) also works., , Salt:, Optional, but I always use it. It just makes the tahini taste better., , , How to Make Homemade Tahini, , Tahini is incredibly simple to make. You will, grind sesame seeds in a food processor with some oil until smooth., If you’ve ever made nut butter like, almond butter, or, homemade peanut butter, , the process is very similar., , , Toasted sesame seeds make our tahini taste even better!, Toast them in a dry skillet over medium-low heat, stirring often and watching them closely until they turn golden., , Toss your toasted seeds into the food processor, . Process until they form a crumbly paste. A powerful food processor helps, but most standard ones will work, too. (I’ve included tips for using a blender below the recipe.) It’s going to go through a few stages. First, the seeds break down into a crumbly mixture that honestly doesn’t really look like it’s going to turn into tahini. Then, it eventually breaks down even more and becomes the creamy tahini we are looking for., , , Adding a few tablespoons of mild-tasting oil is helpful., This helps the tahini become more smooth, creamy, and drippy. You can use less oil, but the tahini won’t be as easy to pour. I find 3 to 4 tablespoons perfect for a texture like store-bought tahini. Process a bit more, scraping down the bowl as needed, and your tahini is now ready to use!, , Ways to Use Tahini, , The most well-known way to use tahini is to, make hummus, , but we use it in our kitchen in many other ways. We use tahini to make other dips like, baba ganoush, (a roasted eggplant dip) and serve it plain next to, homemade falafel, ., , It’s also the perfect base for sauces and dressings. Look at our, tahini salad dressing, or this, creamy tahini sauce, with lemon and garlic. I also use that creamy sauce for this, tahini kale salad, , a dip for our, garlic asparagus, , these, chicken lettuce wraps, , and a drizzle for, honey roasted carrots, ., , You can even use tahini for desserts. Seriously. Drizzle over ice cream or use it instead of peanut butter or butter in your favorite cookies. Once you have tahini in your fridge (it lasts over a month), we bet you will find yourself adding it to a variety of dishes without direction from us!, , , , , , Easy Tahini, , , , , , , , , , , , , , , , , , , , , , 5.0 (94 reviews), , , , , , , , , Leave a review, , , , , , , Save, , , , Pin, , , , Email, , , , Print, , , , , , , PREP, , 10mins, , , , COOK, , 5mins, , , , TOTAL, , 15mins, , , , , Making tahini at home is easy and cheaper than buying it from the store. I also think it tastes better! For the best deals, look for sesame seeds in bulk bins or at International, Asian, and Middle Eastern markets., , While you can make tahini from unhulled, sprouted, or hulled sesame seeds, we prefer hulled seeds., , , Makes approximately 1/2 Cup, , , Watch Us Make the Recipe, , , , , You Will Need, , 1 cup (140g) sesame seeds, we prefer hulled, , 2 to 4 tablespoons neutral flavored oil such as avocado,  grape seed, vegetable or a light olive oil, , Pinch of salt, optional, , , ,  Instructions: , , 1, Add sesame seeds to a wide, dry saucepan over medium-low heat and toast, stirring constantly, until the seeds become fragrant and turn light golden, 3 to 5 minutes. Stay close and keep stirring, as the seeds can burn quickly., , 2, Add the toasted sesame seeds to the bowl of a food processor, then process until a crumbly paste, about 1 minute., , 3, Add 2 tablespoons of the oil, then process for 2 to 3 minutes more, stopping to scrape the bottom and sides of the food processor a couple of times., , 4, Check the tahini’s consistency. It should be smooth, not gritty, and should be pourable. You may need to process for another minute and add 1 to 2 more tablespoons of oil., , 5, Taste the tahini for seasoning, then add salt to taste. Process 5 to 10 seconds to mix., , 6, Store tahini in an airtight container in the fridge for one month., , , , , , , Adam and Joanne's Tips, , , Storing:, Keep tahini in an airtight jar in the refrigerator for a month. After some time in the fridge, it might separate like natural peanut butter. To fix this, stir it well before using it., , Sprouted and black sesame seeds:, You can make tahini from sprouted or black sesame seeds. If you have sprouted your seeds at home, make sure that you dry and toast them before making the tahini., , Unhulled sesame seeds:, Tahini made from unhulled sesame seeds tastes more bitter and isn’t as smooth as when made from hulled seeds. I recommend using hulled seeds., , Sesame seeds not processing:, The sesame seeds take a minute or two to start breaking down (watch our video for reference). If your seeds are whirling around your processor bowl, you may need a higher-powered processor, or the blade may be sitting above the seeds. If you think this is the case, try increasing the sesame seeds in the bowl., , Blender:, I prefer using my food processor, but if you have a high-powered blender, you should be able to make tahini. As you blend, stop and scrape down the sides and bottom of the blender to incorporate all the seeds., , The nutrition facts provided below are estimates., , , , , , Nutrition Per Serving, , Serving Size, , 1 tablespoon, , /, , Calories, , 136, , /, , Protein, , 3g, , /, , Carbohydrate, , 5g, , /, , Dietary Fiber, , 3g, , /, , Total Sugars, , 0g, , /, , Total Fat, , 12g, , /, , Saturated Fat, , 2g, , /, , Cholesterol, , 0mg, , , , , , AUTHOR:, , , Adam Gallagher, , , , , , , , , , , We’re Adam and Joanne, a couple passionate about cooking and sharing delicious, reliable recipes since 2009. Our goal? To inspire you to get in the kitchen and confidently cook fresh and flavorful meals., More About Us, , , , You May Also Like..., , , , , , , , , , Perfect Tahini Sauce, , , , , , , , , , , Best Tahini Dressing, , , , , , , , , , , Easy Hummus (Better than Store-Bought), , , , , , , , , , , Honey Roasted Carrots with Tahini Sauce, , , , , , , , , , , Perfect Homemade Falafel, , , , , , , , , , , Garlic Flatbread, , , , , , , , 397, comments…, Leave a Review, , , , Amy Robinson, , April 8, 2025, , , Thanks I never have made this before or have never had it before it was easy to make not sure but I think I will get better to make it I added it to the humus it turned out good thanks, , , , , , Reply, , , , Jerrianne Barnhart, , April 3, 2025, , , This recipe is delicious but I had to add a lot more EVOO to make it pourable, , , Reply, , , , Chrisha, , February 16, 2025, , , I absolutely love your recipe for your favorite hummus. It is my favorite too now! I love that you include videos. I can’t wait to try your tahini recipe. Thank you so much for sharing your knowledge and expertise!, , , Reply, , , , Gina J, , February 14, 2025, , , Greetings from the UK. I will try this as I often want a specific quantity of tahini and don’t want to buy a whole jar that is nearly always wasted in the back of the cupboard. Fresher is best. Thank you., , , , , , Reply, , , , Linda, , January 26, 2025, , , Thank you! Had I known it was so easy to make I would have never run out of it., , , , , , Reply, , , , Donna Chretien, , January 19, 2025, , , This tahini recipe is much better tasting and a much much better value than any store bought I have used. Delicious. No more buying tahini for me!, , , , , , Reply, , , , Natalie, , December 2, 2024, , , , , , , , Reply, , , , Tejanshi.kamani, , November 17, 2024, , , After viewing the recipe and trying it, I have to conclude that it is great for those who haven’t tried anything as such although this is exactly similar to something we call raitha/perugu pachadi in our culture and with a few weeks this can be even more wonderful., , , Reply, , , , Tejanshi.kamani, , November 17, 2024, , , After viewing the recipe and trying it, I have to conclude that it is great for those who haven’t tried anything as such although this is exactly similar to something we call ratha/perugu pachadi in our culture and with a few weeks this can be even more wonderful., , , , , , Reply, , , , Tina, , November 1, 2024, , , I just tried it a few hours ago and honestly it’s perfect. The recipe is exactly how it should be. Salt is good but not too much.I made a sauce from this tahini, garlic, lemon, vinegar, pepper, parsley and it was amazing in a cauliflower casserole.Definitely will do again when I run out 🙂, , , , , , Reply, , , , , Load More Comments, , , Leave a Reply, Cancel reply, , Leave a Review, Your email address will not be published., , Required fields are marked, *, , , , Save my name, email, and website in this browser for the next time I comment., , , Rate this recipe!, , , , , , , , , , , , , , , , , , , , , , , , , , , , All comments are moderated before appearing on the site. Thank you so much for waiting. First time commenting? Please review our, comment guidelines, . You must be at least 16 years old to post a comment. All comments are governed by our, privacy policy & terms, ., Δ, , , , Previous Post:, The Best Vegetable Broth, , Next Post:, Best Roasted Turkey We’ve Ever Made, , , , , , Welcome!, We are Adam and Joanne, the creators of Inspired Taste, a recipe blog devoted to home cooks. Look around for easy recipes, straightforward recipe videos, and cooking inspiration., More about us, ., , , , , , , , , , , , , , , , , , , , , , , About Us, , Subscribe, , Contact Us, , Press, , Privacy & Terms, , , , , , , , , , , , , , , , , , © 2009-2025, Inspired Taste, Inc., , , , , , , , , , ,",
        "Hummus at Home": "Ingredients: , , Chicken, , Pork, , Beef, , Seafood, , Shrimp, , Salmon, , Pasta, , Turkey, , Avocado, , View All », , , , , , Recipe Index, , Blog, , About Us, , Saved Recipes, , , , , , , , My Account, , , , , , , Search for, , , , , , , , , , , , Recipes, , , Latest Recipes, , Fan Favorites, , Recipes by Category, , , Recipe Videos, , Our Favorites, , Budget Friendly, , Meatless, , Dinner, , Soups and Stews, , Appetizers, , Side Dishes, , Breakfast, , Baking, , Quick, , Make Ahead, , Cocktails, , View All », , , , Recipes by Diet, , , Gluten-free, , Dairy-free, , Light, , Low-Carb, , Vegetarian, , Vegan, , View All », , , , Recipes by Season, , , Spring, , Summer, , Fall, , Winter, , Holiday, , Thanksgiving, , View All », , , , , , Chicken, , Pork, , Beef, , Seafood, , Shrimp, , Salmon, , Pasta, , Turkey, , Avocado, , View All », , , , , , Recipe Index, , Blog, , About Us, , Saved Recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , Easy Hummus (Better than Store-Bought), , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4.9 (1798 reviews), , , , , , , , , Leave a review, , , , , , , Jump to Recipe + Video, , , , Pin, , , , Save, , , , , , , My favorite hummus recipe!, With a few simple tricks, you can make the best creamy, smooth homemade hummus, and yes, it’s better than store-bought., , , Hummus is a delicious spread (or dip) made from chickpeas, , tahini, , lemon, and spices. It is a popular dish in the Middle East and the Mediterranean. You can find it in most grocery stores, but trust me, you’ll want to skip those and make your own. Homemade hummus is just so much better!, , This hummus recipe is a keeper, (our family’s been making it for years!). So many of our readers swear it’s their forever hummus recipe, too. I’ve also shared our recipe for, roasted red pepper hummus, , which I bet you’ll also love!, , , , Chickpeas (or garbanzo beans):, These are the base for my hummus, and they can be canned or cooked from scratch. I use both, but homemade chickpeas have a slightly better flavor., , Tahini:, This sesame seed paste makes the hummus so delicious. You can buy it at the store or make your own. I prefer homemade because it makes my hummus 100% from scratch. Here’s my, homemade tahini recipe, . To make hummus without tahini, see my tips below the recipe., , Lemon juice:, Skip the bottled stuff! Fresh lemon juice makes all the difference in great hummus., , Garlic:, I use one small clove for just the right amount of flavor, but you can add more for a stronger garlic flavor or use roasted garlic instead. Here’s, how to roast garlic, ., , Ground cumin and salt:, Both improve the flavor of our hummus, and the cumin adds a little extra richness and spice. In our video, I sprinkle Za’atar seasoning on top for serving, which I love!, , Olive oil:, This gives my hummus a luxuriously smooth texture. I also like to drizzle a little extra on top when serving. Fruity, light-flavored olive oils are my favorite for making hummus., , , How to Make Hummus from Scratch, , Seriously, this simple trick makes a huge difference., , Tahini and lemon juice go in first. Then, before you add anything else, turn on the food processor and let it run for a minute or two. See the photos below? In the first photo, I’m pouring tahini into a clean food processor., , , After a minute of being whirled, whipped, and creamed in the food processor, it turns into the paste you see in the next photo. It’s lighter in color and much thicker., , , Now, processing the first batch for a minute before adding the rest. Then, I stand back and let my food processor run., , When it looks close to done, I add a splash of cold water while the processor is still running. After a few tablespoons of water, the mixture transforms into, fluffy, creamy, whipped hummus., , I use cold water, but aquafaba (chickpea liquid) works incredibly well, too. If you want to learn more about it, here’s our, ultimate guide to aquafaba, . Some of our readers have also suggested using ice cubes instead of the water., , , Do You Need to Peel the Chickpeas for Hummus?, , I usually skip peeling my chickpeas when making hummus, but it’s totally up to you! If you have some extra time and want the absolute smoothest texture, go ahead and peel them. It takes about 10 minutes to peel a can, and it does make a subtle difference. The photo below shows slightly smoother hummus made with peeled chickpeas on the left., , Even though the peeled chickpeas make a slightly smoother hummus, the difference isn’t huge. So, if you’re short on time, skip peeling. Your hummus will still be delicious! For more recipes with chickpeas, see all of our, chickpea recipes, ., , , What to Serve with Hummus, , There are so many delicious ways to enjoy hummus! I love dipping, fluffy flatbread, , , homemade pita bread, , or fresh, crunchy veggies in it. It’s also delicious, next to other spreads and dips, like my homemade, baba ganoush, (a roasted eggplant dip), , tzatziki sauce, , , homemade labneh, , and our incredible, tahini sauce, . For extra flavor, try adding some toppings, as I do for my, spiced beef and feta hummus, ., , Hummus is also great on sandwiches and wraps, alongside, homemade falafel, , or as a healthy, flavorful filling for, lettuce wraps, . I’ve even got a recipe for, easy hummus cups, with cucumber and tomato if you want something quick and easy., , , , , , Easy Hummus (Better than Store-Bought), , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4.9 (1798 reviews), , , , , , , , , Leave a review, , , , , , , Save, , , , Pin, , , , Email, , , , Print, , , , , , , PREP, , 10mins, , , , TOTAL, , 10mins, , , , , Homemade hummus is easy to make and tastes much better than anything you can buy at the store. You will need tahini, a paste made from sesame seeds. Buy it or make it yourself. Here’s our, homemade tahini recipe, , which I highly recommend for the best homemade hummus! To leave it out, add more olive oil., , , 6 Servings (Makes 1 1/2 cups), , , Watch Us Make the Recipe, , , , , You Will Need, , 1 (15oz) can chickpeas, drained or 1 ½ cups (250g) cooked chickpeas, , 1/4 cup (60ml) fresh lemon juice, 1 large lemon, , 1/4 cup (60ml) well-stirred tahini, try our, homemade tahini recipe, , 1 small garlic clove, minced, , 2 tablespoons (30ml) extra-virgin olive oil, plus more for serving, , 1/2 teaspoon ground cumin, , Salt to taste, , 2 to 3 tablespoons (45ml) cold water or aquafaba, , Dash ground paprika, sumac, or Za’atar for serving, , , ,  Instructions: , , 1, In the bowl of a food processor, combine the tahini and lemon juice and process for 1 minute. Scrape the sides and bottom of the bowl, then process for 30 seconds more. This extra time helps “whip” or “cream” the tahini, making the hummus smooth and creamy., , 2, Add the olive oil, minced garlic, cumin, and a 1/2 teaspoon of salt to the whipped tahini and lemon juice. Process for 30 seconds, scrape the sides and bottom of the bowl, and then process for another 30 seconds or until well blended., , 3, Drain the chickpeas. Then add half of the chickpeas to the food processor and process for 1 minute. Scrape the sides and bottom of the bowl, then add the remaining chickpeas and process them until thick and relatively smooth, 1 to 2 minutes., , 4, The hummus will likely be too thick and still have tiny bits of chickpea. To fix this, slowly add 2 to 3 tablespoons of cold water or aquafaba with the food processor turned on until you reach the perfect consistency., , 5, Taste and adjust as needed. Serve hummus with a drizzle of olive oil and a sprinkle of paprika, sumac, or Za’atar., , 6, Store homemade hummus in an airtight container and refrigerate for up to one week. Freeze, covered with a thin layer of olive oil, for up to one month., , , , , , , Adam and Joanne's Tips, , , How to cook dried chickpeas:, Use canned or home-cooked chickpeas for this recipe. Here is, how we cook dried chickpeas, ., , Hummus without tahini:, For the best hummus, which rivals our favorite store brands, use tahini. However, a chickpea puree without it is still quite delicious. Just add more olive oil. Another option is to use natural, unsweetened, creamy peanut butter in its place., , If you like garlicky hummus, , increase the garlic by a clove or use, roasted garlic, ., , Aquafaba for fluffy hummus:, This is the thick starchy liquid in a can of beans (or the bean cooking liquid). You can use this instead of water in the last step of the recipe. Instead of plain water, add a splash of aquafaba at the end. As it whips, it creates an incredibly light and airy texture. Taste your aquafaba first. If it’s too salty, use less salt when making your hummus., , Tahini & lemon juice are not creaming:, Depending on your food processor, the blade might not come into contact with the tahini and lemon juice. You need to increase the amount of liquid in the food processor, so add the olive oil. If they still do not cream, add a tablespoon of cold water., , Blender:, A food processor is best for making hummus, but a high-powered blender will work. Be sure to scrape the sides down a few extra times as you make it., , The nutrition facts provided below are estimates., , , , , , Nutrition Per Serving, , Serving Size, , 1/4 cup, , /, , Calories, , 155, , /, , Total Fat, , 11g, , /, , Saturated Fat, , 1.5g, , /, , Cholesterol, , 0mg, , /, , Sodium, , 278.3mg, , /, , Carbohydrate, , 11.8g, , /, , Dietary Fiber, , 2.9g, , /, , Total Sugars, , 1.8g, , /, , Protein, , 4.5g, , , , , , AUTHOR:, , , Joanne Gallagher, , , , , , , , , , , We’re Adam and Joanne, a couple passionate about cooking and sharing delicious, reliable recipes since 2009. Our goal? To inspire you to get in the kitchen and confidently cook fresh and flavorful meals., More About Us, , , , You May Also Like..., , , , , , , , , , Easy Tahini, , , , , , , , , , , Easy Roasted Red Pepper Hummus, , , , , , , , , , , Easy Baba Ganoush, , , , , , , , , , , Perfect Homemade Falafel, , , , , , , , , , , Garlic Flatbread, , , , , , , , , , , Perfect Tahini Sauce, , , , , , , , 2879, comments…, Leave a Review, , , , Lieselle Southey, , April 9, 2025, , , Quick, easy, delicious!, , , , , , Reply, , , , Killian, , April 8, 2025, , , SO GOOD!!!! It was simply devoured by my friends and family. Very easy too. Thank youuu, , , , , , Reply, , , , Margaret A. Uffindell, , April 8, 2025, , , Best hummus I’ve ever made. We added a bit of cayenne pepper to it., , , , , , Reply, , , , , Load More Comments, , , Leave a Reply, Cancel reply, , Leave a Review, Your email address will not be published., , Required fields are marked, *, , , , Save my name, email, and website in this browser for the next time I comment., , , Rate this recipe!, , , , , , , , , , , , , , , , , , , , , , , , , , , , All comments are moderated before appearing on the site. Thank you so much for waiting. First time commenting? Please review our, comment guidelines, . You must be at least 16 years old to post a comment. All comments are governed by our, privacy policy & terms, ., Δ, , , , Previous Post:, Best Juicy Pork Tenderloin, , Next Post:, Perfect Guacamole, , , , , , Welcome!, We are Adam and Joanne, the creators of Inspired Taste, a recipe blog devoted to home cooks. Look around for easy recipes, straightforward recipe videos, and cooking inspiration., More about us, ., , , , , , , , , , , , , , , , , , , , , , , About Us, , Subscribe, , Contact Us, , Press, , Privacy & Terms, , , , , , , , , , , , , , , , , , © 2009-2025, Inspired Taste, Inc., , , , , , , , , , ,",
        "Roasted Red Pepper Hummus": "Ingredients: , , Red Bell Peppers., , Tahini., , Lemon Juice., , Garlic Cloves., Chopped., , Salt., , Cumin., , Garbanzo Beans., Chickpeas – drain and rinse., , Extra Virgin Olive Oil., , , For Serving, , , Pita Bread, ., , Spicy Red Pepper Flakes., , , , , chili powder, , cayenne pepper, for a touch of heat, hot sauce or roasted garlic. What's your favorite addition?, , Heat Factor., Roasted red pepper hummus isn't meant to be hot, as we're working with bell peppers, which have no heat to them. However, you can easily up the zest factor by adding in extra spicy chili flakes, spicy chili powder such as, ghost pepper powder, , or roasting some hotter peppers to go along with the red peppers. Or drizzle in some of your favorite, hot sauce, !, , , , , Roasted Red Pepper Hummus Serving Suggestions, , , Pita Bread., I like to lightly warm large pitas, then slice them into 6 wedges each. They're easy to grab for spreading the hummus., , Pita Chips., You can easily pick up a bag of crunchy pita chips and serve them alongside your roasted red pepper hummus. I like the crunch factor. Or make some, homemade bagel chips, as the serving vessel. Great stuff!, , Toasty Bread., I greatly enjoy hummus spread over toast points. Find a good crusty bread, toast it up, then slice it into serving sized pieces. I'll be right over!, , Quick and Easy Lunch., Patty and I like quick lunches, so when I have hummus in the refrigerator, I like to toast up some crusty bread, spread on the hummus, then top it with sliced tomatoes and/or sliced avocado. Just top it with some Tuscan olive oil, flaky sea salt or, citrus salt, , and a few spicy chili flakes and enjoy!, , , , , Storage & Leftovers, , Storing your, Roasted Red Pepper Hummus, in an, airtight container, in the fridge may allow you to store the leftovers for up to 3-5 days. To maximize the storage life, make sure to refrigerate it promptly., , That's it, my friends., I hope you enjoy my recipe for roasted red pepper hummus. It's definitely a good one! Great for game day, your next holiday party, outdoor gathering, or for a nice and healthy snack pretty much anytime! It's one of our favorites., , , , , Try Some of My Other Popular Recipes, , , Roasted Red Peppers, , Fiery Buffalo-Blue Cheese Hummus, , Htipiti: Roasted Red Pepper-Feta Dip, , Muhammara: Roasted Red Pepper-Walnut Dip, , Ajvar (Roasted Red Pepper and Eggplant Spread), , Sweet Roasted Red Pepper Sauce, , Peri Peri Sauce, , Sambal Oelek, , Zacusca: Romanian Roasted Eggplant & Red Pepper Sauce, , Guasacaca (Venezuelan Avocado Dip), , , , , Got any questions? Ask away!, I’m happy to help. If you enjoy this recipe, I hope you’ll leave a comment with some STARS. Also, please share it on social media. Don’t forget to tag us at #ChiliPepperMadness. I’ll be sure to share! Thanks! — Mike H., , , , , Print, , Roasted Red Pepper Hummus Recipe, , , This homemade roasted red pepper hummus recipe is smooth and creamy and so much better when made from scratch. Great for game day, holidays or an anytime snack. Don't forget the pitas!, , , , , , , , , , , , Save Recipe, Saved!, , , , , , , Course:, Appetizer, Salsa, Side Dish, Snack, , Cuisine:, American, Indian, , Keyword:, chickpeas, dip, hummus, recipe, roasted peppers, snack, spicy, , , Prep Time:, 10, minutes, , minutes, , Cook Time:, 20, minutes, , minutes, , , Calories:, 78, kcal, , , Author:, Mike Hultquist, , , , Servings:, 12, , Tap or hover to scale, , , , , 4.91, from, 10, votes, , Leave a Review, , , 2, , red bell peppers, 4, , tablespoons, , tahini, Juice from 1 lemon, , or more as desired, 4-5, , cloves, , garlic, , chopped, 1, , teaspoon, , salt, 1, , teaspoon, , cumin, 2, , cans garbanzo beans, , chickpeas – 30 ounces total, drained, ¼, , cup, , extra virgin olive oil + more for garnish, FOR SERVING: Pita bread, , spicy red pepper flakes, , , , Reply, , , , , , , , Mike Hultquist, , says, , , January 04, 2023 at 8:22 am, , , , Awesome! Glad you enjoyed it, Tammy! Let it rip! =), , , Reply, , , , , , , , , , Mary, , says, , , July 03, 2021 at 5:45 pm, , , , This is absolutely delicious! I’ve made both with peppers that I’ve roasted and the jarred ones (when im pressed for time) either way they are fabulous! My go to for bringing to a party! Bravo!, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , July 04, 2021 at 7:07 am, , , , Thanks, Mary! Glad you enjoyed it!! Yes!, , , Reply, , , , , , , , , , Valerie Hughes, , says, , , September 25, 2020 at 3:51 pm, , , , First time making hummus. This is delish!!! I took the skins off the chickpeas and used jarred roasted peppers. How long will it last in fridge, if we leave any leftover 🙂, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , September 25, 2020 at 4:46 pm, , , , Excellent, Valerie! Thanks! This should last a week or so covered in the refrigerator., , , Reply, , , , , , , , , , Mags, , says, , , September 16, 2020 at 9:55 am, , , , How much is considered one serving? Like a tablespoon?, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , September 16, 2020 at 10:03 am, , , , About a 1/4 cup or so, Mags., , , Reply, , , , , , , , , , Monique S, , says, , , August 27, 2020 at 3:34 pm, , , , So easy to make and tastes far better than store varieties!!    I won’t be buying store hummus ever again!, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , August 27, 2020 at 6:39 pm, , , , Thanks, Monique!, , , Reply, , , , , , , , , , Julie, , says, , , June 29, 2020 at 6:39 am, , , , Can I use jarred roasted red peppers?  How much of that would be needed?, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , June 29, 2020 at 8:25 am, , , , Julie, yes, you surely can. I would use 4-6 ounces, though you could include more if you wanted. Let me know how it turns out for you., , , Reply, , , , , , , , , , Damien C., , says, , , April 09, 2020 at 6:42 am, , , , This turned out smooth and delicious. The roasted red pepper flavor made this better than regular hummus, which I love. Another winner. I wouldn't make it any other way., , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , April 09, 2020 at 6:45 am, , , , Thanks, Damien! Glad you enjoyed it!, , , Reply, , , , , , , , , , Madelaine Makarow, , says, , , April 09, 2020 at 3:55 am, , , , Very good and very easy hummus recipe!  I have always made the \"Moosewood\" cookbook recipe before and never tried adding any flavors so this is definitely a game changer.  I put a few too many garlic cloves in mine, five was just too much, and I think I would have preferred to use just slightly less cumin.  Also, there was a technique I ran across once upon a time to lighten the tahini first by mixing it up with a little hot water until it was creamier (and was there also a pinch of baking soda involved?  I will have to look back at my notes somewhere...) which I think would have given a lighter texture overall, which in turn might have allowed the roasted red pepper flavor to be more pronounced.  I will definitely try this recipe again.  Thank you, you creativity has opened up a whole new hummus world of possibilities, lol., , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , April 09, 2020 at 6:42 am, , , , Thank you, Madelaine. I appreciate the comments. Glad you enjoyed it., , , Reply, , , , , , , , , , Eric, , says, , , March 29, 2020 at 3:06 am, , , , Here in Thailand we have Indian stores so the beans will be dry more than likely, which is fine.  I have zero experience with such legumes.  Any tips?, , , Reply, , , , , , , , Eric, , says, , , March 29, 2020 at 3:13 am, , , , Follow up to my question:  when I say I have zero experience with legumes/beans I mean I don't know anything about the prep needed to get dry ones ready for hummus.  Pealed?  Soaked?  No clue! 😉, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , March 29, 2020 at 1:42 pm, , , , Eric, see my reply above. Let me know how it goes for you., , , Reply, , , , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , March 29, 2020 at 1:42 pm, , , , Eric, with dried chickpeas, you need to soak them in plenty of water overnight, |, Stories, |, Privacy, |, Disclaimer, | © 2024 Chili Pepper Madness, , , , EXCLUSIVE MEMBER OF MEDIAVINE FOOD, , , , , , , , , , , , , , , , , , , , , , , , Instructions: , To Roast the Red Peppers, , To roast the peppers over an open flame, , turn a gas flame to HIGH. Set the peppers directly over the flame. Turn the peppers occasionally with tongs until all sides are blackened and blistered. Do not let them burn or turn white., , To roast the peppers in the oven, , preheat oven to 400 degrees or set it to broil. Set the peppers onto a baking sheet (aluminum foil will make for easy cleanup), and bake for 20-30 minutes, until the skins are blackened and blistered, turning occasionally to evenly roast the peppers., , To roast the peppers in the oven broiler, , set your oven to broil. Set the peppers onto a baking sheet (aluminum foil will make for easy cleanup), skin sides up, and broil for 5-10 minutes, until the skins are blackened and blistered, turning every few minutes to evenly roast the peppers., , , , , Allow the peppers to cool enough to handle, . Transfer them to a bowl and cover them with plastic or a paper towel, or place them into baggies or paper bags to let the skins steam and loosen., , Peel, stem and seed, , then chop the peppers., , Learn How to Roast Chili Peppers here, , For the Hummus, , Next, add the red peppers, to a food processor along with the tahini, lemon juice, garlic, salt, cumin and garbanzo beans (or chick peas). Process to form a paste., , Slowly add the olive oil, in a smooth drizzle while continuing to process until the hummus becomes thick and creamy. There is nothing better than creamy, smooth hummus. YUM!, , Transfer to a bowl, and garnish with spicy red chili flakes and extra olive oil. Serve with pita bread., , , , Boom! That's it, my friends!, This is an easy one. It's really just roasting some peppers then using a food processor. I do love easy., , , Recipe Tips & Notes, , , Store Bought Roasted Red Peppers., You can use jarred roasted red peppers to make the recipe a bit more quickly, though freshly roasted red bell peppers give it that extra wow factor., , Other Peppers., Try it with other roasted peppers. Feel free to add in some spicy peppers., , TO ROAST THE PEPPERS, To roast the peppers over an open flame, turn a gas flame to HIGH. Set the peppers directly over the flame. Turn the peppers occasionally with tongs until all sides are blackened and blistered. Do not let them burn or turn white., To roast the peppers in the oven, preheat oven to 400 degrees or set it to broil. Set the peppers onto a baking sheet (aluminum foil will make for easy cleanup), and bake for 20-30 minutes, until the skins are blackened and blistered, turning occasionally to evenly roast the peppers., To roast the peppers in the oven broiler, set your oven to broil. Set the peppers onto a baking sheet (aluminum foil will make for easy cleanup), skin sides up, and broil for 5-10 minutes, until the skins are blackened and blistered, turning every few minutes to evenly roast the peppers., Allow the peppers to cool enough to handle. Transfer them to a bowl and cover them with plastic or a paper towel, or place them into baggies or paper bags to let the skins steam and loosen., Peel, stem and seed, then chop the peppers., FOR THE HUMMUS, Next, add the red peppers to a food processor along with the tahini, lemon juice, garlic, salt, cumin and garbanzo beans. Process to form a paste., Slowly drizzle in the olive oil while continuing to process until the hummus becomes thick and creamy., Transfer to a bowl and garnish with spicy red chili flakes and extra olive oil. Serve with pita bread., , Video, , Notes, Heat Factor: Mild, though you can spice things up with extra spicy peppers and/or spicy chili flakes., , NOTE: Calories estimated for the hummus only, without pita bread for serving., , , Nutrition Information, Calories:, 78, kcal, , Carbohydrates:, 3, g, , Protein:, 1, g, , Fat:, 7, g, , Saturated Fat:, 1, g, , Sodium:, 197, mg, , Potassium:, 72, mg, , Fiber:, 1, g, , Sugar:, 1, g, , Vitamin A:, 621, IU, , Vitamin C:, 26, mg, , Calcium:, 12, mg, , Iron:, 1, mg, , , , , , , Did You Enjoy This Recipe?, I love hearing how you like it and how you made it your own. Leave a comment below and tag, @ChiliPepperMadness, on social media., , , , NOTE: This recipe was updated on 3/27/20 to include new information and video. It was originally published on 12/19/19., , , , , , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Donna Davis, , says, , , September 26, 2023 at 5:20 pm, , , , Oh my, I waited way too long to make this awesome hummus! It is deliciously addictive, so even though I made myself only half the recipe, exactly as written…I’m not sharing!!! Maybe NEXT time I make it….we’ll see….I’m not buying store-bought hummus again. Thank you so much! (I sprinkled lots of paprika on top instead of chili flakes, which are too hot for wimpy me), , , Reply, , , , , , , , Mike H., , says, , , September 27, 2023 at 4:51 am, , , , You are very welcome, Donna - enjoy!, , , Reply, , , , , , , , , , Rick Kirk, , says, , , May 09, 2023 at 6:23 am, , , , This sounds great! I love hummus and make it often. You are correct that homemade is far better than store bought., I have found that removing the shells/husks from the garbanzos make for a much smoother end result. I alco roast a head of garlic along with the peppers., Thanks for some great recipes!, , , Reply, , , , , , , , Mike Hultquist, , says, , , May 09, 2023 at 6:24 am, , , , Sounds awesome, Rick! Enjoy!, , , Reply, , , , , , , , , , Tammy Ginczycki, , says, , , January 04, 2023 at 8:16 am, , , , you can then cook them for 1.5 hours until they are nicely softened and then go ahead with the recipe. They will triple in size, FYI, so 1 cup dried = 3 cups rehydrated beans., , , Reply, , , , , , , , , , Surya-Patricia Lan Hood, , says, , , March 27, 2020 at 11:26 am, , , , To my utter amazement, you provided the answer to my question above. Most recipe authors do not. Thank you ever so much., , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , March 27, 2020 at 11:54 am, , , , No problem, Surya-Patricia. Glad to help! I hope you enjoy the recipe. Let me know how it turns out for you., , , Reply, , , , , , , , , , Surya-Patricia Lan Hood, , says, , , March 27, 2020 at 11:14 am, , , , And if  you don't have a gas burner, which is the case for most people in Arizona, how do we roast the peppers?, , , Reply, , , , , , , , Michael Hultquist - Chili Pepper Madness, , says, , , March 27, 2020 at 11:25 am, , , , Surya, , To roast the peppers in the oven, preheat oven to 400 degrees or set it to broil. Set the peppers onto a baking sheet (aluminum foil will make for easy cleanup), and bake for 20-30 minutes, until the skins are blackened and blistered, turning occasionally to evenly roast the peppers., To roast the peppers in the oven broiler, set your oven to broil. Set the peppers onto a baking sheet (aluminum foil will make for easy cleanup), skin sides up, and broil for 5-10 minutes, until the skins are blackened and blistered, turning every few minutes to evenly roast the peppers., , , Reply, , , , , , , , , , Ruth McAllister, , says, , , December 11, 2019 at 12:35 pm, , , , If you want it even smoooother and if you have heaps of time, pop the skins off the chickpeas. ????, , , Reply, , , , Primary Sidebar, , , , , , , ALL. SPICY. RECIPES., Hi, I’m Mike and I LOVE Spicy Food! Say goodbye to bland and boring food with my easy-to-follow recipes. Let’s get cooking!, , More about me →, , , , , Mexican, , Cajun, , Sauces, , Seasonings, , , , , , , AMAZON, /, BARNES & NOBLE, /, INDIEBOUND, /, BOOKS A MILLION, , , , , , , , , AMAZON, /, BARNES & NOBLE, /, INDIEBOUND, , , , Footer, , , , NEVER MISS A RECIPE, , , Receive my \"5 Essentials for Spicy Cooking\" email series & new recipes, , , , , , , , , , , , Search, , , , , , Facebook, , Pinterest, , Instagram, , Twitter, , YouTube, , , , , , , ↑ back to top, , , , , About, |, Contact, |, Travel-Food, |",
        "Slow roasted tomato hummus": "Ingredients: slow roasted tomatoes, 2, , pints, , cherry or grape tomatoes,, , halved, 1, , tablespoon, , olive oil, 1/2, , tablespoon, , sugar, 1, , garlic clove,, , minced, 1/2, , teaspoon, , salt, 1/2, , teaspoon, , pepper, 1/2, , teaspoon, , dried thyme, hummus, 2, , (14 ounce), , cans chickpeas,, , drained and rinsed, peeled if you wish, 1, , cup, , tahini paste, 2, , garlic cloves, 1/2, , whole, , lemon, , , juiced, 1/2, , teaspoon, , salt, 1/2, , teaspoon, , pepper, 2/3, , cup, , slow roasted tomatoes, 2 to 3, , tablespoons, , ice water, 1 to 2, , tablespoons, , olive oil,, , plus extra for drizzling, fresh oregano,, , for topping, homemade pita,, , for serving, , knowing each of them and what goes into this, so thank you for this recipe, much appreciated, , , , , , , , , Pingback:, Slow Roasted Tomato Hummus – Slow Roasted Tomato Hummus Recipe – Chow Hub, , , , , , , Chris W,, —, March 7, 2019 @ 11:31 am, , Reply, , , Can’t wait to try this – especially this summer when our tomatoes are growing like they’re on steroids!  For some reason, our plants always get 9-10 feet tall – we need a ladder to pick them.  We only grow heirlooms so this is the perfect recipe – thanks!, , , , , , Pingback:, Here's What You Can Include For Your Vegan Party | Nature's Organic Ice Cream, , , , , , , Mara, —, June 14, 2021 @ 1:41 am, , Reply, , , Hi. How’s the shelf life?  And how do you prolong shelf life Incase you wanna make a bigger batch? Looks so yummy I wanna try!, , , , , , , , , Vivian A. Villalobos, —, June 15, 2021 @ 5:56 pm, , Reply, , , I usually put the sun dried tomatoes in a small jar and fill it with olive oil.  They will keep about a month in the fridge., , , , , , , , , , , Sabrina, —, August 20, 2021 @ 5:19 pm, , Reply, , , Can this be made 3 days in advance? Thanks in advance, , , , , , , , , , Content Sidebar, , , , , , , Welcome!, , Hey hey! You found me., At the corner of the internet that I've deemed extremely self-indulgent., , , More About Me », , , , Pinterest, , , , Facebook, , , , Instagram, , , , Twitter, , Keep in Touch, Subscribe to receive new posts via email:, , , , Subscribe, , , , Daily, , , , Weekly, , , , , Order My New Book!, , Easy Everyday, , Order Now:, , Amazon, /, Barnes & Noble, /, Bookshop.org, /, Books A Million, /, Target, /, Hudson Booksellers, /, Apple Ebook, /, Google Play Ebook, , Find a Recipe:, , , , Submit, , , Categories, Categories, , Select Category, , 12 Days of Christmas, , 4th of July, , a Week in the Life, , Appetizers, , Baby, , Back To School, , Bacon, , Beans, , Beef, , Behind the Book, , Bowls, , Bread, , Breakfast, , Brownies, , Burgers, , by Diet, , Cake, , Cheese Boards!, , Christmas, , Christmas Cocktails, , Cocktails, , Coffee, , Cookies, , Crumbs, , Crushing On, , Cupcakes, , Day In The Life, , Dessert, , Dinner, , Dips, , Drinks, , Easter, , Fall, , Fall Cocktails, , Favorites, , Gift Guides, , Gluten Free, , Grilling, , Halloween, , Holidays, , Ice Cream, , Jessica’s Book Club, , Kentucky Derby, , Lunch Ideas, , Marinades, , Meatless, , Memorial Day, , Michigan, , Mocktails, , Muffins/Scones, , On Blogging, , Pantry Meals, , Pasta, , Pie, , Pittsburgh Eats, , Pizza, , Pork, , Poultry, , Reading Lists, , Real Life Wednesday, , Recipes, , Salads, , Sandwiches, , Seafood, , Sheet Pan, , Side Dishes, , Slow Cooker, , Snacks, , Soup/Stews, , Spring, , St. Patrick’s Day, , Summer, , Summer Cocktails, , Summer Fridays, , Tacos, , Tex Mex, , Thanksgiving, , The Pretty Dish Book Club, , Travel, , Tuesday Things, , Vegan, , Vegetarian, , Video, , Weeknight Meals, , What I Read, , What to Eat This Week, , Winter, , , , Monthly Archive:, , Monthly Archive:, , , Select Month, , April 2025, , March 2025, , February 2025, , January 2025, , December 2024, , November 2024, , October 2024, , September 2024, , August 2024, , July 2024, , June 2024, , May 2024, , April 2024, , March 2024, , February 2024, , January 2024, , December 2023, , November 2023, , October 2023, , September 2023, , August 2023, , July 2023, , June 2023, , May 2023, , April 2023, , March 2023, , February 2023, , January 2023, , December 2022, , November 2022, , October 2022, , September 2022, , August 2022, , July 2022, , June 2022, , May 2022, , April 2022, , March 2022, , February 2022, , January 2022, , December 2021, , November 2021, , October 2021, , September 2021, , August 2021, , July 2021, , June 2021, , May 2021, , April 2021, , March 2021, , February 2021, , January 2021, , December 2020, , November 2020, , October 2020, , September 2020, , August 2020, , July 2020, , June 2020, , May 2020, , April 2020, , March 2020, , February 2020, , January 2020, , December 2019, , November 2019, , October 2019, , September 2019, , August 2019, , July 2019, , June 2019, , May 2019, , April 2019, , March 2019, , February 2019, , January 2019, , December 2018, , November 2018, , October 2018, , September 2018, , August 2018, , July 2018, , June 2018, , May 2018, , April 2018, , March 2018, , February 2018, , January 2018, , December 2017, , November 2017, , October 2017, , September 2017, , August 2017, , July 2017, , June 2017, , May 2017, , April 2017, , March 2017, , February 2017, , January 2017, , December 2016, , November 2016, , October 2016, , September 2016, , August 2016, , July 2016, , June 2016, , May 2016, , April 2016, , March 2016, , February 2016, , January 2016, , December 2015, , November 2015, , October 2015, , September 2015, , August 2015, , July 2015, , June 2015, , May 2015, , April 2015, , March 2015, , February 2015, , January 2015, , December 2014, , November 2014, , October 2014, , September 2014, , August 2014, , July 2014, , June 2014, , May 2014, , April 2014, , March 2014, , February 2014, , January 2014, , December 2013, , November 2013, , October 2013, , September 2013, , August 2013, , July 2013, , June 2013, , May 2013, , April 2013, , March 2013, , February 2013, , January 2013, , December 2012, , November 2012, , October 2012, , September 2012, , August 2012, , July 2012, , June 2012, , May 2012, , April 2012, , March 2012, , February 2012, , January 2012, , December 2011, , November 2011, , October 2011, , September 2011, , August 2011, , July 2011, , June 2011, , May 2011, , April 2011, , March 2011, , February 2011, , January 2011, , December 2010, , November 2010, , October 2010, , September 2010, , August 2010, , July 2010, , June 2010, , May 2010, , April 2010, , March 2010, , February 2010, , January 2010, , December 2009, , November 2009, , October 2009, , September 2009, , , , , , , , , , , , , , , Get, New Recipes, via email:, , , , , Daily, , , , Weekly, , , , , Subscribe, , , , , , , , , ^ Back to Top, , Home, , About, , FAQs, , Contact, , Recipes, , Privacy Policy, , , , ©2025 How Sweet Eats., Design by, Purr, ., , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , , Submit, , , , , Instructions: slow roasted tomatoes, Preheat the oven to 300 degrees F. Line a baking sheet with parchment paper., Place the cherry tomatoes on the sheet and drizzle with olive oil. Sprinkle with garlic, sugar, salt, thyme and toss well. Roast for 1.5 to 2 hours, tossing every 30 minutes, until the tomatoes are super caramely and shriveled and sweet. Remove and let them cool completely before adding to the hummus below!, P.S. These keep great in a sealed container in the fridge for a few days if you have extra!, hummus, Place the chickpeas, tahini, the lemon juice, garlic, salt and pepper in your food processor. Puree until the chickpeas break down and the mixture starts to come together (it probably won’t be smooth at this point!). Make sure to scrape the sides with a spatula. Blend in the tomatoes until combined., Drizzle in the ice water. Blend it for a minute or two – just let it go! Once the water is in, the hummus should really start to get smooth – if you need a little more water, add it 1 tablespoon at a time. Drizzle in the olive oil. Taste and season with more salt and pepper if necessary., , , , Course:, Appetizer, Cuisine:, American, Author:, How Sweet Eats, , , , Instagram, , Did you make this recipe?, , Be sure to follow, @howsweeteats on instagram, and tag, #howsweeteats, . You can also post a photo of your recipe to our, facebook page, ., I appreciate you so much!, , , , It really is tomato candy though!, , , , , posted in:, , Appetizers, , , Recipes, , , , 14, comments, , , , , , , , Order My New Book:, , Easy Everyday, , 100 recipes and meal prep ideas for effortless eats., , Order Now:, , Amazon, /, Barnes & Noble, /, Bookshop.org, /, Books A Million, /, Target, /, Hudson Booksellers, /, Apple Ebook, /, Google Play Ebook, , , , « Previous Post, Tuesday Things., , Next Post », , 11 Recipes to Make Before Saint Patrick’s Day!, , , , , , 5 from 20 votes (, 19 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Notify me of follow-up comments via e-mail, , , , 14 Comments on “Slow Roasted Tomato Hummus.”, , , Pingback:, Slow Roasted Tomato Hummus - Slow Roasted Tomato Hummus Recipe - Kitchenpedia.co, , , , , , , Gemma, —, March 6, 2019 @ 9:21 am, , Reply, , , This looks so good! Can’t wait to make it., , , , , , , , , Kelly, —, March 6, 2019 @ 9:44 am, , Reply, , , We go through an embarrassing amount of hummus every week. I have to try this!, , , , , , , , , corinne, —, March 6, 2019 @ 10:35 am, , Reply, , , Is that an additional 2.5-3 hours roasting after the first 1.5-2 hours, or 2.5-3 total?, Looks good!, , , , , , , , , Danielle, —, March 6, 2019 @ 3:39 pm, , Reply, , , Not to rub it in, but Florida tomatoes are going off right now. I can’t use ’em fast enough and they’re starting to split on the vines. Going to try this with Sungolds and Everglades tomatoes this week., , , , , , , , , Liz S., —, March 6, 2019 @ 4:44 pm, , Reply, , , Not wacky! Totally awesome tomato recipe to share., , , , , , , , , Alicia A, —, March 6, 2019 @ 7:30 pm, , Reply, , , I love to trash hummus, olives, feta chunks, smoked chipotle pepper flakes, Meyers lemon olive oil, fresh chopped parsley and well you get the jist! We have a pita bread bakeries near us so, need I say more., I think I will try the tomatoes that looks good too!, , , , , , , , , sabrina, —, March 6, 2019 @ 10:31 pm, , Reply, , ",
        "Green pea Hummus and Spring Mezze": "Ingredients: Metric, –, Cups, Green Pea Hummus, 250, , grams, , soft cooked chickpeas, , or canned, rinsed well, 150, , grams, , thawed or fresh green peas, 2, , tablespoons, , tahini, 2, , tablespoons, , olive or sesame oil, Juice of one lemon, , ~ 3 tablespoons, 1, , clove, , garlic, ½, , teaspoon, , cayenne pepper, , to taste, Sea salt, , to taste, Black pepper, , to taste, To Serve, ½, , large, , english cucumber, , sliced, 3, , medium, , carrots, , cut into sticks, 250, , grams, , strawberries, Small bunch green asparagus*, 1, , bunch radishes, Crackers, , naan, ., 1/2 large english cucumber, , 3 medium carrots, , 250 grams strawberries, , Small bunch green asparagus*, , 1 bunch radishes, , Crackers, , , Notes, * To steam the asparagus, trim the ends and then place the asparagus into a pot with a few centimetres of boiling water for a minute or two, until bright green but still snappy., , , * For cup (or oz.) measurements, please click the pink link text above the ingredient list that says ‘Cups’., , , , , Nutrition, Serving:, 1, , Calories:, 256, kcal, , Carbohydrates:, 35, g, , Protein:, 11, g, , Fat:, 9, g, , Saturated Fat:, 1, g, , Polyunsaturated Fat:, 2, g, , Monounsaturated Fat:, 5, g, , Sodium:, 31, mg, , Potassium:, 595, mg, , Fiber:, 12, g, , Sugar:, 8, g, , Vitamin A:, 5249, IU, , Vitamin C:, 29, mg, , Calcium:, 63, mg, , Iron:, 3, mg, , Nutrition is provided as a courtesy and is an estimate. If this information is important to you, please have it verified independently., , , ©, Alexandra Daum, , Course:, Appetizer, Dips and Sauces, Side Dish, Sides, Spring, Cuisine:, American, Diet, Gluten Free, Vegan, Vegetarian, , , , , Print, , Pin Recipe, , More, Sides, :, , , , Cabbage and Potato Hash, , , , Swedish Pizza Salad (Raw Cabbage Salad), , , , Carrot Apple Salad, , , , Orange and Red Onion Salad, , , , Previous Post:, « Easy Roasted Sunflower Seed Butter, Next Post:, Springtime Asparagus Quinoa Salad », Reader Interactions, , , , 5 from 2 votes (, 2 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Comments, , , , , , Gabby, , says, , , August 11, 2018 at 4:32 am, , , , Love your food, love to eat it! N best of all love being vegan. Can i come over  ????, , , Reply, , , , , About Alexandra, , Recipes, , FAQ, , Contact, , Work With Me, , , , , STAY IN CONTACT, get weekly updates, exclusive recipes, and more, , , , , , Email Address, , , , , , , , , , , , , , , , , , , , , Get the cookbook, , , , © 2025 Occasionally Eggs | Images and text may not be used without permission |, Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: To make the hummus, add everything except the oil to the bowl of a food processor fitted with the blade attachment. Mix on high for a couple of minutes, or until mostly smooth., 250 grams soft cooked chickpeas, , 150 grams thawed or fresh green peas, , 2 tablespoons tahini, , Juice of one lemon, , 1 clove garlic, , 1/2 teaspoon cayenne pepper, , Sea salt, , Black pepper, Add the oil in a slow stream while blending, until incorporated, and then blend on high until the hummus is completely smooth., 2 tablespoons olive or sesame oil, Place the hummus into a bowl, top with a little more oil and pepper",
        "Baba Ghanoush": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PF, BABA GHANOUSH, SERVES: 12 (approx. ¼ cup each) Prep Time: 15 min. + 2 hrs. chilling time  Cooking Time: 35 min., CONTAINER EQUIVALENTS (per serving):, 1, 1½, This delicious eggplant dip is traditionally served with toasted pita, but it works just as well with fresh veggies if you’re trying to save your, yellows! The key to a great Baba Ghanoush is to get the eggplant skins nice and charred, which lends the flesh a rich, smoky flavor. Our, recipe calls for smoked paprika and cumin to really make it pop, and we like to wring the excess water from the cooked flesh to concentrate, its flavor., 4, medium eggplants, (approx. 3.75 lbs.), 3 Tbsp., tahini paste, 3 cloves, garlic, 2 Tbsp., fresh lemon juice, 1 tsp., finely grated lemon peel, (lemon zest), ¼ cup, fresh parsley, 2 tsp., ground smoked paprika, ½ tsp., ground cumin, 1¼ tsp., sea salt (or Himalayan salt), ½ tsp., ground black pepper, ¼ cup, extra-virgin olive oil, SPECIAL EQUIPMENT:, Cheesecloth, Aluminum foil, Olive oil cooking spray, 1. \t Preheat oven to 500º F., 2. \t Line a large bowl with cheesecloth (or paper towels). Set aside., 3. \t Line large baking sheet with foil., 4. \t Place eggplants on prepared baking sheet. Lightly coat with spray. Bake, for 33 to 35 minutes, or until skin is charred and flesh is very tender to, the core. Remove from oven. Wrap in foil and let rest until cool enough to, handle., 5. \t Cut eggplants in half, peel away skin and discard. Transfer flesh to, prepared bowl. Gently wring out excess moisture., 6. \t Place eggplant flesh, tahini, garlic, lemon juice, lemon peel, parsley, , paprika, cumin, salt, and pepper in food processor; process until blended., 7. \t With food processor running, slowly add oil in a slow steady stream., Process until fully emulsified., 8. \t Refrigerate for 2 hours to cool and to let flavors meld., RECIPE NOTE:, Refrigerate leftovers in an airtight container for up to 4 to 5 days., NUTRITIONAL INFORMATION (per serving): Calories: 103  Total Fat: 7 g  Saturated Fat: 1 g  Cholesterol: 0 mg  Sodium: 245 mg, Carbohydrates: 11 g  Fiber: 5 g  Sugars: 6 g  Protein: 2 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Tzatziki": "Ingredients: tangy, and the perfect dairy-free alternative to traditional tzatziki., , Author, Minimalist Baker, , , , , Print, , , SAVE, SAVED, , , 4.92, from, 56, votes, , , , , , Prep Time, 10, minutes, , minutes, Total Time, 10, minutes, , minutes, , Servings, 7, , (1/4-cup servings), , Course, Sauce, Cuisine, Gluten-Free, Greek-Inspired, Vegan, Freezer Friendly, No, Does it keep?, 5 Days, , Cook Mode, Prevent your screen from going dark, , US Customary, –, Metric, 1/2, , large, , cucumber, , (unpeeled + finely grated // as original recipe is written ~1 cup grated, will shrink to ~1/4 cup after drained // organic when possible), 1 ½, , cups, , coconut yogurt, *, , (see notes for store-bought recommendations), 3, , cloves, , garlic, , (minced), 1/4, , cup, , finely chopped fresh dill, , (or 2 Tbsp dried dill per 1/4 cup fresh), 1, , pinch, , each sea salt and black pepper, , (plus more to taste), 1 ½, , Tbsp, , lemon juice, 1-2, , Tbsp, , extra virgin olive oil, , (, optional, // for flavor and richness),  Instructions: Finely grate cucumber with the skin on – should yield about 1 cup (amount as original recipe is written // adjust if altering batch size). Then either set in a fine-mesh strainer set over a small mixing bowl or transfer to a clean, thin towel and squeeze out excess moisture. The remaining amount should be about 1/4 cup (amount as original recipe is written // adjust if altering batch size)., Add coconut yogurt to a large mixing bowl and add strained cucumber, garlic, dill, salt, pepper, lemon juice, and olive oil (optional). Stir to combine., Taste and adjust flavor as needed, adding more salt for overall flavor, garlic for zing, lemon for acidity, or dill for herbiness., Serve immediately, or store in the refrigerator (where it will thicken) up to 5 days, sometimes longer depending on freshness of yogurt., This Tzatziki is delicious on its own, but it also pairs well with Greek-inspired recipes like these, Traditional Vegan Falafel, , , Tabbouleh Salads, , , Shawarma Sandwiches, , or, Buddha Bowls, ., , , Notes, *If your coconut yogurt is thin, pour over two layers of cheesecloth laid in a fine mesh strainer set over a mixing bowl and strain overnight until the excess liquid has drained out., *One batch of my, coconut yogurt, recipe yields 1 1/2 cups of yogurt, which is the perfect amount for this recipe. Be sure to use the brands of full-fat coconut milk and probiotics I recommend for best results., *If you aren’t making your own coconut yogurt, my favorite unsweetened (Greek style) brands are Culina, Cocojune, and CoYo, which can be found at Whole Foods and most health food stores., *Recipe adapted from, Live Eat Learn, ., *Nutrition information is a rough estimate., , Nutrition (1 of, 7, servings), , Serving:, 1, , quarter-cup servings, , Calories:, 131, , , Carbohydrates:, 5.3, , g, , Protein:, 1.8, , g, , Fat:, 12.6, , g, , Saturated Fat:, 11.1, , g, , Trans Fat:, 0, , g, , Cholesterol:, 0, , mg, , Sodium:, 36, , mg, , Fiber:, 1.6, , g, , Sugar:, 2.1, , g, Did You Make This Recipe?, Tag, @minimalistbaker, on Instagram and hashtag it, #minimalistbaker, so we can see all the deliciousness!, Facebook, Twitter, Pin It, If you love this recipe..., , Recipes, Easy Mediterranean-Inspired Nourish Bowls, Recipes, Easy Lemon Rice (Greek-Inspired), Recipes, Mediterranean-Inspired Cucumber Chickpea Salad, Recipes, Butternut Squash Lasagna (Vegan, GF Optional), , , Reader Interactions, , , Leave a Comment & Rating!, Cancel reply, Have a question?, Use ctrl+f or ⌘+f on your computer or the \"find on page\" function on your phone browser to search existing comments! Need help?, Check out this tutorial!, Comment:, , My Rating:, , , , My Rating:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , I Made this, I Have a Question, , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., You will not be subscribed to our newsletter list., , , , Δ, , , All comments, I made this, Questions, , , , , , Kate, , says, , , December 21, 2024 at 10:24 am, , , , Absolutely delicious! Am half Greek and wouldn’t know that this was vegan, perfect quantities and fantastic :-), , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 23, 2024 at 9:52 am, , , , We’re so glad you enjoyed it, Kate! Thanks so much for sharing. xo, , , Reply, , , , , , , , , , Elise, , says, , , September 3, 2024 at 1:58 pm, , , , Great recipe! I used Cocojune coconut yogurt that I got at fresh market and it’s thick and creamy!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 3, 2024 at 2:22 pm, , , , Lovely! Thank you for sharing, Elise! xo, , , Reply, , , , , , , , , , Val, , says, , , August 16, 2024 at 9:32 pm, , , , I made this with my garden cucumbers (kept the juice for iced cuke water) and Trader Joe’s cashew yogurt. I unfortunately did not have fresh dill but it is still excellent. Ate with TJs falafels and crudités. Will make again!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 19, 2024 at 9:52 am, , , , Lovely! That sounds like a delicious meal. Thank you for sharing, Val!, , , Reply, , , , , , , , , , Randiah, , says, , , January 28, 2024 at 11:10 pm, , , , I made this with veganaisse instead of yogurt and didn’t strain the cucumbers. It came out perfect! Of course I added lemon juice, salt, and dill to my liking but this was a great base recipe and super simple!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 29, 2024 at 9:36 am, , , , Lovely! Thanks so much for sharing, Randiah!, , , Reply, , , , , , , , , , Sheila, , says, , , August 13, 2023 at 7:47 pm, , , , Made it exactly as written except cashew milk yogurt and it’s amazing! Thank you!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 14, 2023 at 1:01 pm, , , , Amazing! We’re so glad you enjoyed it. Thank you for sharing, Sheila! xo, , , Reply, , , , , , , , , , Caroline, , says, , , January 22, 2023 at 1:21 pm, , , , Delicious! I used Kite Hill Protein plant-based yogurt because that’s what my regular grocery store had. Excellent flavor, but a bit thin with that substitution. Next time, I’ll make the trip for the recommended yogurt!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 23, 2023 at 10:27 am, , , , Amazing! Thanks so much for the lovely review and for sharing your modifications, Caroline!, , , Reply, , , , , , , , , , Karyn Seglin, , says, , , December 19, 2022 at 5:59 pm, , , , My husband isn’t a fan of coconut yogurt, can I use almond milk yogurt?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 20, 2022 at 10:18 am, , , , Hi Karyn, we think that should work! If your almond milk yogurt is thin, take a look at the notes below the recipe!, , , Reply, , , , , , , , , , Samantha Clinton, , says, , , June 7, 2022 at 7:16 pm, , , , I got a yogurt that tasted way too much like coconut. :( Will try coconut yogurt recipe next time, , , Reply, , , , , , , , Bruce, , says, , , May 23, 2022 at 6:17 pm, , , , Outstanding! I always thought tzatziki would be difficult, so I suffered through mass-produced brands I’d find in the store. Never again! Thank you so much!, , Note, I made a few substitutions, based on availability and time:, , Oatly plain yogurt — a little thin for this recipe, next time I’ll make sure I use a true Greek style product, if I don’t make the coconut base., , Garlic powder instead of fresh minced garlic — I went low, I’ll seriously increase the amount next time if I’m not using the real stuff., , Cucumber — not a sub, but a suggestion to follow the recipe and make sure you squeeze out as much water as possible. I probably should have done it longer/harder, the thinness of the final product was probably due in part to excess moisture from the cucumber., , Salt & pepper — I added more than a pinch, but we like salty/peppery/savory food in our house. Use the recipe as a starting point, then add more seasoning as you see fit., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 23, 2022 at 8:16 pm, , , , We’re so glad you enjoyed it, Bruce! Thank you for sharing!, , , Reply, , , , , , , , , , Jamie, , says, , , April 16, 2022 at 4:31 pm, , , , What ingredient(s) makes this not freezer friendly?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 18, 2022 at 12:27 pm, , , , The coconut yogurt, , , Reply, , , , , , , , , , Christy S., , says, , , March 5, 2022 at 5:52 pm, , , , Made this recipe today and used Cashew Yogurt from Foragers. It came out so delicious and I will use it as my new sour cream substitute., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 7, 2022 at 9:30 am, , , , Yay! Thanks so much for the wonderful review and for sharing your modifications, Christy!, , , Reply, , , , , , , , , , Tracy, , says, , , January 9, 2022 at 10:00 pm, , , , I made the coconut yogurt and used the tzatziki for a toping for fish tacos, delish!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 10, 2022 at 1:18 pm, , , , Yumm! Thanks so much for the review, Tracy!, , , Reply, , , , , , , , , , Annette, , says, , , October 21, 2021 at 7:47 pm, , , , I really enjoyed the content and thoroughness of your coconut yogurt video. What confused me was the mention of coconut milk while holding coconut cream.  They are completely different products.  I will definitely try your recipe using coconut cream because I think that is what you used. Thank you so very much for sharing your recipe and video., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 22, 2021 at 10:55 am, , , , Hi Annette, we can see how that might be confusing! We find either one works. It just depends how thick you want the yogurt to be., , , Reply, , , , , , , , , , Jessica, , says, , , July 7, 2021 at 1:18 pm, , , , This recipe was perfect! Came together so easily and tasted amazing. I used a store bought coconut yogurt and added lots of extra dill. Paired well with falafel., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 8, 2021 at 3:40 pm, , , , Yumm – we love to hear this! Thanks for the lovely review, Jessica! Glad you enjoyed. xo, , , Reply, , , , , , , , , , Jenna Scott, , says, , , June 9, 2021 at 7:16 pm, , , , I just made this. It came together in about 20 minutes. I used coyo coconut yogurt, fresh lemon and fresh dill. I put the olive oil in too. It tastes amazing!!!!! Taking it to work tomorrow for potluck and will serve with grilled salmon tomorrow for dinner., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 10, 2021 at 9:29 am, , , , Woohoo! We’re so glad you enjoy it, Jenna. Thank you so much for sharing! xo, , , Reply, , , , , , , , Ashley, , says, , , August 19, 2021 at 12:51 am, , , , I accidentally bought almond yogurt instead, would that work too or does it need something thicker?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 19, 2021 at 9:53 am, , , , Hi Ashley, it will depend on the brand. We find some brands of almond yogurt have an unpleasant flavor. As for the texture, it won’t be as thick, but should be okay. Hope that helps!, , , Reply, , , , , , , , , , Heather, , says, , , September 6, 2021 at 8:31 am, , , , I made this today with homemade soy yogurt (that came out a bit too runny).  But it is perfect in this recipe and now I have a delicious dressing for my salads this week.  Your recipes are so dependable!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 7, 2021 at 11:22 am, , , , Aw, thanks Heather! We’re so glad you enjoy our recipes! xo, , , Reply, , , , , , , , , , , , Elizabeth, , says, , , June 2, 2021 at 5:58 pm, , , , Turned out great! Very tasty! The coconut and cucumbers weren’t over-powering which made my dad happy because he doesn’t like coconut flavored things., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 3, 2021 at 8:54 am, , , , Yay! Thank you for sharing, Elizabeth! xo, , , Reply, , , , , , , , , , Sydney, , says, , , May 20, 2021 at 1:58 pm, , , , Is is better to use a regular cucumber or can an English seedless cucumber be used? Thanks! :), , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 20, 2021 at 2:18 pm, , , , English seedless would be great here!, , , Reply, , , , , , , , Sydney, , says, , , May 20, 2021 at 3:13 pm, , , , Awesome! Thank you…making it this weekend to use for veggie pinwheel dip! :), , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 20, 2021 at 3:21 pm, , , , Very cool! Let us know how it turns out!, , , Reply, , , , , , , , , , , , , , B, , says, , , May 17, 2021 at 4:24 pm, , , , Wonderful!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 18, 2021 at 9:06 am, , , , We’re so glad you enjoyed it! xoxo, , , Reply, , , , , , , , , , B, , says, , , May 17, 2021 at 4:23 pm, , , , I have mad this before many times…but as usual your recipe is the best!!!  Thank you!, , , Reply, , , , , , , , Molly, , says, , , March 14, 2021 at 8:12 pm, , , , Great recipe. I used Silk’s Plain Oat Yogurt and it worked wonderful., , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , March 15, 2021 at 12:21 pm, , , , Great! Thanks, Molly. Next time would you mind adding a rating to your review? It’s super helpful to us and other readers! xo, , , Reply, , , , , , , , , , Sam Rich, , says, , , February 27, 2021 at 2:38 pm, , , , I loved this recipe! I used a different store bought yogurt (Forager Cashew yogurt), but it still turned out great :) I added just a bit more lemon juice since I think the particular brand I used really hid the tang/brightness, but otherwise this worked like a charm :D, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 1, 2021 at 9:03 am, , , , Yay! Thanks so much for sharing, Sam!, , , Reply, , , , , , , , Jessica, , says, , , July 24, 2021 at 8:42 pm, , , , Will any vegan yogurt work? Coconut gives me really bad digestive problems, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 26, 2021 at 9:49 am, , , , Hi Jessica, as long as it doesn’t have too strong of a flavor on its own, it should work. We’d suggest scanning the comments to see what types other readers have tried. Hope that helps!, , , Reply, , , , , , , , Seia, , says, , , July 26, 2021 at 8:07 pm, , , , We used unsweetened cashew yogurt and it was great! Cashew yogurt doesn’t really taste like anything so it’s perfect when you need a ‘blank slate’., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 27, 2021 at 9:17 am, , , , Wonderful! Thank you for sharing, Seia!, , , , , , , , , , , , , , , , , Akaya, , says, , , February 3, 2021 at 3:52 pm, , , , This stuff is delicious! I had unsweetened cashew milk yogurt on hand so I used that. It came out perfectly!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 4, 2021 at 9:37 am, , , , Yay! Thanks for sharing, Akaya! xo, , , Reply, , , , , , , , , , Nicole, , says, , , January 15, 2021 at 5:55 pm, , , , So good! And forgiving: I didn’t have cucumber but went ahead without as this sounded amazing to make with a meal featuring the better-than-restaurant falafel (also amazing), and it was delicious. I used dairy yogurt as I’m not vegan and dried dill as I didn’t have fresh. I’ll be sure to try this in future with fresh dill and cucumber, I imagine it’s even better., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 15, 2021 at 6:06 pm, , , , Lovely meal! Thanks for sharing, Nicole!, , , Reply, , , , , , , , Deborah, , says, , , June 25, 2022 at 2:39 pm, , , , I made this today for a quick sauce to put over leftover rice, baked tofu & peas. Before becoming vegan, I loved Tzatziki but hadn’t tried “veganizing” it myself. Your recipe is a great base (your recipes rarely disappoint). I used Cocojune coconut yogurt & had no fresh dill, so used dried. I think that was the only downfall, because the dry was a little too bitter. Next time I’ll plan for it & have fresh dill as your recipe says. I added more lemon & more cucumber to cut the bitterness & thought it was great. Looking forward to making cyan souvlaki to use it again!, Thanks so much for your wonderful work!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 27, 2022 at 10:21 am, , , , Yay! Thanks so much for the great review and for sharing your modifications, Deborah!, , , Reply, , , , , , , , , , , , , , Katherine, , says, , , December 30, 2020 at 9:18 am, , , , If I wanted to make a beet tzatziki, how much beet do you recommend adding?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 30, 2020 at 9:53 am, , , , We’ve never tried that, but sounds amazing! Maybe start with 1/4 small roasted beet and add more to taste?, , , Reply, , , , , , , , Sydney, , says, , , March 23, 2021 at 7:44 am, , , , I want to try this yummy sounding taziziki sauce, but I don’t see the name of the recommended store-bought yogurt. Am I overlooking it?  Can’t wait to make it!!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 23, 2021 at 9:16 am, , , , Hi Sydney, our favorite unsweetened (Greek style) brands are Culina and CoYo, which can be found at Whole Foods and most health food stores., , , Reply, , , , , , , , , , , , Kedi, , says, , , October 26, 2020 at 6:14 pm, , , , OMG!!! This was so good! Especially with your Crispy Quinoa Sweet Potato Fritters. Extra virgin olive oil is the perfect finishing touch!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 27, 2020 at 9:03 am, , , , We’re so glad you enjoyed it, Kedi! Thanks so much for sharing! xo, , , Reply, , , , , , , , , , Lauren Beach, , says, , , September 13, 2020 at 6:56 pm, , , , Easy and delicious! I used Kite Hill brand yogurt (they didn’t have the recommended brand at my store). We made this twice in 2 weeks…tastes fabulous on falafel sandwiches! Thank you for the recipe!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 14, 2020 at 12:15 pm, , , , We’re so glad you enjoyed it, Lauren! Thanks so much for sharing!, , , Reply, , , , , , , , , , Tess, , says, , , September 9, 2020 at 11:27 am, , , , Very good! I’ve made this many times over the last couples years :) perfect flavor and texture, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 9, 2020 at 12:01 pm, , , , Yay! Thanks so much for sharing, Tess! xo, , , Reply, , , , , , , , , , WallyJay, , says, , , August 16, 2020 at 10:42 am, , , , Can I freeze batches of it? I made way to much 😂, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 17, 2020 at 3:19 pm, , , , We don’t think it would freeze well, but if you give it a try, let us know how it goes!, , , Reply, , , , , , , , , , Denali, , says, , , August 11, 2020 at 8:46 pm, , , , Delicous! The whole family enjoyed. We had this with falafel and pita and it was a great combo. Tzatziki was one of my favorite dips before going vegan so I’m grateful to have found this recipe., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 12, 2020 at 10:28 am, , , , Whoop! We’re so glad everyone enjoyed it, Denali! Thanks so much for the lovely review! xo, , , Reply, , , , , , , , , , Amy, , says, , , July 31, 2020 at 3:39 am, , , , I follow this recipe, except sub half vegan sour cream and half vegan mayo for the yogurt. Makes it richer and thicker, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 31, 2020 at 10:26 am, , , , Thanks for sharing, Amy!, , , Reply, , , , , , , , , , Anita, , says, , , July 17, 2020 at 4:59 pm, , , , I am really falling quite in love with this website!! The star ratings are so well deserved! This recipe is absolutely delicious! I used Kite Hill Plain Unsweetened Almond Milk Yogurt Greek Style and this is my first time trying a vegan greek yogurt. It’s freakin good and with live cultures to boot! Thank you so much for these recipes…will be trying this sauce with Shwarma Sandwiches for dinner tonight!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 17, 2020 at 5:48 pm, , , , Aw, we’re so glad you are enjoying our recipes, Anita! We’ll have to give that yogurt a try! Thanks so much for the lovely review!, , , Reply, , , , , , , , , , Sarah, , says, , , June 11, 2020 at 4:06 pm, , , , Will this have a coconut flavour to it?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 12, 2020 at 9:55 am, , , , Yes, it will have a slight coconut taste. You could maybe try with an almond-based yogurt instead? But we haven’t tried it so we can’t guarantee results., , , Reply, , , , , , , , , , Lexi, , says, , , June 7, 2020 at 4:56 pm, , , , Made this recipe along with Minimalist Baker’s Naan and the Falafel – INCREDIBLE! What a fun dinner! Easy and can’t recommend enough., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 8, 2020 at 11:32 am, , , , Whoop! Thanks so much for sharing, Lexi! xo, , , Reply, , , , , , , , , , Maddie, , says, , , May 16, 2020 at 11:35 pm, , , , This has been my go-to recipe for about 2 years now!! I have tried a couple others, but nothing compares!, , A couple things I have modified:, 1 – I use Kite Hill Greek Style yogurt, it has the thicker consistency I like and then I don’t have to make my own from scratch. Usually I can only find this at Whole Foods, and let’s be honest, entering that place is DANGEROUS for your wallet! I have made this with regular almond based  yogurt, but I let the water drain through a cheesecloth overnight before I  use it!, , 2 – After I mince the garlic, I put it on a small frying pan and heat it for a few mins before I mix it into the recipe. I do this because I meal prep for the whole week, and I found that by the end of the week this recipe had way too much of a kick to it with that fresh garlic. Putting it on the pan first seems to tone down the strength of the garlic so it doesn’t become overpowering. If you plan on eating most of this recipe within a couple days, you probably don’t have to do this., , After I transitioned to a plant based diet, the #1 thing I missed was tzatziki!!  Thank you so much for this recipe. My coworkers always comment on how good it smells when I bring it for lunch, and are shocked that it is non-dairy!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 18, 2020 at 11:32 am, , , , We’re so glad you enjoy it, Maddie! Thanks so much for sharing!, , , Reply, , , , , , , , , , Leanda, , says, , , March 22, 2020 at 9:28 pm, , , , I’m not a fan of dill so I used homegrown chives. I couldn’t get the coconut yoghurt and found Nakula Natural yoghurt… is delicious. Thank you!, , , , , , Reply, , , , , , , , Lexi, , says, , , October 10, 2020 at 6:11 pm, , , , This recipe is absolutely fantastic! I’ve missed being able to eat tzatziki and this recipe is so easy to make and absolutely delicious. I used the Culina yogurt, which is one of my favorite brands and it was perfect. I am so happy to have such an easy way to make one of my favorite sauces, thank you!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 12, 2020 at 9:31 am, , , , Aw, yay! We love Culina too! Thanks so much for the lovely review =), , , Reply, , , , , , , , , , , , Amber, , says, , , March 21, 2020 at 12:23 am, , , , I made this today for a falafel gyro, and it was so amazingly delicious!! My partner loved it as well! I didn’t have time to make the coconut yogurt before so I just used a can of coconut cream and it still turned out great. It got thicker after letting it sit for about an hour ~ Can’t decide which consistency was my favorite, both delicious!! Will definitely be making this again. Thank you, Minimalist Baker! ✨, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 23, 2020 at 10:16 am, , , , We’re so glad you enjoyed it, Amber! Thanks so much for sharing! xo, , , Reply, , , , , , , , , , Allison, , says, , , February 29, 2020 at 8:01 pm, , , , Does this freeze ok if i don’t use all of it?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 2, 2020 at 10:27 am, , , , We don’t think it would freeze well, but if you give it a try, let us know how it goes!, , , Reply, , , , , , , , , , Nadllyve Grisales, , says, , , January 17, 2020 at 5:50 pm, , , , I found this recipe very tasty and easy to do. In my case, I had to add a 1/2 cup more of oat flour., Thank you!, , , , , , Reply, , , , , , , , Lydia B Fiedler, , says, , , August 23, 2019 at 2:40 pm, , , , Thanks for this recipe – I miss dairy so much! I used Culina yogurt, and I found that I had to add another teaspoon of lemon juice., , I use Real Salt sea salt, which is less salty than table salt, so if using that, add 1/2 tsp. of Real Salt, not a pinch., , I used Christopher Ranch jarred minced garlic, and it hasn’t been in the fridge very long, but I think powdered garlic might disperse more evenly – has anyone tried that?, , , , , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , August 23, 2019 at 5:48 pm, , , , Thanks for sharing, Lydia!, , , Reply, , , , , , , , , , Shalyn Murphy, , says, , , August 11, 2019 at 6:29 pm, , , , Delicious! Thanks!, , , , , , Reply, , , , , , , , Rachel, , says, , , May 23, 2020 at 6:21 am, , , , Delicious! I ended up doubling the garlic, dill, and lemon juice. When I initially made it, it was a little too sweet, but after ~12 hours in the fridge it was perfect. All the flavors blended together perfectly., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 25, 2020 at 10:40 am, , , , We’re so glad you enjoyed it, Rachel! Thanks so much for sharing!, , , Reply, , , , , , , , , , , , Sara, , says, , , July 25, 2019 at 11:54 am, , , , I made this today but used unsweetened soy yogurt instead of coconut yogurt and it was absolutely delicious! I will definitely make this again in the future. Thanks!, , , , , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , July 25, 2019 at 11:58 am, , , , Thanks, Sara!, , , Reply, , , , , , , , , , Jessi, , says, , , June 27, 2019 at 4:53 pm, , , , I made this and it was delicious! I used kite hill plain Greek yogurt (almond milk) and a little less garlic (not a huge fan) and it was amazing! Will be making again., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , June 28, 2019 at 12:58 am, , , , So glad you enjoyed it, Jessi! Thanks for the lovely review! xo, , , Reply, , , , , , , , , , Laura, , says, , , May 29, 2019 at 3:29 am, , , , Hi! I just made this recipe and it was fabulous!!! I used unsweetened soy yogurt and added a lot more lemon juice. I guess this particular yogurt (from company Soyade) has mild taste and wasn’t sour enough to my likening.  I paired tzatziki with your easy vegan falafels and just could not stop eating the combo! Loved it, thanks so much! :), , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , May 29, 2019 at 9:50 am, , , , Thanks so much for the lovely review, Laura. We are so glad you enjoyed these recipes! Next time, would you mind leaving a rating with your review? It’s super helpful for us and other readers. Thanks so much! xo, , , Reply, , , , , , , , Laura, , says, , , May 30, 2019 at 4:49 am, , , , Yes, sure, will definitely leave a rating next time :), (Sorry, didn’t notice the little stars above the comment, I guess my brain was in the tzatziki heaven) :D, , , Reply, , , , , , , , , , , , Tracy, , says, , , March 29, 2019 at 12:04 pm, , , , I made this with parsley instead of dill (because it’s what I had!) and used kite hill plain unsweetened greek yogurt – so, so lovely!! We had whole wheat pita stuffed with veggies, falafel, hummus, and then topped it with this sauce. Really made it bright, tangy and flavorful!, , , , , , Reply, , , , , , , , Gabriela, , says, , , March 27, 2019 at 12:38 pm, , , , SO GOOD! Refreshing and delicious. I added 3 big bulbs of garlic, for a more garlic-y flavour, but next time I might tone it down haha Going to be a perfect pairing with my seitan gyros. Thanks Dana for the recipe :), , , , , , Reply, , , , , , , , Wendy, , says, , , March 24, 2019 at 9:51 am, , , , The coconut make this an unpleasing mix of sweet and the expected bitter flavors in tzatziki. Unless you  are looking for a very different flavor, I’d stick to the traditional flavors. I love coconut, but not with these accompaniments., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 25, 2019 at 4:04 pm, , , , Hi Wendy, sorry to hear this didn’t turn out as you expected! Do you mind if we ask what brand of coconut yogurt you used?, , , Reply, , , , , , , , Wendy Kirkpatrick, , says, , , March 25, 2019 at 4:55 pm, , , , I think it was Chobani.  Maybe it was sweetened?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 26, 2019 at 10:38 am, , , , Thanks for the info! We haven’t tried that brand, but it looks like yes, they only have sweetened versions. That could make a big difference!, , , Reply, , , , , , , , Wendy Kirkpatrick, , says, , , March 26, 2019 at 10:43 am, , , , It must have, because it was really not delicious., , , , , , , , , , , , , , , , , Brittany, , says, , , March 15, 2019 at 4:38 pm, , , , My husband has been missing tzatziki since I went vegan and refuse to buy dairy. He loves gyros so I used this on tempeh gyros for dinner & now we’ll use this recipe all the time! I’ve never gone wrong with one of your recipes. They’re always a hit. We subbed almond yogurt for coconut and it tasted great. Love how much it makes. Taking it to a party as a dip for veggies., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 18, 2019 at 1:04 pm, , , , Thanks so much for the sweet note and lovely review, Brittany. We are so glad you and your husband enjoyed it! Next time, would you mind leaving a rating with your review? It’s super helpful for us and other readers. Thanks so much! xo, , , Reply, , , , , , , , , , Janet Evpraxia Wehlitz, , says, , , February 25, 2019 at 11:04 am, , , , My husband has trouble digesting cucumbers; could zucchini be substituted for the cucumbers?, , Thanks for all your recipes!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 26, 2019 at 9:59 am, , , , Hi Janet, we aren’t sure if that would work, but if you try it, we suggest adding a little water to compensate for zucchini having a lower water content than cucumber. If you give it a try, we would love to hear how it goes!, , , Reply, , , , , , , , , , Robbie Aaron, , says, , , February 20, 2019 at 11:59 am, , , , 5 stars because I forgot to give it five stars in my comments :-), , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 20, 2019 at 2:56 pm, , , , Whoop! Thanks, Robbie!, , , Reply, , , , , , , , , , Robbie Aaron, , says, , , February 20, 2019 at 11:57 am, , , , Ok, literally just got done making this for a vegan gyro., , wow., , This was the perfect blend of everything. Fresh dill, I crushed my garlic into a paste, and basically followed everything as is. It was so easy and came out exactly how I wanted it to taste., , I ended up using seitan & sprinkled on some Old Bay Seasoning, chopped tomatoes, chopped some of the extra cucumber I had, a little spinach, & some shallots, smoothed on this delicious tzatziki  on a freshly warmed pita: heaven. Had quite a bit leftover so I am excited to see what other things I can incorporate this sauce into! Thanks so much for the great recipe!, , , Reply, , , , , , , , Hanna, , says, , , February 2, 2019 at 1:06 pm, , , , I made this with Unsweetened So Delicious Brand coconut yogurt and it turned out pretty well. I used dried dill and didn’t like how it turned it kind of a grayish green that looked less appetizing than traditional tzatsziki, but maybe that wouldn’t happen with fresh dill?, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 3, 2019 at 9:43 am, , , , You should get a more vibrant color from fresh dill!, , , Reply, , , , , , , , , , Beth, , says, , , January 12, 2019 at 9:10 pm, , , , Wow this was even more amazing than I had dared hoped! And it didn’t have a coconut flavour to it at all! I used the Nudie brand of Natural Coconut Yoghurt (in Australia).  I will definitely be making this recipe again and recommending it to others. Thanks for such a great recipe! So yum!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 13, 2019 at 8:33 am, , , , Whoop! We’re glad you enjoyed it, Beth!, , , Reply, , , , , , , , , , Miranda, , says, , , November 15, 2018 at 2:59 am, , , , Can I use follow your heart vegan mayo instead of coconut yogurt,? I’m not fan of coconut flavor.Love all your recipes., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 15, 2018 at 7:19 am, , , , Hi Miranda! We haven’t tried and can’t say for sure, but its worth a shot! Let us know if you experiment with the recipe :), , , Reply, , , , , , , , , , John, , says, , , November 1, 2018 at 10:21 am, , , , I’ve missed having Tzatziki sauce ever since becoming vegan, so this is such a blessing! I didn’t have dill on hand so I used fresh mint and it was still really delicious. Can’t wait to try it with dill!, I put it on your vegan simple falafel on salad, added some hot sauce as well, and it was divine!, , , , , , Reply, , , , , , , , ELSA BEATRIZ HERRMAN, , says, , , October 11, 2018 at 8:33 pm, , , , I made this for the first time and it was delicious. I’m a vegan, always trying to veganize everything I can.. I like homy dishes. I made so many of your recipes and never, ever disappointed me. I served this Tzatziki with  hot, spice veggies and Seitan stew and couscous. I had some steam potatoes – my husband loves them-and it was a success. I used store bought vegan yougurt Kite Hill.., , , , , , Reply, , , , , , , , Healthtrition, , says, , , September 30, 2018 at 4:09 pm, , , , Do you think vegan sour cream would work well?, , , Reply, , , , , , , , Maralina, , says, , , July 27, 2018 at 8:34 pm, , , , I’m “pegan” or vegan, low carb and sugar-free so I can’t do most vegan yogurts.  Has this been tried with vegan sour cream?  I used to make tzatziki using straight sour cream or Greek plain yogurt.  Some of the vegan sour creams are more diet-friendly although perhaps not as tasty.  Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 28, 2018 at 5:41 am, , , , Hi Maralina! We do have a vegan sour cream recipe which you can find, here, , but we haven’t tried making this with one. If you experiment with it, report back on how it goes!, , , Reply, , , , , , , , , , Amanda, , says, , , July 20, 2018 at 8:30 am, , , , I made this to go with gyros and it was awesome! Super quick to make too. I used Cocoyo brand yogurt which was nice and thick. Next time I make this I’m going to halve the amount of garlic – since it’s raw, it was a little strong. Delicious, thank you for this great recipe!, , , , , , Reply, , , , , , , , Michelle, , says, , , July 19, 2018 at 9:22 am, , , , I just made this recipe with the two ingredient coconut milk yogourt recipe you shared, and I am so amazed at myself right now :) I did it ! It worked :)))) Thanks, it really looks and tastes great., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 20, 2018 at 6:41 am, , , , Yay! We are so glad you enjoyed it, Michelle!, , , Reply, , , , , , , , , , Morgan, , says, , , July 19, 2018 at 2:35 am, , , , I was just curious how you think tofu might work in this recipe, maybe silken? Unfortunately my fiance can’t have coconut products and I’ve been trying to figure out a solution!, , Thanks!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 20, 2018 at 6:46 am, , , , Hmm we haven’t tried it and can’t say for sure. If you experiment with it though, report back on how it goes!, , , Reply, , , , , , , , , , Krystyn, , says, , , July 12, 2018 at 9:08 pm, , , , I just recently found out I have to eliminate dairy from my diet and have been searching for a recipe like this to try as I absolutely love greek food! How long do you think this would keep in the fridge? Provided we don’t eat it all in one sitting! Haha., , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 13, 2018 at 7:28 am, , , , Stored in the refrigerator, it will keep for up to 5 days, sometimes longer depending on freshness of yogurt., , , Reply, , , , , , , , , , Eileen, , says, , , June 8, 2018 at 6:25 pm, , , , Fantastic! I was out of lemon and used lime, and it was still great! Easy and delicious! Will be making frequently., , , , , , Reply, , , , , , , , meg, , says, , , May 8, 2018 at 3:22 pm, , , , this is so delicious! i just made it to serve over your curry-roasted fennel salad. such a hit!, , , , , , Reply, , , , , , , , Aclh, , says, , , May 4, 2018 at 5:31 pm, , , , Hi! I made this with unsweetened plain almond yogurt and it was great! I also made an extra batch made from coconut yogurt and it was awesome ? haha so I like them both. Thanks for the great recipe. I made the chickpea schwarma wraps ?? Sooooo good, , , , , , Reply, , , , , , , , Rebecca Lake, , says, , , April 19, 2018 at 2:57 pm, , , , I just made this with a few changes.  I used two cups of Kite Hill yoghurt, 3 heaping Tbsp of chopped fresh mint, 3 small asian cucumbers shredded and drained, 4 garlic cloves minced, and 1 Tbsp white mellow miso for some unami.  Delicious!  Thank you for the inspiration!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 20, 2018 at 5:03 pm, , , , Great subs, Rebecca! Thanks for sharing :D, , , Reply, , , , , , , , , , Brielle, , says, , , April 16, 2018 at 12:16 pm, , , , Made this using Kite Hill almond plain (unsweetened) yogurt. Came out DELICIOUS. I’m sure it would be even better with the homemade coconut yogurt, but I didnt have the time. Perfect blend of herby and tangy. Really missed tzaziki since being vegan, can’t believe I waited 4 years to find a vegan recipe!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 17, 2018 at 6:50 am, , , , Yay! Thanks for sharing, Brielle!, , , Reply, , , , , , , , , , Wendy, , says, , , March 4, 2018 at 11:38 am, , , , Made it with your 2 ingredient coconut yogurt following both recipes exactly.  SCORE!!! My new favorite!!, , , , , , Reply, , , , , , , , Amy, , says, , , February 26, 2018 at 9:09 am, , , , I made this for a vegan Mezza feast this weekend. I was worried that it would taste like coconut, but it was absolutely divine. Delish! No coconut flavor at all, and it added exactly what my falafel sandwiches needed., , I didn’t have time to let the yogurt sit for more than a day, so it wasn’t terribly thick. I want to try it again with a couple of days to spare. But the taste was delicious., , , , , , Reply, , , , , , , , Kia Postma, , says, , , February 21, 2018 at 5:16 pm, , , , This is AMAZING! Thank you thank you thank you!, , , , , , Reply, , , , , , , , Jaycie, , says, , , January 16, 2018 at 1:53 pm, , , , So incredibly easy and so incredibly good! Seriously!, , , , , , Reply, , , , , , , , LO, , says, , , December 31, 2017 at 2:31 pm, , , , I never leave reviews. I HAD TO!!! This is unbelievable and so easy. LOVE LOVE LOVE!!!, That coyo yogurt is to die! Just a simple delicious recipe. Thank you!!, , , , , , Reply, , , , , , , , Nancy, , says, , , November 17, 2017 at 12:49 pm, , , , This might sound insane but its the world’s greatest recipe and Im so obsessed Ive sent it to multiple friends. Im currently sitting here waiting for my chickpeas to bake to have my t h i r d greek night this week, all because of this recipe.  I do not like coconut things but the ever so slightest tinge of coconut in this lovely yogurt works well, I over do the dill because I love it and I don’t skimp on the garlic.  Its heaven.  My non vegan food loving husband is a huge fan. Thank you!!!!, , , , , , Reply, , , , , , , , Susanna, , says, , , September 29, 2017 at 12:10 am, , , , WOW, this is such a great idea! I total love coconut yoghurt and never came up with the idea of using it for this recipe, I always user regular greek yog!, , , Reply, , , , , , , , Lisa, , says, , , September 28, 2017 at 4:45 pm, , , , How much does the coconut flavor come through?, , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , October 2, 2017 at 5:27 pm, , , , It’s very mild in my opinion! Especially if you use my DIY recipe versus store bought., , , Reply, , , , , , , , Kayla, , says, , , February 5, 2018 at 8:04 am, , , , Finally!! A vegan tzatziki! Cannot wait for dinner tonight ! ;), , , Reply, , , , , , , , , , , , Lindsay, , says, , , September 28, 2017 at 4:13 pm, , , , Do you think almond milk yogurt would work? That’s all I have on-hand., , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , October 2, 2017 at 5:27 pm, , , , Unfortunately I don’t – I find the flavors not to work well together., , , Reply, , , , , , , , Giselle, , says, , , March 26, 2018 at 3:07 pm, , , , Lindsay, I am going to make it now with the Kite Hill PLAIN almond yogurt because it’s the closest to a regular milk yogurt regarding tartness and it’s not sweet at all! I just decided to give it a try a couple months ago after almost giving up on making tahini because all the other types of vegan yogurt were just sooo sweet, yuck ?, My twin adapted Dana’s recipe last night with Kite Hill and said it was outstanding!!!, Oh and Dana, I will make your GENIUS idea for the coconut yogurt made with the canned coconut milk soon as well!! Thank you!! ????❤️, , , Reply, , , , , , , , Elaine, , says, , , June 23, 2018 at 7:01 am, , , , I agree! I made raita with the Kite Hill plain yogurt and am in 7th heaven at long last!!!, , , Reply, , , , , , , , , , Kaley, , says, , , January 13, 2019 at 4:59 am, , , , Turned out great! I ran my cucumber through the juicer, which gave me perfectly chopped up and strained cucumber bits. I drank the juice. I couldn’t find any plain coconut milk greek yogurt even at Whole Foods, so I used kite hill almond Greek and it turned out awesome! The strong flavors of lemon, garlic, cucumber and dill cover any hint of almond anyway. I used it on your traditional falafel which I will review also., , , , , , Reply, , , , , , , , , , Iris, , says, , , September 28, 2017 at 12:00 pm, , , , Is there any substitute for dill? I’m not a fan of it..?, , , Reply, , , , , , , , Amanda, , says, , , September 28, 2017 at 4:40 pm, , , , Mint and parsley could work, , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , October 2, 2017 at 5:26 pm, , , , Dill is a pretty key flavor in this recipe, but I do think parsley or maybe mint would be the next best thing., , , Reply, , , , , , , , Tracy, , says, , , March 29, 2019 at 12:06 pm, , , , I used parsley and it was still great!, , , Reply, , , , , , , , , , Kathryn, , says, , , September 28, 2017 at 6:17 am, , , , Yessss. You’re a hero. I’ve attempted my own vegan tzatziki many times, but I’ve never been fully satisfied with the results (I used store-bought nondairy yogurt, which was always too sweet). Can’t wait to try this!, , , Reply, , , , , , , , Dana @ Minimalist Baker, , says, , , October 2, 2017 at 5:26 pm, , , , Hope you love it!, , , Reply, , , , , , Primary Sidebar, , , , Search for, , , , , , , Recipe Key, GF, , Gluten-Free, VG, , Vegan, V, , Vegetarian, DF, , Dairy-Free, NS, , Naturally Sweetened, , Want More Deliciousness?, Get our copy of, FAN FAVORITES, featuring 20 of our most loved, highly-rated recipes!, Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , Find Us, , Facebook, , Instagram, , Pinterest, , Twitter, , YouTube, , Minimalist Baker Brandmark, Simple Recipes That, , Make You Feel Good, Recipes, , Cookbook, , Shop, , About, , ©MinimalistBaker.com, , Privacy Policy, , Terms, , , , Please enable JavaScript in your browser to complete this form., Email, *, Comment, Submit, , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Website, Submit, , , , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Message, Submit, , , , , , X, , , , , , , Please enable JavaScript in your browser to complete this form., Email, *, Name, Submit, , , , X, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Morrocon Chermoula Sauce": "Ingredients: this wonder sauce can be used in so many different ways. I use it to marinate meat and fish, and I like to add a spoonful to roasted vegetables and soup. It also makes great pasta sauce, dipping sauce or even a salad dressing. This delicious Moroccan sauce is a staple North African condiment is popular in different parts of the world now, and I hope you'll give it a try today., , Chermoula Sauce Video Tutorial, , , , , , , , , , , , , What is Chermoula?, , Chermoula is a flavorful sauce that is popular in North African countries. It pairs well with fish, seafood, meat, poultry, and vegetables. There are many versions of Chermoula Sauce, some are spicier than others, but all are very tasty. There is also a red chermoula made with harissa paste, but we won't into this one today. The green chermoula sauce recipe I am sharing with you today is quite simple, and offers much flavor., , The recipe I am sharing today comes from a book called, \"Step by Step Mediterranean: More than 250 Recipes.\", It is the most basic chermoula recipe. I have tried several other versions of this sauce, but every time, I came back to this one., , , , , Fresh Parsley., Flat-leaf Italian parsley works best., , Fresh Cilantro., Some people call it fresh coriander., , Extra Virgin Olive Oil., Use good-quality olive oil for the best results and health benefits., , Lemon juice., Fresh lemon juice is best. You can also add a touch of lemon zest if desired. Can be substituted with lime juice, if preferred., , Garlic., Avoid garlic that comes from China, here is more info:, Identify, Chinese-grown garlic, , Ground spices., Cumin, coriander, and paprika., , Salt., , , You might already have paprika on hand, but I am not so sure about the latter two. You can easily find ground cumin in most grocery stores, and ground coriander can be found in larger grocery stores and Indian stores. If you don't feel like browsing the stores and looking for these spices, here are some Amazon links for you:, ground coriander, ,, ground cumin, , and, paprika, . If you whole whole spices (cumin seeds or coriander seeds), you can grind them at home using a coffee grinder., , , , Preserved lemons., Some say that it is better to use preserved lemons in this recipe. I never have these on hand, so I have never tried chermoula this way., , Adding hot pepper., Hot pepper, chili powder, Aleppo pepper powder, or red pepper flakes could be used to add some heat to chermoula., , , How to Make Chermoula Sauce, , 1. Place the cumin, coriander, and paprika in a frying pan and cook over medium heat for 30-60 seconds, or until fragrant., , , , , , Is Chermoula sauce healthy?, , Yes! Especially if you use high-quality extra virgin olive oil, and organic herbs and spices. This recipe is Whole30 compliant, low carb, keto-friendly, vegan, gluten-free, and dairy-free., , What does Chermoula taste like?, , With a flavor profile that tastes almost like a mix between pesto and chimichurri, chermoula has a pleasant flavor. You can feel the earthy spices, fresh herbs, and the cumin aroma., , How long will Chermoula last in the fridge?, , This wonderful sauce stores well (up to 3 weeks in the refrigerator), so you’ll have plenty of time to eat it all. Keep it in a mason jar covered with a lid or an airtight container., , Can Chermoula be frozen?, , Chermoula Sauce can also be frozen successfully. To freeze, drop spoonfuls into an ice cube tray that has been greased with olive oil. Then, transfer it into a freezer bag and use it as needed., , Chermoula sauce serving ideas, , , , With Fish., Spread a spoonful of Chermoula Sauce on top of your favorite fish. Let it marinate for a couple of hours or overnight. Place the marinated fish on a baking dish, and bake until cooked through. This African sauce gives a fresh take to your baked fish., , With Shrimps., Another great way to use it is to sauté the shrimp in a bit of olive oil for a couple of minutes. Add some Chermoula Sauce to the skillet, and cook for another minute., , With Chicken., Pan-fry or bake the chicken, and top it with fresh Chermoula., , With Couscous., , 1x, 2x, 3x, 3, , tsp, , ground cumin, ½, , tsp, , ground coriander, 2, , tsp, , paprika, 1, , cup, , chopped fresh cilantro, 1, , cup, , chopped fresh parsley, ½, , cup, , extra virgin olive oil, ¼, , cup, , freshly squeezed lemon juice, 4, , garlic cloves, chopped, ½, , tsp., , salt, a pinch, , cayenne pepper, , or to taste, , 1  cup chopped fresh cilantro, , 1 cup chopped fresh parsley, , ½ cup extra virgin olive oil, , ¼ cup freshly squeezed lemon juice, , 4 garlic cloves, chopped, , ½ tsp. salt, , a pinch cayenne pepper, , , Notes, 1 serving = ⅛ cup, , How long will Chermoula last in the fridge?, , This wonderful sauce stores well (up to 3 weeks in the refrigerator), so you’ll have plenty of time to eat it all. Keep it in a mason jar covered with a lid., , Can Chermoula be frozen?, , Chermoula Sauce can also be frozen successfully. To freeze, drop spoonfuls into an ice cube tray that has been greased with olive oil., , To find MANY serving ideas for this sauce, scroll up!, , , , Nutrition, Calories:, 87, kcal, Carbohydrates:, 1, g, Protein:, 0.4, g, Fat:, 9, g, Saturated Fat:, 1, g, Polyunsaturated Fat:, 1, g, Monounsaturated Fat:, 7, g, Sodium:, 85, mg, Potassium:, 62, mg, Fiber:, 0.4, g, Sugar:, 0.2, g, Vitamin A:, 682, IU, Vitamin C:, 9, mg, Calcium:, 16, mg, Iron:, 1, mg, , , , , , , , Tried this recipe?, Leave a comment below, I can't wait to hear from you!, More Healthy Recipes, Healthy And Delicious Burger Bowls, Scrambled Eggs and Cottage Cheese, Mushroom Bourguignon, Baked Cottage Cheese Egg Bites, , , , 309.8K, , shares, , , , , , , , , Pin, , , , , , , Share, , , Filed Under:, All Recipes, , , Healthy Recipes, , , Meat and poultry, , , Sauce, , , Seafood, , , Top Recipes, , , Vegetarian, , Reader Interactions, Comments, , , , , , Leeanne, , says, , , January 15, 2025 at 2:51 am, , , , Oh wow! What a taste sensation! Never even heard of this sauce before. Delicious. I’m a chilli freak so added a small red chilli. Yummo! Thx for the recipe 🙂, , , Reply, , , , , , , , Tania Sheff, , says, , , January 15, 2025 at 6:59 pm, , , , Thank you so much, Leeanne!, , , Reply, , , , , , , , , , Annie, , says, , , February 20, 2024 at 6:33 pm, , , , Can I use 2 cups of parsley instead of cilantro?, , , Reply, , , , , , , , Tania Sheff, , says, , , February 23, 2024 at 6:52 pm, , , , Hi Annie! Yes, you can do that. Happy cooking!, , , Reply, , , , , , , , , , Maybelle Pantoja Almera, , says, , , January 23, 2024 at 10:26 am, , , , Hi. Can I use curly parsley in lieu of the flat leaf? Its difficult to find flat leaf in the Philippines. Thanks!, , , Reply, , , , , , , , Tania Sheff, , says, , , January 28, 2024 at 2:19 pm, , , , Hi Maybelle! Yes, you can use curly parsley. Happy cooking!, , , Reply, , , , , , « Older Comments, , , , 4.75 from 54 votes (, 48 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., Primary Sidebar, SEARCH COOKTORIA, , search..., , Hello friend!, , My name is Tania.  I create quick, healthy, and wholesome meals. Let's get to know each other, shall we?, Read More…, , , BEST HEALTHY RECIPES, , Beet and Goat Cheese Salad, Cajun Shrimp, Easy Shrimp and Vegetable Skillet, Marinated Tomato Salad, Zucchini in Pesto Sauce, Chermoula Sauce, More Posts from this Category, , , LET'S KEEP IN TOUCH, , Facebook, Instagram, Pinterest, YouTube, , POPULAR RECIPES, , Shrimp Fajitas, Cajun Shrimp, Leftover Turkey Salad, Easy Baked Cabbage Steaks, Mediterranean Quinoa Salad, Old Bay Steamed Shrimp, More Posts from this Category, , Footer, , ↑ back to top, , , , Privacy Policy, , Privacy Policy, , , , Newsletter, , Sign Up!, for emails and updates, , , , Get in Touch, , Contact, , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © Cooktoria LLC 2021, , , , , , 309762, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: , With Orzo and Feta., , With Tofu., Pan-fry the tofu “steak” and top it with a generous amount of Chermoula Sauce., , With Roasted Vegetables., Cut zucchini into ½-inch thick circles and fry in a little oil until cooked through. Spread chermoula over it and serve. Season cauliflower \"steaks\" with salt and pepper. Fry in a little oil on an oven-safe griddle. Bake for another 15 minutes at 350F allowing the cauliflower to cook fully. Spread a generous amount of chermoula on top. Both of these recipes can be found on my vegan site:, Zucchini \"Steaks\", and, Cauliflower \"Steaks\", ., , , , Make Chermoula work for you!, , As with most homemade recipes, you are free to make some substitutions depending on your taste. If you are not a fan of cilantro, use more parsley instead. Add some extra cayenne pepper to make it spicier, or a few more garlic cloves for that amazing garlicky taste. Chermoula is a great sauce, full of warm spices and fresh herbs. It pairs well with so many dishes and I hope I gave you a lot of ideas on how to serve it above., , Please, refer to the recipe card below to get the nutrition information or print the recipe. Happy cooking!, , You'll also enjoy these recipes:, , , Cabbage with Chicken, (Perfect keto meal!), , Sautéed Napa Cabbage, (quick and yummy side dish), , Spinach Stuffed Chicken Breast, (my favorite dinner recipe), , Salmon Pasta with Spinach, (quick and filling dinner for the whole family), , , , , , Chermoula Sauce, , , Tania Sheff, , , This oh-so-flavorful and tangy Moroccan Chermoula Sauce will serve as a healthy addition to your seafood, poultry, meat and vegetable dishes., , , 4.75, from, 54, votes, , , , Print Recipe, , Pin Recipe, , , , , , Prep Time, 5, minutes, , mins, Total Time, 5, minutes, , mins, , , , , , , Course, Side Dish, Cuisine, Moroccan, , , , , , Servings, 12, , servings, Calories, 87, , kcal, , , , , Place the cumin, coriander, and paprika in a frying pan and cook over medium heat for 30-60 seconds, or until fragrant., 3 tsp ground cumin, , ½ tsp ground coriander, , 2 tsp paprika, ",
        "Muhammara": "Ingredients:  Instructions: "
    }
}