{
    "ingredients": {
        "Cucumber Hummus Roll ups": "cucumber,hummus,red peppers",
        "Vegan Air Fryer Cauliflower": "cauliflower,almond milk,eggs,acv,onion powder,oregano,all spice,marjoram,sugar",
        "Easy Baked Falafel": "chickpeas,onion,garlic,parsley,oat flour",
        "Vegan easy falafel": "chickpeas, onion, garlic, parsley",
        "Falafel in Appe Pan": "chickpeas, onion, garlic, cilantro, rice flour",
        "Roast Beetroot Falafels": "beetroot, garlic,chickpeas,coriander,tahini sauce",
        "Eggplant Fries with Fixate Tzatziki Sauce": "bread crumbs,coriander powder,onion powder,eggplant,all purpose flour,eggs, greek yogurt,lemon juice,lemon peel,cucumber,mint,dill",
        "Vegan Spinach Pinwheels cream cheese": "puff pastry sheets,spinach,vegan cream cheese,cinnamon,nutmeg,[dried]parsley,thyme,tarragon,dill",
        "Vegan Spanakopita": "spinach,yellow onion,garlic,parsley,kite hill almond ricotta[vegan ricotta],lemon zest,nutmeg,vegan filo dough"
    },
    "recipe_url": {
        "Cucumber Hummus Roll ups": "fixate_recipes\\Side and Snack\\FXR_Cucumber_Hummus_Roll_Ups_R_03.19.18.pdf",
        "Vegan Air Fryer Cauliflower": "https://chickpeaexpress.com/vegan-recipes/vegan-air-fryer-cauliflower/",
        "Easy Baked Falafel": "https://www.eatingbirdfood.com/easy-baked-falafel/",
        "Vegan easy falafel": "https://www.cookclickndevour.com/easy-falafel-recipe/?fbclid=IwAR3Oizadx2N38m5wlsCvjbxk3eyjjh-YFHSBEL4rpgfkhCbbCZiFLuklWn0",
        "Falafel in Appe Pan": "https://www.enhanceyourpalate.com/falafel-appe-ebelskiver-pan-recipe/#recipe",
        "Roast Beetroot Falafels": "https://www.kindearth.net/roast-beetroot-falafels-with-tahini-sauce-easy-gluten-free-vegan-deliciousness/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes#mv-creation-2-jtr",
        "Eggplant Fries with Fixate Tzatziki Sauce": "fixate_recipes\\Side and Snack\\FXR_Eggplant_Fries_with_Fixate_Tzatziki_Sauce_G_03.19.18.pdf",
        "Vegan Spinach Pinwheels cream cheese": "https://www.veganricha.com/vegan-spinach-pinwheels-cream-cheese/",
        "Vegan Spanakopita": "https://www.staceyhomemaker.com/vegan-spanakopita-recipe/#recipe"
    },
    "Recipe": {
        "Cucumber Hummus Roll ups": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., CUCUMBER HUMMUS ROLL-UPS, O, SERVES: 2 (4 roll-ups each)   Prep Time: 15 min.   Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, ½, ½, 1, , large cucumber, ¼ cup, , prepared hummus, ¼ cup, , roasted red peppers, , , thinly sliced, , , , SPECIAL EQUIPMENT:, Toothpicks, 1. \t Use a vegetable peeler to peel off eight long, thin slices of cucumber., 2. \t Spread 1½ tsp. hummus on each cucumber slice., 3. \t Top each with 1½ tsp. red pepper slices., 4. \t Pick up one end of the cucumber slice and roll cucumber loosely around, the filling. End with the seam on bottom and secure with a toothpick., VARIATIONS (SUBSTITUTE YOUR FAVORITE VEGETABLES OR HERBS FOR, ROASTED RED BELL PEPPERS. YOU CAN TRY THESE OR YOUR FAVORITE, COMBINATIONS):, •\t Chopped fresh red bell peppers, •\t Sun-dried tomatoes, •\t Capers, •\t Fresh chopped herbs, •\t Sliced green onions, NUTRITIONAL INFORMATION (per serving): Calories: 75  Total Fat: 3 g  Saturated Fat: 0 g   Cholesterol: 0 mg  Sodium: 197 mg  Carbohydrates: 9 g  Fiber: 3 g, Sugars: 3 g  Protein: 3 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Air Fryer Cauliflower": "❌ Error scraping https://chickpeaexpress.com/vegan-recipes/vegan-air-fryer-cauliflower/: HTTPSConnectionPool(host='chickpeaexpress.com', port=443): Max retries exceeded with url: /vegan-recipes/vegan-air-fryer-cauliflower/ (Caused by NameResolutionError(\"<urllib3.connection.HTTPSConnection object at 0x000001CE91000EF0>: Failed to resolve 'chickpeaexpress.com' ([Errno 11002] getaddrinfo failed)\"))",
        "Easy Baked Falafel": "Ingredients: , , If you’ve never tried falafel before, you’re in for a treat. I like to eat these on their own, with a sauce or dip (can’t go wrong with hummus or tahini), or as a vegetarian protein option for pita sandwiches, salads and bowls., , Are you a falafel fan? Have you ever tried making your own?, , , More Middle Eastern Recipes to Try, , Homemade Hummus, Israeli Salad, Easy Shakshuka, Tahini Dressing, Za’atar Chicken Bake, Baked Pita Chips, Green Shakshuka, Tabbouleh Salad, , , , If you enjoyed this recipe, please consider leaving a ⭐, star rating, and let me know how it went in the 📝, comments, below., , , Want to save this recipe?, Want to save this recipe?, Enter your email below and we’ll send the recipe to your inbox., Plus you’ll get great new recipes every week!, Please enable JavaScript in your browser to complete this form., First Name, *, Email Address, *, Save Recipe, , , , , , Save, Saved, , , Pin, , Print, , , , , 4.40, from, 160, votes, , Easy Baked Falafel, , By:, Brittany Mullins, , Inspired by our trip to Israel, I created a baked falafel recipe that is just as easy as it is tasty! It’s made with canned chickpeas so there’s no soaking necessary. These protein-packed patties are great for topping bowls and salads, plus they’re vegan and gluten-free., , Prep Time:, 10, minutes, , minutes, Cook Time:, 24, minutes, , minutes, Servings:, 15, , patties, , , , , 1x, 2x, 3x, ▢, 1 15, , oz, , can chickpeas, , , drained and rinsed, ▢, 1/4, , cup, , chopped onion, ▢, 3, , cloves, , fresh garlic, ▢, 1/2, , cup, , fresh parsley, ▢, 1, , Tablespoon, , olive or avocado oil, ▢, 2, , teaspoons, , lemon juice, ▢, 1, , teaspoon, , ground cumin, ▢, 1, , teaspoon, , ground coriander, ▢, 3/4, , teaspoon, , sea salt, ▢, pinch, , of cayenne, ▢, 1/2, , teaspoon, , baking soda, ▢, 3, , Tablespoons, , oat flour, ▢, olive or avocado oil cooking spray,  Instructions: , , Slow Cooker, , Instant Pot, , No Bake, , Meal Prep, , 30 Minutes or Less, , 5 Ingredient or Less, , , , , , Breakfast, , Lunch, , Dinner, , Dessert, , Salads, , My Favorites, About, , Contact, , Shop, , Cookbook, , Home, , , Recipe Index, , , Meal Type, , , Dinner, , , Easy Baked Falafel, Easy Baked Falafel, By, Brittany Mullins, 4.4, 188, Published Mar 17, 2018, Updated Mar 18, 2022, Jump to Recipe, Pin, Save to Favorites, Print, GF, Gluten-Free, V, Vegan, VG, Vegetarian, This post may include, affiliate links, . Thank you for your support., , , Inspired by our trip to Israel, I created a easy baked falafel recipe that is just as easy as it is tasty! It’s made with canned chickpeas so there’s no soaking necessary. These protein-packed patties are great for topping bowls and salads, plus they’re vegan and gluten-free., , , Ever since our trip to Israel last November, I’ve been hooked on Israeli food. Not only does it take me back to that time and place, but it’s just so fresh and the flavors used in their cooking are incredible. I don’t think I’ll ever get sick of Middle Eastern food. I just stumbled across, this article by Food52, that says “the U.S. appetite for goods and products from (Middle Eastern countries) is on the rise.” Apparently I’m on trend… totally not mad about it., , , Rather than just daydreaming about these flavors or depending on a local restaurant, I decided I needed to create my own recipe for baked falafel., , , The main reason these falafel are so easy is that I used canned chickpeas. Traditionally, falafel is made using dried chickpeas that have been soaked overnight. No, soaking is not hard, but sometimes I forget to start the process the night before and when mama wants falafel, mama wants falafel. 😉 I typically like to keep my pantry stocked with a variety of spices, Preheat oven to 375°F. Spray a baking sheet with oil., Add chickpeas, onion, garlic, oil, parsley, lemon juice, cumin, coriander, salt and cayenne into a food processor and pulse until just combined. You don’t want to over-process the mixture or you’ll end up with hummus. Plus, having a few chunks of chickpeas gives the falafel a nice texture. Stir in baking soda and oat flour. At this point your mixture should be holding together quite well., Scoop spoonfuls of mixture out and form into small patties; you should get about 15. Place on prepped baking sheet., Bake 10-12 minutes, flip patties and bake for another 10-12 minutes or until falafel are golden and cooked through., , Cook Mode, Prevent your screen from going dark, , Video, , , , , , , , , , , Nutrition, Serving:, 3, falafel, |, Calories:, 143, kcal, |, Carbohydrates:, 24, g, |, Protein:, 6, g, |, Fat:, 5, g, |, Sodium:, 648, mg, |, Fiber:, 6, g, |, Sugar:, 1, g, , Nutrition information is automatically calculated, so should only be used as an approximation., , , , Additional Info, , Course:, Lunch/Dinner, Cuisine:, Middle Eastern, Keyword:, baked falafel, easy baked falafel, , , , , , , Did you make this recipe?, Mention, @eatingbirdfood, and tag, #eatingbirdfood, !, Share:, Pin, Facebook, Tweet, Yummly, Email, , Dinner, , Gluten-Free, , Recipe, , Vegan, , Vegetarian, , Vegetarian Mains, , , Related Posts, , , GF, Gluten-Free, DF, Dairy Free, V, Vegan, VG, Vegetarian, Vegan Lentil Loaf (Vegan Meatloaf), GF, Gluten-Free, DF, Dairy Free, Slow Cooker Chicken Wild Rice Soup, GF, Gluten-Free, VG, Vegetarian, LC, Low Carb, Cauliflower Pizza Crust, GF, Gluten-Free, DF, Dairy Free, P, Paleo, LC, Low Carb, HP, High-Protein, Egg Roll in a Bowl, , About Brittany, Hey there, I’m Brittany, the creator of Eating Bird Food, , cookbook author, , health coach and mama of two littles. Here you’ll find quick and easy recipes that make healthy fun and enjoyable for you and your family!, , , , , , More about Brittany, , , , , , , Get Your FREE High-Protein Meal Plan, Struggling to eat enough protein? Subscribe to my email list and I’ll send you a 3-Day High-Protein Meal Plan with a Shopping List!, Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Sign Up, , , , , , , , 4.40 from 160 votes (, 86 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , 188 Comments, , , , , , , G, , says:, , , , September 26, 2024 at 8:23 pm, , , , , Hi Brittany, This looks great and would love to try for my toddler. I don’t have oat flour – can I substitute almond flour or something else? Thanks!, , , Reply, , , , , , , , Brittany Mullins, , says:, , , , September 27, 2024 at 1:32 pm, , , , , Hi G. I haven’t tested this recipe with another flour, but some have used regular flour for this recipe and it turned out great for them. If you use regular flour, let me know how they turn out!, , , Reply, , , , , , , , , , Jordan, , says:, , , , November 14, 2023 at 8:13 pm, , , , , So good! I’ve made fried falafel before and honestly this baked version was just as yummy. I sprayed with a little oil before baking and they were perfect! Next time will double the recipe., , , Reply, , , , , , , , Brittany Mullins, , says:, , , , November 16, 2023 at 10:42 am, , , , , YUMM! SO glad you gave this recipe a try and are loving it, Jordan. Thanks for coming back to share your review & star rating, it means so much to me!, , , Reply, , , , , , , See More Comments, , , , , , , , , , Meet Brittany, , Hey there, I’m Brittany, the creator of Eating Bird Food, , cookbook author, , health coach and mama of two littles. Here you’ll find quick and easy recipes that make healthy fun and enjoyable for you and your family!, , , , , , , , More About Brittany, , , , , , , Popular Posts, , GF, Gluten-Free, VG, Vegetarian, Easy Overnight Oats, GF, Gluten-Free, DF, Dairy Free, V, Vegan, P, Paleo, LC, Low Carb, Easy Chia Pudding, GF, Gluten-Free, DF, Dairy Free, V, Vegan, VG, Vegetarian, Easy Baked Oatmeal, GF, Gluten-Free, DF, Dairy Free, V, Vegan, VG, Vegetarian, Perfect Acai Bowl, , , , , , , , Get my cookbook!, , Over 100 plant-focused recipes that prioritize fruits & veggies, whole grains and plant-based proteins, stunning photos, lots of gluten-free and egg-free options, , , Order Now, , , , , , , Easter Brunch Recipes, , GF, Gluten-Free, VG, Vegetarian, Carrot Cake Baked Oatmeal, GF, Gluten-Free, VG, Vegetarian, HP, High-Protein, Easy Frittata with Caramelized Onions & Goat Cheese, GF, Gluten-Free, VG, Vegetarian, Strawberry Spinach Salad, GF, Gluten-Free, DF, Dairy Free, VG, Vegetarian, P, Paleo, Gluten Free Lemon Poppy Seed Muffins, As Seen In, Eating Bird Food, Recipes, , Breakfast, , Dinner, , Dessert, , Salad, , Snacks, , About, , Cookbook, , Contact, , , , , , ©2025 Eating Bird Food. All rights reserved., , Privacy Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , ,",
        "Vegan easy falafel": "Ingredients: this vegan and gluten free Mediterranean snack is such a treat., , , While these are traditionally fried, you can easily bake them too. Serve falafels with, hummus, , , thahini, sauce as snack or stuff in your pita along with your fav salad for a hearty meal. What’s your favorite way to eat these?, , I first tasted falafel in our Bangalore days. It was a part of an amazing mezze spread and I have been a loyal fan ever since 🙂, , It is close to our very own, masala vada, , but only in texture. They both are poll apart in flavors and unique on their own., , This recipe is an authentic recipe to make falafel, that I picked up from a middle eastern cook book long back. Over the years I have made it so many times and it is such a staple at our home., , I bake our own pita and it is such a fun to put together a pita sandwich with falafel, hummus and a quick salad., , So if you are fan of this middle eastern eastern but haven’t tried your hands at this, do make some and you will totally enjoy the homemade ones., , What Is Falafel?, , , Vegan and gluten free by nature, this is a very popular snack worldwide especially with vegetarians., , It is believed that falafel originated in Egypt and was consumed Coptic Christians during religious holidays like lent as meat replacement. In Egypt falafel is made with fava beans., , When I first tasted this snack, I was amazed by its flavor and crispy texture. I was determined to nail the recipe so that I can enjoy falafel whenever I want 🙂, , blend or pulse with herbs and seasoning, make ball and fry., , This is what I call my kind of cooking, straight forward and easy steps with an incredible dish that you cannot get enough of 🙂, , Whether you serve as a snack or as meal with pita this falafel is something that you will be so pleased with!, , This Falafel Recipe Is, , Traditional & authentic, , Absolutely delicious, flavorful and crispy, , ridiculously easy to make, , wholesome snack for kids, , vegan & gluten free, , full of plant protein, , , What Are Falafels Made Of?, , Before getting into the recipe, , Chickpeas, – the star of our dish. We need white chickpeas or kabuli chana or garbanzo beans for this. Get dried chickpeas and soak overnight for best results. I absolutely don’t recommend canned chickpeas for falafel. read more on this in tips section., , Onions & garlic, – For flavor and texture, use as much as you prefer., , Herbs-, Two important herbs for making authentic and traditional falafel are cilantro leaves and parsley. ou can leave out either one if you don’t have. You can also add dill leaves., , Spices-, roasted cumin, coriander and fresh pepper powder. You can also add a dash of chili powder for more heat., , , , flour for binding, – if your mixture is made in rightly you do not need any flour for binding. Adding flour definitely alters the texture of this snack and makes them dense. However if your falafel mixture doesn’t hold shape, you can add 2 tablespoons of rice flour or chickpea flour and bind well., , Baking powder or soda, – the common thought is that adding baking soda lends an airy and light texture to falafel. Again, this can be achieved by using well soaked chickpeas and frying in right temperature. If you want to bake the falafels do add 1/2 teaspoon baking soda though., , , Some Tips Before We Begin, , Use dry chickpeas, – Best falafels are made with soaked and drained dry chickpeas. Canned chickpeas are way too soft as they are cooked andl do not do well in this recipe., , The falafel mixture made with canned chickpeas tend to be very soft and the fried bals turn out soft instead of crispy., , Get the consistency of mixture right-, the consistency of the mixture should be coarse yet not very much. If you try to make a ball with the pulsed mixture you should be able to and it should hold shape., , Do not add water while processing., , If the mixture is very coarse the balls will break while frying and on the other hand if you make the mixture very pasty it will spoil the texture of falafels., , To add flour or not for binding-, As I have mentioned above I never add any flour for binding. If you have soaked the chickpeas well and drained thoroughly you don’t have to add any flour., , If at all you find your mixture very loose and not holding you can add 2-3 tablespoons of rice flour or chickpea flour., , While shaping if you have difficulty or find the mixture difficult to handle, you can refrigerate the mixture for 30 minutes just like we do with some cookie dough. Chilling the mixture makes it tight and eases the shaping., , Get the oil temperature-, to make perfect falafels that are crispy from outside with fluffy light interior, the oil temperature has to be right. If the oil is not hot enough, the falafels will turn dense and hard. If it is too hot, they will brown quickly from outside while the inside will remain uncooked., , What we need here is hot but not smoking oil for frying that is around 375 F or 190 C if you use a thermometer. Another age old way to check oil temperature is you drop a small bit it should rise and float immedietly. Tis is the right temperature for frying., , , this vegan and gluten free Mediterranean snack is such a treat., , , 4.20, from, 21, votes, , , Print Recipe, , Pin Recipe, , , Prep Time, 12, hours, , hrs, , 30, minutes, , mins, Cook Time, 30, minutes, , mins, Total Time, 13, hours, , hrs, , , , , , , Course, Appetizer, Side Dish, Snack, Cuisine, Middle Eastern, , , , , , Servings, 15, , falafels, Calories, 96, , kcal, , , , , 1 CUP = 250 ml, , , 1x, 2x, 3x, ▢, 1, , cup, , dried chickpeas, ▢, 1, , small onion, , quartered, ▢, 3, , garlic cloves, , peeled, ▢, 1/2, , cup, , cilantro leaves, ▢, 1/2, , cup, , parsley leaves, ▢, 2, , teaspoons, , ground cumin, ▢, 2, , teaspoons, , ground coriander, ▢, 1, , teaspoon, , ground pepper, ▢, 1, , teaspoon, , red chili powder or paprika, ▢, salt, , to taste, ▢, oil, , for fryinh,  Instructions: , Soak Chickpeas-, Pick rinse and soak 1 cup chickpeas in plenty of water for 8-12 hours. Be sure to use a big vessel and plenty of water as chickpeas will double in size as they soak., , , Make falafel Mixture, – Before beginning the recipe, drain the chickpeas thoroughly. There should not be too much moisture in the chickpeas, , To a blender jar add drained chickpeas, peeled and roughly chopped onions, peeled garlic cloves, ground cumin, coriander, pepper powder and salt to taste Also add rinsed cilantro and parsley leaves., , , Pulse for few seconds until the mixture resembles coarse meal. Pick up a portion and try to make a ball to check consistency. refrigerate the mixture for 30 minutes., , , Shape and fry-, Make small balls from the prepared mixture., , Heat oil for deep frying. Once the oil is bubbling hot but not smoking, slide the balls in batches., , , Flip gently and fry until crispy and golden brown in medium flame. it takes around 3-4 minutes for each batch. Using a slotted spoon, remove carefully from oil., , , Drain excess oil and falafel is ready to serve., , , , , While making the chickpea mixture add 1/2 teaspoon baking soda and mix well. Shape into balls., , Preheat oven at 190 C or 350 F for 15 minutes. Arrange the shaped balls in a greased baking sheet and brush all the balls with some oil., , Bake in the hot oven for 15-20 minutes. Flip the balls half way ad bake till crispy and golden., , Ways to serve falafel, , As snack with dip, – Most easiest way is to serve this as evening snack with any creamy dip like sour cream dip, tahini sauce or yogurt dip. Here I made a quick vegan yogurt dip with cashew curd.You can serve with tahini sauce or hummus., , , falafel salad-, My most favorite way to serve this snack. make a quick middle eastern salad of cucumber tomato salad with parsley. Just before serving toss the falafels and serve immedietly. You can also do this with kachumber, avocado salad., , Pita sandwich-, stuff these balls in warm pita pockets along with a salad and dip like hummus., , Make Ahead, Storage & Freezing  Notes, , You can store the falafel mixture  in refrigerator for 3 days. Store in airtight containers., , The shaped falafels can be frozen for 20 days. Shape the patties, line in a tray and freeze till they turn hard. Then transfer to freezer safe container and store., , I suggest you serve fried falafels immedietly for best taste. They will remain crispy for 2-3 hours., , I hope you will try this falafel recipe and enjoy as much as we did. P, lease give a star rating, ★, in the recipe card below. Follow us on, Pinterest, ,, Instagram, ,, Facebook, for more recipes and ideas., , , , , How To Make Falafel, , , Cook Mode, Prevent your screen from going dark, , Harini, , , , Pick rinse and soak 1 cup chickpeas in plenty of water for 8-12 hours. Be sure to use a big vessel and plenty of water as chickpeas will double in size as they soak., , Before beginning the recipe, drain the chickpeas thoroughly. There should be too much moisture in the chickpeas., To a blender jar add drained chickpeas, peeled and roughly chopped onions, peeled garlic cloves, ground cumin, coriander, pepper powder and salt to taste Also add rinsed cilantro and parsley leaves., , Pulse for few seconds until the mixture resembles coarse meal. Pick up a portion and try to make a ball to check consistency. refrigerate the mixture for 30 minutes., , Make small balls from the prepared mixture., Heat oil for deep frying. Once the oil is bubbling hot but not smoking, slide the balls in batches., , Flip gently and fry until crispy and golden brown in medium flame. it takes around 3-4 minutes for each batch. Using a slotted spoon, remove carefully from oil., , Drain excess oil and falafel is ready to serve., , , Notes, , Best falafels are made with soaked and drained dry chickpeas. Canned chickpeas are way too soft as they are cooked andl do not do well in this recipe., , the consistency of the mixture should be coarse yet not very much. If you try to make a ball with the pulsed mixture you should be able to and it should hold shape., , to make perfect falafels that are crispy from outside with fluffy light interior, the oil temperature has to be right. If the oil is not hot enough, the falafels will turn dense and hard. If it is too hot, they will brown quickly from outside while the inside will remain uncooked., , You can store the falafel mixture in refrigerator for 3 days. Store in airtight containers., , The shaped falafels can be frozen for 20 days. Shape the patties, line in a tray and freeze till they turn hard. Then transfer to freezer safe container and store., , , Nutrition, Serving:, 15, small falafels, Calories:, 96, kcal, , , , , Keyword, falafel, , , , , , Tried this recipe? Snap a pic and share 🙂, Mention cookclickndevou or tag cookclickndevour, , , , , , , 2241, , shares, , , , , , , , Share, , , , , , , Pin, 2239, , , , , , , Yummly, , , , , , , Flipboard, , , , , , , Twitter, , , Shared by, Harini, , About, Harini, I am Harini. The recipe developer, food photographer and chef behind cook click n devour. My aim behind this blog is to provide easy, tried and tested recipes that beginners can cook with confidence. I took keen interest in cooking and took courses on cooking, baking during teens purely out of passion. With a decade of cooking experience I am glad to share my recipes and culinary knowledge with you all here. Stay tuned and happy cooking!, Harini :), , Comments, , , , , , Angela, , says, , , October 29, 2020 at 3:32 pm, , , , Can you bake instead of frying?, , , , , , , , , Harini, , says, , , October 29, 2020 at 3:53 pm, , , , yes, , , , , , , , , Anna Sperry, , says, , , February 10, 2021 at 7:01 am, , , , Thank you for your recipe for the falafels. I will be making these tonight, and can’t wait to try them! Have been searching for a recipe for these for a while now. Love the authenticity you’ve provided!, , , , , , , , , Harini, , says, , , February 10, 2021 at 10:06 am, , , , thank you so much!, , , , , , , , , Lin, , says, , , February 17, 2021 at 7:11 am, , , , Ok in an air fryer?, , , , , , , , , Camille, , says, , , March 23, 2021 at 1:34 am, , , , I made these today and they are super tasty!!!!! Came out perfect! Thanks for sharing.😁, , , , , , , , , Crystal, , says, , , October 24, 2021 at 6:58 pm, , , , How to make the vegan yogurt and cashew curd dip?, , , , , , , , , Anabelle, , says, , , October 26, 2021 at 7:20 am, , , , I love this. I was getting the falafel balls from revive foods, and I want to make them at home. Revive stuffs them with a tahini sauce, but I’m thinking I can just make a tahini dip., , I know you say the oil has to be hot enough or it will be hard, but I’m wondering about the air fryer. Have you tried? I have such bad luck with frying stuff., , , , , , , , , Chicky, , says, , , January 6, 2022 at 7:49 pm, , , , Can you do them in an air fryer?  I love Mediterranean food but cannot eat fried food.  Thanks, , , , , , , Leave a Reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., , Hello, I am Harini, , , , , , The chef, author and photograper of cook click n devour. Here you'll find tried & tested vegetarian recipes with step by step photos and videos to make cooking a pleasure and fulfilling experience. Happy cooking!, , , Read More, , , , , Popular Recipes, , , , As Seen In, , , About, Contact, Privacy, Copyright ©2025, Cook Click N Devour!!!. All Rights Reserved., , , , , , , , , , , , ,",
        "Falafel in Appe Pan": "Ingredients: 1, , cup, , Chickpeas, , Dry washed soaked overnight and drained., 1, , cup, , Parsley, , Fresh, 1, , cup, , Cilantro, , Chopped, 2, , Green chilies, 1, , tablespoon, , Ginger, , Finely chopped, 1, , cup, , Onion, , Finely chopped, 2, , tablespoon, , Rice flour, 1, , tablespoon, , Lemon, , Juice, Spices:, Salt, , As per your taste, 1, , teaspoon, , Black pepper, 1, , teaspoon, , Cumin seeds, , Roasted powder, , I didn’t keep and right away made the round balls from it. Size of balls depends upon the cavity of your appe/ebelskiver pan., Heat the appe/ ebelskiver pan on a medium low heat and grease all the cavities using little oil., Put one ball in each cavity, no need to cover the pan., Once done and golden brown from bottom flip them with the help of spoon and add little more oil from the sides, if you see the sides are not getting brown flip them again so that they should be golden brown and cooked from all sides., Repeat the process with the remaining falafel balls and serve them with tahini or hummus., Additional steps for making falafel rolls, You can also use these falafels for rolls / wraps to make it easy for kids to eat or take in lunch., , , , , , Notes, Rice flour acts as a binder in this recipe. The above ingredient quantities will yield about 25 falafels, which makes 5 to 7 servings., , , Nutrition Facts, , Falafel, , , Amount Per Serving, , , Calories, 229, , Calories from Fat 27, , , , , % Daily Value*, , , Fat, 3g, 5%, Sodium, 100mg, 4%, Potassium, 608mg, 17%, Carbohydrates, 40g, 13%, Fiber 11g, 46%, Sugar 8g, 9%, Protein, 11g, 22%, , , Vitamin A, 1565IU, 31%, Vitamin C, 30.7mg, 37%, Calcium, 90mg, 9%, Iron, 4.6mg, 26%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , , DID YOU MAKE THIS RECIPE?, Tag, @enhanceyourpalate, on Instagram and hashtag it, #enhanceyourpalate, , Share, Share, Tweet, Pin, 162, Yum, WhatsApp, 162, Shares, More Vegetarian Appetizers, Bathua Paratha, Makhana Bhel - Gluten, Soy Free, and Vegan Foxnut Indian Salad, Pindi Chole (Punjabi Chole) - No Onion No Garlic, Diwali Food for a Festive Celebration, Reader Interactions, Comments, , , , , , Shilpa, , says, , , March 03, 2020 at 9:05 pm, , , , Hi Rupali,, I’m assuming the rice flour is added to the blended mixture?, , , Reply, , , , , , , , Rupali Agarwal, , says, , , March 04, 2020 at 7:41 am, , , , Yes, you add it at the end to the blended mixture., , Thank you!, , , Reply, , , , , , , , , , Pretti, , says, , , August 22, 2018 at 2:04 pm, , , , How to follow your blog, , , Reply, , , , , , , , Rupali Agarwal, , says, , , August 22, 2018 at 8:38 pm, , , , Hey Pretti, Thank you for your interest. You can do email subscription to the website to get updates anytime a new recipe is posted or you can follow me on one of the social media platforms. I am most active on Facebook & Instagram. Just click on the 'Facebook' icon in the website and it will take you right there., , , Reply, , , , , , , , , 5 from 2 votes (, 2 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Primary Sidebar, , Hi, I'm Rupali!, Welcome to my food blog where I love to share healthy vegetarian recipes from my North Indian roots and present day.  My recipes range from simple to elaborate showstoppers., , More about, Rupali →, Tranding Posts, Pindi Chole (Punjabi Chole) - No Onion No Garlic, Peanut Satay Sauce, Rajasthani Thali - An Authentic and Traditional Menu, Baked Namak Para - Healthy and Crispy, April Posts, Bathua Ka Raita: Delicious Yogurt Recipe, Healthy Zucchini Fritters - Vegan & Gluten Free Recipe, Thai Green Curry Veggie Quinoa, Dubki Wale Aloo: No Onion No Garlic Indian Spicy Potato Curry, Footer, ↑ back to top, About, , About, , Shop, , Cart, , Newsletter, , Subscribe for my latest recipes in your inbox, , Contact, , Contact, Facebook, , Instagram, , Pinterest, , YouTube, As an Amazon Associate, I earn from qualifying purchases, Copyright © 2025 Enhance Your Palate, Privacy Policy, -, Terms & Conditions, , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: Show Photos, No Photos, Process the chickpeas, parsley, cilantro, ginger and green chilies in a food processor using chopping blade until rough coarse texture don’t over process into a paste., , Once the mixture reaches the desired consistency and texture, pour it out in a mixing bowl and add chopped onions, salt, black pepper",
        "Roast Beetroot Falafels": "Ingredients: Beetroot falafels are even healthier than regular ones, Beetroot gets my top vote for its incredible nutritional profile. It is said that it can help lower blood pressure, improve stamina and support healthy liver function. So it was only a matter of time before it appeared in my falafel., Beetroot has excellent antioxidant properties. It is high in glutathione, polyphenols and betalains, which all have excellent anti-oxidant properties. Anti-oxidants play a key role in the prevention of most chronic diseases, due to their ability to counteract the effects of free radical damage on human tissue., Beetroot is also rich in essential nutrients such as… Folate (folic acid/B9) which is essential for DNA synthesis and repair. Manganese which is good for skin & bone health; blood sugar management; protection against free radicals.  Helpful for blood pressure regulation and kidney health. Vitamin C – a  powerful anti-oxidant; helpful for wound healing; blood sugar regulator. This root vegetable also has good levels of zinc, iron and copper for maintaining general healthy body function., Read on here for more about, beetroot, …, The Health Benefits of Beetroot, Coriander leaves (cilantro) are a wonderful addition to these beetroot falafels, with its hint of green to compliment the beetroot red and its plethora of antioxidants and beneficial nutrients. It doesn’t dominate the flavour, but simply compliments it (and if you don’t like coriander leaves you can swap for parsley or just leave it out altogether)., Continue to Content, , , , Roast Beetroot Falafels with Tahini Sauce - easy gluten-free vegan deliciousness, , Yield:, , 10, , Cook Time:, , 16 minutes, , , Total Time:, , 16 minutes, , A delicious beetroot inspired falafel recipe with the addition of optional coriander (cilantro) leaves. Baked or grilled (broiled if you are in the USA) to maintain a wonderful, healthy, gluten-free, vegan falafel., , Print, 2 beetroots (just under tennis ball size), 2 large garlic cloves, 250g (2 cups) cooked chickpeas, 1 handful fresh coriander leaves (optional), 1 tablespoon ground coriander, 1 heaped teaspoon ground cumin, 1 teaspoon sea salt, , Tahini Sauce (to serve), just broken down into tiny pieces so that when you compress, everything binds together., Please watch my video (below) for a visual guide and you can't go wrong. If it seems a little too crumbly then I recommend adding a teaspoon or two of water or olive oil. Moisture depends on how much the chickpeas have been drained or how the moisture level of the baked beetroot., Roll into balls (a little smaller than golf balls in size)., Press the balls down into mini patty shapes., Place onto a grill tray (broiler in the USA) and grill on a medium/low heat for about 8 minutes on each side., (You can also bake these in the oven as an alternative to grilling)., Serve right away., This served really well with tahini sauce - check out my, Easy Tahini Sauce Recipe here, , , , , , , Did you make this recipe?, Please leave a comment on the blog or share a photo on, Instagram, © Anastasia, , , Cuisine:, vegan, gluten-free, dairy-free, wheat-free, , /, , Category:, dinner, lunch, , Tahini Sauce Recipe…, If you want to make your own chickpeas in batches from dried then check this page out here:, Pin for later…, , , By, Anastasia, |, Related Posts, , , , Super EASY roast squash & lentil curry, , , Super EASY roast squash & lentil curry, , April 9th, 2025, , |, , 0 Comments, , , Wild Garlic Recipes, , , Wild Garlic Recipes, , March 26th, 2025, , |, , 0 Comments, , , Wild Garlic Olive Tapenade, , , Wild Garlic Olive Tapenade, , March 26th, 2025, , |, , 0 Comments, 51 Comments, , , Jenn, September 27, 2017 at 2:11 am, - Reply, I love that color! What a great idea to add beets to falafel. And, yes, give me all that tahini sauce!, , Nicole Dawson, September 27, 2017 at 3:20 am, - Reply, I would be the first in line if you ever ventured out with that food truck idea!, , Dianne's Vegan Kitchen, September 27, 2017 at 8:37 pm, - Reply, I love falafels, and I love the idea of making them with beets! I can’t wait to try the recipe!, , Mel | avirtualvegan.com, September 29, 2017 at 5:12 am, - Reply, That colour! They are so pretty. They would be wonderful as part of a buffet at a little girls’s birthday party!…Or on my pita bread for lunch! 😉, , Trinity @ Trinity's Conscious Kitchen, September 29, 2017 at 6:35 pm, - Reply, Indeed – they just make any occasion exciting 🙂, , Irina, May 7, 2020 at 9:37 pm, - Reply, This look wonderful! Should the beets be boiled 🙂 ?, , Linda from Veganosity, September 29, 2017 at 5:46 pm, - Reply, The prettiest falafel I’ve ever seen! These sound so wonderful, Trinity. There are two beets in my fridge just begging to be turned into these., , Trinity @ Trinity's Conscious Kitchen, September 29, 2017 at 6:36 pm, - Reply, Ahhhh thanks so much Linda., x, , Kristina, September 29, 2017 at 6:06 pm, - Reply, these are SO PRETTY, and I know they taste great with the tahini! 🙂, , Sophia | Veggies Don't Bite, September 30, 2017 at 11:48 pm, - Reply, Those are SO SO pretty! Just gorgeous.  I love how beautiful beet based foods are in photos. I just wish I actually liked the flavor of beets! LOL., , Alisa Fleming, October 2, 2017 at 12:40 am, - Reply, I’m always amazed by the pink power of beets! I mean, those are such a pretty hue with so many chickpeas! Love the flavor theme, too. Great savory idea., , Ornella, October 4, 2017 at 6:20 pm, - Reply, A great recipe again! Similar to your beetburgers with spices, right?:). Now if we would have a gf pita bread recipe ….that will be a miracle????…just planting a seed for thinking here?. Thank you,Trinity! You make a huge difference with your delightful work!, , Christine, October 25, 2017 at 12:40 am, - Reply, Do these reheat well?  Or maybe eat the leftovers cold inside a pita with some mixed greens and tahini sauce?  Can’t wait to try these!!, , Trinity @ Trinity's Conscious Kitchen, October 25, 2017 at 9:16 am, - Reply, I’ve reheated them fine although I prefer to make a batch and then just cook the ones I need at the time (cook the others when required)., They freeze well too. I do also enjoy them cold., Enjoy 🙂 xx, , Tanya, July 19, 2018 at 12:17 pm, - Reply, When you freeze them do you cook then freeze? Or freeze and then cook? Thank you! Beetroot is currently in the oven 😊, , TrinitysKitchen, August 13, 2018 at 7:30 pm, - Reply, I freeze before cooking. So sorry for the late reply I was running my summer school when you posted and got carried away with everything else 🙂, , Christine, October 25, 2017 at 10:20 pm, - Reply, The flavor is amazing, but mine are quite crumbly.  I used canned chickpeas and drained and rinsed  them.  Should I have added in some water?, , Laura C, October 28, 2017 at 3:12 pm, - Reply, I just made these and they were DELICIOUS!!! Thanks so much for the recipe.  My mixture was a little sloppy as I used whole roasted beets (roasted in foil) that I had in the fridge, but to compensate I used a couple of tablespoons of gram flour., I will definitely be making these again!, , Gail, December 1, 2017 at 5:11 am, - Reply, I made these and they taste wonderful and look just like the pics.  I had no trouble make the patties but as they cooked they dried out and got crumbly.  Any tips?  oh, I made the tahini sauce too, delicious!, , Trinity @ Trinity's Conscious Kitchen, December 1, 2017 at 5:18 am, - Reply, Happy to hear that Gail., Hmmmmm now that is a bit of a mystery, since I’ve not had that happen with them. If anything springs to mind, I’ll be sure to share., , Hannah, March 27, 2018 at 8:56 am, - Reply, Hi I would like to know what you used to shape your falafel?, They were delicious but I need to improve their shape a bit, , Trinity @ Trinity's Conscious Kitchen, March 27, 2018 at 8:59 am, - Reply, Hi Hannah,, I just use my hands. In fact the batch in the photo my mam shaped (as she was visiting at the time). Everyones come out differently! And it is just a matter of practice. Try compacting quite firmly, then squeezing and rounding the shape. It will come with practice 🙂, Trinity x, , Charlie, May 16, 2018 at 9:13 pm, - Reply, When you say bake on high heat. What temperature are you doing it at? Are they super soft when you take them out? Or still firm, but easily cut with a knife? Also.. did you leave the skins on and just take off rought neck? Or did you eventually peel them as well?, Thanks so much!, , Sarah, August 9, 2020 at 5:25 pm, - Reply, Could we use canned beets instead?, , Anastasia, August 10, 2020 at 7:18 am, - Reply, You could adapt the recipe, although I imagine the canned beets would be a lot more moist than the baked beets, so you’d need to compensate (perhaps with chickpea flour)., , Trinity @ Trinity's Conscious Kitchen, May 16, 2018 at 9:21 pm, - Reply, Hi Charlie,, Since we are just baking the beetroots, to begin with, it would be whatever high heat you consider your oven to be. Haha yes, I guess that would vary from person to person… so I would say gas mark 7 (220C or 425F). They don’t need to be super soft when taken out as long as you can pierce them with a fork etc – they will break down in the food processor., Just took off the rough neck – no peeling., I hope that helps 🙂, , Mrs Christine Williamson, August 13, 2018 at 7:17 pm, - Reply, Love the texture of these and the taste .Very easy to make also., , TrinitysKitchen, August 13, 2018 at 7:28 pm, - Reply, Happy to hear you like them 🙂, , Mary, September 26, 2018 at 7:48 pm, - Reply, I just made these for my dinner  ~ well sort of lol ~ I used your basic recipe Trinity, then instead of the coriander & cumin, I put in some grated carrot & lemon juice and some mint from my garden, ’cause I love grated carrot with grated beetroot, lemon juice & mint ~ and it was delicious! 🙂   I have saved one to have cold tomorrow with salad for lunch 🙂 I’ll try your coriander & cumin one the next time ~ my beautiful body was asking for mint this evening! 😉 Thank you so much for your inspiration Trinity 🙂, , Lucrezia Linardi, October 14, 2018 at 11:42 am, - Reply, , Trinity @ Trinity's Conscious Kitchen, October 18, 2018 at 10:14 pm, - Reply, Sorry about that – I was having some issues with my site a couple of days ago, you should be able to see the recipe fine now., Kindest blessings, Trinity, , Stella Millburn, October 18, 2018 at 5:08 pm, - Reply, They look beautiful, can’t wait to try them!, How many people would that recipe feed?, , Trinity @ Trinity's Conscious Kitchen, October 18, 2018 at 10:13 pm, - Reply, It makes 10 falafels so I would say that was good for about three people., Just double up if you want more., , Amber, November 10, 2018 at 8:33 pm, - Reply, These were delicious!!, , Anastasia, November 10, 2018 at 8:39 pm, - Reply, Fab! 🙂, , Mattie, December 18, 2018 at 9:51 am, - Reply, Hey, i’m really looking forward to make them tonight! They look great! But – i’ve got already cooked beetroots, do ya think, it’s okay to use them? Thanks😊❄️, , Anastasia, December 18, 2018 at 10:46 am, - Reply, Definitely worth a try – they might be a little moister if they’ve been boiled, but perhaps then just add a little extra of the dried stuff., , Sara Alves, February 22, 2019 at 2:49 pm, - Reply, Wow! Just, wow! Delicious. Not to mention the tahini sauce…Can’t stop eating the stuff. Very yummy! Thank you Ms. Trinity 🙂, , Anastasia, February 24, 2019 at 9:27 am, - Reply, Yay! Happy to hear it Sara!, , Maja, May 4, 2019 at 3:41 pm, - Reply, These turned out well!, I’d like to ask if your recipes in your cookbook are oil free as well? I don’t use salt, sugar and oil, so it would be helpful to know. The few recipes I’ve looked at didn’t include oil, but I’d just like to make sure., , Anastasia, May 5, 2019 at 4:28 pm, - Reply, Glad you liked them., My recipes do sometimes include oil (although many do not and I tend to use only when necessary)., I don’t use regular refined sugar in any of my recipes, although I sometimes use dried fruit, coconut sugar or maple syrup in the sweet treats., I do use sea salt, tamari or shoyu at times too., I hope that helps., , Carla Sokol, August 18, 2019 at 11:24 pm, - Reply, If I bake the falafel instead of cook them on the stove in a grill pan, at what temperature and for how long would you suggest?, , Anastasia, August 19, 2019 at 4:00 pm, - Reply, Do you mean on top of the stove in skillet or similar? Grill pan means something different in England., If that’s what you mean then just do them until they are tanned then turn over and repeat. I would do on a medium to high temperature. Not sure if that helps 😉 Not 100% sure what you are asking though (language barrier haha – we will get there)., , Supriya, November 3, 2019 at 12:14 pm, - Reply, Followed the recipe exactly and they turned out amazing!!! Thank you for sharing., , G Raff, April 18, 2020 at 11:47 pm, - Reply, Hi, does anyone have any recommendations about freezing these after cooking?, , Sarah, June 9, 2020 at 5:28 pm, - Reply, Would the baking time be the same for grilling? 8 minutes each side?, , Anastasia, June 9, 2020 at 5:36 pm, - Reply, It depends on the oven and temperature… but a little bit longer (perhaps 20 to 25 mins in total) with no turning required., , Von, October 23, 2020 at 8:41 am, - Reply, Should the beets be peeled?, , Anastasia, October 26, 2020 at 8:54 am, - Reply, Not usually. Just cleaned of earth. If the skin has any really gnarly bits, then peel that off, other wise skin is fine to leave on., Enjoy!, , Rosemary, January 22, 2025 at 10:41 am, - Reply, Can I use drained canned chickpeas?, , Anastasia, February 3, 2025 at 2:16 pm, - Reply, yes absolutely, Leave A Comment, Cancel reply, Comment, , , Save my name, email, and website in this browser for the next time I comment., , , Δ, This site uses Akismet to reduce spam., Learn how your comment data is processed., Get signed copies of my books here…, , , , Close product quick view, ×, Title, Privacy Policy, Copyright 2025 Anastasia Eden | All Rights Reserved, Facebook, YouTube, Instagram, Pinterest, , Page load link, , Skip to Recipe, , , , , , 960, , , , , , , , , , , 6564, , , 7524, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: after reading the ingredient list on a falafel packet (essentially chickpeas, garlic, salt, ground coriander, and cumin). I experimented with different ratios and at one point even tried chickpea flour (gram flour) until I found balances and blends that inspired me., In my recipe here, it is the moisture of the chickpeas that holds everything together. It wasn’t long before I could resist playing with different spices, herbs, Ahead of time: Slice the rough neck/top off the beetroots and discard. Chop the remaining beetroot into cubes (1.5cm/half an inch cubed in size). Bake in the oven on a baking tray for about 45 minutes on a high heat. When done, take out and leave to cool until you are ready to make the falafels. This can be done ahead of time, or the night before when you are using the oven for something else., When beetroot is ready...",
        "Eggplant Fries with Fixate Tzatziki Sauce": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., FIXATE TZATZIKI SAUCE, SERVES: 8 (approx. 3 Tbsp. each)  Prep Time: 10 min.  Cooking Time: None, CONTAINER EQUIVALENTS: Free  (¾ cup equal to, ½), 1 cup, reduced-fat (2%) plain, Greek yogurt, 1 Tbsp., fresh lemon juice, 1 tsp., finely grated lemon peel (lemon, zest), 1 clove, garlic, ½ tsp., sea salt (or Himalayan salt), ½ cup, coarsely chopped seeded cucumber, (approx. 1⁄3 medium), 2 tsp., fresh dill, 2 tsp., fresh mint leaves, ¼ tsp., ground black pepper, 1. \t Place yogurt, lemon juice, lemon peel, garlic, salt, cucumber, dill, mint, , and pepper in food processor; process until smooth., RECIPE NOTE:, •\t Refrigerate leftover tzatziki sauce in an airtight container for up to 4, to 5 days., NUTRITIONAL INFORMATION (per serving): Calories: 24  Total Fat: 1 g  Saturated Fat: 0 g   Cholesterol: 1 mg  Sodium: 152 mg  Carbohydrates: 2 g  Fiber: 0 g, Sugars: 1 g  Protein: 3 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Spinach Pinwheels cream cheese": "Ingredients: 1x, 2x, 3x, ▢, 2, , vegan puff pastry sheets, , , thawed, ▢, 5 to 6, , oz, , baby spinach or chopped spinach, , , , thawed if frozen, ▢, 8, , oz, , plain vegan cream cheese, , , , I use kite hill., ▢, 1/2, , tsp, , dried parsley, ▢, 1/4, , tsp, , dried thyme, ▢, 1/4, , tsp, , dried taragon, ▢, 1/2, , tsp, , dried dill, ▢, 1, , tsp, , onion flakes, ▢, 3/4, , tsp, , garlic powder, ▢, 1/3, , tsp, , salt, , , depends on the saltyness of the cream cheese, ▢, a dash of cinnamon and nutmeg, , Cook Mode, Prevent your screen from going dark,  Instructions: Thaw the puff pastry if you havent already. Leave it on the counter till soft enough to handle., Add fresh spinach to a bowl. Pour boiling water and let sit for 3 minutes, then drain and use. If using frozen, thaw, squeeze excess moisture and use., Add the drained spinach to a bowl. Add cream cheese* (see note to make your own), herbs and spices. Mix well, taste and adjust flavor., Place the 1 puff pastry sheet on the other and roll it out to a 12 by 14-16 inch rectangle. Spread the spinach mixture on rolled puff pastry evenly. Roll the puff pastry to make a roll. This roll will be soft at this point. Refrigerate or freeze to harden, about 1 hour. (at this point you can leave the roll refrigerated for upto a day, then slice and bake when needed), Slice with a sharp knife or a serrated knife into 1/2 inch or less thickness. Place on parchment lined baking sheet and bake at 400 deg F for 25 to 30 mins or until golden. Cool for a few minutes before serving., Store on the counter for the day and refrigerated for upto 3 days., , , Notes, To make this gluten-free,, use gluten-free tortillas, spread the spinach mixture, chill and slice. Brush with oil and bake for 10- 15 mins., , Make ahead, : Freeze the sealed roll log in an airtight container or slice the log and freeze unbaked slices for upto 3 months. Bake when needed., , Flavor variations: add chopped sundried tomato or chopped pickled jalapeño., , Make this with Cashew Cream Cheese*:, If you dont have vegan cream cheese, use 1 cup thick cashew cream (1 cup soaked cashews blended with 1/2 cup water), add 1 tbsp refined coconut oil, a tsp of lemon juice 1 tsp vinegar, mix in and use. The cashew cream cheese will be softer, so hill the log for longer to slice well., , , , Nutrition is 1 of 6 serves (2 rolls per serving), , Nutrition, Calories:, 510, kcal, , , Carbohydrates:, 39, g, , , Protein:, 9, g, , , Fat:, 39, g, , , Saturated Fat:, 7, g, , , Sodium:, 462, mg, , , Potassium:, 221, mg, , , Fiber:, 4, g, , , Sugar:, 2, g, , , Vitamin A:, 2660, IU, , , Vitamin C:, 8.6, mg, , , Calcium:, 63, mg, , , Iron:, 3.4, mg, Nutrition information is automatically calculated, so should only be used as an approximation., , , , , , , , , Did you make this recipe? Rate and comment below!, , , Share:, Pin, Facebook, Tweet, Yummly, Email, , About Richa, Hi, I'm Richa! I create flavorful plant based recipes that are inspired by my Indian upbringing, including many gluten-free, soy-free, and oil-free options., , Read More, , , , , , , You May Also Like, , Gameday Recipes, GO, Gluten Free Option, Vegan Mozzarella Sticks with Cashew Mozzarella – Baked or Fried, Gameday Recipes, GO, Gluten Free Option, NO, Nut-Free Option, SO, Soy Free Option, Cheesy Pull-Apart Mushroom Sliders, South Indian curries, GF, Gluten Free, NF, Nut-Free, SO, Soy Free Option, Tofu Kondattam (South Indian Spicy Crispy Tofu), Holiday Recipes, GO, Gluten Free Option, NO, Nut-Free Option, SO, Soy Free Option, Creamy Mushroom Puffs, , , , 4.95 from 20 votes (, 4 ratings without comment, ), , , , Leave a comment, Cancel reply, If you Love the Recipe, Please consider rating it using stars in comments! It helps readers and helps more people find the recipe online and I love hearing from you all!, Your email address will not be published. Required fields are marked *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 66 Comments, , , , , , Carol, , says:, , , , December 16, 2024 at 7:39 am, , , , , Just made these, but they were raw in the middle after baking for the allotted time… :/ The edges were starting to brown, so not sure if more baking time would have burnt them. Is there anything I did wrong?, , , Reply, , , , , , , , Richa, , says:, , , , December 16, 2024 at 8:06 am, , , , , Might be how the oven is heating or if the pinwheels are too big then they need longer bake time . Cover them lightly with parchment and continue baking. This will reduce the browning of the edges and allow for the center to cook., , , Reply, , , , , , , , , , Carol L Mauch, , says:, , , , December 19, 2023 at 5:25 pm, , , , , Making food for a Vegan coworker for a potluck and find it a challenge worthy to take on with no other people in the group vegan, but want them to love it just as much.  Also for me no dairy, also noticed the GF option.  Happy I tried this.  My husband liked it, and he isn’t a spinach fan.  They didn’t have the vegan cream cheese you mentioned so I had to go with another brand.  it ran a little and stuck to the parchment.  I will lightly spray the parchment next time when I make it for Christmas day., , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , December 20, 2023 at 7:13 am, , , , , Yay, happy it worked out!, , , Reply, , , , , , , , , , Kris, , says:, , , , October 9, 2023 at 9:06 am, , , , , Ooh!  This would be great with Vegan Feta instead of cream cheese! Easy Spanakopita., , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , October 13, 2023 at 7:46 am, , , , , smart!, , , Reply, , , , , , , , , , Janey, , says:, , , , February 23, 2023 at 12:43 pm, , , , , Love them, Yummy spices and.crusty yummy pastry roll, , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , April 3, 2023 at 8:44 pm, , , , , thank you!, , , Reply, , , , , , , , , , Kat, , says:, , , , February 20, 2023 at 9:56 am, , , , , These were delicious and so easy. My omni friends loved them and wanted the recipe. I added a sprinkle of red pepper flakes to the filling. Definitely going to make them again!, , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , April 3, 2023 at 8:40 pm, , , , , yay!, , , Reply, , , , , , Comment navigation, Older Comments, , , , Hi, I'm Richa!, , I create flavorful plant based recipes that are inspired by my Indian upbringing, including many gluten-free, soy-free, and oil-free options., , , , more about me, , , , , , , , , , , Amazon, //, Barnes & Noble, //, BAM!, //, Chapter Indigo, //, International, , , Amazon, //, Barnes & Noble, //, BAM!, //, Chapter Indigo, //, International, , , Amazon, //, Barnes & Noble, //, BAM!, //, IndieBound, //, International, , , As Seen In, Back to top, Vegan Richa, , , , , Home, , Recipes, , Subscribe, , CookBooks, , Shop, , About, , ©2025 Vegan Richa. All rights reserved., , Privacy Policy, •, Terms, •, Copyright And Disclaimers, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Vegan Spanakopita": "Ingredients: but a few brands are accidentally vegan because they use oil instead of butter. I really like the Fillo Factory frozen dough (However, always read the label first, , & Substitutions, , Yellow Onion, - Any onion or shallots can be used., Garlic, - If you don't have fresh garlic, you can sub 1 tsp garlic powder., Lemon, Nutmeg, Pepper, Frozen Chopped Spinach, - You can use fresh, but I found it easier to use frozen because it's already chopped and all you have to do is thaw it and drain it. If you use fresh, you'll need about 2 ½ lbs. Thinly sliced and massaged kale can also be used., Parsley, , Vegan Ricotta, - Instead of vegan ricotta, you could use vegan feta (I love Violife feta) or make homemade vegan tofu feta. In a pinch, I've even used Kite Hill plain vegan cream cheese, which was delicious! Not as tangy as the ricotta, but it was still very creamy., Filo Dough, - If you can't find vegan filo dough, you can use vegan puff pastry instead., Olive Oil, - Any neutral oil will work. I have also made it with avocado oil and it turned out great., , , How to Make, Vegan Spanakopita, , First, saute the diced onion in a large pan until it's soft and translucent. Add the minced garlic and let it cook until fragrant, (Photo 1), . While the onions and garlic are cooking, put the thawed spinach in a piece of cheesecloth or a thin lint-free towel, twist it into a ball to seal the top, and squeeze firmly to drain any remaining water. You should end up with a softball-sized ball of dry greens, (Photo 2), ., , , Combine the cooked onions and garlic, spinach, fresh parsley, vegan ricotta, lemon zest, nutmeg, (Photos 3 & 4), . Lay the thawed dough in between two lightly damp towels so it doesn't dry out while you're assembling the vegan spanakopita, (Photo 5), ., , , In a 9x13 casserole dish, brush the bottom with olive oil and then line it with 12 sheets of filo, brushing every other layer lightly with olive oil, (Photo 6), . The edges will hang over the dish, that's ok because you will fold them in later. Add the filling to the casserole dish and gently spread it out in one even layer, (Photo 7), ., , Top the filling with 5 sheets (brushing every other layer with oil), fold in the edges, lay the last piece on top, and tuck the edges in. Generously brush the top layer with oil, score the spanakopita into 12 pieces (only cut through the top layers), (Photo 8), , and then bake the spanakopita until the top is lightly browned and crispy., , , Serving Suggestions, , This vegan spanakopita makes a beautiful and impressive main course. Any of the following side dishes would be delicious to serve with it:, , Lemon Tahini Courgette Salad, Arugula, Avocado Tomato Salad, Pomegranate Wild Rice Salad, Salad with, Vegan Ranch Dressing, , How to Reheat It, , Store leftovers in the fridge for 1-2 days. After that, it may start to get a little soggy., , From the Fridge:, You can warm individual portions in the microwave but it won't make the topping crispy. The best way to reheat the vegan spanakopita so it gets a crispy crust is to put it in an oven-safe dish, cover it with a piece of parchment paper to protect it from burning, and bake it for 12-15 minutes at 350 degrees or until it's warmed through (depending on how big the slice is). Take the parchment paper off for the last minute., , From the Freezer:, Bake it uncovered at 350 degrees for 60-70 minutes or until it's warmed through. If the top starts to get too dark, cover it with parchment paper to protect it., , , Recipe Variation, , you can make vegan spanakopita triangles. To do this, cut the sheets of filo into 3-inch x 10-inch strips. Work with one piece at a time and cover the remaining pieces with plastic wrap and a damp cloth so it doesn't dry out., , Brush the strip lightly with oil and then put a generous spoonful of the filling in the bottom of the strip. Fold it up into a triangle shape and keep folding until you use the whole strip. Repeat until you run out of filling. Arrange the triangles on a parchment-lined baking tray and lightly brush each triangle with oil. Bake at 375 degrees for 25-30 minutes or until they're golden and crispy., , , Frequently Asked Questions, , Can I make it the day before?, , ▢, 2, , lbs, , frozen chopped spinach, ▢, 1, , large, , yellow onion, , diced, ▢, 3, , medium, , garlic cloves, , minced, ▢, 1, , bunch, , fresh flat leaf parsley, , roughly chopped (mostly leaves, but small stems are ok if finely chopped), ▢, 16, , oz, , vegan ricotta, , (I used (2) 8 oz packages Kite Hill almond ricotta), ▢, 1, , tsp, , lemon zest, ▢, ¼, , tsp, , ground nutmeg, ▢, ¼, , tsp, , black pepper, ▢, ¼, , cup, , extra virgin olive oil, ▢, 1, , lb, , vegan filo dough, , thawed (I used an 18-sheet package of Fillo Factory filo dough), , Take the thawed filo dough out of the package and lay it between two slightly damp dish towels so they don't dry out. Don't open the package and expose the sheets to air until you're ready to assemble the pie., Lightly brush the bottom of a, large casserole dish with olive oil and then add 12 layers of filo dough, lightly brushing every other layer with olive oil. It's ok if the filo hangs over the edges of the casserole dish because you're going to fold them in later., Add the spinach filling and use a spatula to smooth it out evenly. Top with the remaining pieces of filo dough (brushing every other layer with oil), but reserve 1 full sheet for the top. Fold in (or trim off) all of the edges that are hanging over and then brush the corners generously with olive oil so they will get crispy. Lay the last piece of filo on top to cover the sloppy edges you just folded in and tuck the edges in., Score the pie (only cut through the top layers of filo) into 12 pieces. It's much easier to cut it now before it's crispy. Bake for 45-50 minutes or until the top layer is lightly brown and crispy. Let it rest for a few minutes before removing slices from the pan., , Notes, , Store any leftover spanakopita in an airtight container in the fridge and it will stay fresh for 2-3 days. After that, it may start to get a little soggy., , , Nutrition, Serving:, 1, piece, |, Calories:, 240, kcal, |, Carbohydrates:, 27, g, |, Protein:, 10, g, |, Fat:, 11, g, |, Saturated Fat:, 3, g, |, Cholesterol:, 13, mg, |, Sodium:, 293, mg, |, Potassium:, 388, mg, |, Fiber:, 3, g, |, Sugar:, 1, g, |, Vitamin A:, 9422, IU, |, Vitamin C:, 12, mg, |, Calcium:, 224, mg, |, Iron:, 3, mg, , , Tried this recipe?, Please rate it and leave a comment below if you have any feedback! If you post a picture on Instagram, please tag, @Stacey_Homemaker, and use the hashtag, #StaceyHomemaker, so I can see your delicious creation!, , , *This recipe was originally shared on 4/18/18, but I updated it on 9/5/20., , , More Vegan Entrees, Pumpkin Sweet Potato Soup (Dairy-Free), Vegan Sausage and Peppers with Rice, High-Protein Vegan Burrito, Pesto Quinoa Stuffed Tomatoes, Reader Interactions, Comments, , , , , , Sabrina Calzada, , , April 12, 2023 at 1:24 am, , , , Great recipe !  This was the first time I worked with Phyllo dough- a little tricky Instructions: , , Is it better to freeze spanakopita cooked or uncooked?, , It's better to freeze the spanakopita uncooked. Store it in an airtight container in the freezer for 1-2 months., , , The filo is too dry and crumbly! How do I fix it?, , If the sheets have been exposed to the air for too long, they may dry out and tear when picked up. If this happens, try to patch the pieces together in the bottom of the casserole because nobody will see it. Instead of trying to piece the topping together, you can crumple each piece (like you would crumple a piece of paper) and put it on top of the pie filling. Make sure generously brush all the nooks and crannies and tips of the dough with olive oil before baking., , , Do I have to use oil?, , Oil is necessary to use to make the dough crispy. However, if you're oil-free, you can use aquafaba as a substitute, but it won't create the same dark color and crispiness as oil does., , , , Success Tips, , Take the frozen spinach and dough out of the freezer and put it in the fridge to thaw for 24 hours. Move the dough to the counter 1-2 hours before you're making the spanakopita so the dough will be at room temperature, soft, and pliable when you're ready to use it., It's very important to drain the spinach extremely well because you don't want the pie to be soggy from excess liquid. If it still has ice crystals when you take it out of the fridge, warm it in a pan to melt the ice before you strain it., When you're assembling the vegan spanakopita, keep the layers of thawed filo in between two slightly damp dish towels so it won't dry out. Don't open the sealed bag that the dough sheets are in until right before you're ready to assemble the pie., Don't worry if the filo tears when you pick it up. Just put it in the casserole dish and match it up the best you can with the other pieces. Brush it with a little bit of olive oil and nobody will be able to tell once it has been baked., , , Want More Vegan Main Course Recipes?, , Vegan Creamy Stuffed Shells, Vegan Chickpea Curry, Vegan Mushroom Stroganoff, Vegan Beef Stew, , , , , Semi-Homemade Vegan Spanakopita, , , This vegan spanakopita is easy to make with a couple of store-bought shortcuts to save you time, but no one will ever know that it's not 100% homemade! Filled with an extremely flavorful mixture of spinach, fresh parsley, garlic, onions, and almond ricotta sandwiched between crispy layers of filo dough, this spinach pie is simply spectacular!, , , 4.60, from, 15, votes, , , Print, , Pin, , Rate, , , Course:, Dinner, Cuisine:, American, , Prep Time:, 30, minutes, , minutes, Cook Time:, 50, minutes, , minutes, Total Time:, 1, hour, , hour, , 20, minutes, , minutes, , Servings:, 12, , servings, , Calories:, 240, kcal, , Author:, Stacey Eckert, , , Equipment, Large Pan, Cheesecloth, Large Mixing Bowl, (2) Hand Towels, 9-inch x 13-inch Casserole Dish, , Take the frozen filo and spinach out of the freezer and put it in the fridge to defrost for 24 hours. If you forget to do this the day before, you can warm the frozen spinach in a pan on the stove (right before you make the dish) until it's fully thawed., Preheat the oven to 350 degrees., In a large pan, saute the diced onion until soft and translucent. Add the minced garlic cloves and let it cook for 1 minute. It will smell very fragrant., While the onions are cooking, drain the spinach. Put the thawed spinach into a piece of cheesecloth or a thin dish towel, twist it into a ball to seal, and squeeze any remaining water out. You want the spinach to be as dry as possible., In a large mixing bowl, add the cooked onions and garlic, drained spinach, almond ricotta, lemon zest, chopped parsley, nutmeg, and we all enjoyed it on Easter, even the non-vegans. 🙂, , , Reply, , , , , , , , Nancy Andres, , , November 19, 2020 at 3:57 pm, , , , Thanks Stacey for sharing this wonderful recipe and participating in my recipe roundup, \"Guilt-free Vegan Holiday Food to Savor\" at Colors 4 Health. Your recipe is tops!, , , Reply, , , , , , , , Christy Eckert, , , September 07, 2020 at 12:58 pm, , , , We were SO fortunate to be given a few treasured pieces of this superb Spinach Pie to taste. It is ABSOLUTELY DELICIOUS and MELTED in our mouths! The dairy free ricotta cheese is VERY creamy and the superb flavors of onions and garlic blend SO nicely complimenting the spinach perfectly. I loved how the philo dough got VERY  crispy fresh out of the oven too. My husband and I actually fought over who was going to get a second piece, and he even offered to do the dishes if I would give up MY piece! (I refused--so I am STILL  doing the dishes! Ha!)  Your recipe is SO DELECTABLE. I can't wait to make it myself!, , , Reply, , , , , , , , Stella, , , August 11, 2020 at 10:38 am, , , , Hi Stacey, Have you ever frozen this recipe before baking???, Thank you!!!!, , , Reply, , , , , , , , Stacey Homemaker, , , August 13, 2020 at 10:03 am, , , , Hi, Stella! No, I haven't frozen it before baking, but I don't see why you couldn't do so!, , , Reply, , , , , , , , Stella, , , October 02, 2020 at 4:36 pm, , , , I finally made the spanakopita!!!, I froze before baking as my mom used too, perfect!, Now....the texture, perfect! But  I found it a bit tart, lemony.. is that from the lemon zest??? If you think so I would leave out next time... otherwise good.., , , , , , , , , Stacey Homemaker, , , October 03, 2020 at 10:18 pm, , , , I'm so glad you liked it! The filling shouldn't taste overly tart, the lemon zest just brightens the flavor a bit. Next time you can definitely leave out the zest if you prefer or you could use half the amount and taste it before you add the rest. Thank you for the feedback!, , , , , , , , , , , , , Kristen Repp, , , February 03, 2020 at 3:22 pm, , , , Hi there, have you made this with fresh spinach before? If so how much would I use? Thanks so much! =), , , Reply, , , , , , , , Stacey Homemaker, , , February 16, 2020 at 11:22 pm, , , , Hello! I haven't used fresh spinach, I've only made it with frozen. If you try it, please let me know how it worked out for you!, , , Reply, , , , , , , , , , tiffany, , , December 19, 2019 at 1:54 am, , , , So delicious! How is this after being refridgerated? Is it ok to heat it up in the microwave?, , , Reply, , , , , , , , Stacey Homemaker, , , December 19, 2019 at 8:38 pm, , , , Thank you, Tiffany! I'm so happy you enjoyed it! You can definitely heat it up in the microwave but I usually heat it in the oven so the filo gets crispy again. If you reheat it in the oven, make sure to cover it with parchment paper so the top layer doesn't burn., , , Reply, , , , , , , , , , Joyce, , , April 19, 2018 at 8:33 am, , , , I can not wait to make this!!, , , Reply, , , , , , , , Stacey Homemaker, , , April 21, 2018 at 1:30 pm, , , , I hope you enjoy it as much as we do, Joyce! Please let me know what you think of it =), , , Reply, , , , , , , , , , Elizabeth, , , April 18, 2018 at 7:44 pm, , , , Stacey, you are just a beautiful person, inside and out. I am so very incredibly sorry about your aunty! How sad. I am just thankful that you were close to her, and have no regrets! My question for you today is---do you k now if there is any fillo dough is gluten free? Joy, , , Reply, , , , , , , , Stacey Homemaker, , , April 21, 2018 at 1:32 pm, , , , Hi, Joy! Thank you much for the sweet comment, I really appreciate it. <3, , Unfortunately, I haven't found a gluten-free fillo dough yet but I'll look for one and update the post if I find one!, , , Reply, , , , , , , , Patricia Fleetwood, , , April 08, 2020 at 8:24 am, , , , Please do let us know if there’s a gluten free alternative!, , , , , , , , , Stacey Homemaker, , , April 08, 2020 at 8:52 am, , , , I'm sorry, I haven't found one yet!, , , , , , , , , , , , 4.60 from 15 votes (, 12 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , Primary Sidebar, Search, , Hi, I'm Stacey! I veganize your favorite classic recipes and transform them into irresistible meals that are made entirely from plants!, Want to know more? →, , , Fall Recipes!, , Slow Cooker Vegan Split Pea Soup, High-Protein Vegan Burrito, Chickpea and Mushroom Curry (Without Coconut Milk), Pumpkin Sweet Potato Soup (Dairy-Free), Vegan Sweet Potato Peanut Noodles, Vegan Scalloped Potatoes Florentine, , , , , , , , , , Footer, , ↑ back to top, , , , About, , Privacy Policy, Disclaimer, Terms & Conditions, Accessibility Policy, , , , Copyright © 2023, Stacey Homemaker, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,"
    }
}