{
    "ingredients": {
        "Vegetarian Paella": "yellow onion, red bell pepper, crimini mushrooms, garlic, dry white wine, white rice, chickpeas, tomatoes, veg broth, green peas, green olives",
        "Vegetable Paella": "veg broth, onion,red bell pepper,tomato,garlic,bomba rice,thyme,peas"
    },
    "recipe_url": {
        "Vegetarian Paella": "https://dishingouthealth.com/vegetarian-paella-recipe/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=998952136_45136794_513478",
        "Vegetable Paella": "https://veganhuggs.com/vegetable-paella-recipe/"
    },
    "Recipe": {
        "Vegetarian Paella": "Ingredients: , Slow Cooker/Instant Pot, , Soups and Stews, , Dressings & Sauces, , Dessert & Baked Goods, , , , By Diet, , , Dairy-Free, , Gluten-Free, , Low Carb, , Nut-Free, , Vegan, , Vegetarian, , , , Recipe Index, , , , 30 Minutes, , About, , Contact, , Search, , , Home, , //, , Recipe Index, , //, , Dinner, Vegetarian Paella, By, Jamie Vespa, on  Feb 17, 2020 Updated May 23, 2022, 4.87, from, 30, votes, Jump to Recipe, Save to Favorites, Pin, Print, This post may contain affiliate links. Please read our, disclosure policy, ., , , This recipe post is sponsored by The USA Rice Federation. I was compensated for my time, however all opinions are my own., , Why You’ll Love this Vegetarian Paella, , Paella is a dish I love to order while dining out with friends and family. Its humble origins and one-pot appeal have a way of bringing people together, regardless of how intimate the setting is. So with its crowd-pleasing appeal and unique simplicity, it begs the question:, Why not just cook it at home?, , This vegetable paella is chockfull of authentic flavor, so don’t fret over the ingredient list. (You may even have a fair amount of them already in your refrigerator or pantry.), , And although it, comes together in under one hour, , the rich layers of flavor will make you believe it’s far more involved., , So break out the red wine and let’s bring the flavors of the Mediterranean into our home kitchen!, , , The beauty of paella is that it’s a blank canvas for you to add any combination of vegetables you like. While many classic paella recipes include a mix of prawns, clams, and chorizo, this veggie version packs enough smoky depth and texture to satisfy any omnivore., , I do, however, suggest trying to make the most of what’s in season. By choosing local, seasonal veggies, you’ll get the best flavor plus peak nutrition, which is a, double-win, . Therefore, the below recommendations are simply an outline for you to interchange as you see fit., , , Aromatics, . A key attribute of paella, aromatics are what build the foundation of flavor, lending aroma and dimension. I suggest using yellow onion and garlic, at minimum. Other optional add-ins include chopped carrots and celery., , Fresh veggies, . I love a mix of mushrooms, green beans, and bell peppers for vegetarian paella. If making during summer months, feel free to add chopped zucchini or yellow squash, too., , Frozen veggies, . Green peas are a staple in paella, however they’re only in season during spring months. For this reason, I lean on frozen green peas to add a pop of vegetal sweetness., , Canned tomatoes, . I prefer fire-roasted tomatoes, which add a smoky backbone to the dish. You can also use plain diced tomatoes, or diced tomatoes with basil., , Spices, . The quintessential spice is paella is saffron, which grows primarily in Iran, Greece, Morocco, and India. Although pricey, a little saffron goes a LONG away because of how intrinsically fragrant it is. You can find saffron at most specialty grocery stores like, Whole Foods, , which is where I typically purchase it. However, if you’d rather not purchase one extra spice, feel free to use ground turmeric instead., , Fresh herbs, . Classic herbs include flat-leaf parsley and scallions, which are fantastic compliments to the spices., , , , How to Make Vegetarian Paella, , The process of making paella is pretty seamless, yet the rewards are huge. To get ahead, you can slice and dice the veggies in advance, and thaw the green peas. From there, this whole dish comes together in under one hour, making it a total weeknight win., , , Start by heating a good glug of olive oil in a 12-inch ovenproof skillet or, paella pan, over medium-high. Cook your aromatics, bell pepper, and mushrooms until soft. Next, add the garlic and spices and cook until fragrant., , Deglaze the pan with white wine and simmer until mostly reduced. (I typically use Sauvignon Blanc or Pinot Grigio.), , Stir in the rice and cook until slightly translucent, about 2 minutes. Add the broth, tomatoes, chickpeas, and green peas, and bring the mixture to a low boil., , Next, reduce the heat to low, cover the pan and cook the paella for about 25 minutes, until the rice is tender., , Lastly, prepare the parsley oil by mixing the parsley, lemon zest and juice, and olive oil. Once the vegetable paella is cooked, scatter the parsley oil overtop and serve!, , , , , What is the Best Rice for Paella?, , Traditionally, paella may be made with Bomba rice, which is a short-grain, starchy white rice primarily cultivated in eastern Spain. Personally, however, I choose a U.S.-grown short-grain white rice due to its high quality and ability to find., , What is Short Grain Rice?, , U.S. short grain rice is softer and stickier than other varieties once cooked. It also has a slight springiness to the bite, making it a great choice for dishes like paella and risotto where rice is the key component. Some varieties include Arborio, Calmochi, and Koshihikari., , All U.S.-grown rice is gluten-free and the least allergenic of all grains. It’s also rich in nutrients, contributing more than 15 vitamins and minerals, including folate and other B-vitamins, as well as iron. And because of rice’s slow-digesting complex carbohydrates, it will help keep you satiated and well fueled., , Is Vegetable Paella Healthy?, , This dish is brimming with antioxidants, plant-based protein, and dietary fiber. In fact, one serving delivers almost 25% of your daily fiber goal. And while it’s plenty satiating from the rice, chickpeas, and veggies, if you’re craving an extra dose of protein, feel free to add meat or fish. For example, grilled shrimp, clams, or sautéed chorizo., , Give this homemade paella recipe a try this week for a guaranteed family favorite. And be sure to snap a pic and tag #dishingouthealth on Instagram so I can see your beautiful creations. Also, follow along on, Facebook, and, Pinterest, for the latest recipe updates!, , More Vegetarian Rice Recipes, , One Pan Wild Rice and Cheesy Broccoli Casserole, , 30 Minute Broccoli Fried Rice, , Kimchi Fried Rice with Sesame Tempeh, , , , , , Save, Saved, , Pin, , Print, , , , , 4.87, from, 30, votes, , Vegetarian Paella, , By, Jamie Vespa MS, RD, , , Prep Time:, 10, minutes, , minutes, Cook Time:, 45, minutes, , minutes, Total Time:, 55, minutes, , minutes, Servings:, 6, , , , , 1x, 2x, 3x, ▢, 1/4, , cup, , plus 2 Tbsp. extra-virgin olive oil, divided, ▢, 1, , yellow onion, finely chopped, ▢, 1, , red bell pepper, thinly sliced, ▢, 8, , oz., , cremini mushrooms, sliced, ▢, 3, , garlic cloves, minced, ▢, 1 1/2, , tsp., , paprika, ▢, 1, , tsp., , saffron threads, ▢, 1, , tsp., , kosher salt, ▢, 1/2, , tsp., , black pepper, ▢, 1, , cup, , dry white wine, ▢, 1 1/2, , cups, , dry U.S.-grown short-grain white rice, ▢, 1, , (15-oz.), , can chickpeas, rinsed and drained, ▢, 1, , (15-oz.), , can diced fire-roasted tomatoes, ▢, 2 1/2, , cups, , vegetable broth, ▢, 1/2, , cup, , frozen green peas, thawed, ▢, 1/4, , cup, , finely chopped fresh parsley, ▢, Zest and juice of 1 lemon, ▢, 1/3, , cup, , sliced green olives, optional, , (I use Castelvetrano olives), , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save, ,  Instructions: Heat 1/4 cup oil in a large high-sided skillet with a fitted lid over medium-high. Add onion, bell pepper, and mushrooms; cook 7 to 8 minutes, until softened. Add garlic, paprika, saffron, salt, and pepper; cook 2 minutes, until fragrant., Add wine and cook 2 to 3 minutes, until mostly reduced. Stir in rice; cook 2 to 3 minutes, until rice begins to turn translucent. Stir in chickpeas, tomatoes, broth, and green peas. Bring to a low boil, reduce heat, cover, and cook 25 minutes., Meanwhile, combine parsley, lemon zest and juice, and remaining 2 Tbsp. oil in a small bowl. Once rice is cooked, remove lid and cook 5 more minutes. Scatter parsley oil overtop, and garnish with olives, if desired., , Video, , Notes, Store in an airtight container and refrigerate up to 4 days., , Nutrition, Calories:, 427, kcal, |, Carbohydrates:, 61, g, |, Protein:, 9, g, |, Fat:, 12, g, |, Saturated Fat:, 2, g, |, Sodium:, 690, mg, |, Fiber:, 6, g, |, Sugar:, 9, g, I calculate these values by hand to ensure accuracy, however expect up to a 10% variable depending on food brands., , , , If you love this recipe, please leave a star rating and review below!, , , , Pin, 14K, Share, 14K, Shares, , You May Also Like, , GF, Gluten-Free, Roasted Artichoke Salad, DF, Dairy-Free, NF, Nut-Free, Salmon Niçoise Smashed Potato Salad, GF, Gluten-Free, Sumac Salmon with Golden Rice, GF, Gluten-Free, NF, Nut-Free, Peperoncino-Feta Turkey Meatballs, , , , 4.87 from 30 votes (, 14 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , 39 Comments, , , , , , Mabel, , says:, , , , March 10, 2025 at 1:13 am, , , , , This is a wonderful and easy paella – so much flavor with the loveliest lemon-oil dressing to cool and compliment the spice. Happy to find a vegan version that is made from real food. Thank you for an amazing recipe!, , , Reply, , , , , , , , Mabel Sanqui, , says:, , , , March 10, 2025 at 1:13 am, , , , , This is a wonderful and easy paella – so much flavor with the loveliest lemon-oil dressing to cool and compliment the spice. Happy to find a vegan version that is made from real food. Thank you for an amazing recipe!, , , Reply, , , , , , , , Norma, , says:, , , , August 19, 2024 at 8:35 pm, , , , , This dish is literally amazing. Making it for the second time because how good it was the first time. I couldn’t stop eating it. The dish is so whole. And it’s vegetarian?? So good., , , Reply, , , , , , , , Norma, , says:, , , , August 19, 2024 at 8:47 pm, , , , , Used oyster mushrooms instead Of Cremini and diced the bell pepper instead of slicing it, , , Reply, , , , , , Comment navigation, Older Comments, , , , About Jamie, , I'm Jamie; Registered Dietitian, former magazine editor and current food journalist and recipe developer serving up delicious, nutritious recipes., , , More about me, , , , , , , , , , Easter Recipes, , VG, Vegetarian, GF, Gluten-Free, LC, Low Carb, Asparagus and Feta Salad, VG, Vegetarian, NF, Nut-Free, Asparagus and Avocado Salad, GF, Gluten-Free, DF, Dairy-Free, LC, Low Carb, Almond Flour Carrot Cake Scones, VG, Vegetarian, GF, Gluten-Free, NF, Nut-Free, LC, Low Carb, Strawberry Cobb Salad with Fried Feta and Tarragon Dressing, DF, Dairy-Free, NF, Nut-Free, Strawberry-Lemon Cardamom Brunch Cake, V, Vegan, VG, Vegetarian, GF, Gluten-Free, DF, Dairy-Free, Coriander Roasted Carrots with Parsley and Pistachios, , , Currently Trending, , V, Vegan, VG, Vegetarian, GF, Gluten-Free, DF, Dairy-Free, NF, Nut-Free, Spanish Rice and Beans (One Pot), VG, Vegetarian, GF, Gluten-Free, NF, Nut-Free, Nourishing White Bean and Lemon Soup, VG, Vegetarian, NF, Nut-Free, Wild Rice and Mushroom Soup, VG, Vegetarian, DF, Dairy-Free, NF, Nut-Free, Lemony Greek Chickpea Soup, V, Vegan, VG, Vegetarian, GF, Gluten-Free, DF, Dairy-Free, NF, Nut-Free, Quinoa Power Bowls with Maple Chipotle Brussels and Smoky Butternut Squash, V, Vegan, VG, Vegetarian, GF, Gluten-Free, DF, Dairy-Free, NF, Nut-Free, Roasted Veggie Glow Bowls, Dishing Out Health, , , , , Recipes, , 30 Minutes, , About, , Contact, , Newsletter, , ©2025 Dishing Out Health. All rights reserved., , Privacy Policy, •, Accessibility Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , ,",
        "Vegetable Paella": "Ingredients: US Customary, Metric, ▢, 3, , tablespoons, , olive oil, , , divided, ▢, 4, , cups, , vegetable broth, , , low sodium, ▢, 1, , teaspoon, , saffron threads, ▢, 1, , medium, , onion, , , diced, ▢, 1, , red bell pepper, , , cut into strips, ▢, 5, , cloves, , garlic, , , chopped, minced or crushed, ▢, 1, , large, , tomato, , , diced (sub ½ cup canned), ▢, 1 ½, , cups, , Bomba Rice, , (sub arborio rice), ▢, 1, , teaspoon, , smoked paprika, ▢, ½, , teaspoon, , sweet paprika, ▢, 1, , teaspoon, , sea salt, , , more to taste, ▢, Fresh cracked pepper, , , to taste, ▢, 2, , sprigs, , fresh thyme, , (sub 1 teaspoon dried), ▢, ¾, , cup, , frozen peas, , , thawed, Garnish (Optional), ▢, Lemon wedges, ▢, Fresh-cut parsley, , Cook Mode, Prevent your screen from going dark,  Instructions: Add vegetable broth in a medium saucepan over medium-high heat. Break up the saffron and add it to the broth. When it begins to simmer, give it, 1 minute, , and then lower the heat just to keep it warm., Heat 2 tablespoons of oil in a, 12-inch Paella Pan, (, or something, similarly sized) over medium heat. Once heated, and the onions and peppers. Sauté until softened and lightly browned, about, 3-5 minutes, ., Add the garlic and sauté for, 1 minute, ., Now add the tomatoes, smoked paprika, and sweet paprika. Sauté for, 1-2 minutes, ., (if using dried thyme, add it with this step), Add the rice and remaining 1 tablespoon of oil to the pan. Stir to coat well. Cook for, 1 minute, to lightly toast the rice and incorporate flavors. Move around occasionally to prevent sticking., Add the fresh thyme and slowly pour in broth. Add salt and pepper., Do not stir after this point, or, , it will release starches and cause creamier rice, ., Turn the heat to medium-high and bring the broth to a heavy simmer for, 1, -2 minutes, ., Now turn the heat down, (between medium-low and medium heat), to a mild simmer. You want to see movement in the pan while the broth is cooking down (, don't boil though, ). Simmer for, 15-20 minutes, until rice is al dente. Rotate the pan on the burner 1-2 times during cooking for even heat distribution., Once the broth is nearly cooked off, you will need to pay close attention to the socarrat forming on the bottom of the pan (, the golden rice crust, ). You will start to hear a snap, crackle, and pop, along with smelling a nutty aroma. This should take, 1-2 minutes, to form. Stick a fork or spoon straight to the bottom to test if it's forming. (, If it smells like it's burning, remove from heat immediately, ) (, *see note, )., Remove the pan from the heat. Add the peas to the top of the rice (, don't mix in, ). Cover the pan with foil and let the paella rest for, 5-8 minutes, . Top with fresh-cut parsley, cracked pepper and side with lemon wedges to serve.  Enjoy!, , , Notes, * Sometimes you might not get the socarrat to form and that's ok. It all depends on the pan, fat content, heat source and experience. The more you cook paella, the better you'll get at reading the signs. I've had times where I left it too long and it burned. That is never fun, so it's better to have no socarrat than burnt socarrat. Your paella will still be delicious without it., , *Saffron gives the paella its distinct flavor which is somewhat earthy and floral. It's very subtle but really finishes the dish. It also turns the rice to a beautiful golden color. It's a little costly, so if it's not in your budget you can replace it with turmeric. It will have a different flavor, but will still be subtle and make the rice golden., , If you don't have a paella pan, I would recommend a large stainless steel pan (, don't use non-stick, )., , * Step-by-step photos above., , Nutrition, Calories:, 366, kcal, |, Carbohydrates:, 59, g, |, Protein:, 9, g, |, Fat:, 10, g, |, Saturated Fat:, 1, g, |, Sodium:, 528, mg, |, Potassium:, 450, mg, |, Fiber:, 4, g, |, Sugar:, 4, g, |, Vitamin A:, 1530, IU, |, Vitamin C:, 47.3, mg, |, Calcium:, 27, mg, |, Iron:, 3.8, mg, , , , Tried this recipe?, Follow me, @veganhuggs, and mention, #veganhuggs, !, , , , , , , , , , , , , Vegan Huggs Weekly Newsletter, , Receive the tastiest vegan recipes straight to your inbox! Join now and get my Fan Favorites ebook FREE!, , , SUBSCRIBE, , , , , , , , , , , , , , , , , , , , , , , , , , , , , More Vegan Dinner Recipes, Creamy Gochujang Chickpeas and Lentils, Butter Bean Curry, Quinoa Stuffed Peppers, Vegan Pumpkin Mac and Cheese, , , , , , , , Pinterest, , , , , , , Facebook, , , , , , , Twitter, , , , , , , Yummly, , , , , , About Melissa, I’m Melissa Huggins – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, Read more..., , , , , , , , Reader Interactions, Comments, , , , 5 from 164 votes (, 105 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , Sinead@msn.com, , , September 04, 2024 at 8:11 pm, , , , Been making this for years one of my faves 😍, , , Reply, , , , , , , , Melissa Huggins, , , October 20, 2024 at 1:18 pm, , , , I'm so happy it's a fave of yours! Thank you for sharing feedback. 🙂, , , Reply, , , , , , , , , , Kath, , , August 06, 2024 at 2:57 am, , , , That recipe was easy to follow and execute. The result was very tasty. I found i needed a bit more water to cook the rice. Thankyou., , , Reply, , , , , , , , Melissa Huggins, , , December 19, 2024 at 11:01 am, , , , I'm so glad you loved the recipe! If you find the liquid cooking off too fast, try lowering the heat (as long as there's still movement in the pan). If it still happens, then adding extra liquid is a good idea. Thanks for sharing feedback. 🙂, , , Reply, , , , , , , , , , April, , , June 02, 2024 at 9:31 pm, , , , Delicious!! Thank you so much!! I used a fire-roasted bell pepper (blackened on a gas burner), fire-roasted canned tomatoes, 1.5t of smoked paprika b/c I didn't have sweet, and added a half portabello mushroom (sauteed w/ the onions). This is a great recipe, thank you!!, , , Reply, , , , , , , , Melissa Huggins, , , August 02, 2024 at 11:47 am, , , , Hi April, I'm so happy it was hit! Thank you for giving it a try and sharing your delicious modifications. 🙂, , , Reply, , , , , , , , Ana-Maria, , , September 15, 2024 at 11:30 pm, , , , I’m cooking this recipe for some time now, last night I made it for 16 people on a wood fire. It was great! Guests were really impressed. Thank you., , , Reply, , , , , , , , Melissa Huggins, , , December 19, 2024 at 12:39 pm, , , , Hi Ana-Marie, I'm so glad it was a hit with everyone. Sounds perfect cooked on a wood fire. Thank you for taking time to share feedback., , , , , , , , , , , , , K, , , March 24, 2024 at 10:41 pm, , , , Made this paella for a Spanish night I was having and it was the best. It was my first time making paella and this recipe made it less complicated for me. It was so delicious, my guests loved it, thank you! Also, for those who don’t have saffron I skipped it and it still turned out so good., , , Reply, , , , , , , , Melissa Huggins, , , June 01, 2024 at 4:18 pm, , , , I'm so glad the paella was a hit and you found it easy to make! Thank you for trying the recipe and sharing feedback. 🙂, , , Reply, , , , , , , , , , Christine Aicken, , , February 09, 2024 at 8:39 pm, , , , Made it didn't form a crust but was Amazing ❤️🩵, , , Reply, , , , , , , , Melissa Huggins, , , February 15, 2024 at 1:55 pm, , , , Hi Christine, I'm so happy you loved it! Sorry you didn't get the crust to form. Next time, turn the heat up the last few minutes. Just watch it very carefully and smell for burning. 🙂, , , Reply, , , , , , , , , , Donna Silva, , , February 02, 2024 at 8:53 pm, , , , I love this recipe! I've made it many times for mostly non-vegans and they love it! I add beyond meat italian hot sausage. I'm just wondering if I can freeze it?, , , Reply, , , , , , , , Melissa Huggins, , , February 22, 2024 at 11:04 am, , , , So glad everyone loves the paella, Donna! Sounds perfect with the Italian sausage. Yes, you can freeze it for 2-3 months in an airtight container. Thanks for trying the recipe and sharing your feedback. 🙂, , , Reply, , , , , , , , , , Vicki, , , December 27, 2023 at 4:16 pm, , , , Thank you for such a wonderfully written recipe that is equally delicious!!  This will be our go-to for vegan paella going forward!!, , , Reply, , , , , , , , Melissa Huggins, , , December 29, 2023 at 9:39 am, , , , Hi Vicki, you comment made my day! I'm so happy you loved the paella. Thank you for sharing your wonderful feedback. 🙂, , , Reply, , , , , , , , , , Ana-Maria, , , October 11, 2023 at 5:11 am, , , , It’s great! Thanks, , , Reply, , , , , , , , BKMar, , , September 02, 2023 at 3:59 pm, , , , Really enjoyed this and it was easy to make. I had to sub for basmati rice which seemed to work. I would just use 1/2 the smoke paprika next time as it seemed to overpower all the other flavors. But great recipe and I started following you for more!, , , Reply, , , , , , , , Melissa Huggins, , , December 03, 2023 at 11:08 am, , , , I'm so glad you loved the recipe and it worked well with the basmati. Thank you for giving it a try and sharing your feedback. 🙂, , , Reply, , , , , , , , , , Fay, , , August 24, 2023 at 11:00 pm, , , , We love this Vegan Huggs Paella! We’ve had it regularly since first seeing it years ago. I usually add, It’s not bacon pieces or vegan sausages to serve. The lemon finishes it off nicely. Two of us almost finish it 🤫, , , Reply, , , , , , , , Melissa Huggins, , , September 14, 2023 at 11:25 am, , , , Hi Fay, This made my day! I'm so happy everyone loves it. Sounds perfect with the vegan bacon and sausage.Thank you for sharing your wonderful feedback. 🙂, , , Reply, , , , , , , , , , Bryan, , , August 11, 2023 at 8:10 am, , , , Very delicious!, , , Reply, , , , , , , , Melissa Huggins, , , August 17, 2023 at 11:24 am, , , , HI Bryan, I'm so happy you loved it. Thank you for making it and sharing your wonderful feedback. 🙂, , , Reply, , , , , , , , , , Robert, , , July 29, 2023 at 12:11 pm, , , , Really lovely dish. Had most things in the larder but not saffron. Managed to find a paella spice mix which worked very well and had saffron in it. Not sure about serving for 5, my wife and I demolished the lot (we are not gluttons but it was our main meal.) Thank you, I am not the world's greatest cook but it was easy to follow., , , Reply, , , , , , , , Melissa Huggins, , , July 31, 2023 at 12:41 pm, , , , Hello Robert, thank you for the feedback. It is great to know you and your wife enjoyed this recipe. 🙂, , , Reply, , , , , , « Older Comments, Primary Sidebar, , , , I’m Melissa Huggins, – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, , More about me →, , , Search, Search, , vegan huggs facebook, , vegan huggs Instagram., , vegan huggs pinterest, , YouTube, , My Most Popular, , Vegan Crab Cakes, Easy Vegan Quiche, Sticky Sesame Cauliflower, Creamy Vegan Potato Leek Soup, Cheesy Vegan Cauliflower Casserole, Grilled Portobello Mushroom Steaks, Footer, , SEEN ON, , , ^ back to top, , , , About, , About Me, Privacy Policy, Recipe Index, , , , Newsletter, , Sign Up!, for emails and updates, , , Contact, , Contact, Subscribe, , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2020, Vegan Huggs, , We use cookies to ensure that you have the best experience possible on our website. By continuing on the site you agree to the use of your cookies by www.veganhuggs.com, , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,"
    }
}