{
    "ingredients": {
        "Vegan Borsch": "beetroot, porcini mushrooms, white cabbage, dried beans"
    },
    "recipe_url": {
        "Vegan Borsch": "http://www.slavicvegan.com/2018/12/16/vegan-borsch/?fbclid=IwAR3YbVURmd4QZpaZC9OVepKoW1W2TCWGWkoAqyOxvyOoDz7VkDi9uehBFag"
    },
    "Recipe": {
        "Vegan Borsch": "Ingredients: , , , , Scale, , 1x, 2x, 3x, , , , , , 1/2, C dried porcini, , 1/2, C dried beans, , 350g, white cabbage, shredded roughly, , 1, potato (about, 200g, ), diced, , 1, small carrot, julienned, , 1, medium beetroot, julienned, , 1, medium onion, diced, , 1, small red chili, minced, , 3, garlic cloves, minced, , 1, heaped tbsp tomato paste, , 1 tbsp, white wine vinegar, , 1 tsp, brown sugar, , few pinches each of dried oregano, marjoram and basil, , 2, bay leaves, , oil for cooking, , salt and black pepper to taste, , vegan sour cream, and fresh parsley for garnishing, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , ,  Instructions: , , , Soak beans overnight., , Put dried porcini in a big pot and cover with 2 liters of water. Set aside for 1-2 hours., , Drain the beans, add to mushrooms and bring to boil., , Meanwhile heat oil in a pan over medium heat. First throw in beetroot. Sprinkle with sugar, half of the vinegar and sauté for few minutes. Then add carrot, minced chili and onion. Stir until veggies start to brown. Lastly add tomato paste and about 1/2 cup of stock. Let it simmer for 5-10 minutes., , When beans are half cooked add shredded cabbage. Wait until the soup starts to boil again, season with salt and throw in potatoes. In a few minutes transfer sautéed veggies into the pot, add herbs and let it simmer uncovered until the beans and potatoes are cooked., , Taste for doneness and seasoning. Vegetables should be cooked but a bit crunchy. Add more salt and vinegar if needed. Finish with minced garlic, switch off the heat, cover with lid and let it sit for at least 30 minutes. Best on a second day., , Serve with vegan sour cream and fresh chopped parsley., , , , , , , Notes, , , Makes 4 big servings. Can be considered as a main course., , , , , Nutrition, , , Calories:, , 202, , Sugar:, , 9.4g, , Sodium:, , 55mg, , Fat:, , 3.9g, , Saturated Fat:, , 0.5g, , Carbohydrates:, , 35.1g, , Fiber:, , 9.5g, , Protein:, , 8.2g, , , , , Did you make this recipe?, , Share a photo and tag us — we can't wait to see what you've made!, , , , You may also like:, Ukrainian “Vinaigrette” salad, Vegan Root Vegetable Chowder with Roasted Sunchokes and Cabbage, Roasted Turnip and White Bean Soup, Black Bean and Vegetable Stew, Creamed Buckwheat with Roasted Beetroot and Sunchoke Purée, Purple cabbage soup, , , Filed Under:, Soups, , Tagged With:, beans, , , beetroot, , , cabbage, , , gluten-free, , , root vegetables, , , soup, , , Ukrainian, Subscribe, , Don't miss new recipe!, , , , , , Privacy Policy, , Previous Post:, « Roasted beetroot with garlic cashew cheese, Next Post:, Vegan gingerbread men », Reader Interactions, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., , , , Δ, , , Primary Sidebar, About me, , Hello there!, My name is Anastasia and currently I live in Ukraine. I'm a passionate traveller and I've visited more than 70 countries. I like to create delicious vegan recipes based on my experience with a slavic touch., , S'more here.., , , Facebook, Instagram, Pinterest, Twitter, , , , Recent Posts, , , , Tofu Avocado Salad with Fresh Herbs, , , , Homemade Elderflower Syrup (+ Virgin Hugo), , , , Vegan Chebureki (Simple Recipe), , , , Roasted Romanesco Quinoa Salad, , , , Potato and Mushroom Soup with Crispy Red Cabbage, , , , , Recent Comments, , Anastasia, on, Vegan Puff Pastry Lentil and Jackfruit Loaf, Anastasia, on, Perfect Fluffy Vegan Omelette, Jules, on, Vegan Cream Cheese (5-minute, High Protein), Alicia, on, Vegan Crescent Cookies (Austrian Vanillekipferl), Chris, on, Vegan Puff Pastry Lentil and Jackfruit Loaf, , Archives, , , July 2022, , June 2022, , May 2022, , February 2022, , December 2021, , November 2021, , March 2021, , February 2021, , December 2020, , November 2020, , September 2020, , August 2020, , July 2020, , June 2020, , May 2020, , April 2020, , March 2020, , February 2020, , January 2020, , December 2019, , November 2019, , October 2019, , September 2019, , August 2019, , July 2019, , June 2019, , May 2019, , March 2019, , February 2019, , January 2019, , December 2018, , November 2018, , , , Categories, , , Appetizers, , , Breakfast, , , Desserts, , , Drinks, , , Main courses, , , Salads, , , Sides, , , Soups, , , Tutorials, , , , , Search, , Feature Your Favorites, , Georgian Roasted Eggplant in Walnut Sauce, Lemon, Garlic and Ginger Butter Beans, Nettle and Mint Pesto with Pumpkin Seeds (Vegan), Basil Tofu Zucchini Roll Ups (Vegan, GF), Vegan Moscow Buns (Plyushki), Grilled Peach and Zucchini Salad, Spring Soup with Chickpeas and Ramson, , Copyright © 2025 Slavic Vegan on the, Foodie Pro Theme, This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish., Accept, , Reject, , Read More, Privacy & Cookies Policy, , , , , , Close, , , , , , , , Privacy Overview, , , This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience., , , , , , , , , Necessary, , , , Necessary, , , Always Enabled, , , , , Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information., , , , , , , Non-necessary, , , , Non-necessary, , , , , , Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website., , , , , , , , , , , , , , SAVE & ACCEPT, , , , , , , , , , , , , , , , , , , , , , ,"
    }
}