{
    "ingredients": {
        "Mexican Vegetarian Lasagna": "spinach, cottage cheese, black beans, pinto beans, corn tortillas, salsa, cheese",
        "Black Bean Tamale Pie": "garlic, bell pepper, zucchini, black beans, tomatoes, cornmeal, whole wheat flour, baking powder, maple syrup, almond milk, apple cider vinegar, green chillies,corn",
        "Chimichanga": "fried",
        "Vegan Garlic Spinach Empanadas": "flour, vegan butter, baking powder, almond milk, garlic, spinach, vegan cheese",
        "Vegan Black Bean Burrito": "zucchini, red bell pepper, onion, black beans, tortilla, vegan cheese",
        "Vegan Bean Burrito": "grain tortilla,non fat refried beans,avocado, lime,tomato,red onion,bell pepper,radish,green olives",
        "Arepas": "corn flour,mushrooms/tofu, onion, garlic, avocado, mayo,lemon",
        "Vegan Nacho Pizza": "all purpose flour,dry active dry yeast, TVP veg protein,onion,garlic, tomato sauce,dried oregano and thyme, avocados,red onion,black olives,cherry tomatoes,jalapeno,red pepper,vegan sour cream",
        "Spring Breakfast Bowl": "brown rice,asparagus,eggs,avocado,watermelon radish,grapefruit",
        "Black Bean Enchilada Bake": "quinoa,veg broth,enchilada sauce,red onion,bell pepper,garlic,lime,black beans,gluten free flour,dried oregano"
    },
    "recipe_url": {
        "Mexican Vegetarian Lasagna": "https://www.thestatenislandfamily.com/mexican-vegetarian-lasagna/?fbclid=IwAR2HnTBybJHyPpsc1GAuztnKvaZNKGpZc8pEZVLtRnCQMlzjUiNUjxq448I",
        "Black Bean Tamale Pie": "https://www.delishknowledge.com/black-bean-tamale-pie/",
        "Chimichanga": "(onions, garlic, white button mushrooms, broccoli, bell pepper colored, onion powder, tortillas whole wheat or corn, cheddar cheese, guacamole, tomato salsa",
        "Vegan Garlic Spinach Empanadas": "https://biancazapatka.com/en/vegan-empanadas/",
        "Vegan Black Bean Burrito": "https://www.pinterest.co.uk/pin/496592296426657123/",
        "Vegan Bean Burrito": "fixate_recipes\\Lunch\\FXR_Vegan-Bean-Burrito_R_02.25.19.pdf",
        "Arepas": "https://www.pinterest.co.uk/pin/496592296426657307/",
        "Vegan Nacho Pizza": "https://thestingyvegan.com/vegan-nacho-pizza/",
        "Spring Breakfast Bowl": "fixate_recipes\\Breakfast\\FXR-EN-Spring_Breakfast_Bowl-7.9.20-Recipe.pdf",
        "Black Bean Enchilada Bake": "https://www.justwhatweeat.com/black-bean-enchilada-bake-gluten-free-vegan/"
    },
    "Recipe": {
        "Mexican Vegetarian Lasagna": "Ingredients: ▫️1 package frozen spinach (thawed, drained, and squeezed dry), ▫️1 cup cottage cheese (I use fat free), ▫️1 can of black beans (rinsed and drained), ▫️1 can of pinto beans (rinsed and drained), ▫️ 6 thin corn tortillas, ▫️ 2 cups salsa, ▫️ 1 cup fat free cheese, , ▫️1 package frozen spinach, , thawed, drained, and squeezed dry, , ▫️1 cup cottage cheese, , I use fat free, , ▫️1 can of black beans, , rinsed and drained, , ▫️1 can of pinto beans, , rinsed and drained, , ▫️ 6 thin corn tortillas, , ▫️ 2 cups salsa, , ▫️ 1 cup fat free cheese, I guess it was just a mistake….., Reply, , Patti Culpepper, , says, July 15, 2023 at 12:07 pm, I caught this too! Was gonna ask the same. I came here looking for the same answer…, Reply, , Sue, , says, September 29, 2021 at 3:35 pm, What is it on Green ? Daughter\\\\\\’s visiting ., Reply, , Sandra Nida, , says, October 23, 2021 at 12:03 am, Would like to know how many calories per serving in lieu of the WW points…., Reply, , Carol I Breese, , says, January 14, 2022 at 10:56 pm, I would also like to know the calories per serving., Reply, , Melissa Chapman, , says, January 15, 2022 at 5:51 pm, unfortunately i dont have the caloric value, Reply, , Lorraine Schuell, , says, March 5, 2022 at 10:10 pm, Absolutely delicious,especially when you have 2 vegetarians who love Mexican food.Full disclosure;I didn’t use low or fat free cheese and I used whole milk ricotta.For the cheese topping I used the 4 cheese Mexican cheese with taco seasoning.My 2 grands usually eat like birds but this they had seconds.I will definately be making this on a regular basis.Thank you for this recipe!, Reply, , Melissa Chapman, , says, March 7, 2022 at 5:59 pm, So glad to hear this!!! thanks for the feedback!!, Reply, , Heather, , says, March 6, 2022 at 9:23 pm, Can this be prepared ahead of time and frozen?, Reply, , Melissa Chapman, , says, March 7, 2022 at 5:59 pm, absolutely!!!!, Reply, , Lisa A Garrido, , says, April 6, 2022 at 8:54 pm, Has anyone added meat? My hubby will turn his nose up bc he needs meat., Reply, , Reuben Ross, , says, April 8, 2022 at 2:39 am Instructions: 1) preheat oven to 425, 2) combine spinach and ricotta in a bowl. combine beans in a separate bowl, 3) cut tortillas into fourths. arrange half of the tortillas to cover the bottom of a 8 inch baking dish that has been sprayed with cooking spray, 4) top with half the beans, half of the salsa, and half of the spinach mixture. Repeat layers and top with fat free cheese, 5) cover and bake for 25 minutes, then uncover and bake for an additional 15 minutes or until bubbly. I like to broil for the last few minutes. Let stand 10 minutes before serving, This recipe Makes 6 large servings – 3 points per serving on blue 💙, , , , , , 4.58, from, 7, votes, , Print, Mexican Vegetarian Lasagna, This recipe Makes 6 large servings - 3 points per serving on blue 💙, preheat oven to 425, combine spinach and ricotta in a bowl. combine beans in a separate bowl, cut tortillas into fourths. arrange half of the tortillas to cover the bottom of a 8 inch baking dish that has been sprayed with cooking spray, top with half the beans, half of the salsa, and half of the spinach mixture. Repeat layers and top with fat free cheese, cover and bake for 25 minutes, then uncover and bake for an additional 15 minutes or until bubbly. I like to broil for the last few minutes. Let stand 10 minutes before serving, Looking for more, Weight Watchers recipes, ? Here are a few of our favorites!, https://www.thestatenislandfamily.com/air-fryer-egg-rolls-weight-watchers-style/, https://www.thestatenislandfamily.com/asian-inspired-crispy-air-fried-tofu-with-stir-fry-vegetables-two-pints-per-serving-on-weight-watchers-blue/, https://www.thestatenislandfamily.com/2-ingredient-dough-cinnamon-twists/, So…   how will you be celebrating Cinco de Mayo?, Share this..., Yummly, Facebook, Twitter, Pinterest, More, Email, Print, LinkedIn, Reddit, Pocket, Tumblr, «, », Filed Under:, Delicious Recipes, , , Featured, , Tagged With:, Mexican Vegetarian Lasagna, , , Weight Watchers Blue, Browse by Category, Browse by Category, Select Category, beauty, Delicious Recipes, Family Fun, Fashion & Beauty, Fashion and Beauty, Featured, Giveaways, health and lifestyle, Healthy Bites, Home DIY and Improvement, Husbands & Wives, Kid Gear, Love & Sex, Marriage, Marriage, Marriage and Relationships, MMSG, Motherhood Musings, My Sugar daddy, Parenting, Parenting Tips, Relationships, Uncategorized, Weight Watchers Recipes, , Browse by Date, , Browse by Date, , Select Month, April 2025, March 2025, February 2025, January 2025, December 2024, November 2024, October 2024, September 2024, August 2024, July 2024, June 2024, May 2024, April 2024, March 2024, February 2024, January 2024, December 2023, November 2023, October 2023, September 2023, August 2023, July 2023, June 2023, May 2023, April 2023, March 2023, February 2023, January 2023, December 2022, November 2022, October 2022, September 2022, August 2022, July 2022, June 2022, May 2022, April 2022, March 2022, February 2022, January 2022, December 2021, November 2021, October 2021, September 2021, August 2021, July 2021, June 2021, May 2021, April 2021, March 2021, February 2021, January 2021, December 2020, November 2020, October 2020, September 2020, August 2020, July 2020, June 2020, May 2020, April 2020, March 2020, February 2020, January 2020, December 2019, November 2019, October 2019, September 2019, August 2019, July 2019, June 2019, May 2019, April 2019, March 2019, February 2019, January 2019, December 2018, November 2018, October 2018, September 2018, August 2018, July 2018, June 2018, May 2018, April 2018, March 2018, February 2018, January 2018, December 2017, November 2017, October 2017, September 2017, August 2017, July 2017, June 2017, May 2017, April 2017, March 2017, February 2017, January 2017, December 2016, November 2016, October 2016, September 2016, August 2016, July 2016, June 2016, May 2016, April 2016, March 2016, February 2016, January 2016, December 2015, November 2015, October 2015, September 2015, August 2015, July 2015, June 2015, May 2015, April 2015, March 2015, February 2015, January 2015, December 2014, November 2014, October 2014, September 2014, August 2014, July 2014, June 2014, May 2014, April 2014, March 2014, February 2014, January 2014, December 2013, November 2013, October 2013, September 2013, August 2013, July 2013, June 2013, May 2013, April 2013, March 2013, February 2013, January 2013, December 2012, November 2012, October 2012, September 2012, August 2012, July 2012, June 2012, May 2012, April 2012, March 2012, February 2012, January 2012, December 2011, November 2011, October 2011, September 2011, August 2011, July 2011, June 2011, May 2011, April 2011, March 2011, February 2011, January 2011, December 2010, November 2010, October 2010, June 2010, May 2010, February 2010, November 2009, , , Comments, , Amber Myers, , says, May 4, 2021 at 4:54 pm, This would be a delicious dinner. We love Mexican food, so I’ll keep the lasagna in mind. I bet my family would love it!, Reply, , Terri A Steffes, , says, May 4, 2021 at 7:11 pm, I was looking for a dinner tomorrow and this could be it.  The best day in May!  We love Mexican food and dishes, so this would be popular here., Reply, , Tara Pittman, , says, May 4, 2021 at 9:06 pm, This dish needs some green chile. This is a dish that my family would love, Reply, , Brandy, , says, May 4, 2021 at 11:43 pm, That’s a pretty interesting lasagna recipe to share. I will give this to my friends who are on a diet and will want the lower points.Glad you shared this recipe., Reply, , Lisalisa, , says, May 4, 2021 at 11:58 pm, Yesss, now this is my kind of dish! I’m going to make this over the weekend and I sure hope it comes out like yours! I’m always open to creating new meals., Reply, , Nikki Wayne, , says, May 5, 2021 at 3:40 am, I love beans, I’m sure this is so satisfying, thanks for the recipe!, Reply, , MELANIE EDJOURIAN, , says, May 5, 2021 at 9:13 am, We haven’t celebrated Cinco de Mayo before. I think with food like this I will have to. It sounds so tasty and thankfully not too hard to make., Reply, , Catalina, , says, May 5, 2021 at 10:02 am, I make so often lasagna because my family loves it! I am so curious to try this vegetarian version!, Reply, , Heather - thedomesticdiva.org, , says, May 5, 2021 at 2:12 pm, I need to add more vegetarian options to our family meal plan. This looks delicious!, Reply, , Gervin Khan, , says, May 5, 2021 at 2:59 pm, That looks amazing! I want to have a taste of this dish! Thanks for sharing this., Reply, , Kathy, , says, May 5, 2021 at 5:01 pm, This looks amazing. I love having lasagna. I haven’t tried a vegetarian one yet. I’ll have to give this a try soon., Reply, , Beth, , says, May 5, 2021 at 6:27 pm, This looks like a delicious dinner idea!  I know my family will love it., Reply, , Msjane90, , says, May 7, 2021 at 5:17 pm, This got me craving in the middle of the night. lol, Thanks for the recipe!, Reply, , Amy, , says, July 27, 2021 at 12:45 pm, Do you use cottage cheese or ricotta?, Reply, , Darlene, , says, November 14, 2021 at 7:46 pm, Reply, , Sheila, , says, April 8, 2022 at 11:51 am, She clearly stated that if someone doesn’t like cottage cheese that you could use ricotta, Reply, , Viveca Slagle, , says, April 11, 2022 at 3:31 pm, This was absolutely DELICIOUS! Plus, it was even better after being refrigerated, then reheated the next day., I rarely cook for my husband because he’s a VERY picky eater (we eat lots of frozen entrees). Among many other things, he specifically dislikes legumes, corn tortillas, spinach, and cottage cheese., He never entered the kitchen while I was putting this together, but while it was cooking, he walked through and remarked how good it smelled. So, I fixed him a plate. He scarfed it down and asked if there was any more. We have a WINNER!, Reply, , Ann, , says, May 15, 2022 at 9:31 pm, This was WAY TOO SPICY for us!  We’re going to try it again with only one can of beans and a small sprinkle of salsa., Reply, Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , Website, , , Notify me of follow-up comments by email., , Notify me of new posts by email., , , Δ, This site uses Akismet to reduce spam., Learn how your comment data is processed., Work with Melissa of The Staten Island Family, , Recent Posts, , Easy cherry cheesecake cups, , Banana Bread Muffins, , Double chocolate chip muffins, Categories, beauty, Delicious Recipes, Family Fun, Fashion & Beauty, Fashion and Beauty, Featured, Giveaways, health and lifestyle, Healthy Bites, Home DIY and Improvement, Husbands & Wives, Kid Gear, Love & Sex, Marriage, Marriage, Marriage and Relationships, MMSG, Motherhood Musings, My Sugar daddy, Parenting, Parenting Tips, Relationships, Uncategorized, Weight Watchers Recipes, Copyright © 2025 · Designed by, Restored 316, Copyright © 2025 ·, The Staten Island Family, on, Genesis Framework, ·, WordPress, ·, Log in, , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Black Bean Tamale Pie": "Ingredients: , For the black bean chili filling:, , , Olive oil, , Aromatics like onion and garlic cloves, , Green or Red bell pepper, , Zucchini, , Spices like chili powder, cayenne pepper, cumin and ground coriander, , Canned black beans, , Canned diced tomatoes with juice, , , For the cornmeal tamale topping:, , , Ground cornmeal, , Whole-wheat flour (or use gluten-free flour for gluten free option), , Baking powder, , Canola oil, , Maple syrup, , Unsweetened soymilk, or dairy-free milk of choice, , Apple cider vinegar or other vinegar; you just need a splash of acidity, , Can of diced green chilis, mild or hot depending on spice preferences, , 1/2 cup corn (thawed from frozen or canned), , , , , , zucchini, bell pepper and garlic. Heat the olive oil in a large cast-iron, skillet, or stock pan over medium heat. Add the onion and garlic and cook until softened., , From there, stir in the zucchini and bell pepper and cook another 5 minutes until tender. Sprinkle in the spices along with the drained and rinsed black beans and tomatoes with their juices., , Just like regular chili, you can season until your heart’s content. I use the usual suspects: chili powder, cayenne, cumin and coriander but feel free to turn up the heat with chopped jalapeños or other spices., , If you plan on using the same pan then you’ll need to choose a large skillet. I like my 12″ cast-iron skillet but any oven-safe option will work., , , , , Make the cornmeal crust, , Now comes the best part– the cornbread crust. Essentially, tamale pie is just chili and cornbread combined together in one pan. And for me, it’s not chili unless I’ve got a side of cornbread. I’m using my favorite, cornbread, , While the chili is cooking, mix up the cornbread filling and set aside. If you cooked the chili in an oven safe skillet, like a cast-iron then you are ready to go. Otherwise, you can pour the bean mixture to a casserole dish or other oven-safe skillet., , Top with the cornbread filling, then place in the oven and cook until hot and bubbly., , Pie goes in the oven, delicious dinner comes out. How great is that? If you decide to use a casserole pan or, baking dish, for this instead of a, skillet, , make sure your chili is fairly saucy. It will dry out as it cooks in the oven and you want enough moisture to create the best part of this meal —> the thin layer of soggy cornbread that’s been baked in chili juice., , The top layer is slightly crunchy, the underneath is perfectly soggy. The texture is so perfect. Good luck not picking off the cornbread topping as you dish this one up!, , , , , Shortcut Options, , For an easy weeknight shortcut, you can use any box mix that you’d like for the cornbread topping. If using a boxed version, then I highly recommend adding in the canned chilis and cheddar, either regular or dairy-free cheese to elevate the boxed version., , Or, alternatively you can use any chili recipe and top with this homemade cornbread topping., , What to top this vegetarian tamale pie with?, , You can top this pie with whatever you’d like. I usually go with avocado slices, fresh cilantro, salsa and thinly sliced scallions., , , , , More One Pot Dinner Recipes:, , , One Skillet Dinner with Sausage and Potatoes, , Healthy Vegan Enchilada Casserole, , Quinoa Enchilada Casserole, , Pasta Bake with No-Cook Noodles, , Sheet Pan Maple Balsamic Tempeh and Vegetables, , One Pot Pasta Puttanesca, , , If you try this recipe, let me know! Leave a comment, rate it, and tag your, Instagram, photos with #delishknowledge . I absolutely, love, seeing your creations. Happy cooking!, This recipe was originally posted in 2015, updated in 2021 based on user feedback., , , , , , , , Save, Saved, , Black Bean Tamale Pie, , , , , , , , , , Print, , , , , , , , 4.91, from, 10, votes, , Black Bean Tamale Pie! This weeknight meal is healthy and filling! Black Bean and Zucchini Chili topped with homemade cornbread, baked to perfection! Vegan with gluten-free option., Originally posted in 2015; updated in 2021., , Servings:, 6, , servings, Prep Time:, 10, minutes, , minutes, Cook Time:, 20, minutes, , minutes, Total Time:, 30, minutes, , minutes, , , , Black Bean Chili Filling:, 1, , tablespoon, , olive oil, 1, , onion, , , chopped, 1, , clove, , garlic, , , minced, 1, , bell pepper, , , chopped, 1, , medium zucchini, , , chopped, 1, , tablespoon, , chili powder, 1/4, , teaspoon, , cayenne pepper, , , use more if you want more heat, 1, , teaspoon, , ground cumin, 1, , teaspoon, , ground coriander, 1 15., , oz., , can black beans, , , drained and rinsed, 1 15, , oz., , diced tomatoes with juice, Vegan Cornmeal Topping:, 3/4, , cup, , ground cornmeal, 1/4, , cup, , cup whole-wheat flour, , , use gluten-free flour blend for gluten free option, 1/2, , teaspoon, , baking powder, 1/4, , cup, , canola oil or olive oil, 1, , tablespoon, , maple syrup, 3/4, , cup, , unsweetened soymilk or other unsweetened non-dairy milk, 1, , teaspoon, , apple cider vinegar, 1 4, , oz., , can diced green chilis, 1/2, , cup, , corn, , , thawed from frozen or canned, , flour, baking powder in a large bowl. In a separate bowl or large measuring cup, maple syrup, soymilk and apple cider vinegar., Add the wet to the dry and mix until combined. Add in the green chilis and corn, mix again then pour the cornmeal batter over the filling and bake for 20-25 minutes until golden brown., , Notes, I used a large, cast iron, , skillet, for this dish but if you don’t have a, skillet, that large, use a casserole dish instead., , For a cheesy cornbread topping, stir in shredded cheddar cheese (either regular or dairy-free) to the cornbread mixture., , Once it’s baked, enjoy as is or top like you would your favorite chili!, , , Nutrition, Serving:, 1, serving, Calories:, 346, kcal, Carbohydrates:, 47, g, Protein:, 11, g, Fat:, 14, g, Saturated Fat:, 2, g, Polyunsaturated Fat:, 3, g, Monounsaturated Fat:, 9, g, Sodium:, 469, mg, Potassium:, 808, mg, Fiber:, 11, g, Sugar:, 10, g, Vitamin A:, 1437, IU, Vitamin C:, 45, mg, Calcium:, 142, mg, Iron:, 4, mg, , , Course:, dinner, entree, healthy, pie, Cuisine:, Mexican, Southwestern, , Author:, Alexandra Caspero, , , , , Share on Pinterest, , Share on Facebook, , Share on X (Twitter), , Share on Email, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Did you make this? Rate this recipe!, , , , Did you make this? Rate this recipe!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , , , , Δ, , , 26 Comments, , , Comments navigation, , Older comments, , , , , , , , Kristina, , says:, , , , at, , , , , Can this be done without oil?, , , Reply, , , , , , , , Ali, , says:, , , , at, , , , , Made this and it’s a definite do-again. I really liked the subtle heat/spice. My son did not like it, but hubby did!, , , Reply, , , , , , , , Alex, , says:, , , , at, , , , , Glad to hear!, , , Reply, , , , , , , , , , Jennie Lemire, , says:, , , , at, , , , , I have made this several times, have substituted a corn bread mix if needed, but the recipe works great on its own. Love to top with sour cream. Best part (after flavor) is one dish!, , , Reply, , , , , , , , Vicky, , says:, , , , at, , , , , This was delicious! I made it in a 10” skillet and didn’t use quite all of the topping, and it turned out perfect! I did add about 1/2 cup cheese to the cornmeal mixture and 1/4-1/2 teaspoon salt before baking. Thank you for sharing!, , , Reply, , , , , , , , Vicky, , says:, , , , at, , , , , This was delicious! I made it in a 10” skillet and didn’t use quite all of the topping, and it turned out perfect! I did add about 1/2 cup cheese to the cornmeal mixture before baking. Thank you for sharing!, , , Reply, , , , , , , , Catherine, , says:, , , , at, , , , , This looks amazing. Plan on making it tomorrow tonight.  What size casserole dish would you suggest if you want to bake in that?, , , Reply, , , , , , , , Alex, , says:, , , , at, , , , , Hi Catherine, I make this in my large skillet, but if you don’t have that then I’d recommend a 9×12″ casserole dish; I find that this dish is better with a thinner layer of the cornbread topping on top. A smaller pan works, but the cornbread topping ends up being too thick., , , Reply, , , , , , , , , , Kaci, , says:, , , , at, , , , , This is like a 4.5/5, realllly good and so easy. My biggest complaint that didn’t get it to a 5/5 is the cornbread needed a little something extra, its was kinda bland. Of course, with the filling on the bottom it was a delicious combo, but if you got a bite that was mostly cornbread, it lacked something. I think maybe a little more maple syrup and some salt would do the trick. Definitely making this in the future again!, , , Reply, , , , , , , , Alex, , says:, , , , at, , , , , Thanks for the feedback Kaci! I’m redoing the recipe based on similar feedback. Thanks!, , , Reply, , , , , , , , , , Jon Nelson, , says:, , , , at, , , , , My vegetarian son, who usually only gives a response of “good”, labeled this “very good”. We did agree that next time we make this we will use two cans of beans and two cans of tomatoes., , , Reply, , , , , , Comments navigation, , Older comments, , , , , , , , , , , , , , , , , feel good, veg-heavy food from my kitchen to yours, , I’m Alexandra Caspero, the Registered Dietitian and, New York Times, bestselling chef behind Delish Knowledge. Life is too short to follow strict diet rules. In my world, there’s room for both kale salads and chocolate chip cookies., , , About Alex, , , , , , , Trending Recipes, , Air Fryer Cauliflower Wings, Homemade Enchilada Sauce, Easy Vegan Pasta, Pasta in Green Sauce (Green Pasta), Vegan Lentil Tacos, Mexican Avocado Salad, , , , , , , , , , , , , , , , , , , , Subscribe, , , , (and get a free 7-day plant-based protein course), Name, (Required), , , , First, , , Email, (Required), , , , , , , , , , , , , , , , , Δ, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , follow, @delishknowledge, on instagram, , , , , , , , , , , , , , , , , , Resources, About, , Contact, , Press, , Privacy Policy, , Accessibility, , , , , , , , , , , Facebook, , X, , Instagram, , Pinterest, , , , , , , , , Recipes, Recipes, , Breakfasts, , Mains, , Snacks, , Drinks, , , , , , , , , Nutrition, Nutrition, , Intuitive Eating, , Recipe Roundups, , Travel, , Healthy Recipes, , , , , , , , , More, Life, , 30 Under 30 Ebook, , My Italian Cookbook, , Plant-based Juniors, , , , , , , , , , , , , , , , , Copyright 2025, Delish Knowledge, | 3800 Gravois Ave Ste. 1F #201 St. Louis, MO 63116, , , , , , , , , , , , , , , , , , , , Scroll to top, , Scroll to top, , , , , , , , , , , , , , , , Search, , , , , , , , , Recipes, Toggle child menu, Expand, , , , Dinner, , Lunch, , Appetizers, , Side Dish, , Breakfast, , Dessert, , Snacks, , Salad, , Soup, , Drinks, , , , Popular, Toggle child menu, Expand, , , , Canning, , Healthy, , Spring Recipes, , 30 Minutes or Less, , Air Fryer Recipes, , Slow Cooker & Instant Pot, , , , Nutrition, , Shop, Toggle child menu, Expand, , , , 30 Dinners in 30 Minutes, , Easy Dinners for Busy Parents, , Pregnancy Guide, , Nut Free Lunch Box Book, , The Plant-Based Baby and Toddler, , Plant-Based Nutrition for Parents Course, , First Bites Starting Solids Course, , Pediatric Nutrition for Health Professionals Course, , , , Subscribe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , Instructions: , Make the black bean chili, , Start by making the bottom layer; a simple black bean chili that comes together in just 15 minutes., , Make the black bean chili layer., Heat a large oven-safe skillet over medium heat. Add the olive oil and sauté the onion for 5-6 minutes until translucent. Add a pinch of salt and the garlic, then stir together., Add the rest of the vegetables:, bell pepper and zucchini along with the chili powder, cayenne pepper, cumin, and coriander. Cook until soft, about 10 minutes. Add the beans and tomatoes with juice to the skillet., Preheat oven to 400 degrees F., Make the cornbread filling.",
        "Chimichanga": "❌ Error scraping (onions, garlic, white button mushrooms, broccoli, bell pepper colored, onion powder, tortillas whole wheat or corn, cheddar cheese, guacamole, tomato salsa: Invalid URL '(onions, garlic, white button mushrooms, broccoli, bell pepper colored, onion powder, tortillas whole wheat or corn, cheddar cheese, guacamole, tomato salsa': No scheme supplied. Perhaps you meant https://(onions, garlic, white button mushrooms, broccoli, bell pepper colored, onion powder, tortillas whole wheat or corn, cheddar cheese, guacamole, tomato salsa?",
        "Vegan Garlic Spinach Empanadas": "Ingredients: Dough:, 2 ½, , cups, , , (, 300, , g, ), , flour *, 3.5, , oz, , , (, 100, , g, ), , vegan butter, , optional margarine, 1, , tsp, , , , salt, 1, , tsp, , , , baking powder, ⅔, , cup, , , (, 160, , ml, ), , dairy-free milk (or water), , lukewarm, Filling *:, 1, , , , onion, 2, , , , garlic cloves, 10.6, , oz, , , (, 300, , g, ), , spinach, , frozen, 1 ⅓, , cups, , , (, 150, , g, ), , shredded vegan cheese, , or vegan cream cheese/feta*, , , salt, , to taste, , , pepper, , to taste, , , chili, , optional, , , nutmeg, , optional, To brush:, 3, , tbsp, , , , soy milk, , or other dairy-free milk, 1-2, , tbsp, , , , olive oil, 1, , , , pinch of turmeric, , optional, , , I used vegan shredded cheese, but you can also use vegan cream cheese, , homemade vegan feta, , or, homemade cashew ricotta, ., , If you leave the dough in the fridge for longer than 1/2 hour, you should remove it earlier and allow it to come to room temperature before using it. Otherwise, the dough will be too firm and difficult to roll out., , They taste best when you serve them with different dips, such as, guacamole, or, cashew cream dip, , or, vegan mayonnaise, ., , , Nutrition is calculated automatically and should be used as estimate., , , , , , Did you make this recipe?, Mention, @biancazapatka, or tag, #biancazapatka, !, , IF YOU HAVE PINTEREST, YOU CAN FIND ME, HERE, AND PIN YOUR FAVORITE PICTURE, IF YOU LIKE!, , , ©Bianca Zapatka | All images & content are copyright protected. Please do not use my \r\n            images without prior permission. If you want to republish this recipe, please link back to this post for the recipe. More info, here, . Thank you \r\n            for supporting, biancazapatka.com, !, , Disclosure for affiliate links with asterisk (*):, This\r\n            page may contain affiliate links that earn me a small commission, at no additional cost to you. You can find more information, here, ., , Filed Under:, Basics, , , Fingerfood & Snacks, , , Lunch & Dinner, , , Recipes, , Tagged With:, baked, , , cheese, , , crispy, , , dairy-free, , , dumplings, , , empanadas, , , garlic, , , gluten-free, , , glutenfree, , , savory, , , snack, , , spinach, , , vegan, , , vegetables, , , vegetarian, You may also like:, , , , Previous Post:, « Penne all’ Arrabbiata, Next Post:, Cherry Pie with Juicy Filling (Easy Vegan Recipe) », Reader Interactions, , , , 4.48 from 21 votes (, 8 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , I have read and accepted the, Privacy Policy, *, , , , Notify me of followup comments via e-mail., , , , , , Comments, , , , , , Sara, , , 31. August 2023 at 1:26, , , , Made the recipe exactly as instructed. It was okay, had way too much filling for the dough. I’m open to anyone who can identify the one ingredient that could make this pop. Reading other reviews apparently you have to change this recipe up entirely but I think it’s solid, just bland., , , Reply, , , , , , , , Bianca Zapatka, , , 5. September 2023 at 10:19, , , , Hi there,, when you serve them with, aioli, or another dip, they taste great!, Greetings,, Bianca, , , Reply, , , , , , , , , , Rikita, , , 11. August 2023 at 17:59, , , , fantastic recipe. made my own filling of roasted butternut squash and impossible beef flavored with onion, garlic, seasonings – the works. the dough is immaculate, I think I subbed out about 0.5 oz of vegan butter with olive oil which worked perfectly. I also used whole foods 365 almond milk from the carton instead of water when making the dough and empanadas baked at about 14-16 minutes 390 F great for me in the bella air fryer. I followed the dough recipe pretty precisely, making sure to remove from the fridge after approximately 30 minutes. few things to note – the more thin you roll out your dough, might compromise the structure and flakiness of the empanada, keep it almost thin but thick enough to hold etc. I wish I put half my dough away while I rolled out and stuffed the first half because it felt like it was drying out just a little (not enough for concern), so by the time I got to the second half it just didn’t have the same maximum and freshness of moisture which I’ll be more mindful of next time I make it. Hubby loved it – can’t wait to make this again!!!!!! Thank you Bianca!!!, , , Reply, , , , , , , , Bianca Zapatka, , , 22. August 2023 at 11:55, , , , That’s great! Thanks for your wonderful feedback! 🙂, , , Reply, , , , , , , , , , Mary, , , 7. July 2022 at 0:56, , , , Hi! About how many empanadas does this recipe yield?, , , Reply, , , , , , , , Bianca Zapatka, , , 7. July 2022 at 21:00, , , , Around 15, depending on size., , , Reply, , , , , , , , , , Helen, , , 8. February 2022 at 10:42, , , , Could I freeze these?  If so before or after baking?  Thanks, , , Reply, , , , , , , , Bianca Zapatka, , , 8. February 2022 at 22:34, , , , You can freeze them before baking. Then bake straight from frozen., , , Reply, , , , , , , , , , Marike, , , 11. April 2021 at 8:46, , , , Delicious recipe! I added some sweet potato to the filling., , , Reply, , , , , , , , Bianca Zapatka, , , 11. April 2021 at 22:07, , , , Sounds great! Thank you! 🙂, , , Reply, , , , , , , , , , Breanne craig, , , 4. February 2021 at 19:07, , , , Made your empanadas and they were soooo good! I had to make a few modifications based on what we had on hand. Used oat milk instead of soy and the dough was lovely! We also added black beans, mushrooms, cumin, and smoked paprika to the filling. Love the Turmeric glaze for the top and will definitely be making these again. Thank you!, , , Reply, , , , , , , , Bianca Zapatka, , , 4. February 2021 at 20:13, , , , I’m happy you liked the recipe! Many thanks! 🙂, , , Reply, , , , , , , , , , Eliska, , , 14. September 2020 at 19:44, , , , So delicious! Thank you for this recipe 🤩, , , Reply, , , , , , , , Bianca Zapatka, , , 14. September 2020 at 20:54, , , , So glad you enjoyed it! Thank you! 🙂, , , Reply, , , , , , , , , , Steven Longden, , , 26. August 2020 at 12:03, , , , Good recipe and I am going to try but no oven temperature provided. 🤔, , , Reply, , , , , , , , Bianca Zapatka, , , 26. August 2020 at 20:42, , , , In step 8 you can find the temperature: “Bake them in a preheated oven at 200°C (392°F) for about 20 minutes until golden brown and crispy.”, , , Reply, , , , , , « Older Comments, Primary Sidebar, Follow Me, , Email, Facebook, Instagram, Pinterest, YouTube, , About Me, , Hi! I’m Bianca, and welcome to my blog! I love to cook and bake and want to share that passion with you. Here you’ll find many delicious recipes which are mainly plant-based and easy to make for everyone., Read More…, , , , , Search, , New Posts, , Vegan Fajitas with Sheet Pan Vegetables, Cilantro Lime Rice Recipe, Tabbouleh Salad Recipe Original (quick & easy), , Tags, , autumn, , baked, , berries, , cake, , christmas, , creamy, , crispy, , dairy-free, , dessert, , egg-free, , fall, , fluffy, , fruit, , fruits, , fruity, , garlic, , gluten-free, , green, , sauce, , savory, , snack, , spicy, , spring, , summer, , sweet, , tomato, , vegan, , vegetables, , vegetarian, , winter, , , , , , , , Footer, , txt, , , , Email, Facebook, Instagram, Pinterest, YouTube, , About Me, , Hi! I’m Bianca, and welcome to my blog! I love to cook and bake and want to share that passion with you. Here you’ll find many delicious recipes which are mainly plant-based and easy to make for everyone., , , My Favorites, , , Legal Notice, , Privacy Policy, , Contact, , , Copyright © 2025 Bianca Zapatka, WordPress Betreuung by Florian Salman, , , , , Bianca Zapatka, , , , , , , , , , Search, Home, Browse Recipes, , , Basics, , , Bread, Naan (Flatbread), Pancakes, Pasta Dough, Pizza Dough, Dumpling Wrappers, Vegan Mozzarella, Sponge Cake, Pie Dough, Back, , , Breakfast & Brunch, Appetizers, Sides & Salads, Soup, Stew & Curry, Lunch & Dinner, Pasta & Gnocchi, Quick & Easy, Pizza, Sandwiches & Burger, Fingerfood & Snacks, Cake, Sweets & Dessert, Drinks, Back, , Topics, , , Vegan Protein Sources, Vegan Collagen, Vegan BBQ Recipes, Vegan Pasta Recipes, Best Vegan Cheesecakes, Easy Vegan Recipes, Vegan Cookies, Veganuary Recipes, Vegan Christmas Dinner, Back, , Tips & Tricks, , , How to peel and cook Asparagus, Vegan Baking Tips, Cake Pan Conversion Calculator, Egg Substitutes, Meat Alternatives, Vegan Food Pyramid – Nutrients & Nutrition Facts, Food Storage and Shelf Life – How To Store Food, Back, , Cookbooks, , , Vegan Food Love, Vegan Paradise, Vegan Cakeporn, Vegan Soulfood, Vegan Foodporn, Vegan & Easy, Back, , My App, About me, , , Work with Me, Contact, Newsletter, Back, , , × Close Panel, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: Dough:, Whisk together the flour, baking powder, and salt in a large bowl. Then form a mold in the center of the flour., Melt the vegan butter in a saucepan. Allow to cool slightly, then pour it into the flour mold. Pour in dairy-free milk (or water) and knead everything until a nice smooth dough forms., Then form the dough into a ball, wrap tightly in cling film, and place in the fridge to chill for at least ½ hour.*, Filling:, Thaw and squeeze out the spinach., Peel and finely chop the onion and the garlic., Heat the oil in a pan. Sauté chopped onion and garlic briefly. Then add the spinach and season with salt, pepper, a bit of nutmeg, and chili to taste. Set aside and let cool slightly before adding the vegan cheese., Remove the dough from the fridge and knead again on a lightly floured surface. Then roll it out and cut out 4-inch (10 cm) diameter circles (, I used a big glass to do that, ). Collect the remaining dough and knead it together into a ball. Then roll it out again, and cut out more circles of dough. Continue this process until all of the dough is used up., Place 1-2 tsp of the filling in the center of each dough circle and fold the empanadas into a half-moon shape. Then press the edges together firmly using a fork., Brush a baking tray with oil (, or line it with parchment paper, ) and arrange the stuffed empanadas onto it., Mix the olive oil, soy milk, and turmeric to combine, then brush the filled empanadas with it., Bake them in a preheated oven at 392°F (200°C) for about 20 minutes, until golden brown and crispy. (, Optionally, you can also deep fry them, )., Serve your vegan empanadas hot or cold., Enjoy!, , , Notes, , Instead of all-purpose or spelt flour, you can also use gluten-free (pre-cooked) cornflour, or combine both types of flour. You could also use a gluten-free 1 to 1 all-purpose flour blend, however, I do not recommend using whole grain flour., ",
        "Vegan Black Bean Burrito": "Ingredients:  Instructions: ",
        "Vegan Bean Burrito": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN BEAN BURRITO, SERVES: 1 Prep Time: 10 min.  Cooking Time: 2 min., CONTAINER EQUIVALENTS (per serving):, 1⁄2, 2, 1, 1⁄2, VEGAN CONTAINER EQUIVALENTS (per serving):, 1⁄2, 1⁄2    B  1, 1, 1⁄2, 1, , \u0007(6-inch) sprouted grain (or, gluten-free) tortilla, ¼ cup + 2 Tbsp. \tnonfat refried beans, warm, ¼, , medium avocado, sliced, 1 dash, , chili powder, 1 pinch, , ground black pepper, 1, , lime wedge, 2 Tbsp., , chopped tomato, 2 Tbsp., , chopped red onion, 2 Tbsp., , chopped bell pepper, 2 Tbsp., , \u0007thinly sliced radish, (about 8 slices), 2 Tbsp., , sliced green olives, 2 Tbsp., , fresh cilantro leaves, 1. \t Warm tortilla in medium skillet over medium-high heat for 1 minute on, each side. Set aside; keep warm., 2. \t Spread beans in middle of wrap. Top with avocado. Season with chili, powder, pepper, and a squeeze of lime., 3. \t Top with tomato, onion, bell pepper, radish, olives, and cilantro. Roll, tortilla, tucking in ends as you wrap., RECIPE NOTE:, Place your burrito in the middle of a rectangular piece of aluminum foil., Roll from the bottom up to keep your burrito warm and hold it together as, you eat., NUTRITIONAL INFORMATION (per serving): Calories: 309  Total Fat: 12 g  Saturated Fat: 2 g  Cholesterol: 0 mg  Sodium: 757 mg  Carbohydrates: 40 g  Fiber: 8 g, Sugars: 4 g  Protein: 10 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 15, Instructions: ",
        "Arepas": "Ingredients:  Instructions: ",
        "Vegan Nacho Pizza": "Ingredients: For the pizza crust:, 2, , cups (240 grams), , all-purpose flour, , divided - $0.16, 1, , teaspoon, , dry active yeast, , - $0.20, ½, , teaspoon, , salt, , - $0.01, 2, , teaspoons, , olive oil, , plus a bit more for the bowl - $0.07, ⅔, , cup (160 ml), , warm water, , - $0.00, For the taco meat:, ¾, , cup (50 grams), , TVP (textured vegetable protein), , - $0.85, ½, , cup (120 ml), , water, , - $0.00, 1, , tablespoon, , oil, , - $0.10, ¼, , small onion, , diced - $0.08, 2, , cloves, , of garlic, , minced - $0.16, 3, , tablespoons, , tomato sauce, , - $0.08, 1 ¼, , teaspoons, , smoked paprika, , - $0.12, ¾, , teaspoon, , cumin, , - $0.04, ¾, , teaspoon, , dried oregano, , - $0.08, ¾, , teaspoon, , dried thyme, , - $0.08, ¾, , teaspoon, , salt, , - $0.02, ½, , teaspoon, , chili powder, , - $0.05, A few grinds of pepper, , - $0.01, For the nacho pizza:, 1 ½, , avocados, , - $1.80, The juice of half a lime, , - $0.09, ½, , teaspoon, , salt, , - $0.01, ¼, , small red onion, , diced - $0.08, A, , handful (about 50 grams / 1.8 oz ), , of sliced black olives, , - $0.47, A, , handful (about 100 grams / 3.5 oz), , of sliced cherry tomatoes, , - $0.80, 1, , tablespoon, , jarred sliced jalapeños, , - $0.12, ½, , a red pepper, , diced - $0.35, A, , small bunch, , of fresh cilantro, , - $0.20, Vegan sour cream*, , - $0.50, , For the nacho pizza: Make a simple guacamole by mashing together the avocados, lime juice and salt. Mix in almost all of the red onion (I like to keep a few tablespoons to sprinkle over the top of the pizza). Spread the guacamole over the baked pizza crust and top with the taco meat, chopped veggies, cilantro and drizzle or dollop over the vegan sour cream., , Notes, *You can use a store-bought product like Toffuti or use a cashew sour cream recipe. I made mine with 5 tablespoons soy yogurt, ½ teaspoon white wine vinegar, ½ teaspoon soy sauce, ½ teaspoon lemon juice and ¼ teaspoon salt. It was runnier than regular sour cream but fine for this pizza topping. **Pizza crust recipe from Canadian Living., , , , , , Find us on Instagram, @stingyveganrecipes, , , Find us on Facebook, @thestingyvegan, , Nutrition, Calories:, 364, kcal, |, Carbohydrates:, 47, g, |, Protein:, 12, g, |, Fat:, 14, g, |, Saturated Fat:, 2, g, |, Sodium:, 936, mg, |, Potassium:, 412, mg, |, Fiber:, 8, g, |, Sugar:, 4, g, |, Vitamin A:, 860, IU, |, Vitamin C:, 24.1, mg, |, Calcium:, 66, mg, |, Iron:, 4.3, mg, , Nutritional information is provided as a courtesy and is approximate only. Please refer to our, nutrition disclaimer, for more information., , , We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites., , , «, Curried Rice Vegan Buddha Bowl, 50+ Simple Vegan Recipes, », , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , , , , Karly, , says, , , October 11, 2017 at 3:31 am, , , , This is perfection. I mean, seriously, healthy, nachos and pizza in one name? I've gotta try this!, , , Reply, , , , , , , , Lili, , says, , , April 03, 2019 at 8:10 am, , , , Oooo. I bet this would be great with some type of cornmeal crust..., , , Reply, , , , , , , 4.67 from 3 votes (, 3 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., Primary Sidebar, Search, , PRIVACY POLICY, , , Connect with us!, , Facebook, Instagram, , Get The Cookbook!, , , , , , This page contains affiliate links, meaning, at no additional cost to you, I will earn a commission if you click through and make a purchase. See, disclosure policy, ., , , , Get the 14-day meal plan!, , , Footer, , ↑ back to top, , , , About, , Privacy Policy, Nutrition Disclaimer, Our Cookbook, Recipe Index, Contact, , , , Newsletter, , Sign Up!, for our 5-day guide to saving money and time in your vegan kitchen., , , , , Copyright © 2020, The Stingy Vegan, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: For the pizza crust: Combine 1 ½ cups (180 grams) of the flour, yeast and salt in a bowl. Stir in the olive oil and warm water until you get a rough dough. Turn it out onto a floured counter and add as much of the remaining flour as necessary, while kneading, until you get a soft ball of dough that’s slightly tacky but doesn’t stick to the counter or your hands. Wash out and dry your bowl and lightly coat your dough with olive oil. Leave the dough in the bowl and cover with a towel. Leave to rise for 1 hour to an hour and a half or until the dough roughly doubles in size., Preheat the oven to 260°C (500°F)., Roll out your dough on a lightly oiled pan to about 30 cm / 12 inches (this is a medium-thick crust, you can roll it out bigger for a thinner crust). Use a fork to poke some holes in the base then bake for 10 – 15 minutes or until the crust is golden brown., For the vegan taco meat: Combine the TVP and water in a bowl for a few minutes until the TVP is hydrated. Heat a medium pan over medium-high heat and add the oil",
        "Spring Breakfast Bowl": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., SPRING BREAKFAST BOWL, SERVES: 1 Prep Time: 6 min. Cooking Time: 12 min., CONTAINER EQUIVALENTS (per serving):, 1, ½, 1, 1, 1, 1, ½ cup, , , cooked brown rice, ¼ cup + 2 Tbsp., water, divided use, 10, , , medium asparagus, , , spears, trimmed, 1 tsp., , , olive oil, 1 dash, , , sea salt (or Himalayan, , , salt), divided use, 1 dash, , , ground black pepper, , , , divided use, 2, , , large eggs, ¼, , , medium ripe avocado, , , , sliced, ¼ cup, , , peeled and thinly, , , sliced watermelon, , , radish, ½, , , large grapefruit, cut, , , into 4 wedges, peeled, SPECIAL EQUIPMENT:, Nonstick cooking spray, 1.\t\t Heat a large nonstick skillet over medium-high heat. Add rice and 2 Tbsp., water; cook, stirring constantly, for 3 minutes, until rice is warm. Transfer, to serving bowl; set aside., 2.\t\t Wipe out skillet with a paper towel. Add remaining ¼ cup water and bring, to a simmer over medium-high heat. Add asparagus, cover, and cook for 3, to 4 minutes, until tender-crisp., 3.\t\t Transfer asparagus to serving bowl, drizzle with olive oil, and sprinkle with, 1 pinch salt and 1 pinch pepper., 4.\t\t Lightly coat the same skillet with cooking spray and place over medium, heat. Add eggs; cook them however you prefer, for 3 to 5 minutes, or until, done to your liking., 5.\t\t Arrange eggs on top of asparagus; sprinkle remaining 1 pinch salt and, remaining 1 pinch pepper., 6.\t\t Top with avocado, radish, and grapefruit; serve immediately., NUTRITIONAL INFORMATION (per serving): Calories 426  Total Fat: 22 g  Saturated Fat: 5 g  Cholesterol: 373 mg, Sodium: 338 mg  Carbohydrates: 41 g  Fiber: 8 g  Sugars: 5 g  Protein 20 g, RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 22, Instructions: ",
        "Black Bean Enchilada Bake": "Ingredients: , , , , Scale, , 1x, 2x, 3x, , , , , , , 1 cup, uncooked quinoa, , 2 cups, low sodium vegetable broth, , 1, 15 oz can enchilada sauce or homemade recipe listed below, , 1 tbsp, olive oil, , 1/2 cup, red or white onion, chopped, , 1, bell pepper, chopped, , 2, cloves garlic, minced, , 1, small lime, juiced, , 2, 15 oz can black beans, drained and rinsed, , 1 tsp, salt (I use “Lite Salt”), , 1/4 cup, cilantro, chopped (optional), , , Homemade Enchilada Sauce, , , 2 tbsp, olive oil, , 2 tbsp, gluten free flour (I use glu, ten, free brown rice flour), , 4 tbsp, chili powder* (, homemade chili powder recipe, ), , 1/2 tsp, garlic powder, , 1/4 tsp, salt, , 1/2 tsp, ground cumin, , 1/4 tsp, dried oregano, , 2 cups, low sodium vegetable broth, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , February 26, 2020 at 8:15 pm, , , , , Thank you so much! It’s definitely a great way to use up some veggies!  I hope you enjoy it if you give it a try. ☺, , , Reply, , , , , , , , , , , Andrea, , says:, , , , June 19, 2020 at 4:36 pm, , , , , If I were going to freeze and cook a few days later, how long would you suggest cooking? Thanks!, , , Reply, , , , , , , , , Morgan, , says:, , , , July 4, 2020 at 2:04 pm, , , , , Hi Andrea, I haven’t tried cooking this from frozen before. I would recommend defrosting it overnight in the refrigerator before cooking. Then add 10-15 minutes to the cook time or until it’s heated through., , , Reply, , , , , , , , , , , Candice, , says:, , , , July 19, 2020 at 4:17 am, , , , , I made this tonight, it was so easy and so delicious! Thank you!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , July 24, 2020 at 7:38 pm, , , , , I’m so happy you enjoyed it!  Thank you so much for sharing!, , , Reply, , , , , , , , , , , Marissa, , says:, , , , August 8, 2020 at 10:32 pm, , , , , Could these be made into a freezer meal?, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , August 18, 2020 at 9:52 pm, , , , , Hi Marissa Instructions: , , , , Preheat oven to 350 degrees F., , In a small saucepan, combine quinoa and vegetable broth and bring to a boil. Reduce heat, cover the pan, and simmer for 15-20 minutes until quinoa is fluffy and no liquid remains., , While the quinoa is cooking, chop the onion and pepper. Add olive oil to a pan and saute the onion and pepper until soft (about 5-8 minutes)., , Add garlic and saute for an additional minute., , If making the homemade enchilada sauce, Heat olive oil in a small sauce pan over medium high heat. Add flour and whisk together for one minute. Add in the remaining seasoning and slowly pour in the vegetable broth whisking constantly. Reduce heat and simmer for 10 minutes or until the enchilada sauce has thickened., , Add quinoa, enchilada sauce, sauteed veggies, lime juice, salt, and black beans to a 9×13 Casserole dish and stir to combine., , Bake for 15-20 minutes until heated through., , Optionally top casserole with chopped cilantro., , , , , , , Notes, , , If you are making the homemade enchilada sauce, make sure you know EXACTLY how spicy your chili powder is.  I recommend using a very mild chili powder otherwise your enchilada sauce may be too spicy., , , , , , , , Did you make this recipe?, , Tag, @JustWhatWeEat, on Instagram and hashtag it, #justwhatweeatrecipes, , , , , , , ©, Just What We Eat., All images & content are copyright protected. Please do not use my images without prior permission. If you want to republish this recipe, please link back to this post for the recipe., , LOOKING FOR MORE DELICIOUS VEGAN AND GLUTEN FREE DINNER RECIPES?  CHECK OUT SOME OF MY FAVORITES BELOW!, , White Bean Soup, , Vegetarian Enchilada Casserole, , Black Bean Burgers, , , , , , , 34 Comments, , , , , , , , Marlene, , says:, , , , March 7, 2018 at 12:35 am, , , , , I totally love your recipes!! Thanks and blessings for sharing them! I was just looking at one that calls for vegetable broth. I’ve never heard of it before. Where do you get it? What section of grocery store? Is there a way to make your own? Or can I substitute it for something else? Thanks, Marlene, , , Reply, , , , , , , , , justwhatweeat@gmail.com, , says:, , , , March 7, 2018 at 12:59 am, , , , , Thank you, Marlene!  I usually find vegetable broth over by the chicken and beef broth in my grocery store.  You can substitute chicken or beef broth if you would like.  It’s used for soups and sauce bases often., , , Reply, , , , , , , , , Deb, , says:, , , , August 5, 2022 at 7:45 pm, , , , , Hi Morgan,, This recipe was easy, delicious and a great appetizer served with tortia chips. Followed the recipe but substituted chicken Better Than Bouillon for the vegetable, broth and was great!  Everyone raved about it and look forward to another party to enjoy it again. (next weekend)!, Thank you!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , August 19, 2022 at 11:30 pm, , , , , Hi Deb, I’m so happy to hear that it was a big hit with everyone! Thank you for sharing! ☺, , , Reply, , , , , , , , , , , , , , , Diane, , says:, , , , December 13, 2018 at 1:47 am, , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , December 13, 2018 at 2:00 am, , , , , Yay!  You’re welcome! I’m so glad you liked it.  It’s one of our favorites as well! ?, , , Reply, , , , , , , , , , , Morgan, , says:, , , , July 9, 2019 at 10:30 pm, , , , , Hi Emily, This recipe calls for 1/2 cup of uncooked quinoa.  Which should be about 1 and 1/2 cups of cooked quinoa.  I apologize for any confusion., , , Reply, , , , , , , , , Amy, , says:, , , , February 4, 2020 at 3:46 am, , , , , The recipe says 1 cup uncooked quinoa, but above you say 1/2 cup. Please clarify., , , Reply, , , , , , , , , Morgan, , says:, , , , February 6, 2020 at 8:59 pm, , , , , Hi Amy, I apologize for the confusion. 1 cup uncooked quinoa is the correct amount., , , Reply, , , , , , , , , , , , , Erika, , says:, , , , August 9, 2019 at 8:34 pm, , , , , This looks so good! I love easy to make meals like these that are good for large families. 🙂, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , August 9, 2019 at 8:47 pm, , , , , Thank you so much, Erika!, , , Reply, , , , , , , , , , , Colleen | Bakes & Blunders, , says:, , , , August 9, 2019 at 8:47 pm, , , , , Oh my!  This sounds PERFECT!  I’m currently obsessed with the enchilada sauce from Trader Joe’s and I’ve been putting it on everything., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , August 13, 2019 at 7:14 pm, , , , , Thank you so much!  I could eat enchilada sauce by the spoonful! ☺, , , Reply, , , , , , , , , , , Angela Greven | Mean Green Chef, , says:, , , , August 11, 2019 at 2:02 pm, , , , , Delicious looking recipe and perfect for a family meal night, easy to put together and dish up! As always love your creations 🙂, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , August 13, 2019 at 7:13 pm, , , , , Thank you, Angela!  It’s one of our favorite quick meals!, , , Reply, , , , , , , , , , , Brooke, , says:, , , , February 26, 2020 at 4:06 pm, , , , , , , Reply, , , , , , , , , , , Marie, , says:, , , , January 9, 2021 at 7:26 pm, , , , , Easy to make, and the whole family loved it! Thank you!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Amanda, , says:, , , , February 14, 2021 at 12:49 pm, , , , , How long does it reheat for?, , , Reply, , , , , , , , , Morgan, , says:, , , , February 15, 2021 at 11:22 pm, , , , , Hi Amanda, you can store this in the refrigerator and reheat for 4 days., , , Reply, , , , , , , , , , , Patty O., , says:, , , , May 30, 2021 at 11:25 pm, , , , , Can I make this a day ahead and refridgerate until needed?, , , Reply, , , , , , , , , Morgan, , says:, , , , June 7, 2021 at 11:58 pm, , , , , Hi Patty, , , Reply, , , , , , , , , , , Donna, , says:, , , , May 26, 2022 at 1:46 am, , , , , Our family loves this recipe!  I’ve made it several times and am going to make ahead a freeze for a crowd!  Hoping it turns out as yummy!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , August 19, 2022 at 11:40 pm, , , , , I’m so happy that you all are enjoying this recipe!  It should also freeze well! ☺, , , Reply, , , , , , , , , , , Martisa Browning, , says:, , , , July 22, 2022 at 2:26 pm, , , , , Can you substitute the brown rice for quinoa?, , , Reply, , , , , , , , , Morgan, , says:, , , , August 19, 2022 at 11:32 pm, , , , , Yes, brown rice works great as a substitute for quinoa., , , Reply, , , , , , , , , , , Michelle, , says:, , , , May 13, 2024 at 1:23 am, , , , , This was very good! Used the homemade enchilada sauce recipe that was super easy to make and good. Followed recipe except topped with plant based cheese. Served with fresh salad and blue corn tortilla chips. Great vegan and gluten free recipe!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Reply, , , , , , , , , Morgan, , says:, , , , December 19, 2024 at 8:20 pm, , , , , I’m so glad you enjoyed it!, , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , , Comment, *, Name, *, , Email, *, , Website, , , , , , , , , , , , , , Search for:, , , , , Search, , Recent Posts, Easy Gluten Free and Vegan Potato Soup, September 30, 2024, Gluten Free and Vegan Cream Cheese Frosting, May 6, 2023, Recipe for Gluten Free Peanut Butter Cookies, May 6, 2023, Tasty Tofu Marinade Recipe in Just 5 Steps, October 11, 2022, Simple Guide To Make Kombucha Tea at Home, September 12, 2022, Let’s Stay Connected!, Facebook, Instagram, Pinterest, , , , , , , , , , , , , , , , , , , , , , , Facebook, , Facebook, Pinterest, , Pinterest, Instagram, , Instagram, , , , , , , , , , , , , , , , , , © 2025 Just What We Eat, PRIVACY POLICY & DISCLOSURE, , , , , , , , , , , , , , , , , , , , , , , , , , , About, Expand child menu, Expand, , , , About Morgan, , New? Start here!, , Contact Me, , Work With Me, , Privacy Policy, , , , Recipes, Expand child menu, Expand, , , , Breakfast, , Main Dishes, , Dessert, , Side Dish Recipes, , Snack Recipes, , Drinks and Smoothies, , Seasoning Mixes, , , , Recipes by Allergy, Expand child menu, Expand, , , , Top 8 Allergen Free, , Gluten Free and Dairy Free, , Gluten Free & Vegan, , Nut Free Recipes, , , , Shop, Expand child menu, Expand, , , , The Ultimate Guide to Going Gluten Free, , Simply Delicious Gluten Free Meal Plans, , Meal Planning Made Simple, , Resource Library Access, , Recipe Binder with 41 Gluten Free and Dairy Free Recipes, , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it., Ok, , , , , ,"
    }
}