{
    "ingredients": {
        "Red Enchilada Sauce": "olive oil, yellow onion, garlic, veg broth, tomato sauce, chipotle peppers in adobo sauce, oregano",
        "Vegan Cashew Queso": "cashews, nutritional yeast, taco seasoning, apple cider vinegar, oat milk, salsa",
        "Sweet Potato and Roasted Red pepper dip": "red bell peppers,sweet potato,tahini paste,lemon juice,garlic",
        "Vegan Refried Beans": "onion, green bell pepper,garlic,pinto beans,lime",
        "Roasted Tomatillo Salsa": "Tomatillo,onion,jalapeno,cilantro,garlic"
    },
    "recipe_url": {
        "Red Enchilada Sauce": "https://www.acouplecooks.com/homemade-enchilada-sauce/",
        "Vegan Cashew Queso": "https://wholesomecrumbs.com/cashew-queso-vgf/",
        "Sweet Potato and Roasted Red pepper dip": "fixate_recipes\\Side and Snack\\FXR-EN-Sweet_Potato_and_Roasted_Red_Pepper_Dip-05.26.20-Recipe.pdf",
        "Vegan Refried Beans": "fixate_recipes\\Side and Snack\\FXR-EN-Vegan_Refried_Beans-07.23.20-Recipe.pdf",
        "Roasted Tomatillo Salsa": "fixate_recipes\\Sauce and Dressing\\FXR-EN-Roasted_Tomatillo_Salsa-10.15.20-Recipe.pdf"
    },
    "Recipe": {
        "Red Enchilada Sauce": "Ingredients: huge, flavor. This full-bodied sauce is zingy, zesty, and you’ll never want to stop eating it., , What’s in a red enchilada sauce?, , Guess what? You don’t need canned tomatoes to make this enchilada sauce. All you need is tomato paste, , vegetable broth, and some seasonings. Because you’re using tomato paste which is naturally sweeter, you’ll only need to simmer the sauce for 15 minutes. It turns into a full-flavored sauce with a creamy texture and a zesty flavor that’s irresistible. Here’s all you need for this sauce:, , Yellow onion and garlic, Olive oil, (to saute), Vegetable broth, Tomato paste, Adobo sauce, (from a can of chipotle peppers; see below), Spices:, cumin, oregano, garlic powder, and chili powder, , All you’ll have to do is saute the onion and garlic for 5 minutes, , , Why make homemade enchilada sauce?, , When it’s easy to find packaged enchilada sauce, why make it at home? Lots of reasons. Here’s why we’re now converts to making homemade enchilada sauce:, , There’s no MSG or preservatives., You know exactly what’s going into this sauce: it’s all natural!, It’s vegan and gluten-free., Many red enchilada sauce recipes are vegan, but many are not gluten-free because they use flour as a thickener. This one has no need for flour or cornstarch!, It’s cheaper., When we priced out the enchilada sauce at our local grocery, 3 cups (to make our, vegan enchiladas, ) would be about $12. This homemade enchilada sauce is about $5, depending on your local grocery store., , So, set aside 25 minutes and make this enchilada sauce the night before! It’s totally worth the time investment., , , What is adobo sauce?, , Adobo sauce is a tomato-chili sauce that brings savory, smoky flavor to Mexican dishes. It’s packaged inside a can of chipotle chilis! Here’s some info about using adobo sauce in recipes:, , Chipotles in adobo sauce, are sold in most grocery stores here in the US, available near the Mexican products. The can includes, chipotle chiles, : smoked and dried jalapeños that are rehydrated and canned, and, adobo sauce, , a purée of tomato, vinegar, garlic, and other spices., This recipe calls for adobo sauce only., You’ll just use a tablespoon to pull out just the sauce from the can. The sauce is lightly spicy, but not nearly as spicy as the chipotle peppers! Each brand of can has different amounts of adobo sauce, so you’ll have to experiment and find your favorite., Refrigerate or freeze the remainder., You can use the remaining adobo sauce and chipotle peppers in recipes! See below for our favorite adobo sauce recipes., , Use this sauce in our best, vegan enchiladas, !, , How to serve this homemade enchilada sauce, , Enchiladas are one of our favorite recipes to make, because they always, always impress! Here are a few we’d recommend:, , Vegan Enchiladas, Who needs cheese? These are so full of flavor, everyone, loves, them!, Vegetarian Skillet Enchiladas, Make enchiladas in a skillet instead!, Sweet Potato Black Bean Enchiladas, Substitute red enchilada sauce for green in this fan favorite recipe., Vegetarian Enchiladas with Quinoa, This meaty filling would be perfect with a red enchilada sauce instead of green., , , More recipes with adobo sauce!, , You’ll use only 1 ½ tablespoons of adobo sauce in this recipe: so you’ll have plenty to use in other recipes! You can also use the chipotle chilis: finely mince them and add them to, salsa, ., , Vegetarian Tortilla Soup, A swirl of adobo sauce makes the flavor of this fan favorite soup!, Chipotle Stuffed Delicata Squash, Paint adobo sauce on squash, then stuff it with black beans and rice., Quinoa Chili, Adobo sauce is perfect to bring flavor to plant-based chili., Chipotle Quesadilla with Avocado, Top this avocado quesadilla with, chipotle sauce, ., For more, …., Everything You Can Do with a Can of Chipotles in Adobo | Serious Eats, , This homemade enchilada sauce recipe is…, , Vegetarian, vegan, plant-based, dairy-free, and gluten-free., , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Email, *, Save, , Print, , Homemade Enchilada Sauce, , , , , , , , , Pin Recipe, , , , , , Print Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , No reviews, , , , This red homemade enchilada sauce has the best flavor! It’s all natural, cheaper than store-bought, and quick and easy to make., , , , , Author:, , Sonja Overhiser, , Prep Time:, , 5 minutes, , Cook Time:, , 20 minutes, , Total Time:, , 25 minutes, , Yield:, , About, 3 cups, , 1, x, , Category:, , Sauce, , , , , , Scale, , 1x, 2x, 3x, , , , , , , 3 tablespoons, olive oil, , 1 cup, minced yellow onion (, 1/2, large), , 3, garlic cloves, , 3 cups, , vegetable broth, , 6 ounce, can tomato paste (, 10 tablespoons, ), , 1 ½ tablespoons, adobo sauce (from, 1, can chipotle peppers in adobo sauce), , 1 tablespoon, cumin, , ½ tablespoon, oregano, , ½ tablespoon, garlic powder, , ½ tablespoon, chili powder, , ½ teaspoon, , kosher salt, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , adobo sauce, cumin, oregano, garlic powder, chili powder, and, kosher salt, . Bring to a simmer, where the sauce is gently bubbling, and simmer for 15 minutes., , Carefully transfer the contents to a blender (use a ladle to keep from splashing). Blend until smooth. Use immediately or place in a jar and refrigerate for up to 2 weeks., , , , , , , , , , Did you love this recipe?, , Get our, free newsletter, with all of our best recipes!, , , , vegan, vegetarian, gluten free, Published on, January 20, 2020, / Last updated on, January 16, 2021, Categorized In:, , Cooking Basics, , Recipes, About the authors, Alex & Sonja, Hi! We’re Alex & Sonja Overhiser, authors of the acclaimed cookbooks, A Couple Cooks, and, Pretty Simple Cooking, —and a real life couple who cooks together. We founded the A Couple Cooks website in 2010 to share seasonal recipes and the joy of home cooking. Now, we’ve got over 3,000 well-tested recipes, including Mediterranean diet, vegan, vegetarian, pescatarian, smoothies, cocktails, and more!, , About Us, Cookbook, , , , Leave a Comment, Cancel reply, Name, , , Email, , , Comment, , , Recipe rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 3 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 2 Stars, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 1 Star, , , , , , Display a, Gravatar, image next to my comments., , , , , , , , 7 Comments, , , , , , , Susan NLN, , says:, , , , May 30, 2022 at 7:11 pm, , , , , Where is the amount of sodium per serving?, , , Reply, , , , , , , , Alex Overhiser, , says:, , , , May 31, 2022 at 10:33 am, , , , , cheese or broth can have vastly different amounts and we don’t want to give false information. 1 teaspoon of kosher salt has 1920 mg of sodium if that is helpful., , , Reply, , , , , , , , , , Lea, , says:, , , , May 10, 2022 at 11:09 am, , , , , Do you use the chipotle peppers along with the adobo sauce or discard the peppers?, , , Reply, , , , , , , , Alex Overhiser, , says:, , , , May 10, 2022 at 11:48 am, , , , , Just the sauce. You can freeze the remaining sauce and peppers until the next use (the peppers are VERY spicy though so we often only use the sauce)., , , Reply, , , , , , , , , , Sarah, , says:, , , , September 6, 2021 at 1:41 pm, , , , , Can leftovers be frozen?, , , Reply, , , , , , , , Lisa D., , says:, , , , March 5, 2020 at 11:19 am, , , , , How long can you keep a can chipotle peppers in adobo sauce once it has been opened?, , , Reply, , , , , , , , Alex Overhiser, , says:, , , , March 5, 2020 at 8:59 pm, , , , , We keep our in the freezer indefinitely, or covered in the fridge for several weeks., , , Reply, , , , , , , , Alex & Sonja, Hi! We’re Alex & Sonja Overhiser, authors of the acclaimed cookbooks, A Couple Cooks, and, Pretty Simple Cooking, —and a real life couple who cooks together. We founded the A Couple Cooks website in 2010 to share seasonal recipes and the joy of home cooking. Now, we’ve got over 3,000 well-tested recipes, including Mediterranean diet, vegan, vegetarian, pescatarian, smoothies, cocktails, and more!, , About Us, Cookbook, , Popular Posts, 50 Easy Mediterranean Diet Recipes, 25 Popular Pizza Toppings, 50 Smoothie Recipes, , Veggie Love, 50 Easy Vegan Recipes, 60 Best Salad Recipes, 50 Great Vegetable Recipes, , Trending Now, 20 Healthy Soup Recipes Everyone Will Love, 21 Warming Winter Recipes, 21 Cozy Winter Soup Recipes, Subscribe, Get recipes worth repeating and more from A Couple Cooks, straight to your inbox., Please enable JavaScript in your browser to complete this form., Email, *, GDPR Agreement, *, Yes, send me the latest recipes by email., *, Subscribe, , A Couple Cooks, Recipes that make your life better!, , , , , Recipes, , , All Recipes, , Dinners, , Drinks, , Recipes by Type, , Side Dishes & Salads, , Appetizers & Snacks, , Breakfast & Brunch, , Lunch Recipes, , Desserts, , Baked Goods, , Mediterranean Diet, , Pescatarian Recipes, , Vegetarian Recipes, , Vegan Recipes, , Gluten Free Recipes, , High Protein, , Cooking Basics, , , , Dinners, , , All Dinner Recipes, , Fast Dinner Ideas, , Special Dinners, , Vegetarian Dinners, , Vegan Dinners, , Gluten Free Dinners, , Pasta Recipes, , Tofu Dinners, , Chicken Dinners, , Seafood Dinners, , , , Drinks, , , All Drinks, , Cocktails, , Smoothies, , Coffee, Tea & More, , Liquor Guides, , , , More, , , Start Here, , Editorial Policy, , Why to Trust Us, , Accessibility Statement, , How To, , Other, , , , —, , Cookbook!, , About, , Contact, , Subscribe, , , , Back to Top, , © 2025 - A Couple Cooks® ·, Privacy Policy & Disclosure, , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , Stovetop, , Cuisine:, , Mexican, , , , , , , , , , , Mince the onion, ., Mince the garlic, ., , In a saucepan, heat the olive oil over medium heat. Add the onions and saute for 5 minutes until golden and tender but not browned. Add the garlic and saute for 1 minute., , Carefully pour in the, vegetable broth, ",
        "Vegan Cashew Queso": "Ingredients: REALLY good. It really is the best vegan cashew queso., , It’s SO CHEESY, creamy, packed with flavor and so much healthier than any cheese dip!, , What’s in it?, First, can we just take a minute to bow down to, cashews, ? I LOVE using cashews in my recipes! They are so creamy when boiled and mixed up in a blender. You can totally transform the taste and they are loaded with nutrients!, , They are a good source of, heart-healthy fats, magnesium, zinc, protein and antioxidants., I highly suggest buying them raw., , , Next in line-, nutritional yeast., If you’re not new to vegan cooking, you’ve probably heard of nutritional yeast but if you are new to this, nutritional yeast is an inactive yeast that has a cheesy/nutty flavor., It’s important to note that not all nutritional yeast is created equal!, , , Some are fortified, some aren’t. I personally like to use one that is non-fortified. Aside from the added synthetic vitamins, nutritional yeast is actually naturally full of vitamins and minerals (although b12 is not naturally occurring in any plant-based food)., , Given the extra b-vitamins, one could argue that the fortified yeast’s have health benefits but my personal opinion is to go non-fortified because some people don’t handle all of those synthetic vitamins very well. Again, that is just my opinion but I do believe the fortified ones can be a great option for some people!, , How to Make, , There are, 3 main steps, to this recipe., , First, boil your cashews. Second, heat it up! I like to reuse the pot I boiled the cashews in because, less dishes=happy mama., , After the cashews are done, about 20 minutes, drain and rinse and set aside to cool for about 5 minutes. Once cooled, except salsa, into the food processor/high speed blender. Blend until smooth., , Once the cashew queso is smooth, transfer it to the same pot you boiled the cashews in and turn the stove to medium-low. I like to add my salsa at this point for a chunky queso, but if you want your dip really smooth you can blend it in the blender., , The possibilities are endless with this queso dip! Use in taco bowls, dip for chips/veggies, drizzle over steamed veggies, get creative!, , , , , , , The Best Vegan Cashew Queso [GF], , , Vegan, gluten-free and oil-free super tasty vegan cashew queso dip. Ready to devour in about 30 minutes!, , , 5, from, 7, votes, , , , Print Recipe, , Pin Recipe, , , , , , Prep Time, 5, minutes, , mins, Cook Time, 25, minutes, , mins, Total Time, 30, minutes, , mins, , , , , , , Course, Appetizer, Side Dish, , , , , , Servings, 4, , people, , , , Equipment, food processor, , , 3/4, , cup, , raw cashews, 1/3, , cup, , + 3 tbsp nutritional yeast, 2, , tbsp, , taco seasoning, , use a quality taco seasoning- It makes a difference!, 1/4, , tsp, , salt + more to taste, 1, , & 1/2 tbsp apple cider vinegar, 1/4, , tsp, , garlic powder, 1/2, , tsp, , fresh chopped garlic, , or about 1 clove, Pinch, , of turmeric for color, , optional, 1, , cup, , unsweetened plant-based milk, , I use oat milk, 1, , cup, , chunky salsa, , Transfer queso dip to a pot and heat over medium-low. Stir in salsa and serve when hot., , Notes, , This will thicken when heated., , For leftovers: stir very well. You may need to add a little bit of plant-based milk when you reheat it as it will thicken as it sits., , , , , , Keyword, dips, Gluten Free, Oil Free, queso, , Reader Interactions, Comments, , , , , , alyssa, , says, , , January 18, 2021 at 10:29 pm, , , , , , Reply, , , , , , , , Alexandria McAndrew, , says, , , January 19, 2021 at 1:41 am, , , , I am so glad you enjoyed it! Thank you for letting me know! 🙂, , , Reply, , , , , , , , , , Kristina A Morocco, , says, , , January 20, 2021 at 8:09 pm, , , , I don’t usually eat vegan so i was skeptical about this….but OH MY GOSH. Prefer this to the real thing! So so good!, , , Reply, , , , , , , , Alexandria McAndrew, , says, , , January 21, 2021 at 2:59 am, , , , Woohoo!, , , Reply, , , , , , , , , , Diana, , says, , , February 20, 2021 at 4:12 pm, , , , I made this Super Bowl Sunday for my roommates and I. They’re trying the vegan life and one of them is lactose intolerant so I thought “why not try this out?” It was easy to make, everything you need is most likely already in your pantry, and it was not time consuming at all. The final product was so creamy and you can hardly tell it isn’t the real thing. You do have to make sure you blend as much as possible to get the extra creamy consistency and a very good taco seasoning really does make all the difference. Everyone loved it and I was in awe. I know I’ll be making it for all of my post Covid get togethers.  Thanks for the recipe!, , , Reply, , , , , , , , Alexandria McAndrew, , says, , , February 23, 2021 at 1:19 am, , , , Yay! I am so happy everyone loved it! Thank you so so much for your rating and comment, Diana! 🙂, , , Reply, , , , , , , , , , Martina, , says, , , November 27, 2022 at 3:55 pm, , , , Hi. I took this to a party last night, and IT WAS GONE!! So many Vegan-skeptics were in awe! Delish!, , , Reply, , , , , , , , Nancy, , says, , , November 29, 2022 at 9:56 pm, , , , Will it turn out without the yeast? It’s msg and I’m allergic to it., , , Reply, , , , , , , , Shannon, , says, , , December 25, 2022 at 7:38 am, , , , I made this for an appetizer on Christmas Eve. My sister and her family are vegan and they LOVED it! Actually, everyone loved it. Super easy to make, even easier to polish off the entire container. I look forward to doing this again and I will use a spicier salsa next time just to change it up., , , Reply, , , , , , , , alisa haitoff, , says, , , March 8, 2023 at 12:25 am, , , , I totally forgot the taco seasoning!It still tastes good, but I felt something was missing. Is it possible to add it after it’s done? Thanks for this cool vegan recipe! Finally a recipe that actually tastes like cheese, mild, but good., , , Reply, , , , , , , , Melissa, , says, , , August 6, 2023 at 9:24 pm, , , , This is the best vegan queso dip I ever had.  This makes being  whole foods plant based much easier.  My husband kept asking me if I was sure it was vegan! Thank you so much for this recipe., , , Reply, , , , , , , , Josie, , says, , , February 24, 2025 at 5:21 am, , , , OH MY GOODNESS!!!  This is hands down the best queso I’ve EVER had.  Gotta love vegan recipes that are better than the “real” thing!, , , Reply, , , , Trackbacks, , , , , , Vegan Queso Mac and Cheese [GF, Oil-Free] | Wholesome Crumbs, , says:, , , , September 10, 2020 at 2:58 pm, , , , , […] this recipe, I used my vegan cashew queso recipe (with some slight modifications) as the cheese […], , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, Search..., , About Me, , , , Welcome! My name is Ali and I developed Wholesome Crumbs to provide classic comfort food treats and dishes that are made  out of, plant based whole foods., , All of the recipes you find on Wholesome Crumbs are, vegan and free of processed flours and sugars, . Most are, oil-free and gluten-free, too!, , I put a large emphasis on simplicity and ease and proving that, vegan comfort food can taste even better than the classics!, , Read more about my recipes, , , , , , , , Pages, , , About Me, , Contact Me, , Most Recent Recipes, , Privacy Policy, , , , , Recent Posts, , , , Healthier Vegan “Nutella” Stuffed Cookies [GF], , , , Pumpkin Cheesecake Mousse Parfait, , , , Best Ever Dairy and Gluten-Free Brownies, , , , Healthier Copycat Kudos Bars [vegan, gluten-free, no bake], , , , Healthy Greek Yogurt Banana Pancakes, , , , , Copyright © 2025 · Wholesome Crumbs · Site done by Eilar Web Solutions, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 66786, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it., Ok, Privacy policy, , Instructions: , Add raw cashews and water to a pot. Cover and bring to a boil., Reduce heat to medium and boil cashews for about 20 minutes., When the cashews are done boiling, rinse and drain and then let them cool for about 5 minutes.",
        "Sweet Potato and Roasted Red pepper dip": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or ﬁsh. Please read product labels for each ingredient to ensure this to be the case., PF, SWEET POTATO AND ROASTED RED PEPPER DIP, SERVES: 12 (approx. ¼ cup each) Prep Time: 5 min.  Cooking Time: 20 min., CONTAINER EQUIVALENTS (per serving):, 1⁄2, 1, VEGAN CONTAINER EQUIVALENTS (per serving):     B  1⁄2, 1, 2, whole red bell peppers, 2 cups, mashed sweet potato (approx. 3, medium; skins removed), ¼ cup, tahini paste, 2 Tbsp., fresh lemon juice, 1 Tbsp., extra-virgin olive oil, 2 cloves, garlic, 1½ tsp., sea salt (or Himalayan salt), 1 tsp., ground cumin, 1 tsp., ground smoked paprika, ½ tsp., ground black pepper, SPECIAL EQUIPMENT:, Aluminum foil, 1.   Preheat oven to 450° F (or your oven’s hottest setting)., 2.   Line a baking sheet with foil; set aside., 3.   Place oven rack on the top position about 4 inches from the broiler. Lay, peppers on foil-lined baking sheet. Roast for 15 to 20 minutes or until, skins are black. Once darkened remove from the oven; set aside until, peppers are cool enough to handle., 4.   Remove seeds and stems from peppers, and scrape away charred skin., 5.   Place peppers, sweet potato, tahini paste, lemon juice, oil, garlic, salt, , cumin, paprika, and pepper into a food processor and process until, smooth., 6.   Serve immediately, or store refrigerated in an airtight container for up to 4, days., RECIPE NOTE:, This is a perfect way to use meal-prepped sweet potatoes., NUTRITIONAL INFORMATION (per serving): Calories: 91  Total Fat: 4 g  Saturated Fat: 1 g Cholesterol: 0 mg  Sodium: 20 mg  Carbohydrates: 13 g  Fiber: 2 g, Sugars: 4 g  Protein: 2 g, RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 14, Instructions: ",
        "Vegan Refried Beans": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., VEGAN REFRIED BEANS, SERVES: 5 (approx. ¾ cup each) Prep Time: 5 min. Cooking Time: 10 min., CONTAINER EQUIVALENTS (per serving):, 1, 1, VEGAN CONTAINER EQUIVALENTS (per serving):, 1, 1, 1 Tbsp., , olive oil, 1 cup, , chopped onion, , , (approx. 11⁄3 medium), ¼ cup, , chopped green bell pepper, , (approx. 1⁄3 medium), 2 cloves, , garlic, finely chopped, ½ tsp., , sea salt (or Himalayan salt), 2 cups, , canned pinto beans, , , (reserve liquid), ¼ tsp., , ground smoked paprika, ¼ cup, , chopped fresh cilantro, ½, , medium lime, cut into 5 wedges, 1.\t\t Heat oil in a large nonstick skillet over medium heat., 2.\t\t Add onion, bell pepper, garlic, and salt; cook for 5 minutes, or until soft., 3.\t\t Add beans, along with their liquid, and paprika; cook another 5 minutes., 4.\t\t Transfer vegetable mixture to a food processor; process until smooth., Return to skillet and heat through (if desired)., 5.\t\t Serve garnished with cilantro and a lime wedge., NUTRITIONAL INFORMATION (per serving): Calories: 123  Total Fat: 3 g  Saturated Fat: 0.5 g  Cholesterol: 0 mg, Sodium: 492 mg  Carbohydrates: 19 g  Fiber: 5 g  Sugars: 3 g  Protein: 5 g, RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 25, Instructions: ",
        "Roasted Tomatillo Salsa": "Ingredients: gluten-free, since foods are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., ROASTED TOMATILLO SALSA, Serves: 12 (approx. 2 Tbsp. each), GF, V, VG, Total Time: 15 min., Prep Time: 5 min., Cooking Time: 10 min., 4, medium tomatillos, ½, medium onion, quartered, 1, medium jalapeño, halved, seeded, ½ cup, fresh cilantro, 3 cloves, garlic, 1 tsp., olive oil, ½ tsp., sea salt (or Himalayan salt), SPECIAL EQUIPMENT: Parchment paper, 1., Preheat broiler., 2., Line a baking sheet with parchment paper; set aside., 3.\t Remove husks from tomatillos; rinse under warm water., 4.\t \u0007Arrange tomatillos, onion, and jalapeño on baking sheet; broil for 8 to 10 minutes, rotating pan if needed, , until tomatillos are soft and slightly charred., 5.\t \u0007Place tomatillos, onion, jalapeño, cilantro, garlic, oil, and salt in a blender; cover with lid and a clean towel., Pulse until smooth., RECIPE NOTE: This salsa pairs great with tacos and burrito bowls, and tastes great as a sauce for chicken!, Instructions: "
    }
}