{
    "ingredients": {
        "Tofu Steaks with Avocado Chimichurri": "tofi, soy sauce, maple syrup, onion powder, nutritional yeast, thyme dried, cilantro, parsley, onion, garlic, lemon juice, avocado, dried oregano",
        "Corn Elote Nachos": "corn, jalapenos, vegan mayo, vegan sour cream, vegan cheese, vegan feta",
        "Fixate Vegan Kale Nachos": "kale,cauliflower,taco seasoning,roma tomatoes, onion,black beans,vegan nacho cheese dip, lime juice",
        "Spicy Black Bean Nachos": "black beans, onion, garlic cloves, chipotles in adobo, tortilla chips, Shredded cheese, tomatillos, avocado, cilantro, tomato, jalapeno, lime"
    },
    "recipe_url": {
        "Tofu Steaks with Avocado Chimichurri": "https://healthiersteps.com/recipe/tofu-steaks-with-avocado-chimichurri/",
        "Corn Elote Nachos": "https://www.pinterest.co.uk/pin/496592296426661368/",
        "Fixate Vegan Kale Nachos": "fixate_recipes\\Lunch\\FXR_Fixate_Vegan_Kale_Nachos_R_02.2021.pdf",
        "Spicy Black Bean Nachos": "https://www.mexicanplease.com/spicy-black-bean-nachos/"
    },
    "Recipe": {
        "Tofu Steaks with Avocado Chimichurri": "Ingredients: For The Tofu, 1, , pound, , super-firm tofu, , sliced into 8 pieces, 2, , tablespoons, , Bragg liquid aminos, , or Tamari, or soy sauce, 1, , tablespoon, , maple syrup, 1, , teaspoon, , roasted sesame oil, 1, , teaspoon, , onion powder, 1, , teaspoon, , garlic powder, 1, , teaspoon, , ground paprika, 1, , teaspoon, , nutritional yeast flakes, , optional, 1/2, , teaspoon, , cumin, 1/2, , teaspoon, , dried thyme, For The Chimichurri Sauce, 1, , cup, , cilantro leaves, , chopped, 1/2, , cup, , fresh parsley, , chopped, 2, , tablespoons, , onion, , chopped, 3, , cloves, , garlic, , minced, 1/4, , cup, , extra-virgin olive oil, 2, , tablespoons, , lemon juice, 1, , medium avocado, , pitted and chopped, 1/2, , teaspoon, , dried oregano, 1/4, , teaspoon, , Cayenne pepper, , optional, 1/2, , teaspoon, , salt,  Instructions: To Prepare The Tofu, Preheat oven 400 degrees. Line baking sheet with parchment paper and lightly brush with oil or spray. Set aside. Drain, press tofu (if not super-firm) and cut on the narrow side into about 8 slices., Combine Bragg’s liquid aminos, maple syrup, sesame oil, onion powder, garlic powder, paprika, nutritional yeast flakes, cumin and thyme in a small bowl and mix well., Brush marinade on tofu slices and allow to marinate for 20 minutes. Meanwhile, prepare the chimichurri sauce., To Prepare The Chimichurri Sauce, To prepare the avocado chimichurri, add cilantro, parsley, onion, garlic, olive oil, lemon juice, avocado, oregano, cayenne pepper and salt to a high-speed blender or food processor and process until smooth or chunky., Place tofu slices onto a baking sheet and brush with oil. Bake for 30 minutes, turning halfway. Serve tofu topped with avocado chimichurri., , , Nutrition, Calories:, 169, kcal, |, Carbohydrates:, 7, g, |, Protein:, 6, g, |, Fat:, 14, g, |, Saturated Fat:, 2, g, |, Polyunsaturated Fat:, 3, g, |, Monounsaturated Fat:, 8, g, |, Sodium:, 154, mg, |, Potassium:, 194, mg, |, Fiber:, 3, g, |, Sugar:, 2, g, |, Vitamin A:, 643, IU, |, Vitamin C:, 10, mg, |, Calcium:, 92, mg, |, Iron:, 1, mg, , , , , , , , , , Michelle Blackwood, RN, , , Hi, I’m Michelle, I’m the voice, content creator and photographer behind Healthier Steps. I share vegan and gluten-free recipes because of past health issues. My goal is to help you make healthier choices and show you how healthy eating is easy and delicious., , , , , Facebook, , , , , X, , , , , Instagram, , , , , Linkedin, , , , , Pinterest, , , , , , , , Post navigation, , Previous, , Previous, Vegan Gluten-Free Blueberry Pineapple Bread, Next, Continue, , Vegan, Gluten-Free Blackberry Cake, , , , , , Similar Posts, , , , , , , , , , , , , , Teriyaki Noodles, , , , , , , , , , , , , , , How To Freeze Butternut Squash, , , , , , , , , , , , , , , Chickpea Stew (Vegan, Gluten-free), , , , , , , , , , , , , , , Zucchini and Green Peas Coconut Curry, , , , , , , , , , , , , , , Vegan Red Lentil Curry, , , , , , , , , , , , , , , Cauliflower Rice Curry, , , , , , , , , , , , , , 14 Comments, , , , , , , , Mischa, , says:, , , , August 16, 2021 at 4:21 pm, , , , , This was AWESOME!  The Tofu marinade was fantastic and the chimichurri sauce, OH MY HEAVENS!!! I was in heaven! I am going to triple the sauce and use it on chicken and even as a dip for veggies.  Hands down the best tofu marinade I have had so far.  I am new to tofu due to new dietary restrictions, and have been scared to death to try new ideas.  This one hit it out of the park for me. Thanks so much for the recipe and I can’t wait to try others you have!, , , Reply, , , , , , , , , Michelle Blackwood, RN, , says:, , , , August 16, 2021 at 8:48 pm, , , , , Mischa, I’m so happy it turned out great for you. I really appreciate your feedback. Thank you., , , Reply, , , , , , , , , , , Joe, , says:, , , , February 11, 2021 at 1:48 am, , , , , Wow! This was delicious. I’ve cooked a lot of tofu in my life, and this is probably the tastiest I’ve ever had. We served it over rice noodles. Both the chimichurri and the tofu marinade would go well with all kinds of other dishes. Thank you Michelle! I look forward to trying some of your other recipes., , , Reply, , , , , , , , , Michelle Blackwood, RN, , says:, , , , February 11, 2021 at 7:10 pm, , , , , Joe, I’m so happy you enjoyed it. Sounds great served with rice noodles. Thank you for sharing your feedback., , , Reply, , , , , , , , , , , Heidi, , says:, , , , June 24, 2020 at 3:13 pm, , , , , I do meal prep for local families and this recipe was an absolute favorite!  I’ve been asked to make the sauce on a regular basis and offer it a la cart. The chimichurri is perfect for this meal, but just as delicious as a sandwich spread and direct chip dip. So good and a great way to use up quickly ripe avocados. A+, , , Reply, , , , , , , , , Jg, , says:, , , , August 5, 2018 at 1:50 pm, , , , , This was seriously amazing!! I didnt want to brush my teeth before going to bed because I wanted to keep the flavor in my mouth! I made it with basmati rice! Looking forward to cook it again!, , , Reply, , , , , , , , , Michelle Blackwood, , says:, , , , August 5, 2018 at 3:00 pm, , , , , Wow Jg, love your feedback, you have me cracking up!!! Thank you., , , Reply, , , , , , , , , , , Nikki, , says:, , , , May 15, 2018 at 12:03 pm, , , , , This was delicious!!!  My male friend loved this! I used what I had at the house so I used smoked paprika.  It added a great flavor.  My chimichurri ended up being more of a pesto.  I added some leftover pistachios and spinach.  It still turned out delicious.  Thank you for this recipe., , , Reply, , , , , , , , , Michelle Blackwood, , says:, , , , May 15, 2018 at 12:17 pm, , , , , Niki, I love that you and your friend loved it. Love your variation of the chimichurri sauce. Thank you very much for your response., , , Reply, , , , , , , , , , , Cassie larson, , says:, , , , April 3, 2018 at 10:14 pm, , , , , These are absolutely delicious. The chimichurri sauce is insane. It’s one of my favorite sauces and it just works so perfectly with the tofu in that marinade. It’s perfect, if you ask me. Thank you for this. It’s already made it into my weekly rotation., , , Reply, , , , , , , , , Michelle Blackwood, , says:, , , , April 3, 2018 at 10:40 pm, , , , , Cassie, thank you very much for your feedback, I’m so happy you love it!, , , Reply, , , , , , , , , Gerry, , says:, , , , September 8, 2019 at 11:58 am, , , , , I’m cooking for 1 and tend to have for several days. How long will chimichurri last in fridge for leftovers?, , , Reply, , , , , , , , , Michelle Blackwood, , says:, , , , September 8, 2019 at 12:05 pm, , , , , Gerry it should last you at least a week refrigerated., , , Reply, , , , , , , , , , , Angelique, , says:, , , , June 25, 2023 at 11:39 am, , , , , Thank you for this healthy recipe, , , Reply, , , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , , , , , , , , , , , , , , , , , , Hi, I'm Michelle, , , , Registered Nurse, Content Creator + Visionary behind Healthier Steps, and devoted wife + mom to 2 amazing kids. I share gluten-free + plant-based recipes that equal parts healthy and full of flavor., , , , About Michelle, , , , , , , , , , , , , , , , , Reader Favorites, , , , , , , , , , Zucchini Potato Fritters, , , , , , , , , , , , , , Vegan Jamaican Saltfish Rundown, , , , , , , , , , , , , , Vegan Oatmeal Cookies, , , , , , , , , , , , , , Low Carb Flatbread, , , , , , , , , , , , , , , , , , , , , , , , , , , , Let's Connect, , , , , Instagram, , , , , YouTube, , , , , Facebook, , , , , Pinterest, , , , , , , Recipes, , , Recipe Index, Ethnic Cuisine, By Course, Terms of Use, , , , , Explore, , , About, Contact, Shop, Privacy Policy, , , , , , , , , , , , , Delicious Freebies, , , Want free recipes delivered straight to your inbox? Click the button below now., , , Grab Your Freebies!, , , , , , , , , , , Featured In, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Search, , , , , , , , , , , , , , , , , , , © 2025 Healthier Steps • Custom Site Design by, Jennifer Holt Designs, ♡, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Search for:, , , , , Search, , , , , , Recipe Index, , Ethnic Cuisine, Toggle child menu, Expand, , , , Jamaican, , Caribbean, , Indian, , Mediterranean, , African, , Mexican, , Asian, , Italian, , Soul Food, , , , Recipes by Course, Toggle child menu, Expand, , , , Breakfast, , Appetizer, , Salad, , Soups and Stews, , Side Dish, , Entrée, , Dessert, , Snack, , Condiments, , Beverage, , , , , , , , , Instagram, , Facebook, , Pinterest, , YouTube, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Corn Elote Nachos": "Ingredients:  Instructions: ",
        "Fixate Vegan Kale Nachos": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., FOR KALE CHIPS:, 4 cups, raw kale, stems and ribs removed, and discarded, leaves cut into, 1-inch pieces, 1 Tbsp., olive oil, 1 dash, sea salt (or Himalayan salt), FOR TACO “MEAT”:, 1½ cups, cauliflower florets, 1 Tbsp., FIXATE Taco Seasoning, (see separate recipe for, FIXATE Taco Seasoning), 1 Tbsp., olive oil, ¼ tsp., sea salt (or Himalayan salt), FOR TOPPINGS:, , 2 medium Roma tomatoes, , seeds removed, chopped, ½ cup, chopped onion, 1 cup, canned black beans, , drained, rinsed, ¼ cup, FIXATE Vegan Nacho “Cheese” Dip, (see separate recipe for, FIXATE Vegan Nacho “Cheese” Dip), 1 Tbsp., fresh lime juice, (juice of ½ medium lime), ¼ cup, chopped fresh cilantro, Special Equipment:, Parchment paper, Nonstick cooking spray, FIXATE VEGAN KALE NACHOS, SERVES: 4    Prep Time: 20 min.    Cooking Time: 31 min., CONTAINER EQUIVALENTS (per serving):, 1½, ½, 3, VEGAN CONTAINER EQUIVALENTS (per serving):, 1½, ½, 2 ½, FOR KALE CHIPS:, 1.\t Preheat oven to 400º F., 2.\t Cut a sheet of parchment paper into four equal squares. Lay parchment, paper squares on a large baking sheet; lightly coat with spray. Set aside., 3.\t Combine kale, oil, and salt in a large bowl; toss gently to blend., 4.\t Evenly arrange kale, in a single layer, on each parchment paper square., 5.\t Bake for 15 to 18 minutes, turning halfway through, or until dry and, crispy. Set aside., FOR TACO “MEAT”:, 1.\t Place cauliflower in food processor (or blender); pulse until it resembles, rice, seven to ten 1-second pulses., 2.\t Combine cauliflower and taco seasoning in a large mixing bowl; mix well., 3.\t Heat oil in large skillet over medium-high heat; swirling to coat pan., 4.\t Add cauliflower mixture and salt; cook, stirring frequently, for 6 to 8, minutes, or until lightly browned and cooked through. Remove to a paper-, lined plate. Set aside. Cook’s Note: Be sure not to overcrowd pan as this, will impede browning; if your pan is not large enough, work in batches., 5.\t Top kale chips evenly with cauliflower mixture, tomato, onion, black beans, , and cheese dip., 6.\t Bake for 3 to 5 minutes, or until everything is warm and melty., 7.\t Carefully transfer each parchment sheet to a serving plate. Drizzle evenly, with lime juice and garnish with cilantro; enjoy!, TIP:, Kale chips can be more fragile than tortilla chips, so you might want to, enjoy these nachos with a fork., NUTRITIONAL INFORMATION (per serving): Calories: 220   Total Fat: 12 g   Saturated Fat: 2 g   Cholesterol: 0 mg   Sodium: 635 mg   Carbohydrates: 24 g, Fiber: 8 g   Sugars: 4 g   Protein: 9 g, GF, V, VG, RECIPES, © 2021 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., GF, V, VG, Recipes containing the GF  icon are designed to be Gluten-Free and contain no gluten. If you are following a gluten-free diet, since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PF, NUTRITIONAL INFORMATION (per serving): Calories: 6   Total Fat: 0 g   Saturated Fat: 0 g   Cholesterol: 0 mg   Sodium: 38 mg   Carbohydrates: 1 g   Fiber: 1 g, Sugars: 0 g   Protein: 0 g, FIXATE TACO SEASONING, SERVES: 24 (1 tsp. each)    Prep Time: 5 min.    Cooking Time: None, CONTAINER EQUIVALENTS (per serving):   Free food, This flavorful Fixate Taco Seasoning is used in the Kale Nachos, but it’s also delicious as a meat rub, in rice and beans, and in most, vegetable dishes., 3 Tbsp., , chili powder, 1 Tbsp. + 1½ tsp. \t ground cumin, 2½ tsp., , garlic powder, 2½ tsp., , onion powder, 2½ tsp., , ground sweet smoked paprika, 2½ tsp., , ground coriander, 2 tsp., , ground black pepper, 1.\t Combine chili powder, cumin, garlic powder, onion powder, paprika, , coriander, and pepper in a small bowl; mix well., 2.\t Store taco seasoning in an airtight container., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., GF, V, VG, Recipes containing the GF  icon are designed to be Gluten-Free and contain no gluten. If you are following a gluten-free diet, since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., NUTRITIONAL INFORMATION (per serving): Calories: 97   Total Fat: 8 g   Saturated Fat: 2 g   Cholesterol: 0 mg   Sodium: 201 mg   Carbohydrates: 4 g   Fiber: 1 g, Sugars: 2 g   Protein: 4 g, FIXATE VEGAN NACHO “CHEESE” DIP, SERVES: 12 (approx. 2 Tbsp. each)    Prep Time: 10 min.    Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 3, VEGAN CONTAINER EQUIVALENTS (per serving):, 3, ¾ cup, all-natural peanut (or cashew) butter, 1 Tbsp., fresh lime juice (juice of ½ medium, lime), 3 slices, pickled jalapeño, 1 tsp., jalapeño brine (from pickled, jalapeño jar), ½ tsp., sea salt (or Himalayan salt), 1 tsp., palm sugar or coconut sugar, 1 Tbsp., FIXATE Taco Seasoning, (see separate recipe for, FIXATE Taco Seasoning), ¾ cup, cool water, 1.\t Place peanut butter, lime juice, jalapeño, jalapeño brine, salt, sugar, and, taco seasoning in food processor (or blender)., 2.\t Process continuously while slowly adding water until a smooth, creamy, sauce has formed., NOTE:, This sauce is also great on veggie tacos and veggie burgers. It stores, covered, in the refrigerator for up to 5 days. When ready to use, simply, warm gently in the microwave, stirring every 10 seconds, until desired, temperature is reached. Don’t be afraid to add a teaspoon or two of water if, sauce has thickened., RECIPES, © 2021 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Spicy Black Bean Nachos": "Ingredients: other Mexican recipes, you can make., , , Spicy Black Bean Nachos Recipe, , We're building this delight using canned beans as that is easiest, but of course you are welcome to use 2 cups of, homemade beans, , if you have some on hand., , Roughly chop 1/2 an onion and peel 2 garlic cloves.  Saute in a dollop of oil over medium heat for 5-7 minutes., , , Rinse and drain a can of black beans and add to the onion mixture, along with 2, chipotles in adobo, , 1 Tablespoon adobo sauce, 1/2 teaspoon cumin, 1/2 teaspoon salt, freshly ground pepper, and 1/2 cup of water (or stock)., , , , , , You're left with a delicious bean puree that is capable of both drizzling and clinging at the same time.  If for any reason your batch comes out too liquidy (to cling to chips) then you can saute it over mediumish heat for a few minutes and it will reduce to a thicker consistency.  (We also use this puree in our, Black Bean and Guacamole Tostadas, )., , And note that using 2 chipotles in adobo creates real heat!  I tend to make this bean mixture extra spicy knowing that it will be diluted down by the chips and fixings.  Using only a single chipotle is a good option if you're not a huge fan of spicy foods., , , , And now I'm going to make a suggestion that might send some of you nacho experts running for the hills...., , I think these nachos taste best when they are done in moderation.  I know, I know, nachos are an infrequent delight designed to be over the top goopy decadence, amirite?!, , This version tries to have the best of both nacho worlds:  some goopy decadence but also some restraint so that the beany cheesy flavors stay at the forefront.  In other words, don't dump everything in the kitchen on top of them.  I've made double and triple layer batches of nachos before and they quickly turn into a soggy mess., , So while you'll have enough quantity to make a double layer batch, this recipe far prefers a single layer of nachos, ensuring that you'll always have chips in tact and they'll be warm and crispy.  Nachos!, , Start by creating a dense, single layer of chips on a sheetpan.  Drizzle with some of the bean mixture and add a layer of cheese.  I'm using a mix of Monterey Jack and Cheddar., , , This gets baked in the oven at 400F for 5-7 minutes or until the cheese is thoroughly melted., , And now give yourself a quick pat on the back as all the hard work is done.  The combo of warm chips, melted cheese and spicy black beans is good enough to be eaten on its own and the rest is just a bonus that can be customized to your liking., , I think a, fresh, cool Avocado Salsa Verde, is the perfect complement to cheesy nachos so consider that a good option for these Spicy Black Bean Nachos., , 1, , can black beans, 1/2, , onion, 2, , garlic cloves, 2, , chipotles in adobo, 1, , tablespoon, , adobo sauce, 1/2, , teaspoon, , cumin, 1/2, , teaspoon, , salt, freshly ground pepper, 1/2, , cup, , water, , (or stock), 1, , bag tortilla chips, 4-5, , cups, , shredded Monterey Jack cheese, oil, jalapeno slices, , (optional), chopped cilantro, , (optional), Avocado Salsa Verde, 4, , tomatillos, 1/2, , onion, 1, , garlic clove, 1/2, , jalapeno, 10-12, , sprigs cilantro, 1, , avocado, salt to taste, but I doubled it), 1, , tomato, 1/4, , onion, 1/2, , jalapeno, 10-12, , sprigs cilantro, juice of 1/2 lime, 1/4, , teaspoon, , salt, , , , , , Salsas, , , , Starting a Food Blog, , , , , Enchilada Recipes, , , , , About Me, , , , , Contact, , , , , Disclaimer, , , , , © 2025, Mexican Please, , - Privacy Policy, , , , , , , , , , , , , , , , , , Instructions: you are roasting some tomatillos and combining them with onion, garlic, cilantro, jalapeno, and avocado., , , You're left with vibrant salsa that does wonders in this dish., , Additional garnishes, all of them optional, include tomatoes, jalapeno slices, avocado bits, cilantro, and Cotija cheese., , I combined a few of those options and made a quick double batch of our default, Pico de Gallo recipe, that you'll find, here, ., , , So this nachos version is topped with drizzled, Avocado Salsa Verde, , jalapeno slices, Pico de Gallo, and a sprinkling of cilantro., , , One last thing...., , Keep the bowl of spicy black beans close by to give yourself the much deserved option of double dipping, i.e. dipping the warm cheesy chips into both the beans, and, the Avocado Salsa Verde.  Because you deserve it., , , Tough to beat beany cheesy tortilla chips eh?, , Nachos!, , , , , Spicy Black Bean Nachos, , , It's tough to beat the combo of warm tortilla chips, melted cheese, and spicy black beans. In other words, NACHOS!! Quantities listed are enough for two single layer sheetpans of nachos., , , 5, from, 12, votes, , , Print, , Pin, , Rate, , , Prep Time:, 25, minutes, , minutes, Cook Time:, 5, minutes, , minutes, Total Time:, 30, minutes, , minutes, , Servings:, 6, , Calories:, 654, kcal, , Author:, Patrick Calhoun | Mexican Please, , , Roughly chop 1/2 an onion and peel 2 garlic cloves.  Saute the onion and garlic in a dollop of oil over medium heat for 5-7 minutes., Drain and rinse one can of black beans.  Add the black beans to the onion mixture along with 2 chipotles in adobo, 1 Tablespoon adobo sauce, 1/2 teaspoon cumin, 1/2 teaspoon salt, freshly ground pepper, and 1/2 cup water (or stock).  Simmer for a few minutes until heated through., Combine the bean mixture in a blender or food processor.  Salt to taste (I added another pinch for this recipe)., Shred 4-5 cups of Monterey Jack cheese. This is enough cheese for three single layer batches., Add a dense, single layer of chips to a sheet pan. (You can line the sheetpan with foil or parchment paper if you want to make cleanup easier)., Drizzle some of the beans over the chips.  Add a layer of cheese to the chips.  Bake in the oven at 400F for 5-7 minutes or until all the cheese is melted., Top with your favorite fixings and serve immediately., This batch was drizzled with Avocado Salsa Verde and topped with Pico de Gallo, chopped cilantro, and jalapeno slices., If you are making Avocado Salsa Verde, start by rinsing four fresh tomatillos.  I usually cut out the stems too.  Roast the tomatillos in the oven at 400F until cooked through and they start to turn army green., Add the roasted tomatillos to a blender along with ½ onion, 1 garlic clove, 10-12 sprigs cilantro, and ½ of a jalapeno pepper.  Pulse blend and taste for heat, adding the additional ½ of the jalapeno if you want more heat. Add the flesh of the avocado to the blender and combine well.  Salt to taste., If you are making Pico de Gallo, start by finely chopping the tomato, 1/4 onion, and 1/2 jalapeno into ¼\" sized chunks.  Finely dice the cilantro.  Combine the tomato, onion, jalapeno and cilantro in a mixing bowl.  Add ¼ teaspoon salt and the juice of a ½ lime.  Mix together well and taste for seasoning.  Add additional salt and lime if necessary., , Notes, Keep the beans close by so you have the option of dipping the chips in both the beans and the Avocado Salsa Verde., , Using two chipotles in adobo gives the beans real kick. If you want a milder version you can use a single chipotle or even 1/2 of a chipotle. Note that some of the heat will get diluted once you combine the beans with all the fixings, so my version tastes extra spicy right out of the blender., , Feel free to use cheddar cheese instead of Monterey Jack. Or both!, , You can substitute a serrano for the jalapeno in the Avocado Salsa Verde., , , , , Like this recipe?, Click the stars above to rate it or leave a comment down below!, @mexplease, , , You might also like our, beef nachos, ., , , , , Or you can use a similar bean puree for our, , Chipotle and Cheese Bean Dip, :, , , , , Been thinking about, starting a food blog, ?  Here's the easiest way to do it with a small, manageable startup cost:, , , , , , Still hungry?!, , Want to receive Mexican Please recipes via email when they are posted?  Sign up below to subscribe.  All recipes are spam free., , , , , , , , , , Subscribe, , , , , , , , , , , , And don't worry, we hate spam too!  You can unsubscribe at any time., , , , , , Thank You For Subscribing!, , , , «, Roasted Poblano Quesadilla, Tomato Jalapeno Salsa, », Reader Interactions, Comments, , , , , , Liane, , , September 02, 2023 at 5:32 pm, , , , All look delicious. Would like to try all of it., , , Reply, , , , , , , , Sarah, , , July 07, 2022 at 2:45 am, , , , SO GOOD! I don't normally like nachos because they are just too heavy but these are beautiful and we've been craving them every night. I do make a guacamole with avocado, lime, chilli, red onion, garlic, coriander, salt and pepper instead of the Avocado salsa verde though. YUM!, , , Reply, , , , , , , , Patrick, , , July 07, 2022 at 7:26 am, , , , Thanks Sarah, so glad you tried these out!  Cheers., , , Reply, , , , , , , , , , Elizi, , , May 02, 2022 at 4:15 pm, , , , These are in my rotation...we seriously eat these for dinner some nights! Thank you for sharing!, , , Reply, , , , , , , , Patrick, , , May 05, 2022 at 3:46 pm, , , , Nachos for dinner is awesome 🙂 Cheers., , , Reply, , , , , , « Older Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , Primary Sidebar, Hey, I'm Patrick!  I spent 2 years living in Cozumel and got obsessed with Mexican food.  I built this site to share all the recipes and techniques I've learned along the way., Read More…, , , Search, , Footer, , , , , Mexican Recipes, , , , , Cooking Course, , , , , Mexican Cooking 101, , , , "
    }
}