{
    "ingredients": {
        "Vegetarian seven layer tostadas": "refried beans, guacamole, sour cream, Kalynï¿½s taco seasoning mix, four cheese mexican blend, tomatoes, green onions, black olives, tortillas",
        "Vegan Seven Layer Tostadas": "refried beans, guacamole, sour cream, taco seasoning, four cheese mexican blend, tomatoes, green onions, black olives, tortillas",
        "Vegetarian Fajitas": "lime, red onion, bell peppers, mushrooms, zucchini, garlic ,avocado, tortillas, salsa, sour cream, cheese",
        "Portobello Vegan Fajitas": "chipotle peppers in adobo sauce, veg broth, lime juice, garlic, portobello mushrooms, bell peppers, red onion, corn tortillas, vegan sour cream",
        "Mexican vegetable fajitas": "red yellow green bell peppers, onion,portabella mushrooms,tortillas,guacamole,salsa",
        "Tofu Sofritos": "firm tofu, chipotle in adobo sauce, garlic, green bell pepper, oregano, tomato, salsa, tomato paste",
        "Vegan Quesarito": "white rice,taco seasoning, tomato sauce, vegan ground beef, onion, potato, cashews, carrot, nutritional yeast, vegan cheddar, non dairy milk, tortillas, vegan chipotle mayo, vegan sour cream"
    },
    "recipe_url": {
        "Vegetarian seven layer tostadas": "https://kalynskitchen.com/recipe-for-seven-layer-tostadas/#mv-creation-85-jtr",
        "Vegan Seven Layer Tostadas": "https://kalynskitchen.com/recipe-for-seven-layer-tostadas/",
        "Vegetarian Fajitas": "https://wendypolisi.com/vegetarian-fajitas/",
        "Portobello Vegan Fajitas": "https://veganhuggs.com/portobello-vegan-fajitas/",
        "Mexican vegetable fajitas": "https://thebellyrulesthemind.net/best-vegetable-fajitas/",
        "Tofu Sofritos": "https://veganheaven.org/recipe/sofritas/",
        "Vegan Quesarito": "https://plantifullybasedblog.com/2019/08/29/vegan-quesarito/"
    },
    "Recipe": {
        "Vegetarian seven layer tostadas": "Ingredients: , Kid Friendly, , Slow Cooker, , Weekend Food Prep, , More, , , , Recipe Index, , , , Recipe Round-Ups, , More +, , , , , , Kalyn’s Kitchen Picks, , Things I’m Thinking About, , Friday Favorites, , , , , , Subscribe via Email, , , , , , , , , , , , Follow Me:, , , , , , , , , , , , , , , , , , , , , , subscribe now, , , , , , , , , , , , , , Submit, , , , , , , , , , , , , Home, , About, , Browse Recipes, , , Filtered Recipe Search, , Recipes by Diet, , , Dairy-Free, , Can be Keto, , Gluten-Free, , Low-Carb, , South Beach, , Vegetarian, , , , Recipes by Course, , , Appetizers, , Breakfast, , Desserts and Baking, , Dinner, , Lunches, , Side Dishes, , Soups & Stews, , Salads, , More, , , , , Kid Friendly, , Slow Cooker, , Weekend Food Prep, , More, , , , Recipe Index, , , , Recipe Round-Ups, , More +, , , Kalyn’s Kitchen Picks, , Things I’m Thinking About, , Friday Favorites, , , , , , , , Home, , , Recipes, , , Appetizers, , , Seven Layer Dip Tostadas, , , , , Seven Layer Dip Tostadas, , April 27, 2022 —, last updated, April 9, 2025, by, , Kalyn Denny, , , 49, comments », , , , , Jump to Recipe, Everyone who likes Seven Layer Dip is going to love it made into Tostadas for an easy and delicious lunch idea! I use low-carb tortillas, and you can make this even lower in carbs by skipping the refried beans if you prefer!, , PIN the Seven Layer Dip Tostadas to try later!, , , Seven Layer Dip Tostadas, are a recipe that has a lot of fans, even though they aren’t authentically Mexican! And this recipe will be a hit with everyone who loves Seven Layer Dip, and it absolutely does have Mexican flavors going on., , This is made with a crisped, Low-Carb Tortillas, topped with my family’s version of what makes up the seven layers in the dip. Did you look at the photo and count to see if there really were seven layers? And as you can tell, in my family we like a lot of olives on the Seven Layer Dip that always makes an appearance at every Denny family party., , And when I had this idea of crisping up the, Low-Carb Tortillas, I’m so fond of and using them as the base for a tostada topped with Seven Layer Dip, the only question in my mind was why I’d never thought doing this sooner! Hope you enjoy for a lunch or light dinner, or cut them in quarters and serve as an appetizer!, , , , it will take you directly to the complete recipe with ingredient amounts.), , , can of refried pinto beans (we used “restaurant style” beans which were great), , guacamole, homemade or purchased, , sour cream, , Kalyn’s Taco Seasoning Mix, , or use your favorite purchased Taco Seasoning, , grated Four Cheese Mexican Blend cheese, , tomatoes, , green onions, , black olives, , Mission Carb Balance Low-Carb Tortillas, (affiliate link), , La Banderita Low-Carb Tortillas, (affiliate link), or other low-carb tortillas of your choice, , olive oil, , , What are the seven layers in Seven Layer Dip?, , I’m guessing there are many variations on seven layer dip, but in my family these are the seven layers we always include:, , , refried beans, , guacamole, , sour cream with, Kalyn’s Taco Seasoning Mix, stirred in, , grated Mexican blend cheese, , chopped tomatoes, , sliced green onions, , sliced black olives., , , Are the Seven Layer Dip Tostadas low in carbs?, , If you use the low-carb tortillas I recommend with a light layer of refried beans, each tostada has only 13 net carbs and 13 grams of protein!, , How to make Seven Layer Dip Tostadas even lower in carbs?, , If you want to make a version of the tostadas that will be even lower in carbs, just omit the refried beans and have six layers., , , How to make Seven Layer Dip Tostadas:, , (This is only a summary of the steps for the recipe; please scroll down for complete printable recipe. Or if you use the JUMP TO RECIPE link at the top of the page, it will take you directly to the complete recipe.), , , I would use, Mission Carb Balance Low-Carb Tortillas, (affiliate link) or, La Banderita Low-Carb Tortillas, (affiliate link), but use any low-carb tortillas you prefer., , Preheat the oven to 450F/230C with a baking sheet in the oven. Remove pan, brush on a little olive oil, and put tortillas on the baking sheet., , Toast tortillas until they are crisp and barely starting to brown, turning several times., , Assemble heated refried beans, sour cream with Kalyn’s Taco Seasoning mixed in, guacamole, grated cheese, chopped tomatoes, sliced black olives, and sliced green onions. (Those are the seven layers!), , Spread a thin layer of refried beans on each tortilla. (Just omit the refried beans if you want a version with fewer carbs.), , Top the refried beans with guacamole., , Top that with the seasoned sour cream., , Sprinkle on some finely grated cheese. (I used Four Cheese Mexican Blend from Costco, which is perfect for this recipe.), , Top with diced tomatoes, thinly sliced green onions, and sliced olives., , These are pretty easy to pick up and eat with your hands, but you want to make them just a few minutes before serving or the tortillas will get soggy., , If you’re feeding kids, help them make their own and each one could choose the toppings they like!, , , , More Snacks with Southwestern Flavors:, , , Cilantro-Lover’s Perfect Guacamole, , Southwest Ranch Dip, , Cucumber Guacamole Appetizer Bites, , , Want more tasty dip recipes?, , Check out, 50+ Low-Carb and Keto Appetizer Recipes, for lots more ideas for tasty dips!, , , , , Continue to Content, , , , , , , , , , Print, , , , , , , Yield: 4 servings, , Seven Layer Dip Tostadas, , , , , Prep Time, , 20 minutes, , , , , Cook Time, , 5 minutes, , , , , Total Time, , 25 minutes, , , , , , These Seven Layer Dip Tostadas will be a hit with anyone who loves Seven Layer Dip! And this is perfect for lunch or a light dinner., , , , , , , 8 oz. refried beans, , 3/4 cup guacamole (see notes), , 1/2 cup sour cream, , 1/2 tsp. Kalyn’s Taco Seasoning Mix (or use your favorite Taco Seasoning), , 1 cup grated Four Cheese Mexican Blend, , 1/2 cup chopped tomatoes, , 1/4 cup thinly sliced green onions, , 1/4 cup sliced black olives, , 4 Mission Carb-Balance Low-Carb tortillas (see notes), , olive oil for greasing baking sheet, about 2 tsp., , , , , , –a thin layer of refried beans, –a thin layer of guacamole, –a thin layer of seasoned sour cream, –several generous pinches of finely grated low-fat cheese, –chopped tomatoes, –thinly sliced green onions, –sliced olives, Serve right away, , , , Notes, , , If you take time to make, homemade refried beans, and/or, homemade guacamole, that will make these Seven Layer Tostadas even better., I used, Mission Carb Balance Low-Carb Tortillas, (affiliate link) for this recipe, but I also like, La Banderita Low-Carb Tortillas, (affiliate link)., Nutritional info was calculated based on the Low-Carb Tortillas I used., This recipe created by Kalyn., , , , , , Nutrition Information, , Yield, 4, , Serving Size, 1, , Amount Per Serving, , Calories, 354, Total Fat, 27g, Saturated Fat, 10g, Trans Fat, 0g, Unsaturated Fat, 13g, Cholesterol, 45mg, Sodium, 711mg, Carbohydrates, 19g, Fiber, 6g, Sugar, 3g, Protein, 13g, , , Nutrition information is automatically calculated by the Recipe Plug-In I am using. I am not a nutritionist and cannot guarantee 100% accuracy, since many variables affect those calculations., , , , , , , , , , , Did you make this recipe?, , Did you make this recipe? Please leave a star rating (under the PRINT button in the recipe) or share a photo of your results on Instagram! THANKS!, , , , , , , © Kalyn Denny, , , Category:, Lunches, , , , , , , , Low-Carb Diet / Low-Glycemic Diet / South Beach Diet Suggestions:, Beans are high in carbs for low-carb diets, but Seven Layer Dip Tostadas use a very moderate amount of refried beans and low-carb tortillas for about 13 net carbs per tostada. If you want an even lower-carb version of this recipe, skip the beans. With an approved tortilla, this tostada would work for phase 2 or 3 of the original South Beach Diet. South Beach would recommend light sour cream and low-fat cheese, and remember that avocados are limited to 1/2 per day if you’re making this for a South Beach Diet meal., , Find More Recipes Like This One:, Use, Lunches, or, Tortillas, to find more recipes like this one. Use the, Diet Type Index, to find recipes suitable for a specific eating plan. You might also like to follow Kalyn’s Kitchen, on Pinterest, , , on Facebook, , , on Instagram, , , on TikTok, , or, on YouTube, to see all the good recipes I’m sharing there., , Historical Notes for this Recipe:, This recipe for tostadas with the flavors of Seven Layer Dip was first posted in 2011. The photos were updated in 2023 and the recipe was last updated with more information in 2025., , , Share This:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites. As an Amazon Associate, I earn from qualifying purchases., , , Categories:, , Appetizers, , , Easy to Cook, , , Kid Friendly, , , Lunches, , , Quick and Easy Recipes, , , Recipes, , , Low-Carb, , , South Beach Diet, , , Vegetarian, , , Beans & Legumes, , , Tortillas, , , originally published on, Apr 27, 2022, (last updated, Apr 9, 2025, ), , by, , Kalyn Denny, , , , , 49 comments, , , Leave a comment », , , , , , , Get, new recipes, via email:, , , , , , , , , , , , , , « Previous Post, Celebrating 17 Years of Kalyn’s Kitchen!, , Next Post », , Vegetarian Taco Salad, , , , , , Leave a Comment & Rate this Recipe!, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , , 49 Comments on “Seven Layer Dip Tostadas”, , , , , Lisa, —, April 28, 2022 @ 4:55 am, , Reply, , , I don’t see in the recipe the 2nd tortilla and toppings?  Is it all repeated? Looks great and would like to try it., , , , , , , Kalyn Denny, —, April 28, 2022 @ 4:58 am, , Reply, , , Yes, every tostada is made exactly the same (or however you prefer, there are endless variations.) Hope you enjoy!, , , , , , , , , Emily, —, November 25, 2018 @ 5:56 pm, , Reply, , , Oh my goodness!!! These are delicious. So easy and light. Can’t wait to make them again., , , , , , , Kalyn Denny, —, November 25, 2018 @ 6:00 pm, , Reply, , , Thanks Emily; so glad you enjoyed it!, , , , , , , , , Michelle Palin, —, June 17, 2018 @ 10:24 pm, , Reply, , , I love this dinner idea! I think it would be a hit with my family. I can just substitute with gluten-free rice flour tortillas. I’m making this soon!, , , , , , , Kalyn Denny, —, June 17, 2018 @ 10:47 pm, , Reply, , , Thanks, glad you like the idea!, , , , , , , , , Kalyn Denny, —, May 6, 2013 @ 1:55 pm, , Reply, , , Kristi, I love canned olives so I'm not sure what to suggest.  You could certainly leave them off though., , , , , , , Kristi Chastain, —, May 6, 2013 @ 1:45 pm, , Reply, , , This looks delicious.  I have a question though.  I've tried canned olives in the past and they have a \"canned\" taste that is not appealing to me.  I've tried rinsing them, but it didn't help.  Suggestions?, , Thanks., , , , , , , Michelle Palin, —, June 17, 2018 @ 10:26 pm, , Reply, , , Kristi – did you use canned already sliced olives? You might try just buying the canned whole olives and slicing them yourself. I’ve found I like those better!, , , , , , , , , Carole, —, August 16, 2012 @ 2:53 am, , Reply, , , Similar to my 7-layer nacho. Don't know why I never thought to do it in tostada form., , , , , , , Kalyn Denny, —, July 25, 2011 @ 5:33 pm, , Reply, , , Pam, glad to hear the idea was such a hit with your daughter!, , , , , , , Pam, —, July 25, 2011 @ 5:21 pm, , Reply, , , Tonight! So, I guess this is what we will be having. Can't wait to try it., Pam@ shaneylouscountrylane.blogspot.com, , , , , , , Kalyn Denny, —, July 25, 2011 @ 4:33 pm, , Reply, , , Thanks Jenn.  Sounds like you would fit in well in the Denny family!, , , , , , , J3nn (Jenn's Menu and Lifestyle Blog), —, July 25, 2011 @ 4:29 pm, , Reply, , , Those look scrumptious! I love 7-layer dip. Yum!!, , , , , , , Kalyn Denny, —, July 24, 2011 @ 12:33 pm, , Reply, , , Thanks Kevin.  It was a big hit at my house., , , , , , , Kevin, —, July 24, 2011 @ 10:16 am, , Reply, , , What a great way to enjoy seven layer dip!, , , , , , , Kalyn Denny, —, June 29, 2011 @ 12:44 pm, , Reply, , , I do have green onions on mine, but you can certainly add more.  🙂, , , , , , , owlmazing, —, June 29, 2011 @ 4:00 am, , Reply, , , Oh my gosh! I do love this dip and am now dying to make these! yummmmy. I would add some green onions on top!, , , , , , , Kalyn Denny, —, June 24, 2011 @ 8:24 pm, , Reply, , , Mary, thanks; glad you like it., , KellyPea, I would love tostadas like that too (especially if there was guacamole.), , When I go back to phase one I stick to amounts as outlined in the books for phase one.  Since there's an entire index of phase one recipes on the blog, I could be eating any of those foods, but only in the amounts that are allowed for phase one., , , , , , , Imagination, —, June 24, 2011 @ 7:34 pm, , Reply, , , Hi Kalyn,, I'm pretty new to South Beach Diet. You have mentioned that you occasionally follow Phase 1 of the diet for tune ups. Can you please post a sample list of the foods that you eat when you follow Phase 1. I would also like to know the quantity as the last time I tried Phase 1, I only lost 4 lbs in 2 weeks. Please help., Thanks,, Kalpana, , , , , , , kellypea, —, June 23, 2011 @ 2:51 pm, , Reply, , , Love 7-layer dip, love tostadas, and love this idea. We pretty much put on our tostadas what we put on our tacos — I just make a few flat tortillas and we mix things up.  It's leftover night or I'd put this on the menu., , , , , , , Mary, —, June 23, 2011 @ 2:14 pm, , Reply, , , Kalyn, these really look amazingly delicious. I really have to make these for my family. I hope you have a great day. Blessings…Mary, , , , , , , Kalyn Denny, —, June 23, 2011 @ 12:31 pm, , Reply, , , Barbara, thanks.  I am still eating it here!, , Joanne, fun hearing how you're going to turn them into Eight-Layer Tostadas!, , Thrifty Foodie, glad you like it., , Lisa, thanks.  So glad you like it., , , , , , , Lisa (Homesick Texan), —, June 23, 2011 @ 11:58 am, , Reply, , , I love this, Kalyn!, , , , , , , athriftyfoodie, —, June 23, 2011 @ 9:33 am, , Reply, , , This looks so good! i just LOVE mexican, yummy!!, , , , , , , Joanne Sid, —, June 23, 2011 @ 7:15 am, , Reply, , , Wow, sounds very fancy, lol, but I really think this is doable.  I'm thinking of something to make with my kids this weekend.  I think this is a great idea, I'll just have to make it 8-layer though.  I must add ham, it's their favorite. They'll actually eat anything with ham, so to keep them all excited, ham got to be in it! lol!, , , , , , , Barbara Bakes, —, June 23, 2011 @ 5:10 am, , Reply, , , Such a fantastic idea. Everyone immediately knows what to expect., , , , , , , Kalyn Denny, —, June 22, 2011 @ 10:46 pm, , Reply, , , Glad people are liking this.  If you haven't tried whole wheat tortillas, I promise they are great!, , , , , , , FabFrugalFood, —, June 22, 2011 @ 9:07 pm, , Reply, , , Tostadas are one of my go-to easy dinners. Really. I make them about once a week. Love to skip the beans and do guacamole tostadas for a change. I have never tried using whole wheat tortillas – thanks for the idea!, , Donna, , , , , , , Pam, —, June 22, 2011 @ 8:31 pm, , Reply, , , Wow, now that's what I'm talking about…..these look yummy. They are definitely on my menu soon., , , , , , , Paddy Abroad!, —, June 22, 2011 @ 7:05 pm, , Reply, , , Hi,, , The hubby loves Tostadas and so I make them for him all the time. I love your recipe. The difference between yours and mine is that I do not use Guacamole and I used cooked ground beef in Mexican spices and lettuce. Similar to how Taco Beano does theirs. I layer mine with Refried Beans, Ground Beef, Lettuce and Sour Cream and then layer on some Mexican Cheese! I agree that this is really a very easy and delicious dish. Thanks for posting, I will try your recipe on the Hubby and see how it goes!, , , , , , , knitalot3, —, June 22, 2011 @ 6:04 pm, , Reply, , , That looks so yummy!  Your recipes and pictures are amazing.  Thanks for sharing with us.  I love your blog., , , , , , , Priya (Yallapantula) Mitharwal, —, June 22, 2011 @ 3:02 pm, , Reply, , , Yum, love your idea and delicious layers., , , , , , , CJ, —, June 22, 2011 @ 2:53 pm, , Reply, , , I could eat those every day!, , , , , , , Kalyn Denny, —, June 22, 2011 @ 2:36 pm, , Reply, , , Thanks Jess.  I love homemade refried beans too, but this was good even with canned ones., , , , , , , Jess @ Stylish Stealthy and Healthy, —, June 22, 2011 @ 2:29 pm, , Reply, , , Wow. Genius! I am a lover of Mexican food and am definitely making these ASAP. I just made my first batch of homemade refried beans recently too and now I'm hooked 🙂  Great recipe!!, , , , , , , Sara @ Saucy Dipper, —, June 22, 2011 @ 2:28 pm, , Reply, , , I like this recipe for a lot of reasons, but, like Maris, my favorite aspect is the portion control. 7 layer dip is one of those dips that you can just eat, eat, and eat without having any idea how much you ate. I'll do it your way next time!, , , , , , , Kalyn Denny, —, June 22, 2011 @ 2:28 pm, , Reply, , , I'm chuckling because this has been my dinner menu for several days now (ever since I had the idea on Monday!), , , , , , , Cooking Creation, —, June 22, 2011 @ 2:26 pm, , Reply, , , YUM!  I'm putting this in my dinner menu for next week!!!!  🙂, , , , , , , Sharan, —, June 22, 2011 @ 2:15 pm, , Reply, , , That looks delicious! And, they are not the kind where all the topping would fall out. That's my biggest pet peeve when it comes to tostadas!, , , , , , , Kalyn Denny, —, June 22, 2011 @ 1:11 pm, , Reply, , , Kirsten, corn is one of the vegetables that's not recommended even for phase two because it's so high in sugar., , , , , , , Kirsten, —, June 22, 2011 @ 1:06 pm, , Reply, , , Those look great.  Just curious – why no corn tortillas for South Beach?, , , , , , , Kalyn Denny, —, June 22, 2011 @ 12:42 pm, , Reply, , , I thought fans of Seven Layer Dip would like this idea.  I guess this would be \"American-Mexican\", as it's not authentically Mexican or even Tex-Mex, but still very tasty!, , , , , , , Cozy in Texas, —, June 22, 2011 @ 12:37 pm, , Reply, , , These look wonderful. I've been so used to our version of Mexican food that I was shocked when I went to Mexico. Theirs is far from what we serve in restaurants in the U.S., Ann, , , , , , , Lydia (The Perfect Pantry), —, June 22, 2011 @ 11:28 am, , Reply, , , The Denny family sure does eat well! I love the idea of these tostadas, especially making minis for a party. (I'd cut out small circles from the tortilla with a cookie cutter.), , , , , , , Jeanette, —, June 22, 2011 @ 10:45 am, , Reply, , , What a great idea Kalyn! I made a simple tostado for my son for breakfast, just vegetarian refried beans and some corn salsa, but this looks like a fun lunch or dinner idea – everyone can assemble their own favorite toppings., , , , , , , Joanne, —, June 22, 2011 @ 10:21 am, , Reply, , , I love seven layer dip but can't have it around because I'd totally eat a whole container/batch in one shot.  Perfect solution right here!  I get to have my dip and eat it too!, , , , , , , Maris(In Good Taste), —, June 22, 2011 @ 8:28 am, , Reply, , , I love that I can make such a delicious dinner just for myself. Portion control is an issue for me!, , , , , , , Nicole @sugarcoatedsisters, —, June 22, 2011 @ 8:11 am, , Reply, , , This is absolutely fantastic!  I love 7 layer dip and chips… and this is like the ultimate covered chip!, , I'd probably leave off the olives because olives and I don't get along too well, but everything else looks so great.  Plus, they seem easy to make!, , Great recipe, thanks Kayln 🙂, , , , , , , , , , , , Find the, perfect, recipe:, , , , , Submit, , , , , Browse the Recipe Index, , Filtered Recipe Search, , , , , , Keto, , , , Low Carb, , , , Gluten Free, , , , Dairy Free, , , , South Beach, , , , Vegetarian, , , , , , Get, new recipes, via email:, , , , , , , , , , Browse Categories, Browse Categories, , Select Category, , Cooking for Gardeners, , Cooking Tips, , Five Fun Things on Friday, , Food Gifts, , Friday Favorites, , Garden Updates, , House Renovations, , Kalyn’s Kitchen Picks, , Recipe Round-Ups, , Recipes, , Appetizers, , Breakfast, , Denny Family Recipes, , Desserts and Baking, , Dinner, , Bowl Meals, , Casseroles, , Lettuce Wraps, , Pasta, , Pizza, , Tacos, , Holiday Recipes, , Lunches, , Salads, , Sauces, , Side Dishes, , Soups & Stews, , , Foil Dinners, , Grilling, , Instant Pot, , Kid Friendly, , Oven Dinners, , Quick and Easy Recipes, , Sheet Pan Meal, , Skillet Meals, , Slow Cooker, , Spiralizer, , Stir-Fry, , Weekend Food Prep, , Soups and Ste, , Things I’m Thinking About, , , , Archives, , Archives, , , Select Month, , April 2025, , March 2025, , February 2025, , January 2025, , December 2024, , November 2024, , October 2024, , September 2024, , August 2024, , July 2024, , June 2024, , May 2024, , April 2024, , March 2024, , February 2024, , January 2024, , December 2023, , November 2023, , October 2023, , September 2023, , August 2023, , July 2023, , June 2023, , May 2023, , April 2023, , March 2023, , February 2023, , January 2023, , December 2022, , November 2022, , October 2022, , September 2022, , August 2022, , July 2022, , June 2022, , May 2022, , April 2022, , March 2022, , February 2022, , January 2022, , December 2021, , November 2021, , October 2021, , September 2021, , August 2021, , July 2021, , June 2021, , May 2021, , April 2021, , March 2021, , February 2021, , January 2021, , December 2020, , November 2020, , October 2020, , September 2020, , August 2020, , July 2020, , June 2020, , May 2020, , April 2020, , March 2020, , February 2020, , January 2020, , December 2019, , November 2019, , October 2019, , September 2019, , August 2019, , July 2019, , June 2019, , May 2019, , April 2019, , March 2019, , February 2019, , January 2019, , December 2018, , November 2018, , October 2018, , September 2018, , August 2018, , July 2018, , June 2018, , May 2018, , April 2018, , March 2018, , February 2018, , January 2018, , December 2017, , November 2017, , October 2017, , September 2017, , August 2017, , July 2017, , June 2017, , May 2017, , April 2017, , March 2017, , February 2017, , January 2017, , December 2016, , November 2016, , October 2016, , September 2016, , August 2016, , July 2016, , June 2016, , May 2016, , April 2016, , March 2016, , February 2016, , January 2016, , December 2015, , November 2015, , October 2015, , September 2015, , August 2015, , July 2015, , June 2015, , May 2015, , April 2015, , March 2015, , February 2015, , January 2015, , December 2014, , November 2014, , October 2014, , September 2014, , August 2014, , July 2014, , June 2014, , May 2014, , April 2014, , March 2014, , February 2014, , January 2014, , December 2013, , November 2013, , October 2013, , September 2013, , August 2013, , July 2013, , June 2013, , May 2013, , April 2013, , March 2013, , February 2013, , January 2013, , December 2012, , November 2012, , October 2012, , September 2012, , August 2012, , July 2012, , June 2012, , May 2012, , April 2012, , March 2012, , February 2012, , January 2012, , December 2011, , November 2011, , October 2011, , September 2011, , August 2011, , July 2011, , June 2011, , May 2011, , April 2011, , March 2011, , February 2011, , January 2011, , December 2010, , November 2010, , October 2010, , September 2010, , August 2010, , July 2010, , June 2010, , May 2010, , April 2010, , March 2010, , February 2010, , January 2010, , December 2009, , November 2009, , October 2009, , September 2009, , August 2009, , July 2009, , June 2009, , May 2009, , April 2009, , March 2009, , February 2009, , January 2009, , December 2008, , November 2008, , October 2008, , September 2008, , August 2008, , July 2008, , June 2008, , May 2008, , April 2008, , March 2008, , February 2008, , January 2008, , December 2007, , November 2007, , October 2007, , September 2007, , August 2007, , July 2007, , June 2007, , May 2007, , April 2007, , March 2007, , February 2007, , January 2007, , December 2006, , November 2006, , October 2006, , September 2006, , August 2006, , July 2006, , June 2006, , May 2006, , April 2006, , March 2006, , February 2006, , January 2006, , December 2005, , November 2005, , October 2005, , September 2005, , August 2005, , July 2005, , June 2005, , May 2005, , April 2005, , , , Trending Now, Low-Carb and Keto Asparagus Recipes, Bulgur Wheat Salad with Tomatoes, Cucumbers,…, Fried Cauliflower with Bacon and Mushrooms, Easy Cheesy Zucchini Bake, Artichoke Frittata with Bacon, Easy Cheesy Baked Keto Cauliflower, visit our sister site:, , , , , , , , , , , , , , Get, new recipes, via email:, , , , , , , , , , , , , , , , , , , Footer Navigation, , Recipes, Recipe Index, , Recipe Search, , Recipe Round-Ups, , Special Diets, , About, About, , Contact, , Kalyn’s Picks, , Thoughts, , Follow, Pinterest, , Facebook, , Punchfork, , Instagram, , , , , , , , , , , , , , , , , ©2025 Kalyn's Kitchen, — All Rights Reserved., , Privacy Policy, , , Design by, Purr, ., , , , , , , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Sign up to get recipes via your email!, , , , , , , , , Please enter all required fields, , Correct invalid entries, , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , Air Fryer, , Can Freeze, , Easy to Cook, , , , Air Fryer, , Can Freeze, , Easy to Cook, , , Place a baking sheet inside the oven or toaster oven and let it get hot while you preheat oven to 450F/230C, about 10 minutes., Carefully remove baking sheet, drizzle a tiny bit of olive oil on it and spread around with a paper towel or pastry brush, and put flour tortillas on the baking sheet., Toast tortillas in the oven until they’re crisp and barely starting to brown, turning several times.  This will take about 5 minutes, but watch them carefully., While tortillas are crisping, put the refried beans in a bowl, stir to break them apart, and microwave 2-3 minutes, or until they’re hot., Stir, Kalyn’s Taco Seasoning Mix, into the sour cream., Chop the onions, slice green onions, and slice the olives.  (If you’re using homemade guacamole and cheese that needs to be grated you’ll need to prepare those as well.), , Air Fryer, , Can Freeze, , Easy to Cook, ",
        "Vegan Seven Layer Tostadas": "Ingredients: , Kid Friendly, , Slow Cooker, , Weekend Food Prep, , More, , , , Recipe Index, , , , Recipe Round-Ups, , More +, , , , , , Kalyn’s Kitchen Picks, , Things I’m Thinking About, , Friday Favorites, , , , , , Subscribe via Email, , , , , , , , , , , , Follow Me:, , , , , , , , , , , , , , , , , , , , , , subscribe now, , , , , , , , , , , , , , Submit, , , , , , , , , , , , , Home, , About, , Browse Recipes, , , Filtered Recipe Search, , Recipes by Diet, , , Dairy-Free, , Can be Keto, , Gluten-Free, , Low-Carb, , South Beach, , Vegetarian, , , , Recipes by Course, , , Appetizers, , Breakfast, , Desserts and Baking, , Dinner, , Lunches, , Side Dishes, , Soups & Stews, , Salads, , More, , , , , Kid Friendly, , Slow Cooker, , Weekend Food Prep, , More, , , , Recipe Index, , , , Recipe Round-Ups, , More +, , , Kalyn’s Kitchen Picks, , Things I’m Thinking About, , Friday Favorites, , , , , , , , Home, , , Recipes, , , Appetizers, , , Seven Layer Dip Tostadas, , , , , Seven Layer Dip Tostadas, , April 27, 2022 —, last updated, April 9, 2025, by, , Kalyn Denny, , , 49, comments », , , , , Jump to Recipe, Everyone who likes Seven Layer Dip is going to love it made into Tostadas for an easy and delicious lunch idea! I use low-carb tortillas, and you can make this even lower in carbs by skipping the refried beans if you prefer!, , PIN the Seven Layer Dip Tostadas to try later!, , , Seven Layer Dip Tostadas, are a recipe that has a lot of fans, even though they aren’t authentically Mexican! And this recipe will be a hit with everyone who loves Seven Layer Dip, and it absolutely does have Mexican flavors going on., , This is made with a crisped, Low-Carb Tortillas, topped with my family’s version of what makes up the seven layers in the dip. Did you look at the photo and count to see if there really were seven layers? And as you can tell, in my family we like a lot of olives on the Seven Layer Dip that always makes an appearance at every Denny family party., , And when I had this idea of crisping up the, Low-Carb Tortillas, I’m so fond of and using them as the base for a tostada topped with Seven Layer Dip, the only question in my mind was why I’d never thought doing this sooner! Hope you enjoy for a lunch or light dinner, or cut them in quarters and serve as an appetizer!, , , , it will take you directly to the complete recipe with ingredient amounts.), , , can of refried pinto beans (we used “restaurant style” beans which were great), , guacamole, homemade or purchased, , sour cream, , Kalyn’s Taco Seasoning Mix, , or use your favorite purchased Taco Seasoning, , grated Four Cheese Mexican Blend cheese, , tomatoes, , green onions, , black olives, , Mission Carb Balance Low-Carb Tortillas, (affiliate link), , La Banderita Low-Carb Tortillas, (affiliate link), or other low-carb tortillas of your choice, , olive oil, , , What are the seven layers in Seven Layer Dip?, , I’m guessing there are many variations on seven layer dip, but in my family these are the seven layers we always include:, , , refried beans, , guacamole, , sour cream with, Kalyn’s Taco Seasoning Mix, stirred in, , grated Mexican blend cheese, , chopped tomatoes, , sliced green onions, , sliced black olives., , , Are the Seven Layer Dip Tostadas low in carbs?, , If you use the low-carb tortillas I recommend with a light layer of refried beans, each tostada has only 13 net carbs and 13 grams of protein!, , How to make Seven Layer Dip Tostadas even lower in carbs?, , If you want to make a version of the tostadas that will be even lower in carbs, just omit the refried beans and have six layers., , , How to make Seven Layer Dip Tostadas:, , (This is only a summary of the steps for the recipe; please scroll down for complete printable recipe. Or if you use the JUMP TO RECIPE link at the top of the page, it will take you directly to the complete recipe.), , , I would use, Mission Carb Balance Low-Carb Tortillas, (affiliate link) or, La Banderita Low-Carb Tortillas, (affiliate link), but use any low-carb tortillas you prefer., , Preheat the oven to 450F/230C with a baking sheet in the oven. Remove pan, brush on a little olive oil, and put tortillas on the baking sheet., , Toast tortillas until they are crisp and barely starting to brown, turning several times., , Assemble heated refried beans, sour cream with Kalyn’s Taco Seasoning mixed in, guacamole, grated cheese, chopped tomatoes, sliced black olives, and sliced green onions. (Those are the seven layers!), , Spread a thin layer of refried beans on each tortilla. (Just omit the refried beans if you want a version with fewer carbs.), , Top the refried beans with guacamole., , Top that with the seasoned sour cream., , Sprinkle on some finely grated cheese. (I used Four Cheese Mexican Blend from Costco, which is perfect for this recipe.), , Top with diced tomatoes, thinly sliced green onions, and sliced olives., , These are pretty easy to pick up and eat with your hands, but you want to make them just a few minutes before serving or the tortillas will get soggy., , If you’re feeding kids, help them make their own and each one could choose the toppings they like!, , , , More Snacks with Southwestern Flavors:, , , Cilantro-Lover’s Perfect Guacamole, , Southwest Ranch Dip, , Cucumber Guacamole Appetizer Bites, , , Want more tasty dip recipes?, , Check out, 50+ Low-Carb and Keto Appetizer Recipes, for lots more ideas for tasty dips!, , , , , Continue to Content, , , , , , , , , , Print, , , , , , , Yield: 4 servings, , Seven Layer Dip Tostadas, , , , , Prep Time, , 20 minutes, , , , , Cook Time, , 5 minutes, , , , , Total Time, , 25 minutes, , , , , , These Seven Layer Dip Tostadas will be a hit with anyone who loves Seven Layer Dip! And this is perfect for lunch or a light dinner., , , , , , , 8 oz. refried beans, , 3/4 cup guacamole (see notes), , 1/2 cup sour cream, , 1/2 tsp. Kalyn’s Taco Seasoning Mix (or use your favorite Taco Seasoning), , 1 cup grated Four Cheese Mexican Blend, , 1/2 cup chopped tomatoes, , 1/4 cup thinly sliced green onions, , 1/4 cup sliced black olives, , 4 Mission Carb-Balance Low-Carb tortillas (see notes), , olive oil for greasing baking sheet, about 2 tsp., , , , , , –a thin layer of refried beans, –a thin layer of guacamole, –a thin layer of seasoned sour cream, –several generous pinches of finely grated low-fat cheese, –chopped tomatoes, –thinly sliced green onions, –sliced olives, Serve right away, , , , Notes, , , If you take time to make, homemade refried beans, and/or, homemade guacamole, that will make these Seven Layer Tostadas even better., I used, Mission Carb Balance Low-Carb Tortillas, (affiliate link) for this recipe, but I also like, La Banderita Low-Carb Tortillas, (affiliate link)., Nutritional info was calculated based on the Low-Carb Tortillas I used., This recipe created by Kalyn., , , , , , Nutrition Information, , Yield, 4, , Serving Size, 1, , Amount Per Serving, , Calories, 354, Total Fat, 27g, Saturated Fat, 10g, Trans Fat, 0g, Unsaturated Fat, 13g, Cholesterol, 45mg, Sodium, 711mg, Carbohydrates, 19g, Fiber, 6g, Sugar, 3g, Protein, 13g, , , Nutrition information is automatically calculated by the Recipe Plug-In I am using. I am not a nutritionist and cannot guarantee 100% accuracy, since many variables affect those calculations., , , , , , , , , , , Did you make this recipe?, , Did you make this recipe? Please leave a star rating (under the PRINT button in the recipe) or share a photo of your results on Instagram! THANKS!, , , , , , , © Kalyn Denny, , , Category:, Lunches, , , , , , , , Low-Carb Diet / Low-Glycemic Diet / South Beach Diet Suggestions:, Beans are high in carbs for low-carb diets, but Seven Layer Dip Tostadas use a very moderate amount of refried beans and low-carb tortillas for about 13 net carbs per tostada. If you want an even lower-carb version of this recipe, skip the beans. With an approved tortilla, this tostada would work for phase 2 or 3 of the original South Beach Diet. South Beach would recommend light sour cream and low-fat cheese, and remember that avocados are limited to 1/2 per day if you’re making this for a South Beach Diet meal., , Find More Recipes Like This One:, Use, Lunches, or, Tortillas, to find more recipes like this one. Use the, Diet Type Index, to find recipes suitable for a specific eating plan. You might also like to follow Kalyn’s Kitchen, on Pinterest, , , on Facebook, , , on Instagram, , , on TikTok, , or, on YouTube, to see all the good recipes I’m sharing there., , Historical Notes for this Recipe:, This recipe for tostadas with the flavors of Seven Layer Dip was first posted in 2011. The photos were updated in 2023 and the recipe was last updated with more information in 2025., , , Share This:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites. As an Amazon Associate, I earn from qualifying purchases., , , Categories:, , Appetizers, , , Easy to Cook, , , Kid Friendly, , , Lunches, , , Quick and Easy Recipes, , , Recipes, , , Low-Carb, , , South Beach Diet, , , Vegetarian, , , Beans & Legumes, , , Tortillas, , , originally published on, Apr 27, 2022, (last updated, Apr 9, 2025, ), , by, , Kalyn Denny, , , , , 49 comments, , , Leave a comment », , , , , , , Get, new recipes, via email:, , , , , , , , , , , , , , « Previous Post, Celebrating 17 Years of Kalyn’s Kitchen!, , Next Post », , Vegetarian Taco Salad, , , , , , Leave a Comment & Rate this Recipe!, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , , 49 Comments on “Seven Layer Dip Tostadas”, , , , , Lisa, —, April 28, 2022 @ 4:55 am, , Reply, , , I don’t see in the recipe the 2nd tortilla and toppings?  Is it all repeated? Looks great and would like to try it., , , , , , , Kalyn Denny, —, April 28, 2022 @ 4:58 am, , Reply, , , Yes, every tostada is made exactly the same (or however you prefer, there are endless variations.) Hope you enjoy!, , , , , , , , , Emily, —, November 25, 2018 @ 5:56 pm, , Reply, , , Oh my goodness!!! These are delicious. So easy and light. Can’t wait to make them again., , , , , , , Kalyn Denny, —, November 25, 2018 @ 6:00 pm, , Reply, , , Thanks Emily; so glad you enjoyed it!, , , , , , , , , Michelle Palin, —, June 17, 2018 @ 10:24 pm, , Reply, , , I love this dinner idea! I think it would be a hit with my family. I can just substitute with gluten-free rice flour tortillas. I’m making this soon!, , , , , , , Kalyn Denny, —, June 17, 2018 @ 10:47 pm, , Reply, , , Thanks, glad you like the idea!, , , , , , , , , Kalyn Denny, —, May 6, 2013 @ 1:55 pm, , Reply, , , Kristi, I love canned olives so I'm not sure what to suggest.  You could certainly leave them off though., , , , , , , Kristi Chastain, —, May 6, 2013 @ 1:45 pm, , Reply, , , This looks delicious.  I have a question though.  I've tried canned olives in the past and they have a \"canned\" taste that is not appealing to me.  I've tried rinsing them, but it didn't help.  Suggestions?, , Thanks., , , , , , , Michelle Palin, —, June 17, 2018 @ 10:26 pm, , Reply, , , Kristi – did you use canned already sliced olives? You might try just buying the canned whole olives and slicing them yourself. I’ve found I like those better!, , , , , , , , , Carole, —, August 16, 2012 @ 2:53 am, , Reply, , , Similar to my 7-layer nacho. Don't know why I never thought to do it in tostada form., , , , , , , Kalyn Denny, —, July 25, 2011 @ 5:33 pm, , Reply, , , Pam, glad to hear the idea was such a hit with your daughter!, , , , , , , Pam, —, July 25, 2011 @ 5:21 pm, , Reply, , , Tonight! So, I guess this is what we will be having. Can't wait to try it., Pam@ shaneylouscountrylane.blogspot.com, , , , , , , Kalyn Denny, —, July 25, 2011 @ 4:33 pm, , Reply, , , Thanks Jenn.  Sounds like you would fit in well in the Denny family!, , , , , , , J3nn (Jenn's Menu and Lifestyle Blog), —, July 25, 2011 @ 4:29 pm, , Reply, , , Those look scrumptious! I love 7-layer dip. Yum!!, , , , , , , Kalyn Denny, —, July 24, 2011 @ 12:33 pm, , Reply, , , Thanks Kevin.  It was a big hit at my house., , , , , , , Kevin, —, July 24, 2011 @ 10:16 am, , Reply, , , What a great way to enjoy seven layer dip!, , , , , , , Kalyn Denny, —, June 29, 2011 @ 12:44 pm, , Reply, , , I do have green onions on mine, but you can certainly add more.  🙂, , , , , , , owlmazing, —, June 29, 2011 @ 4:00 am, , Reply, , , Oh my gosh! I do love this dip and am now dying to make these! yummmmy. I would add some green onions on top!, , , , , , , Kalyn Denny, —, June 24, 2011 @ 8:24 pm, , Reply, , , Mary, thanks; glad you like it., , KellyPea, I would love tostadas like that too (especially if there was guacamole.), , When I go back to phase one I stick to amounts as outlined in the books for phase one.  Since there's an entire index of phase one recipes on the blog, I could be eating any of those foods, but only in the amounts that are allowed for phase one., , , , , , , Imagination, —, June 24, 2011 @ 7:34 pm, , Reply, , , Hi Kalyn,, I'm pretty new to South Beach Diet. You have mentioned that you occasionally follow Phase 1 of the diet for tune ups. Can you please post a sample list of the foods that you eat when you follow Phase 1. I would also like to know the quantity as the last time I tried Phase 1, I only lost 4 lbs in 2 weeks. Please help., Thanks,, Kalpana, , , , , , , kellypea, —, June 23, 2011 @ 2:51 pm, , Reply, , , Love 7-layer dip, love tostadas, and love this idea. We pretty much put on our tostadas what we put on our tacos — I just make a few flat tortillas and we mix things up.  It's leftover night or I'd put this on the menu., , , , , , , Mary, —, June 23, 2011 @ 2:14 pm, , Reply, , , Kalyn, these really look amazingly delicious. I really have to make these for my family. I hope you have a great day. Blessings…Mary, , , , , , , Kalyn Denny, —, June 23, 2011 @ 12:31 pm, , Reply, , , Barbara, thanks.  I am still eating it here!, , Joanne, fun hearing how you're going to turn them into Eight-Layer Tostadas!, , Thrifty Foodie, glad you like it., , Lisa, thanks.  So glad you like it., , , , , , , Lisa (Homesick Texan), —, June 23, 2011 @ 11:58 am, , Reply, , , I love this, Kalyn!, , , , , , , athriftyfoodie, —, June 23, 2011 @ 9:33 am, , Reply, , , This looks so good! i just LOVE mexican, yummy!!, , , , , , , Joanne Sid, —, June 23, 2011 @ 7:15 am, , Reply, , , Wow, sounds very fancy, lol, but I really think this is doable.  I'm thinking of something to make with my kids this weekend.  I think this is a great idea, I'll just have to make it 8-layer though.  I must add ham, it's their favorite. They'll actually eat anything with ham, so to keep them all excited, ham got to be in it! lol!, , , , , , , Barbara Bakes, —, June 23, 2011 @ 5:10 am, , Reply, , , Such a fantastic idea. Everyone immediately knows what to expect., , , , , , , Kalyn Denny, —, June 22, 2011 @ 10:46 pm, , Reply, , , Glad people are liking this.  If you haven't tried whole wheat tortillas, I promise they are great!, , , , , , , FabFrugalFood, —, June 22, 2011 @ 9:07 pm, , Reply, , , Tostadas are one of my go-to easy dinners. Really. I make them about once a week. Love to skip the beans and do guacamole tostadas for a change. I have never tried using whole wheat tortillas – thanks for the idea!, , Donna, , , , , , , Pam, —, June 22, 2011 @ 8:31 pm, , Reply, , , Wow, now that's what I'm talking about…..these look yummy. They are definitely on my menu soon., , , , , , , Paddy Abroad!, —, June 22, 2011 @ 7:05 pm, , Reply, , , Hi,, , The hubby loves Tostadas and so I make them for him all the time. I love your recipe. The difference between yours and mine is that I do not use Guacamole and I used cooked ground beef in Mexican spices and lettuce. Similar to how Taco Beano does theirs. I layer mine with Refried Beans, Ground Beef, Lettuce and Sour Cream and then layer on some Mexican Cheese! I agree that this is really a very easy and delicious dish. Thanks for posting, I will try your recipe on the Hubby and see how it goes!, , , , , , , knitalot3, —, June 22, 2011 @ 6:04 pm, , Reply, , , That looks so yummy!  Your recipes and pictures are amazing.  Thanks for sharing with us.  I love your blog., , , , , , , Priya (Yallapantula) Mitharwal, —, June 22, 2011 @ 3:02 pm, , Reply, , , Yum, love your idea and delicious layers., , , , , , , CJ, —, June 22, 2011 @ 2:53 pm, , Reply, , , I could eat those every day!, , , , , , , Kalyn Denny, —, June 22, 2011 @ 2:36 pm, , Reply, , , Thanks Jess.  I love homemade refried beans too, but this was good even with canned ones., , , , , , , Jess @ Stylish Stealthy and Healthy, —, June 22, 2011 @ 2:29 pm, , Reply, , , Wow. Genius! I am a lover of Mexican food and am definitely making these ASAP. I just made my first batch of homemade refried beans recently too and now I'm hooked 🙂  Great recipe!!, , , , , , , Sara @ Saucy Dipper, —, June 22, 2011 @ 2:28 pm, , Reply, , , I like this recipe for a lot of reasons, but, like Maris, my favorite aspect is the portion control. 7 layer dip is one of those dips that you can just eat, eat, and eat without having any idea how much you ate. I'll do it your way next time!, , , , , , , Kalyn Denny, —, June 22, 2011 @ 2:28 pm, , Reply, , , I'm chuckling because this has been my dinner menu for several days now (ever since I had the idea on Monday!), , , , , , , Cooking Creation, —, June 22, 2011 @ 2:26 pm, , Reply, , , YUM!  I'm putting this in my dinner menu for next week!!!!  🙂, , , , , , , Sharan, —, June 22, 2011 @ 2:15 pm, , Reply, , , That looks delicious! And, they are not the kind where all the topping would fall out. That's my biggest pet peeve when it comes to tostadas!, , , , , , , Kalyn Denny, —, June 22, 2011 @ 1:11 pm, , Reply, , , Kirsten, corn is one of the vegetables that's not recommended even for phase two because it's so high in sugar., , , , , , , Kirsten, —, June 22, 2011 @ 1:06 pm, , Reply, , , Those look great.  Just curious – why no corn tortillas for South Beach?, , , , , , , Kalyn Denny, —, June 22, 2011 @ 12:42 pm, , Reply, , , I thought fans of Seven Layer Dip would like this idea.  I guess this would be \"American-Mexican\", as it's not authentically Mexican or even Tex-Mex, but still very tasty!, , , , , , , Cozy in Texas, —, June 22, 2011 @ 12:37 pm, , Reply, , , These look wonderful. I've been so used to our version of Mexican food that I was shocked when I went to Mexico. Theirs is far from what we serve in restaurants in the U.S., Ann, , , , , , , Lydia (The Perfect Pantry), —, June 22, 2011 @ 11:28 am, , Reply, , , The Denny family sure does eat well! I love the idea of these tostadas, especially making minis for a party. (I'd cut out small circles from the tortilla with a cookie cutter.), , , , , , , Jeanette, —, June 22, 2011 @ 10:45 am, , Reply, , , What a great idea Kalyn! I made a simple tostado for my son for breakfast, just vegetarian refried beans and some corn salsa, but this looks like a fun lunch or dinner idea – everyone can assemble their own favorite toppings., , , , , , , Joanne, —, June 22, 2011 @ 10:21 am, , Reply, , , I love seven layer dip but can't have it around because I'd totally eat a whole container/batch in one shot.  Perfect solution right here!  I get to have my dip and eat it too!, , , , , , , Maris(In Good Taste), —, June 22, 2011 @ 8:28 am, , Reply, , , I love that I can make such a delicious dinner just for myself. Portion control is an issue for me!, , , , , , , Nicole @sugarcoatedsisters, —, June 22, 2011 @ 8:11 am, , Reply, , , This is absolutely fantastic!  I love 7 layer dip and chips… and this is like the ultimate covered chip!, , I'd probably leave off the olives because olives and I don't get along too well, but everything else looks so great.  Plus, they seem easy to make!, , Great recipe, thanks Kayln 🙂, , , , , , , , , , , , Find the, perfect, recipe:, , , , , Submit, , , , , Browse the Recipe Index, , Filtered Recipe Search, , , , , , Keto, , , , Low Carb, , , , Gluten Free, , , , Dairy Free, , , , South Beach, , , , Vegetarian, , , , , , Get, new recipes, via email:, , , , , , , , , , Browse Categories, Browse Categories, , Select Category, , Cooking for Gardeners, , Cooking Tips, , Five Fun Things on Friday, , Food Gifts, , Friday Favorites, , Garden Updates, , House Renovations, , Kalyn’s Kitchen Picks, , Recipe Round-Ups, , Recipes, , Appetizers, , Breakfast, , Denny Family Recipes, , Desserts and Baking, , Dinner, , Bowl Meals, , Casseroles, , Lettuce Wraps, , Pasta, , Pizza, , Tacos, , Holiday Recipes, , Lunches, , Salads, , Sauces, , Side Dishes, , Soups & Stews, , , Foil Dinners, , Grilling, , Instant Pot, , Kid Friendly, , Oven Dinners, , Quick and Easy Recipes, , Sheet Pan Meal, , Skillet Meals, , Slow Cooker, , Spiralizer, , Stir-Fry, , Weekend Food Prep, , Soups and Ste, , Things I’m Thinking About, , , , Archives, , Archives, , , Select Month, , April 2025, , March 2025, , February 2025, , January 2025, , December 2024, , November 2024, , October 2024, , September 2024, , August 2024, , July 2024, , June 2024, , May 2024, , April 2024, , March 2024, , February 2024, , January 2024, , December 2023, , November 2023, , October 2023, , September 2023, , August 2023, , July 2023, , June 2023, , May 2023, , April 2023, , March 2023, , February 2023, , January 2023, , December 2022, , November 2022, , October 2022, , September 2022, , August 2022, , July 2022, , June 2022, , May 2022, , April 2022, , March 2022, , February 2022, , January 2022, , December 2021, , November 2021, , October 2021, , September 2021, , August 2021, , July 2021, , June 2021, , May 2021, , April 2021, , March 2021, , February 2021, , January 2021, , December 2020, , November 2020, , October 2020, , September 2020, , August 2020, , July 2020, , June 2020, , May 2020, , April 2020, , March 2020, , February 2020, , January 2020, , December 2019, , November 2019, , October 2019, , September 2019, , August 2019, , July 2019, , June 2019, , May 2019, , April 2019, , March 2019, , February 2019, , January 2019, , December 2018, , November 2018, , October 2018, , September 2018, , August 2018, , July 2018, , June 2018, , May 2018, , April 2018, , March 2018, , February 2018, , January 2018, , December 2017, , November 2017, , October 2017, , September 2017, , August 2017, , July 2017, , June 2017, , May 2017, , April 2017, , March 2017, , February 2017, , January 2017, , December 2016, , November 2016, , October 2016, , September 2016, , August 2016, , July 2016, , June 2016, , May 2016, , April 2016, , March 2016, , February 2016, , January 2016, , December 2015, , November 2015, , October 2015, , September 2015, , August 2015, , July 2015, , June 2015, , May 2015, , April 2015, , March 2015, , February 2015, , January 2015, , December 2014, , November 2014, , October 2014, , September 2014, , August 2014, , July 2014, , June 2014, , May 2014, , April 2014, , March 2014, , February 2014, , January 2014, , December 2013, , November 2013, , October 2013, , September 2013, , August 2013, , July 2013, , June 2013, , May 2013, , April 2013, , March 2013, , February 2013, , January 2013, , December 2012, , November 2012, , October 2012, , September 2012, , August 2012, , July 2012, , June 2012, , May 2012, , April 2012, , March 2012, , February 2012, , January 2012, , December 2011, , November 2011, , October 2011, , September 2011, , August 2011, , July 2011, , June 2011, , May 2011, , April 2011, , March 2011, , February 2011, , January 2011, , December 2010, , November 2010, , October 2010, , September 2010, , August 2010, , July 2010, , June 2010, , May 2010, , April 2010, , March 2010, , February 2010, , January 2010, , December 2009, , November 2009, , October 2009, , September 2009, , August 2009, , July 2009, , June 2009, , May 2009, , April 2009, , March 2009, , February 2009, , January 2009, , December 2008, , November 2008, , October 2008, , September 2008, , August 2008, , July 2008, , June 2008, , May 2008, , April 2008, , March 2008, , February 2008, , January 2008, , December 2007, , November 2007, , October 2007, , September 2007, , August 2007, , July 2007, , June 2007, , May 2007, , April 2007, , March 2007, , February 2007, , January 2007, , December 2006, , November 2006, , October 2006, , September 2006, , August 2006, , July 2006, , June 2006, , May 2006, , April 2006, , March 2006, , February 2006, , January 2006, , December 2005, , November 2005, , October 2005, , September 2005, , August 2005, , July 2005, , June 2005, , May 2005, , April 2005, , , , Trending Now, Low-Carb and Keto Asparagus Recipes, Bulgur Wheat Salad with Tomatoes, Cucumbers,…, Fried Cauliflower with Bacon and Mushrooms, Easy Cheesy Zucchini Bake, Artichoke Frittata with Bacon, Easy Cheesy Baked Keto Cauliflower, visit our sister site:, , , , , , , , , , , , , , Get, new recipes, via email:, , , , , , , , , , , , , , , , , , , Footer Navigation, , Recipes, Recipe Index, , Recipe Search, , Recipe Round-Ups, , Special Diets, , About, About, , Contact, , Kalyn’s Picks, , Thoughts, , Follow, Pinterest, , Facebook, , Punchfork, , Instagram, , , , , , , , , , , , , , , , , ©2025 Kalyn's Kitchen, — All Rights Reserved., , Privacy Policy, , , Design by, Purr, ., , , , , , , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Sign up to get recipes via your email!, , , , , , , , , Please enter all required fields, , Correct invalid entries, , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , Air Fryer, , Can Freeze, , Easy to Cook, , , , Air Fryer, , Can Freeze, , Easy to Cook, , , Place a baking sheet inside the oven or toaster oven and let it get hot while you preheat oven to 450F/230C, about 10 minutes., Carefully remove baking sheet, drizzle a tiny bit of olive oil on it and spread around with a paper towel or pastry brush, and put flour tortillas on the baking sheet., Toast tortillas in the oven until they’re crisp and barely starting to brown, turning several times.  This will take about 5 minutes, but watch them carefully., While tortillas are crisping, put the refried beans in a bowl, stir to break them apart, and microwave 2-3 minutes, or until they’re hot., Stir, Kalyn’s Taco Seasoning Mix, into the sour cream., Chop the onions, slice green onions, and slice the olives.  (If you’re using homemade guacamole and cheese that needs to be grated you’ll need to prepare those as well.), , Air Fryer, , Can Freeze, , Easy to Cook, ",
        "Vegetarian Fajitas": "Ingredients: , , , , , , Oil:, Avocado oil is my go-to oil for high-heat cooking., , Lime Juice:, Fresh lime juice is best. For an extra punch of flavor, zest the lime before you juice it., , Seasonings:, A blend of chili powder, garlic powder, smoked paprika cumin, salt, and pepper adds the much-loved fajitas flavor. Onion powder is another great option. In a hurry? Substitute a packet of taco or fajita seasoning., , Vegetables:, I used red onion, bell peppers, mushrooms, zucchini, and garlic, but feel free to play with this and use what you have on hand., , Tortillas:, I used white corn tortillas, but you can use yellow corn or flour tortillas if you like. A lettuce wrap is another great option., , For Topping:, Use traditional fajita fixings: avocado, guacamole, salsa, hot sauce, sour cream, and cheese are all great options., , , Mix It Up!, , , Add one minced chipotle chili pepper and one tablespoon of adobo sauce to the marinade for a kick of heat., , I used corn tortillas to keep it gluten-free, but you can use whatever tortillas you prefer., , To add sweetness, add two teaspoons of your preferred sweetener to the marinade., , Skip the avocado or guacamole and instead serve with, Mango Avocado Salsa, ., , You can add black beans, garbanzo beans, or quinoa to your tortillas for an extra kick of protein., , , What Do You Serve With Vegetable Fajitas?, , , Lime rice,, Mexican Quinoa, or, Spanish Cauliflower Rice, all make great sides., , Rainbow Citrus Slaw, is an unexpected option that is ridiculously good., , Slow Cooker Black Beans, make a fabulous side, and work well in the fajitas too., , , Frequently Asked Questions, , How Do You Make Vegan Fajitas?, , This meatless fajita recipe is already vegan!  Just change what you serve with the veggies.  Make sure your tortillas are vegan (most are), and either omit the cheese, or use vegan cheese., , Serve with, Cashew Sour Cream, in place of the Sour Cream, or use purchased vegan sour cream., , Can You Make This Vegetarian Fajitas Recipe on a Sheet Pan?, , Making sheet pan vegetarian fajitas is so easy! All you need to do is line a baking sheet with parchment paper. Preheat your oven to 400 degrees., Prepare the recipe through step 3. Place the drained vegetables in a single layer on a baking sheet., Cook for 15 minutes. Stir and cook for 5 to 10 minutes longer, until the vegetables are tender., , What Veggies are Good for a Vegetable Fajitas Recipe?, , , Onions, , Green, Red, or Yellow Bell Peppers, , Mushrooms, , Zucchini, , Cauliflower, , Broccoli, , Corn, , Carrots, , Sweet Potatoes, , , Recommended Tools, , As an Amazon Associate, I Earn from Qualifying Sales, , , Mixing Bowl, (small), , Shallow Dish, for Marinating (I used a baking pan), , Large Skillet, (Cast Iron Skillets are also great for fajitas!), , Small Skillet, , , Storage, , Store leftover vegetarian fajita filling in a sealed container in the refrigerator for up to four days., , Meal Prep Tips, , , Double the recipe and separate it into individual containers. Add the fixings on the side in small containers, and you have a grab and go meal that will last for three or four days., , If you are short on time, buy pre-cut vegetables., , Alternatively, the vegetables may be chopped up to two days in advance., , , How to Make Veggie Fajitas, , First, , , Transfer the vegetables to a shallow dish and pour the marinade over them., , , , , , , Marinate for at least 30 minutes or up to 2 hours., , Drain., , Heat the avocado oil in a large skillet over medium-high heat., , Add the peppers and onions and cook, stirring often, for about 6 minutes., , Add the mushrooms and zucchini. Cook the veggies until they are tender, about another 5 minutes., , Heat the tortillas in a small dry skillet., , Serve the vegetables in warm tortillas with the desired toppings., , , You May Also Like, , , Sheet Pan Chicken Fajitas, are the ultimate easy weeknight meal. This is a kid-friendly recipe that you will turn to again and again., , Slow Cooker Beef Fajitas, are one of those recipes that I like to double so that I have enough to re-purpose the meat the next day., , Vegetarian Paella, is a satisfying and fun meal that even kids love!, , Vegetarian Stuffed Mushrooms, are a crazy good appetizer that you can easily make ahead., , , If you’ve tried this recipe or any other recipe on the blog then don’t forget to rate the recipe and let me know how it went in the below comments, I love hearing from you! You can also FOLLOW ME on, FACEBOOK, , , INSTAGRAM, , and, PINTEREST, to see all my delicious recipes., , , , , , Print Recipe, , No ratings yet, , , , Quick Marinated Vegetarian Fajitas, , , These easy Vegetarian Fajitas are made with onion, peppers, mushrooms and zucchini seasoned in a zesty marinade.  This flavor-packed meal has very little hands on prep time making it perfect for a speedy weeknight meal.  This recipe just may become one of your favorite ways to use up your vegetables at the end of the week - feel free to get creative and use what you have on hand!, , , Prep Time, 10, minutes, , mins, Cook Time, 11, minutes, , mins, Marinating Time, 30, minutes, , mins, Total Time, 51, minutes, , mins, , , Course:, Main Course, Vegetarian Main Course, Cuisine:, Mexican, Keyword:, spicy, zesty, , Servings:, 4, , Calories:, 337, kcal, , Author:, Wendy Polisi, , , , , Marinade, ¼, , cup, , avocado oil, 1, , lime, , juiced, 1, , teaspoon, , chili powder, 1, , teaspoon, , garlic powder, 1, , teaspoon, , smoked paprika, ½, , teaspoon, , ground cumin, Salt and Pepper to Taste, Vegetables, 1, , tablespoon, , avocado oil, 1, , large red onion, , sliced, 3, , bell peppers, , any color, seeded and cut into strips, 8, , ounces, , mushrooms, , sliced, 1, , zucchini, , cut into matchsticks, 2, , cloves, , garlic, , minced, For Serving, 8, , Corn Tortillas, Avocado or Guacamole, Salsa or Hot Sauce, Sour Cream, Cheese, US Customary, -, Metric,  Instructions: In a small bowl combine avocado oil, lime juice, chili powder, garlic powder, smoked paprika, cumin, salt and pepper.  Whisk to combine., Place mushrooms, onions, peppers, zucchini and garlic in a shallow dish.  Pour marinade over the vegetables and let marinade for 30 minutes and up to 2 hours., Heat the oil in a skillet to medium-high heat.  Drain the vegetables., Add the onion and peppers to the pan and cook, stirring often, for 6 minutes., Add mushrooms and zucchini and cook for 5 more minutes., Meanwhile, while the vegetables are cooking heat another skillet over medium-high heat.  Heat tortillas in the skillet until warmed through, about 2 minutes per side., To serve, add vegetables to the tortillas and top with avocado, salsa, sour cream, and cheese., , , Nutrition, Calories:, 337, kcal, |, Carbohydrates:, 37, g, |, Protein:, 7, g, |, Fat:, 19, g, |, Saturated Fat:, 2, g, |, Sodium:, 44, mg, |, Potassium:, 680, mg, |, Fiber:, 7, g, |, Sugar:, 8, g, |, Vitamin A:, 3285, IU, |, Vitamin C:, 131.3, mg, |, Calcium:, 71, mg, |, Iron:, 2, mg, , Filed Under:, Game Day Recipes, Gluten Free Recipes, Main Dish Recipes, Skillet, Vegetarian Recipes, More Vegetarian Recipes, 30-Minute Sautéed Brussels Sprouts, Hibachi Noodles on the Blackstone, 20 Minute Sautéed Broccolini Recipe with Parmesan, Ninja Creami Mango Sorbet, About, Wendy Polisi, Hi, I’m Wendy!  I’m a cook, 5 time cookbook author, blogger, natural health enthusiast…and most importantly a mom.  My boys are 18 & 19 and my late life princess is 10., , Reader Interactions, , , Leave a Comment & Rate this Recipe, Cancel reply, Your support means the world to me! If you loved this recipe, I would be grateful if you left a star rating while leaving a comment. Star ratings go a long way in helping other food enthusiasts discover and enjoy my recipes online., , Thank you!, Wendy, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Rating, , , , Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me if there is a reply to my comment, , , , , , Δ, , , Primary Sidebar, Thai Chicken Salad Recipe, Gluten Free Veggie Lasagna, Vegetarian Butternut Squash Quinoa Casserole, Slow Cooker Eggplant Parmesan, Sweet Potato Pomegranate Salad with Crispy Quinoa, 25-Minute Spanish Cauliflower Rice, , , , Family, Food and Fun!, , Hi, I’m Wendy! I’m a cook, 5 time cookbook author, blogger, natural health enthusiast…and most importantly a mom. My boys are 16 & 17 and my late life princess is 9., , More about me →, , , Footer, , ↑ back to top, , , , About, , , Privacy Policy, , Affiliate Disclosure, , Terms of Service, , About, , Web Stories, , , , , Newsletter, , , Sign Up!, for emails and updates, , , , , Contact, , , Contact, , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2025 Wendy Polisi, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , ,",
        "Portobello Vegan Fajitas": "Ingredients: , Avocado oil (or preferred oil), Portobello Mushrooms, Bell Peppers,, Red Onion, Salt and Pepper., , How to Make Vegan Fajitas, , STEP 1, - Blend up the fajita sauce and set it aside., , STEP 2, - Sauté the mushrooms until perfectly browned and set aside., , STEP 3, - In the same pan, sauté the onions and peppers until slightly tender and somewhat charred., , STEP 4, - Add the sauce and cook for a few minutes to incorporate flavors., , How to Serve, , They are delicious with warm corn tortillas, lime wedges, fresh-cut cilantro, , vegan sour cream, , guacamole, or, Spanish Rice and Beans, , but feel free to get creative. They are pretty spicy, but if you want to turn up the heat, add your favorite hot sauce or salsa., , , Tips for Cooking Mushrooms, , , The key to flavorful veggies is perfectly browning and caramelizing them. Make sure your heat is high enough and don't add them to the pan until it's hot. You should hear that familiar sizzle right away!, , Don't overcrowd the pan when sauteéing the mushrooms or they will steam instead of searing and browning. They need lots of room, so you may need to cook the portobellos in two batches., , To clean mushrooms, use a dry, slightly damp paper towel or a soft brush to clean each mushroom. Mushrooms are like sponges and will absorb a lot of water which can make the mushrooms soggy., , The brown gills on the mushrooms can be gently scraped if desired. They make the vegetable mixture a little darker, but it doesn't affect the taste. I usually leave them intact., , , An alternative to Fajita Sauce, , If you think the sauce might be too spicy for your taste, you can omit it altogether. Instead, add the dry spices, (garlic powder, cumin, chili powder), when the cooked mushrooms go into the pan of sauteéd onions and peppers. You can add ½ teaspoon of smoked paprika too. Add a squeeze of lime juice when everything is done., , More Flavor-Packed Recipes to Love, , , Creamy Chipotle Sauce, , One-Pan Mexican Quinoa, , General Tso's Tofu, , Mushroom Shawarma, , , I’d love to hear from you, , If you make these Vegan Fajitas, let me know what you think by ★ star rating it and leaving a comment below. It would really make my day. You can also follow me on, Instagram, and share your creation with me. Just tag me, @veganhuggs, and hashtag, #veganhuggs, so I don’t miss it., , Recipe, , , , Print Recipe, , Pin Recipe, , Rate this Recipe, , 5, from, 30, votes, , , Portobello Vegan Fajitas, , , Get your weeknight sizzling In just 30 minutes with these Portobello Vegan Fajitas. They are spicy, smoky, subtly sweet and robust! The flavors come together when the seared veggies meet the homemade fajita sauce. It's mouth-watering good!, , , Prep Time, 15, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 30, minutes, , mins, , , Course:, Entree, Cuisine:, Mexican, Vegan, , Servings:, 4, , People, , Calories:, 295, kcal, , Author:, Melissa Huggins, , US Customary, Metric, Fajita sauce, ▢, 2, , chipotle peppers in adobo sauce, , + 1 tablespoon sauce, ▢, ⅓, , cup, , vegetable broth, , , low sodium, ▢, 2, , tablespoons, , lime juice, , , fresh squeezed, ▢, ½, , teaspoon, , granulated garlic, ▢, 1, , teaspoon, , chili powder, ▢, 1, , teaspoon, , cumin, ▢, ¼, , teaspoon, , salt, Fajitas, ▢, 3-4, , tablespoons, , avocado oil, , (or any high smoke point oil), ▢, 4, , large, , portobello mushrooms, , , remove stems & cut caps into ½\" slices, ▢, 2, , large, , bell peppers, , , cut into ¼\" strips, ▢, 1, , large, , red onion, , , cut into ¼\" strips, ▢, , Fresh cracked pepper, , , to taste, ▢, , Salt, , , to taste, To Serve, ▢, 8, , 6\", , corn tortillas, , , warmed (*see note), ▢, , vegan sour cream, , (homemade or store-bought), ▢, *Optional, , chopped cilantro, lime wedges, guacamole and rice, , Cook Mode, Prevent your screen from going dark, , Fajitas, Heat a large pan over, medium-high heat, , (*see note), . When it's, very hot, , add 1-2 tablespoons of oil. As soon as the oil gets hot and shimmery,, add the mushrooms, (you should hear a sizzle)., Don't move the mushrooms around the first 2-3 minutes. This will give them time to sear and brown on one side., Now give them a stir and let them brown for another 2-3 minutes. Once they have reduced their size and are fully browned, sprinkle with a generous pinch of salt & pepper., (*optional: to deglaze, splash some sherry into the pan - this will pick up some brown bits and add more flavor to your mushrooms)., Remove from heat and place mushrooms on a plate or bowl., Heat the same large pan, between, , medium and medium-high heat, . When it's hot, add 2 tablespoons of oil. As soon as the oil gets hot and shimmery, add the onions and peppers, (you should hear a sizzle), . Now add a generous pinch of salt & pepper. Stir occasionally, but don't move them around too much, so they have time to get nicely browned and somewhat charred. This will create a robust flavor., Sauté until lightly tender and browned about 6-8 minutes., (*optional: to deglaze, splash some sherry into the pan), Now add the cooked mushrooms and fajita sauce. You'll want to stir frequently at this point to prevent burning the sauce. Taste for seasoning and add if needed. Cook for 1-2 minutes and remove from heat. Serve immediately., , , Notes, * Cleaning Mushrooms:, Use a dry, slightly damp paper towel or a soft brush to clean each mushroom. Mushrooms are like sponges and will absorb a lot of water which can make the mushrooms soggy. * The brown gills can be gently scraped if desired. They make the vegetable mixture a little darker, but it doesn't affect the taste. I usually leave them intact., , , , , , *Sauteéing Mushrooms:, don't overcrowd the pan when sauteéing the mushrooms or they will steam instead of searing. They need lots of room. You may need to cook the portobellos in two batches., , , , , , *Warming Tortillas:, , Place a tortilla in a cast iron or stainless steel skillet over medium heat, (don’t add oil), . Cook for 30 seconds on each side. Remove and cover with a slightly damp dish towel to keep soft & warm. Repeat with remaining tortillas. *Start this step before the fajitas are finished so everything will be nice and hot., , , , , , *Quicker option:, You can cook the mushrooms at the same time as the onions and peppers, just use 2 separate pans., , , , Nutrition, Serving:, 1, (2 fajitas), |, Calories:, 295, kcal, |, Carbohydrates:, 42, g, |, Protein:, 3, g, |, Fat:, 11, g, |, Saturated Fat:, 1, g, |, Sodium:, 249, mg, |, Potassium:, 204, mg, |, Fiber:, 2, g, |, Sugar:, 3, g, |, Vitamin A:, 2715, IU, |, Vitamin C:, 107.4, mg, |, Calcium:, 21, mg, |, Iron:, 1, mg, , , , Tried this recipe?, Follow me, @veganhuggs, and mention, #veganhuggs, !, , , , , , , , , , Vegan Huggs Weekly Newsletter, , Receive the tastiest vegan recipes straight to your inbox! Join now and get my Fan Favorites ebook FREE!, , , SUBSCRIBE, , , , , , , , , , , , , , , , , , , , , , , , , , , , , More Vegan Dinner Recipes, Creamy Gochujang Chickpeas and Lentils, Butter Bean Curry, Quinoa Stuffed Peppers, Vegan Pumpkin Mac and Cheese, , , , , , , , Pinterest, , , , , , , Facebook, , , , , , , Twitter, , , , , , , Yummly, , , , , , About Melissa, I’m Melissa Huggins – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, Read more..., , , , , , , , Reader Interactions, Comments, , , , 5 from 30 votes (, 15 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , Julia, , , January 13, 2025 at 12:49 pm, , , , This looks soooo good and I really want to try it! I was wondering about the chipotle peppers in adobo sauce, sorry for my ignorance and thanks a lot in advance for any help!🙏✨️, , , Reply, , , , , , , , Melissa Huggins, , , January 13, 2025 at 1:06 pm, , , , Hi Julia, good question! Yes, you can use the paste instead of the sauce. Each brand might vary regarding the spice level, so you may want to use caution so it's not overly spicy. I'm so glad you'll give them a try. Thank you 🙂, , , Reply, , , , , , , , , , Michele, , , October 02, 2024 at 5:41 pm, , , , Delicious.  Use less adobe peppers if you don't want it spicy., , , Reply, , , , , , , , Melissa Huggins, , , November 24, 2024 at 9:16 am, , , , Hi Michele, I'm so glad you loved the recipe. Thank you for sharing feedback. 🙂, , , Reply, , , , , , , , , , Pablo, , , February 08, 2024 at 7:50 pm, , , , Wonderful and tasteful.   Healthy and smells amazing., , , Reply, , , , , , , , Melissa Huggins, , , February 15, 2024 at 1:54 pm, , , , So glad you loved them, Pablo! Thanks for trying the recipe. 🙂, , , Reply, , , , , , , , Kimberly, , , March 20, 2024 at 11:49 am, , , , Have made this recipe four times.  It is in the weekly rotation of meals.  Thank you so so much!, , , , , , , , , Melissa Huggins, , , April 16, 2024 at 3:32 pm, , , , Hi Kimberly, I'm so happy you love the recipe and it's a part of your rotation. Thanks so much for leaving feedback. 🙂, , , , , , , , , « Older Comments, Primary Sidebar, , , , I’m Melissa Huggins, – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, , More about me →, , , Search, Search, , vegan huggs facebook, , vegan huggs Instagram., , vegan huggs pinterest, , YouTube, , My Most Popular, , Vegan Crab Cakes, Easy Vegan Quiche, Sticky Sesame Cauliflower, Creamy Vegan Potato Leek Soup, Cheesy Vegan Cauliflower Casserole, Grilled Portobello Mushroom Steaks, Footer, , SEEN ON, , , ^ back to top, , , , About, , About Me, Privacy Policy, Recipe Index, , , , Newsletter, , Sign Up!, for emails and updates, , , Contact, , Contact, Subscribe, , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2020, Vegan Huggs, , We use cookies to ensure that you have the best experience possible on our website. By continuing on the site you agree to the use of your cookies by www.veganhuggs.com, , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: scroll down to the recipe card., , Chipotle peppers in adobo sauce, Vegetable broth, Lime juice, Garlic Powder, Chili powder, Cumin, Salt, , The robust and smoky flavor comes from the chipotle peppers in adobo sauce. I use them to amp up so many recipes. Buy a few cans and keep them in your pantry. You won't regret it!, , To make the sauce, just blend everything up until smooth and get those fajitas ready for greatness!, , , Fajita Sauce",
        "Mexican vegetable fajitas": "Ingredients: How to make Fajitas, Pro tips and tricks to make best Vegetable Fajita, What is the best fajitas seasoning?, What are the best vegetables to use for veggie fajitas?, Tips, tricks, and substitutions, What to serve with Vegetable Fajita?, Do I need a skillet to cook Fajitas?, What tortillas are best with Vegetable Fajita?, How to store veggie fajitas, How long does this vegetable fajita recipe keep?, How to reheat vegetable fajita?, Let us know what you think, How to make the Best Vegetable Fajitas, , What are fajitas?, , Fajitas are a Tex-Mex dish that involves thinly sliced vegetables, peppers, onions, and Southwest spices and served by wrapping in a flour or corn tortilla. The spicy combo offers a tangy flavor that is hard to beat., , Watch Vegetable Fajita Video Recipe, , , Why you’ll love these veggie packed fajitas, , Our fajitas are packed full of different veggies and spices. They will tantalize your taste buds and get even your pickiest eaters to enjoy their vegetables., , You’ll also love that these veggie filled treats are naturally vegan. If you don’t follow a vegan diet though, you can easily top them with sour cream or your favorite cheese., , For ease, we provide you with two different ways to cook them. You can place them in your oven or you can use your air fryer to create perfectly charred and slightly crispy veggies for your filling., , Since these are homemade, you can control what goes in them. You can add additional veggies if you like or even omit some of our suggestions without drastically altering the recipe., , , , When you are hungry for fajitas, , , Olive oil -you could use a different light tasting oil if you prefer, , Garlic powder, , Onion powder, , Paprika, , Cumin powder, , Chili powder, , Salt, , Red, green, and yellow bell peppers - you’ll need to cut them into stripes, , Onion, , Portobello mushrooms, , Tortillas, , Additional toppings - guacamole, salsa, sour cream or vegan crema, chopped fresh cilantro (coriander), or cheese, , , , How to make Fajitas, , , First, mix together the olive oil and all of the spices in a small bowl or measuring cup. Once mixed, set the bowl aside., , Next, place the vegetables into a large mixing bowl and then pour the spiced olive oil on top of them. We often use tongs to mix until the veggies are all coated in the spices., , , , , Once the veggies are ready, you need to either line a baking sheet or your air fryer basket with parchment paper. Next, spread the veggies over the paper., , When using the oven, preheat it to 450°F and then cook for about 20 minutes or until the vegetables have softened and browned., , If you want to use your air fryer, first preheat it to 200C / 390F and then cook for 15 minutes.Half way through frying them, carefully open the fryer up to mix the vegetables., , , , , Whether you use the oven or fryer, the veggies are ready when they become juicy and appear a bit charred. If they are not to your desired level of doneness, you can cook them for about 5 more minutes or until they reach your desired level of perfection., , Serve the fajitas in flour or corn tortillas alongside your favorite sides and with your favorite toppings., , , Pro tips and tricks to make best Vegetable Fajita, , If you are ready to make fajitas like a pro, check out these tips below:, , , Sub in as many additional veggies as you like. Just try to cut them into similar size pieces or stripes whenever possible., , Don’t skip the onions or peppers, these provide part of their great flavor., , When using an air fryer, always make sure to leave a bit of room between veggies. Air needs to hit each side of veggies to provide uniform charring and cooking., , , , What is the best fajitas seasoning?, , When you buy a premade packet or bottle of fajita seasoning, you are often buying salt mixed with a few spices. And though this may provide some flavor, it is often very salty., , But if you are looking for good flavor and far less salt, you can make your own seasoning at home using spices you probably already have on hand. All you need for delicious flavor is garlic powder, onion powder, paprika, cumin powder, chili powder, and a small amount of salt., , What are the best vegetables to use for veggie fajitas?, , Without question, you really can’t make a fajita without bell peppers and onions. But they are really just a starting point., , In our recipe, we use mushrooms as an added veggie. For added flavors, textures, or nutrients, you could easily add veggies like:, , , zucchini, , corn, , broccoli, , squash, , black beans, , potatoes, , jalapenos, , , , Tips, tricks, and substitutions, , When making homemade fajitas, you can follow these easy tips to make your life a bit easier:, , , If you can’t find different colored peppers, you can use the same variety of peppers., , For added spice, thinly slice a jalapeno pepper., , When baking or cooking in the air fryer, leave them in a bit longer for more charring., , Try to make the pepper and onion slices about the same size for uniform cooking., , Add as many toppings and extras as you like to dress them up., , , What to serve with Vegetable Fajita?, , Fajitas pair well with a lot of different Tex-Mex inspired foods., , For rice lovers, you could serve them alongside our, Spanish Rice, or our spicy, Fiesta Rice, ., , If you love beans, you could try our homemade, refried beans, recipe, . Or if you are looking for a lower carb option with plenty of flavor, you could serve them with our Mexican, Cauliflower Rice Bowl, ., , , Do I need a skillet to cook Fajitas?, , Some recipes call for cooking fajitas on the stovetop using a cast iron or other heavy iron skillet. You may have even seen a server bring out a sizzling skillet full of fajita filling at a local restaurant. And while this is one great way to cook the filling, you don’t have to use a skillet to get a great tasting fajita., , In our recipe, we use either an air fryer or oven to crisp up and roast the veggie filling. The slight charring provides additional flavor that is not always easy to get from a skillet., , What tortillas are best with Vegetable Fajita?, , You can use your favorite type of tortilla when making fajitas. Both flour and corn tortilla work very well, so it really comes down to a matter of taste and texture., , Flour tortillas tend to be softer and have a mild flavor. Corn tortillas are often a bit tougher and can break a bit more easily. They also have a slight corn flavor to them., , Though not traditional for fajitas, you could also use crunchy taco shells if you are in a pinch or just like the flavor., , , How to store veggie fajitas, , When storing veggie fajitas, it is a good idea to keep the veggies and any leftover tortillas separate. You should place any tortillas back in their bag or in any air tight container., , You can then place the fajita filling in an airtight container. Once sealed, you can place the container in the fridge for up to about 5 days., , How long does this vegetable fajita recipe keep?, , The veggies should stay fresh in the fridge for up to five days. The sooner you eat them, the fresher they will taste. You can make these ahead to serve for lunch during the week or as a very quick leftovers night on a busy weeknight., , , How to reheat vegetable fajita?, , It is super easy to reheat the filling. You can place the container or an individual serving in the microwave and cook for about 2 minutes or until heated through., , Or if you prefer, you could gently reheat them over medium low heat on the stove top. If you use the stove top, make sure to gently stir them as they heat through., , More Air Fryer Recipes that you might like to try, , , Baked Potatoes, , Crispy Gobi Manchurian, , Cauliflower Steaks, , Apple chips, , Zucchini  chips, , Cauliflower Wings, , Onion Rings, , Olive Garden Bread Sticks, , , Let us know what you think, , If you make this delicious recipe, let us know how it went! When you make this, be sure to take a pic and tag us on Instagram, , @dbellyrulesdmind, or Facebook, @thebellyrulesthemind, !, , , , , Continue to Content, , , , , , , , How to make the Best Vegetable Fajitas, , , , Yield:, , 8 servings, , , , Prep Time:, , 5 minutes, , , , , Cook Time:, , 15 minutes, , , , , Additional Time:, , 5 minutes, , , , , Total Time:, , 25 minutes, , , , , , Vegetable fajitas should make your mouth water just thinking about them. They are the perfect handheld, Tex-Mex food that just about everyone loves. Packed full of flavor, this popular and wholesome street food is something you can easily make at home and serve to your hungry family., , , , , , Print, , , , , , , , Olive oil - ¼ cup, , Garlic powder - 1 tsp., , Onion powder - 1 tsp., , Paprika - ½ tbsp., , Cumin powder - ½ tsp., , Salt - 1 tsp., , Chili powder - ½ tsp., , , , , Vegetables, , , 3 small red, green, yellow bell peppers, cut into stripes, , 1 medium onion, cut into half slices., , 2 medium portabella mushrooms, cut into medium pieces, , Serving, , 8 tortillas, , Toppings of your choice - guacamole, salsa, sour cream or vegan crema, chopped fresh cilantro (coriander), , , , ,  Instructions: », Air Fryer, How to make the Best Vegetable Fajitas, , Modified:, Apr 6, 2022, · Published:, Sep 17, 2021, by, Soniya Saluja, · This post may contain affiliate links ·, 5 Comments, Jump to Recipe, Vegetable fajita should make your mouth water just thinking about them. They are the perfect handheld, Tex-Mex food that just about everyone loves. Packed full of flavor, this popular and wholesome street food is something you can easily make at home and serve to your hungry family., , LET’S BE FRIENDS ON PINTEREST, ! WE’RE ALWAYS PINNING TASTY RECIPES, , , Recipe Navigation, What are fajitas?, Watch Vegetable Fajita Video Recipe, Why you’ll love these veggie packed fajitas, , In a small bowl or measuring cup, mix together the olive oil and the spices. Then set it aside., Place the vegetables into a large mixing bowl and pour the spiced olive oil on top of them. Mix everything very well., Line a large baking sheet with parchment paper and evenly spread the vegetables out on  it., Roast the Fajita Vegetables at 450°F for about 20 minutes, or until the vegetables have softened and browned. Or  Pre-heat the air fryer to 200C / 390F., Cook for 15 minutes, opening the fryer up to mix the vegetables halfway through., They are ready when the vegetables are juicy and a little bit charred., You may want to cook for another 5 minutes if they are not yet charred to your liking., Serve immediately with warmed tortillas and your toppings of choice., , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , Organic Red Chilli Powder 7 Ounce - Non GMO Extra Hot Chili - by Jiva Organics, , , , , , , , , McCormick Ground Cumin, 14 oz, , , , , , , , , McCormick Classic Garlic Powder, Value Size, 8.75 Oz, , , , , , , , , Dexas Microwavable Tortilla Warmer, Red, , , , , , , , , Gourmia GAF400 Electric Multipurpose Classic Rapid Air Fryer with Dual Dial Timer & Temperature Controls, 10 Cup/4.5 Qt. Capacity, 1230W, Black, , , , , , , , , Instant Pot Vortex 6-Quart 4-in-1 Air Fryer, , , , , , , , , , , , , , Follow us for more delicious Recipes !, , Did you make recipe? don’t forget to come back and leave your feedback and star rating., , , , , , , © Soniya Saluja, , , , Cuisine:, Mexican, , , , , , , , , More Air Fryer, Traditional Crispy Sabudana Vada Recipe, Easy Air Fryer Cheesecake Chimichanga Recipe, Crispy Frozen Air Fryer Diced Potatoes in minutes, Warning: This Air Fryer Mozzarella Stick Recipe May Cause Addiction!, Comments, , , , , , Lu, , says, , , November 13, 2021 at 6:22 pm, , , , You say roast them for 20 minutes and then you say after 15 minutes (half-way through) to mix them up. Half way through would mean cooking for 30 minutes. What am I missing. Also, how long in the air fryer at 390F?, , , Reply, , , , , , , , Natalie, , says, , , September 17, 2021 at 12:50 pm, , , , I will have to give these meatles fajitas a try. Looks delicious. Can't wait to serve this to my family. Thanks!, , , Reply, , , , , , , , Julie, , says, , , September 17, 2021 at 11:18 am, , , , The veggies are the best part of the fajita.  Which makes this a perfect recipe for me. Can't wait to make these., , , Reply, , , , , , , , Jenn, , says, , , September 17, 2021 at 10:52 am, , , , These are terrific! I love the flavor combination and it's a veggie meal we all feel good about eating!, , , Reply, , , , , , , , Emily Flint, , says, , , September 17, 2021 at 10:25 am, , , , These fajitas had the perfect blend of spices! My family loved them and didn't even realize it was all veggies!, , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , Welcome!, , A vegetarian & vegan food blog where we (Anvita & Soniya) share everyday healthy-ish recipes, some occasional treats, and even-you-can-do-this ideas., , , Read more, , , , Popular Recipes, , Instant Pot 2 Ingredient Homemade Yogurt !, Instant Pot Vegetable Chowmein Recipe, Date & Walnut Loaf Cake, Minestrone Soup (Copycat Olive Garden), , , Trending Now, , , , , , Footer, , , , freebie alert!, , Download our Vegetarian Grazing Table Grocery List, , Download our, FREE, Vegetarian Grazing Table Grocery List so you can start setting up an Instagram worthy spread for your next gathering., , , Get the list!, , , , , , , , , About Us, , Privacy Policy, , Contact, , ↑ back to top, , , , , , , Copyright © 2024, The Belly Rules The Mind, •, Powered by Feast+, , , , , Skip to Recipe, , , , , , , , , , ,",
        "Tofu Sofritos": "Ingredients: How To Make This Recipe, Tips & Tricks, Storing, Freezing, Related Recipes, I Love To Hear From You!, , Why This Recipe Works, , If you love Chipotle tofu sofritas, then this is the right place for you. This recipe is the, perfect copy-cat recipe, and it tastes just like the original!, , Made with crumbled tofu, a medley of aromatic spices, and a zesty blend of tomatoes and peppers, this recipe works like magic to deliver a burst of flavors that will keep you coming back for more., , I absolutely love this recipe because it is incredibly versatile, , bursting with bold flavors, , and offers a protein-packed alternative to traditional meat-based dishes. It can be enjoyed in a variety of ways – as a filling for tacos and, burritos, , a topping for rice bowls, or even a flavorful addition to salads., , I experimented with this recipe quite a bit to get it perfect for you. For the best results, I recommend frying the tofu first and then crumble it when it’s nicely browned. The crumbled tofu soaks up the savory spices and seasonings, creating a satisfying and meaty texture that will have even the most die-hard meat lovers asking for seconds., , The marinade, couldn’t be any easier, . It’s made of chipotle peppers in adobo sauce, a green bell pepper, tomato paste, a fresh tomato, oregano, smoked paprika powder, garlic, and a bit of salt., , Many sofrita recipes call for roasting a poblano pepper, but I wanted to create an easier recipe that is perfect for busy weeknights. So I skipped this step and used a canned chipotle pepper instead, which works perfectly., , For ultimate flavor, simmer the crumbled tofu in the marinade for 15 minutes. It’s very, easy to adjust the spice level, of the marinade to your personal preference by using more or less of the chipotle peppers., , You can also adjust the amount of salt to your personal liking.  And let’s not forget that making sofritas at home is, much cheaper, . Trust me, once you try this recipe, you’ll be hooked!, , , , , , , , Firm Tofu, – Don’t use soft or silken tofu for this recipe as it has a different texture. For best results use extra firm tofu., , Chipotle Pepper, – canned whole chipotles in adobo sauce, , Adobo Sauce, – from the canned chipotle pepper, , Smoked Paprika Powder, – if possible don’t replace it with regular paprika powder as it has a very unique and smoky taste., , Salsa, – use your favorite kind of salsa., , Garlic, – fresh., , , , , How To Make This Recipe, , , , 1. Step, : Drain the tofu. Wrap it in paper towels and squeeze out as much of the excess water as possible. Cut it into slices., , 2. Step, : In a large non-stick frying pan, heat some oil and cook the tofu on high heat until it’s nicely browned on both sides. This should take about 8 minutes., , 3. Step, : In the meantime, , 4. Step, : When the tofu is nicely browned, use a wooden spoon to crumble it. The crumbles shouldn’t be too small., , , 5. Step, : Add the sauce to the tofu., , 6. Step, : Stir well., , 7. Step, : Simmer for 15 minutes on medium heat., , 8. Step, : Serve with burritos, tacos, or in a burrito bowl with brown rice, lettuce, guacamole, and vegan sour cream., , Tips & Tricks, , , Make sure to use very firm tofu. The recipe doesn’t work with soft tofu because it doesn’t crumble and it also doesn’t absorb sauces well., , If your tofu is not firm enough, press it for 20-30 minutes before you start with the recipe. You could do this by placing a stack of cookbooks on top or by using a tofu press. I posted a post on, how to cook tofu, a while ago that also explains how to press tofu., , Adjust the level of spiciness to your personal liking by using more or less of the chipotle peppers. We liked one chipotle and about two tablespoons of the adobo sauce, but feel free to adjust the amount you’re using., , I love serving the sofritas with brown rice, black beans, lettuce, guacamole, vegan sour cream, nachos, and maybe a bit of vegan shredded cheese. So good!, , , , Storing, , Stored in an airtight container in the fridge, the sofritas will last up to, 3-4 days, ., , Freezing, , This recipe freezes pretty well. Let it cool down completely after cooking, then transfer it into a freezer-safe container. You can store it in the freezer for, up to 4 weeks, ., , Related Recipes, , Vegan Burrito, Jackfruit Tacos, Vegan Burrito Bowl with Quinoa, Mexican Pizza, , I Love To Hear From You!, , I hope you like these sofritas as much as we do around here., , If you give this recipe a try, I’d love to know what you think about it. Just, leave me a comment and a star rating, below. Your comments really make my day!, , You like my recipes and want to see more? Then follow me on, Facebook, ,, Instagram, , or, Pinterest, !, , Sina, , , , , , , If you love Chipotle, you have to try these homemade tofu sofritas! The recipe is super easy to make, incredibly delicious, packed with flavor, and entirely vegan! It's ready in just 30 minutes!, , , 5, from, 19, votes, , , Print, , Pin, , Rate, , , Course:, Entrées, Cuisine:, American, Diet:, Vegan, Vegetarian, , Prep Time:, 7, minutes, , mins, Cook Time:, 23, minutes, , mins, , Servings:, 4, , servings, , Calories:, 96, kcal, , Author:, Sina, , , ▢, 14, , oz, , very firm tofu, ▢, 1, , chipotle in adobo sauce (canned), ▢, 2, , tablespoons, , adobo sauce (from the canned chipotle), ▢, 3, , cloves of garlic, ▢, 2, , teaspoons, , cumin, ▢, 1/2, , teaspoon, , smoked paprika powder, ▢, 1, , green bell pepper, roughly chopped, ▢, 1/2, , teaspoon, , dried oregano, ▢, 1, , tomato, quartered, ▢, 3/4, , cup, , salsa, ▢, 1, , teaspoon, , salt, ▢, 2, , teaspoons, , tomato paste, , When the tofu is nicely browned, use a wooden spoon to crumble it. The crumbles shouldn't be too small., Add the sauce to the tofu., Stir well., Simmer for 15 minutes on medium heat., Serve with burritos, tacos, or in a burrito bowl with brown rice, lettuce, guacamole, and vegan sour cream., , , Notes, , Make sure to use very firm tofu. The recipe doesn’t work with soft tofu because it doesn’t crumble and it also doesn’t absorb sauces well., , If your tofu is not firm enough, press it for 20-30 minutes before you start with the recipe. You could do this by placing a stack of cookbooks on top or by using a tofu press. I posted a post on, how to cook tofu, a while ago that also explains how to press tofu., , Adjust the level of spiciness to your personal liking by using more or less of the chipotle peppers. We liked one chipotle and about two tablespoons of the adobo sauce, but feel free to adjust the amount you’re using., , I love serving the sofritas with brown rice, black beans, lettuce, guacamole, vegan sour cream, nachos, and maybe a bit of vegan shredded cheese. So good!, , , Nutrition, Calories:, 96, kcal, |, Carbohydrates:, 11, g, |, Protein:, 9, g, |, Fat:, 2, g, |, Saturated Fat:, 1, g, |, Sodium:, 1017, mg, |, Potassium:, 474, mg, |, Fiber:, 3, g, |, Sugar:, 6, g, |, Vitamin A:, 659, IU, |, Vitamin C:, 30, mg, |, Calcium:, 69, mg, |, Iron:, 2, mg, , , , , Tried this recipe?, Mention, @_veganheaven_, or tag, #veganheaven, !, , , Rate the recipe!, If you like this recipe, please leave a good rating! This will help other readers., , , , , More Recipes, Spinach Tomato Pasta, Lemon Olive Oil Cake, Corn Tomato Avocado Salad, Sausage Fennel Pasta, Reader Interactions, Comments, , , , , , Gail, , , March 09, 2025 at 12:34 am, , , , Love this recipe! I will definitely be making this again!, Thank you, , , Reply, , , , , , , , hannah, , , June 13, 2023 at 6:33 pm, , , , tastes just like chipotle sofritas! spot on, , , Reply, , , , , , , , Debbie, , , May 13, 2023 at 9:49 pm, , , , This is a great recipe! It is a go to in our house for Mexican suppers. Serve it with a side of refried beans, a chopped kale salad, salsa, taco salad dressing, and chips or rice. Yummy!, , , Reply, , , , , , , , George S., , , March 05, 2023 at 8:02 pm, , , , Wow! This recipe is delicious. I kinda cheated with the tomatoes and substituted a can of diced tomatoes and omitted the tomato paste (by accident) and salsa because I used some of the juice from the diced tomatoes. It came out simply delicious. Much props for the recipe! I put some sofritas in a flour tortilla with cheese, and warmed it up in a dry pan!  Can’t wait to try it, similar to a Chipotle bowl., , , Reply, , , , , , , , GEM, , , February 21, 2023 at 2:26 am, , , , This recipe was BETTER than Chipotle. Made it for guests and it was delicious! Adding this to my rotation for sure! Followed to the letter, was perfect!, , , Reply, , , , , , , , K, , , August 09, 2022 at 8:06 pm, , , , Thank you for this awesome recipe. My family loved it!, , , Reply, , , , , , , , Mimi, , , June 18, 2021 at 8:31 pm, , , , This is super simple to make and absolutely delicious!, , , Reply, , , , , , , , Andrea, , , April 03, 2021 at 1:59 pm, , , , Really great recipe.  Super easy to make and so delish.  It’s a keeper., , , Reply, , , , , , , , Rick, , , December 14, 2020 at 12:03 am, , , , I prepared this exactly as written and I wouldn’t change a thing! muy  delicioso. I’m looking forward to trying more of your recipes. Thank you for sharing., , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , Primary Sidebar, Facebook, Instagram, Pinterest, RSS, Tumblr, Twitter, , , , Hi, I'm Sina and this is my recipe blog where I share heavenly simple and sinfully delicious vegan recipes., , , Popular Recipes, , Lemon Spaghetti with Spinach (One Pot), One Pan Mexican Quinoa, Roasted Chickpeas, Thai Pineapple Fried Rice Recipe (Vegan), Vegan Meatballs with Spaghetti, Creamy Vegan One Pot Pasta (Asian Style), , , , Grilling, , Vegetable Kabobs, Vegan Black Bean Burgers (Grillable!), Vegan Potato Salad, Creamy Vegan Dip with Dates, Tofu Vegetable Skewers, Lentil Burgers, , , , , , , , , About Sina, , As a mom of twins, I know how busy life can be. So if you're looking for easy and quick vegan recipes the whole family loves, this is the right place for you!, , Learn more about me →, , , , Popular Recipes, , Lemon Spaghetti with Spinach (One Pot), One Pan Mexican Quinoa, Roasted Chickpeas, Thai Pineapple Fried Rice Recipe (Vegan), Vegan Meatballs with Spaghetti, Creamy Vegan One Pot Pasta (Asian Style), , Healthy Recipes, , Greek Pasta Salad with Easy Greek Vinaigrette, Quinoa Black Bean Salad, Sofritas, Vegan Chickpea Salad, Vegan Pad Thai, Easy Vegan Chickpea Curry, Footer, , , , , Impressum/Legal Notice, , , Privacy Policy, , Facebook, Instagram, Pinterest, RSS, Tumblr, Twitter, , Search, , Affiliate Disclaimer:, , Some posts may contain affiliate links, which means that if you click on one of the product links and actually decide to buy it, I’ll receive a small percentage of the total price - of course this does not cause any extra costs for you. I only recommend products that I personally love and use regularly., , , , , , Copyright © 2025 by Vegan Heaven, ·, Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: Drain the tofu. Wrap it in paper towels and squeeze out as much of the excess water as possible. Cut it into slices, In a large non-stick frying pan, heat some oil and cook the tofu on high heat until it's nicely browned on both sides. This should take about 8 minutes., In the meantime",
        "Vegan Quesarito": "Ingredients: , 1x, 2x, 3x, Seasoned Rice, ½, , cup, , white rice, , dry, 1, , tsp, , taco seasoning, 2, , tbsp, , tomato sauce, Pinch, , of salt, 1 ¼, , cup, , water, Vegan Ground “Beef”, 3, , oz, , ground “beef” crumbles [85g], 1, , tsp, , taco seasoning, 1, , tsp, , oil, ¼, , onion [25g], Nacho Cheese Sauce, 1 ½, , cups, , potato, , chopped, ½, , cup, , cashews, 1, , carrot, , chopped, 1, , tbsp, , nutritional yeast, ¼, , tsp, , salt, , or more to taste, ½, , cup, , vegan cheddar shreds, , optional but highly encouraged, ½, , cup, , non-dairy milk, , unflavored and unsweetened, 6, , tortillas, 1, , cup, , vegan cheddar shreds, 1 ½, , tbsp, , vegan chipotle mayo, 3, , tbsp, , vegan sour cream, Spray oil, , oil or vegan butter for pan, , Add the rice, beans, nacho cheese sauce, chiptole mayo and sour cream. Roll it up like a regular burrito., Place it back into the warm pan with the stove on low heat. This will help to seal the quesarito up and brown the outside a bit., Enjoy with extra cheese sauce or sour cream if you like!, , Video, , Notes, , If you have a Trader Joe’s nearby you can use 85g of the cashew fiesta dip, ⅛ cup vegan cheddar shreds and ¼ cup of almond milk to make an easier blender free cheese sauce, , You will have leftover cheese sauce. It is great for mac and cheese, queso dip or more quesaritos., , , , , , Keyword, quesarito, vegan taco bell recipes, veganized fast food, , , , , Tried this recipe?, Let us know, how it was!, , SAVE TO PINTEREST, , , , , Plantifully Based® is part of the Amazon, , Affiliate Partner Program. Links on here may be from Amazon or other affiliate programs. If you decide to purchase through a link I will receive a small commission. This helps to run the blog and make more recipes., , If you enjoyed this recipe please be sure to leave a comment or review, it is so helpful for the blog. Thank you!, , , «, 20 Minute Meals, Pad Thai Ramen Soup, », , , , 10305, , shares, , , , , , , , , , , , , , , 10305, , , , , , , , , Reader Interactions, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, , , Email, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, , , , about me, , Hello there and welcome, I am Francesca Bonadonna the food blogger behind this account. Here is a place to find vegan inspiration and ideas! I am a full time food photographer, recipe creator, social media content creator, and cookbook author., , Learn more about me →, , , Get My Cookbook, , , My Podcast, , , , Spring Recipes, , Rich Vegan Pizza Rustica (Italian Easter Pie), Vegan Caprese Pasta Salad (Homemade Vegan Mozzarella), Delicious Homemade Vegan Banana Pudding, Vegan Green Goddess Dressing (Made with Tofu), , , YouTube Channel, , , , , , Facebook, Instagram, Pinterest, YouTube, , , , Footer, , ↑ back to top, , , , About, , , Privacy Policy, , , , , , , , Contact, , , Contact, , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2025, Plantifully Based, , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , Instructions: , If you are going to make the cheese sauce using the above recipe and not the Trader Joe’s cashew fiesta dip way prepare cheese sauce first., Boil the potatoes, cashews and carrots for 20 minutes or until everything is soft. Once the potatoes, cashews and carrots are done cooking strain them if there is any water left. Place it into a blender along with the nutritional yeast, salt, vegan cheddar shreds and non-dairy milk. Blend until smooth. You may need to add more non-dairy milk to get it very smooth. Taste it and make sure there is enough salt., Begin the rice by bringing it to a boil and then dropping it to a simmer for 15-20 minutes or until all water has been absorbed. Rice should be fluffy. Once it has cooked add in the taco seasoning, tomato sauce and salt. Stir to combine., To prepare the vegan ground “beef” start by adding the oil and onion into a pan on a low heat. Once the onions are translucent and fragrant add in the ground “beef” and cook for 5-10 minutes. Add in the taco seasoning., Make the quesadilla by adding a bit of spray oil, oil or vegan butter into a pan on a low heat. Add in ⅓ cup of vegan cheese in between two tortillas. Place a lid on top to help the cheese melt better. After 3-5 minutes vegan cheese should be melted. DO NOT BURN THE QUESADILLA. It is easier to roll the quesadilla up when it is softer., Take the quesadilla out and turn the stove off."
    }
}