{
    "ingredients": {
        "Beans Poriyal": "beans,chana dal,coconut,",
        "Beans Patoli": "Green beans,chana dal",
        "Beans Potato Curry": "green beans,potato,onion"
    },
    "recipe_url": {
        "Beans Poriyal": "https://www.indianhealthyrecipes.com/beans-poriyal-recipe-beans-stir-fry/",
        "Beans Patoli": "https://veggieplatter.blogspot.com/search?q=beans+patoli",
        "Beans Potato Curry": "https://www.cookwithmanali.com/aloo-beans"
    },
    "Recipe": {
        "Beans Poriyal": "Ingredients: ▢, 250, , grams, , green beans, , (preferably fresh and tender), ▢, 3 to 4, , tablespoons, , coconut, , (fresh, frozen or desiccated unsweetened), ▢, ½, , teaspoon, , chilli powder, , or  ¾ tsp sambar powder or 1 green chilli, ▢, 1 to 1½, , tablespoon, , oil, ▢, ¼, , teaspoon, , mustard seeds, ▢, 1, , teaspoon, , urad dal, , (optional), ▢, 1, , teaspoon, , chana dal, , (optional), ▢, ⅛, , teaspoon, , hing, , (asafoetida) (optional), ▢, 1, , red chilli, , broken, ▢, 1, , sprig, , curry leaves, ▢, ⅛, , teaspoon, , turmeric, ▢, ⅓, , teaspoon, , salt,  Instructions: , For more vegetable stir fry recipes, you can check, Bitter gourd stir fry, Potato stir fry, Vendakkai poriyal, Carrot stir fry, Ladies finger stir fry, , , , , Photo Guide, , How to make Green Beans Poriyal (Stepwise photos), , Preparation, , 1. Nip off both the ends of the beans and remove the fibrous strings if any. For tender & young beans there will be no strings on the sides. For this recipe I have used about 250 grams., , , , 2. I usually spray some vinegar and allow them to rest for 10 mins. Then soak for another 10 mins and then wash off a few times. Drain water completely., , , , 3. Hold a handful of beans together and begin to chop them to the desired size. If beans are not tender, then it is good to chop them to small sizes. This helps them cook faster. If using young french beans then you can chop them to almost half inch long., , , , Make poriyal, , 4. Heat 1 to 1½ tablespoon oil in a pan or kadai. Add ¼ to ½ teaspoon mustard seeds, 1 broken red chili, 1 teaspoon urad dal and 1 teaspoon chana dal. Fry them until golden. If you do not have the lentils you may skip them but they impart a nutty aroma., , , , 5. Then add 1 pinch hing and 1 sprig curry leaves. Saute for a while until the leaves turn crisp., , , , 6. Add chopped beans, ⅛ teaspoon turmeric and ⅓ teaspoon salt. Stir fry for about 2 mins., , , , 7. Cover and cook for 2 mins on a low flame. After 2 to 3 mins, open the lid to check if it has released any moisture., , , , 8. If the beans look too dry, sprinkle some water, a few tablespoons would be good enough. If beans are fresh and tender they tend to get cooked with their own moisture, you may not need to add any water., , , , 9. When the French beans are cooked completely to tender, then add ½ teaspoon red chili powder or ¾ tsp sambar powder. You can also use 1 to 2 tbsp peanut podi, flax seed podi or idli podi., , , , 10. Add fresh grated coconut or desiccated coconut., , , , 11. Stir well and saute for a minute. Switch off the stove., , , , Serve beans poriyal with rice, rasam and sambar., , , , Pro Tips, , Green Beans: Use tender, fresher and young green beans that are crisp, feel firm and easily snap. Mature beans that are harvested later won’t cook faster in the pan. This is a stir fried dish so young veggies go well as we don’t cook them with water in the recipe., , Coconut: Though traditionally fresh grated coconut is used. It can easily be replaced with frozen or unsweetened desiccated coconut or with copra. Though desiccated coconut won’t taste the same it is just okay to use. A better substitute is to use idli podi or chutney podi., , , Related Recipes, , Kakarakaya fry | ..., , , Potato Fry (Aloo ..., , , Vendakkai Poriyal..., , , Carrot Curry, , , Ladies Finger Fry..., , , Sambar Recipe, Ho..., , , , , Recipe Card, , , , , , Beans Poriyal (Indian Green Beans Fry), , , 5, from, 62, votes, , , , Beans poriyal is a traditional South Indian dish made with green beans, spices, curry leaves and fresh coconut. Serve it with rice, roti or as a side in any meal. Make it on the stovetop in a pan or in the Instant Pot., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 10, minutes, , minutes, Cook Time, 15, minutes, , minutes, Total Time, 25, minutes, , minutes, , Servings, 3, , Author, Swasthi, , , , ▢, Cut off both the edges of beans. Rinse them well in lot of water or under running water. Drain them., ▢, Chop to ¼ inch pieces., How to make Green Beans Poriyal, ▢, Heat oil in a pan. Add mustard, urad dal, chana dal and red chili., ▢, When the dal turn golden, add hing and curry leaves., ▢, Fry till the curry leaves turn crisp., ▢, Add chopped beans,turmeric along with salt and saute for 2 mins., ▢, Cook covered for 2 to 3 mins on a low flame. This helps to release the moisture., ▢, If needed sprinkle 1 to 2 tbsps water. Cover and cook until soft and tender., ▢, Add sambar powder or chili powder and coconut., ▢, Mix well and saute for a minute., ▢, Switch off and serve beans poriyal with rice., Instant pot Green Beans Poriyal, ▢, It is important to chop the beans to at least ½ inch pieces. If you chop them too small, they will become mushy., ▢, Press saute button on your instant pot. Pour oil to the steel insert., ▢, When the oil turns hot, add mustard, red chili, urad dal and chana dal. Saute for a minute or so until the dal turns golden., ▢, Then stir in curry leaves and hing. Add chopped beans, turmeric and salt., ▢, Press cancel and pour 2 tablespoons water. Mix and secure the Instant pot with the lid. Press pressure cook and set the timer to \"zero\" minutes., ▢, Once done, quick release the instant pot carefully. Open the lid and add red chilli powder or sambar powder. Mix well and saute just for a minute or so until the sambar powder smells good. If you see any moisture at the bottom, simply evaporate it. Add coconut and mix well., ▢, Stir beans poriyal and serve it., , , Notes, , If you do not have coconut, use this, peanut podi, , Instant pot version has not been tested with frozen beans. It works well with tender and fresh green beans., , , , Video, Watch Indian Green Beans Fry, , , NUTRITION INFO (estimation only), , Nutrition Facts, , Beans Poriyal (Indian Green Beans Fry), , , Amount Per Serving, , , Calories, 96, , Calories from Fat 45, , , , , % Daily Value*, , , Fat, 5g, 8%, Saturated Fat 1g, 6%, Sodium, 7mg, 0%, Potassium, 188mg, 5%, Carbohydrates, 9g, 3%, Fiber 2g, 8%, Sugar 4g, 4%, Protein, 3g, 6%, , , Vitamin A, 185IU, 4%, Vitamin C, 45.9mg, 56%, Calcium, 11mg, 1%, Iron, 1.4mg, 8%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , Beans poriyal first published in January 2017. Updated and republished in July 2021., , , , , 2.3K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 62 votes (, 48 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 29, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , shalmali, , , , , , May 29, 2024 6:20 am, , , , , , amazing.., , , , , , Reply, , , , , , , , , , , Sudesh, , , , , , November 23, 2023 5:34 pm, , , , , , I tried this recipe today for thanksgiving. It turned out pretty good. I tried 3x recipe and needed more than 1 tsp salt. I also added 2 tsp jaggery at the end and it gave a nice taste., , , , , , Reply, , , , , , , , , , , Rathina, , , , , , November 4, 2023 12:03 pm, , , , , , , , , , , Reply, , , , , , , , , , , Shawn, , , , , , August 7, 2023 12:46 am, , , , , , Tried this out last night and it turned out so well to have with chapati. Thank you ??, , , , , , Reply, , , , , , , , , , , Maya Kherani, , , , , , March 23, 2023 11:05 pm, , , , , , Thanks for this recipe! I’m excited to try it tonight! By the way, your “Print Recipe” link is not working on the post., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Maya Kherani, , , , March 25, 2023 2:46 am, , , , , , Maya, Please recheck after a while. It’s working., , , , , , Reply, , , , , , , , , , , Marguerite, , , , , , December 18, 2022 7:14 pm, , , , , , Great recipe, , , , , , Reply, , , , , , , , , , , Suzette, , , , , , April 26, 2022 3:51 pm, , , , , , Thank you so much for this recipe—it was delicious! I am a vegan and made it for my main dinner dish and ate it all myself. My only regret is that I should have tripled it!!! I love your recipes. ❤️, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Suzette, , , , April 28, 2022 3:05 am, , , , , , Thank you so much Suzette, Glad you like the recipes, 🙂, , , , , , Reply, , , , , , , , , , , Naveda, , , , , , December 9, 2021 5:32 am, , , , , , Swasthi..your recipes have been a life saver during the lockdown..esp for someone who rarely cooks. Your recipes are simple, delicious and easy to follow. And you have made cooking fun for me. Thank you. I’m a dedicated follower., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Naveda, , , , December 11, 2021 3:21 am, , , , , , Thank you so much Naveda, So glad to know the recipes are helping., 🙂, , , , , , Reply, , , , , , , , , , , Zuhair, , , , , , August 10, 2021 8:50 am, , , , , , Excellent, very simple, easy, healthy, God bless u, thanks, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Zuhair, , , , August 11, 2021 1:09 pm, , , , , , Thank you so much Zuhair, , , , , , Reply, , , , , , , , , , , Maya, , , , , , November 30, 2020 8:36 am, , , , , , Thanks a lot..after 9years my beans poriyal become so yummy…, , , , , , Reply, , , , , , , , , , , Minal Kalas, , , , , , January 12, 2020 5:47 pm, , , , , , Ma’am I really don’t like beans went through your recipes tried the bean recipe came out lovely., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Minal Kalas, , , , January 13, 2020 8:31 am, , , , , , Thanks Minal, , , , , , Reply, , , , , , , , , , , Jenifer, , , , , , July 13, 2018 9:12 am, , , , , , I tried this and it came out very well, , , , , , Reply, , , , , , , , , , , , , , Jenifer, , , , , , Reply to, Jenifer, , , , July 13, 2018 9:13 am, , , , , , I tried this and it came out very well, And thank you so much for sharing this recipe.., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Jenifer, , , , July 13, 2018 1:53 pm, , , , , , You are welcome Jenifer,, Glad to know you liked it. thank you, , , , , , Reply, , , , , , , , , , , KK, , , , , , August 10, 2017 12:14 pm, , , , , , Nice recipe, thanks for sharing.?????, I was looking for some curry dishes with the different type of south Indian rice., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, KK, , , , August 10, 2017 1:39 pm, , , , , , Welcome & thanks KK, , , , , , Reply, , , , , , , , , , , Rebecca Watson, , , , , , February 23, 2017 8:59 am, , , , , , When you use those small amounts of 2 types of dal, has the dal been soaked?, , Thank you,, Rebecca, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rebecca Watson, , , , February 23, 2017 9:52 am, , , , , , Hi Rebecca, I don’t soak the dals. Actually when we cover and cook the veggies, there is some amount of moisture released. That makes the dals soft., , , , , , Reply, , , , , , , , , , , neha, , , , , , February 21, 2017 8:46 am, , , , , , Thank you Swasthi, This dish came out very tasty, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, neha, , , , February 21, 2017 8:54 am, , , , , , Welcome Neha, , , , , , Reply, , , , , , , , , , , Rama, , , , , , January 30, 2017 8:50 am, , , , , , Thanks alot mam, , , , , , Reply, , , , , , , , , , , Rama, , , , , , January 28, 2017 4:27 pm, , , , , , My first kid was very lean i tried ur weight gaining foods  from 8 months now she is ok .my younger baby was 6 months And  7kgs now only she drinks my milk only we have a cow can i feed cows milk or other foods, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rama, , , , January 30, 2017 7:01 am, , , , , , Hi Rama, Cow’s milk for a 6 months old is not a very good idea for 2 reasons., , 1. Cow’s milk can cause allergies in young babies, 2. Cow’s milk has good amount of vitamins etc but not enough fats., , Though doctors do not recommend any other milk other than mothers milk or formula for babies under 1 year, In india for many years babies have grown up healthy, drinking buffalo’s milk. I think you should try buffalos milk and put your baby more on solids. By the end of 8 th month, you can also start early dinner like at 6.30 pm, Hope these help, , , , , , Reply, , , , , , , , , , , Rama, , , , , , January 28, 2017 4:02 pm, , , , , , Hi mam my baby now 6months old can i feed cows milk to her, , , , , , Reply, , , , , , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Beans Patoli": "Ingredients: Chopped French (green) beans – 2 cups, Chanadal – 1/2 cup, Cumin seeds – 2 tsp, Red chillies - 8 to 10 (depending upon the spiciness you prefer, medium to hot), , Salt to taste, Oil – 2 or 3 Tbsp, Mustard seeds - 1 tsp, Chana dal (Bengal gram) - 1 tsp, Urad dal (Black gram) – 1 tsp, Jeera (Cumin seeds) - 1 tsp, Curry leaves - Few, Hing (Asafoetida) – Few pinches (optional), Turmeric powder – ¼ tsp, , Preparation:, Cook the beans., Soak chanadal in water for atleast two hours. Coarsely grind chanadal, 2 tsp of cumin seeds and red chillies with as little as water as possible. Cook the mixture in a pressure cooker without the weight, till it is done. Let it cool for a while. Crumble the chanadal mixture, which would have become dry at this point ., Heat oil in a pan. Add chanadal, urad dal, jeera, mustard seeds, curry leaves to the hot oil. When chanadal and uraddal begin to turn reddish, add turmeric powder and the chanadal mixture to the pan and stir fry for a few minutes. Now add the cooked french beans and salt to the pan. Saute for a couple of minutes. Turn off the stove., Serve with rice or rotis., , , , , Cluster (Goovar) Beans Patoli:, Replace French beans with cluster beans in the above recipe., If using fresh cluster beans, use 2 bunches of methi leaves. Pluck all the leaves from the methi stems. Throw away the stems. Wash and chop the methi leaves. Heat 2 tbsp of oil in a pan and fry the methi leaves till they are cooked. By the time, they would be wilted and change their color to a darker shade., , , , , , Patoli - My 'P' entry for, Nupur's A - Z event, and for, Latha's RCI - Andhra Cuisine, event., , , Post a comment, , , , , Posted by\nSuma Gandlur, , at, 10:39 PM, , , , , , Labels:, Beans/Dals, ,, Chana Dal, ,, Cluster Beans, ,, Fenugreek Leaves / MenthiKoora, ,, French beans, ,, Vegetables, , , , , , , , , , , Tuesday, December 22, 2015, , , , , , , Recipe Index ~ Curries / Gravies / Subzis / Koora / Palya / Poriyal, , , , , , Here is a list of Indian style side dishes based on vegetables and/or legumes and paneer, the Indian style rennet free cheese. They can be served with plain rice or Indian style flat breads like rotis, phulkas, naans or even tortillas. For additional legume and dairy based side dishes check under ', Indian Dals / Kadhis, ' label., , , , , , , DRY SIDE DISHES:, , Aava Pettina Aratikaya Koora, , Aloo Bhaji / Aloogadde Palya / Potato Curry, , , Aloo Bhujiya Subzi, , Aloo Posta, , , Aloo Methi, , Aratikaaya Koora / Plantain Curry, , Asafoetida Flavored Potatoes, , Beans Koora, , Beans with Moongdal, , Beans with Toordal, , Beerakaya Koora / Ridgegourd Curry, , Beetroot Curry, , Beans-Carrot Curry with Sesame Powder, , Beets & Carrots with Toor Dal, , Bitter Gourd Crisps, , Cabbage-Carrot-Black Chickpea Sprouts Curry, , Cabbage - Green Garbanzo Curry, , Cabbage - Moongdal Curry, , Cabbage - Peas Curry, , Cabbage - Soybeans Curry, , Capsicum Curry, , Capsicum with Pappula Podi/Roasted Chickpea Powder, , Carrot-Beans with Moongdal, , Carrot Koora / Carrot Subzi, , , Carrot Kosumbari, , Carrot- Urad dal Curry, , , Cauliflower - Cabbage Curry, , Chayote Curry / Seemonkaya Koora, , Chikkudukaaya Koora / Valor Beans Curry, , , Cucumber Curry / Southekayi Palya, , Dondakaya Vepudu / Tindora Fry, , Drumsticks Curry, , Dum Ki Bharwan Bhindi, , Eggplant Curry with Peanut Powder, , , Gajar - Methi Ki Subzi / Carrot With Fenugreek Greens, , Gutti Vankaya Koora, , Imli Aloo, , Jeera Aloo, , , Kanda Gadda Koora, , Knolkhol Koora / Kohlrabi Curry, Kumror Chokka, - Bengali plantain - potato curry, , Methi Aloo, , Methi Pakoda Curry, , , Mixed Vegetable Curry, , Mixed Vegetable - Soy Chunks Curry, , Mixed Vegetable Subzi, , Palakoora Podi Koora / Dry Spinach Saute, , Palakoora Pulusukoora (Dry Spinach Saute), , Palak Kaapa, , Panasa Pottu Koora / Raw Jack Fruit Curry, , , Patoli, , Plantain Fry / Aratikaya Vepudu, , , Potato - Capsicum with Besan (Chickpea Flour), , Potato Curry, , Potato Curry (With Lemon and Green Chillies), , Ringan Methi nu Shaak, , , Sandiga Koora / Spinach-Toordal Patoli, , Spicy Eggplants, , , Spinac, h-Toor Dal Saute, , Stuffed Eggplants, , Stuffed Bitter Gourd / Bharwan, Karela, , Tawa Bhindi, , , Tindora-Coconut Curry, , Uchche Bhaja, - Bengali Bitter Gourd Fry, , Vankaya - Bangaladumpa Koora / Eggplant-Potato Curry, , Vankaya Koora / Eggplant Curry with Spice Powder, , , Vankaya Kothimeera Karam, , , Vazhakkai Podimas, , Vazhakkai Poriyal, - A simple plantain curry, Zhunka Vadi, , , , , SIDE DISHES (GRAVY):, , Aloo Chole, , Aloo Gobhi, , Aloo Gobhi in Coconut-Poppy Seeds Sauce, , Aloo Jhol, , Aloo Mangodi Ki Subzi, , Aloo Matar, , Aloo - Methi (Rasedaar), , Aloo Methi Matar, , Aloo Palak / Saag Aloo, , Aloo Posta, , Aloo Soya Korma, , Aviyal, , Baby, Lima Beans in Spicy Almond Sauce, Banarasi Aloo / Raswaale Aloo, , Beerakaaya Paalu Posina Koora, , Bombai Chutney, , , Cabbage Saagu, , Capsicum in Tomato Gravy, , Carrot-Beans Curry in Peanut-Sesame Sauce, , , Chana Madra, , Chole / Chana Masala, , Chole Panjim, , , Eggplant Kurma, , Ghuguni, , Greengram Sprouts Subzi, , , Green Moong - Vegetable Curry, , Green Papaya Saagu, , Green Peas Curry in Coconut Milk Sauce, , Green Peas Masala, , Fennel Flavored Vegetable Curry, , Idiyappam Kurma, , Kashmiri Dum Aloo, , Khattu Mag, , Lauki Ki Subzi, , Magori Palak Ki Kadhi, , Makai Palak, , , Matarchi Usal, , Mathura Ke Dubkiwali Aloo, , Methi Chole / Fenugreek Greens with Chickpeas, , Methi Matar Malai, , Mirchi Ka Salan, , , Mixed Vegetable - Soy Chunks Curry, , Navy Beans Curry, , Nawabi Curry, , Pinto Beans Curry, , Potato - Peppers Curry, , , Rajma - Aloo, , Rajma Masala, , Simple Chole Masala, , Sprouted Peas - Potato Subzi, , Shalgam - Methi Subzi, , Sri Lankan Curry, , Tamatar Chaaman, , Tomato Gojju, , Vegetable Saagu, , Xacuti, Yogiratna / Valval, , , PANEER DISHES:, , Matar Paneer, , , Paneer Bhurji, , Shahi Paneer, , Tawa Paneer Masala, , , , Comments, , , , , , Posted by\nSuma Gandlur, , at, 6:36 PM, , , , , , Labels:, Curries, ,, Indian Side Dishes, ,, Koora, ,, Legumes, ,, Palya, ,, Poriyal, ,, Recipe Index, ,, Vegetables, , , , , , , , , , , Saturday, June 10, 2017, , , , , , , Y for Yard Long Beans Sandiga Koora / Patoli, , , , , , , , Sandiga Koora / Patoli / Paruppu usili is one of the traditional and healthy side dishes served in south Indian regions to go along with rice. Of course the health factor comes into picture only when the spicy lentil paste is steamed instead of being sauteed in a generous amount oil. It is a dry curry prepared using a vegetable with a sauteed or steamed and sauteed spicy lentil paste. And I obviously prefer the latter because of the less usage of oil in the recipe. The vegetables that usually go into the dish are green beans, fresh fenugreek greens, cabbage and such., , , The legume that usually goes in the preparation of this delicious would be split chick peas (chana dal) whereas in Andhra regions, split pigeon peas (toordal), yellow lentils (moong dal) or even a combo of legumes are used. I heard the name sandiga koora for patoli for the first time from one of my husband's aunts and so, I assume that is Rayalaseema in origin and the version uses, split pigeon peas, rather than, split chick peas, ., , , (Yield 6 servings), , 3 cups finely chopped yard long beans, , 4 to 6 tbsp. toor dal / split pigeon peas / kandi pappu, , 2 tsp. cumin seeds, , 3 to 4 tbsp. shredded dry coconut / copra / endu kobbari, , 4 dried Indian variety or any spicy red chillies, , 1 tbsp. oil, , 1 tsp. chana dal / split chickpeas, , 1 tsp. urad dal / skinned, split black gram, , 1 tsp. mustard seeds, , 1 tsp. cumin seeds, , Few curry leaves, , 1/8 tsp. turmeric powder, , Salt to taste, , , , For the final letter 'Z' of the series, 'Zimikand Halwa' & 'Zucchini - Tomato Pappu' are my entries., Thank you Nupur for such a wonderful event, which I really enjoyed. You ARE a gracious hostess. :), , Zimikand Halwa, , Zucchini - Tomato Pappu, ------------------------------------------------------------------------------------------------, Zimikand Halwa, I had a feeling that I could not pull off a dry zunka and it was planned that zucchini would come into picture only if I could not find any other 'Z' alternatives. When I was going through the hindi words for veggies, I came across 'Zimikand'. After some web surfing, I concluded that it has to be suran or ratalu, the purple yams., I must admit, I have never encountered these 'Indian Yams' in and around the region, I grew up. I therefore, went yesterday and bought two bags of frozen ratalu. The picture on the bag had beautiful purple discs of chopped ratalu. When I opened them, it was a sheer disappointment. Half of them were brown rotten things. I had to throw more than half of them into the garbage. The remaining purple things were enough to cheer me up. I would like to see some real fresh stuff in the future and enjoy it in it's true form, ., Somehow, I did not wish to see the purple hue lost to some spices and other veggies added in the dish. Unlike some colorful root vegetables, these yams were on the bland side. Still, their rich color tempted me to try a sweet dish. I thawed them for a while, grated them, added milk and sugar, cooked it and ended up with a yummy dessert. I have a hunch that probably the halwa would be rich purple in color, if I had access to the fresh stuff., Coming to this lilac colored dessert, it was just heavenly. Unlike carrots & lauki, this vegetable almost becomes a mush when cooked and will have a melt in your mouth kind of creaminess to it. If you have ratalu available at a grocery store near you, I would recommend you to try this dish. I was so glad that I did not try to cook it into one more sabji. I am so excited with this new found veggie and am looking forward to try some more desserts with it., :, Grated zimikand - 1 cup, Milk - less than 1/2 cup, Sugar - 1/2 cup, Ghee - 2 Tbsp, Cardamom powder - 1/4 tsp, Cooking part, :, Add grated zimikand, milk, sugar and ghee to a pan and cook on low flame. The mixture tends to get a little sticky at the initial stages but keep stirring in between. When the mixture turns to almost halwa consistency, add cardamom powder and mix well. Cook for a couple of minutes more and turn off the stove., Refrigerate for a couple of hours and serve., ------------------------------------------------------------------------------------------------, Zucchini - Tomato Pappu (Dal), I could not resist the fresh zucchinis at the grocery store and brought some. I made delicious, dal adding some tomatoes along with it today., Toor dal - 1 Cup, Zucchini - Peeled, ends cut and chopped into medium sized cubes - 1 Cup, Small sized tomatoes - 2, 2 Serrano peppers (or green chillies), vertically slit into 4 pieces, Turmeric powder - 1/2 tsp, Tamarind extract - 1/4 cup, Chilli powder - 2 to 2 & 1/2 tsp, Salt -2 & 1/2 tsp, For tadka / seasoning, you need:, Oil - 1 tsp, Cumin seeds - 1 tsp, Mustard seeds - 1 tsp, A few pinches of asafoetida, Few curry leaves, Cooking pappu, :, Cook toordal with tomatoes (whole), green chillies, turmeric powder adding 2 cups of water in a pressure cooker until you hear one or two whistles., Mean while, cook the zucchini with a little amount of water in a MW. Let it be cooked till tender, (not turning them into a mush)., When the valve pressure is gone, remove the cooker's lid. Mash the tomatoes well along with the dal and add cooked zucchini, tamarind extract, chilli powder, salt to the dal mixture., Turn on the stove and let the dal simmer on low - medium flame for about five minutes., Heat oil in a small pan and add mustard seeds, cumin seeds, asafoetida and curry leaves in that order. When mustard seeds start to pop, turn off the stove and add the mixture to the cooked dal and mix well., Serve hot with rice and ghee or rotis., ------------------------------------------------------------------------------------------------, Previously On A - Z series, D -, Daikon Chutney, E -, Eggplants, Stuffed, F -, French beans & Indian Beans In a Sabji, G -, Gajar Ka Kheer, H -, Hagalakayi (Bitter gourd) Gojju, I -, Idli Upma, I -, Imli Ke Paththon Ka Dal, J -, Jalapenos – Mirchi Ka Salan, K -, Kosumbari, L -, Lauki Ka Halwa, M -, Mirapakaya – Aloo Koora, N -, Nuggekayi Palya, O -, Okra dal, P -, Patoli, Q -, Quick Mango chutney, R -, Rajma - Aloo, S -, Spinach Rice, T -, Tomato Gojju, U -, Urlagadda – Menthaku Koora, V -, Vergodalas Dal, W -, Whole, White Potatoes In Spinach Gravy, X -, Xacuti Masala Rice, X -, Xacuti, Vegetarian, Y -, Yogurt With Snakegourd, Post a comment, , , , , , Posted by\nSuma Gandlur, , at, 6:10 PM, , , , , , Labels:, Beans/Dals, ,, Dairy Products, ,, Milk, ,, Sugar, ,, Sweeteners, ,, Tomato, ,, Toor dal, ,, Vegetables, ,, Zimikand / Ratalu, ,, Zucchini, , , , , , , , , , , , Home, , , , , Subscribe to:, Posts (Atom), , , , , , , , , , , , , , , , , , , , , , , , , , , ALL PHOTOGRAPHS AND TEXT - COPYRIGHT© 2006-2018 VEGGIE PLATTER, ALL RIGHTS RESERVED, , , , , , , , , , , , , , , Instructions: thaw them, chop them and cook them as above. The above measurements are good for a 12 oz frozen cluster beans packet., , , , , Menthi Koora (Methi) Patoli:, Replace French beans with methi leaves in the French beans patoli recipe and proceed., , *, Soak split pigeon peas in water for at least 2 hours and drain., , *, Coarsely grind, split pigeon peas, , cumin seeds, coconut and red chilies with as \nlittle water as possible., , , , *, Place this mixture in a container and steam \non medium flame in a pressure cooker without the weight on until it is done\n (as one would steam idlis). The mixture should be dry and crumbly by the time it is cooked and it usually takes about 30 minutes. Let it cool\n for a while., , , , *, Crumble the steamed mixture, which would have become dry at this point. It can be immediately used or frozen to use later., , *, Heat oil in a pan and add, split chickpeas, , black gram, cumin and mustard seeds. When, split chickpeas, and black gram, begin to turn \nreddish, add curry leaves and turmeric powder. Stir once and add yard long beans to the pan. Cook on low flame until the beans are cooked. Next add the crumbled steamed mixture and salt. Stir well and cook for a couple of minutes. Turn off the stove., , *, Serve warm with rice or rotis., , , , , This post goes to B, logging marathon #77, under the theme \"Healthy Lunches\". C, heck out the page to read what other marathoners are cooking., , , , , Comments, , , , , , Posted by\nSuma Gandlur, , at, 5:31 PM, , , , , , , , , , , , , , , , Sunday, August 5, 2007, , , , , , , Zimikand Halwa & Zucchini - Tomato Pappu, , , , , As all good things in life, Nupur's, A-Z Indian vegetable, series is also coming to an end. I wish there had been more letters in the English alphabet. I have been a vegetarian all my life and so, this event became my 'favorite' one. Sending recipes every week, was like a self made commitment, though initially planned things were never executed. Planned 'V' entry vangibhath became vergodalas dal, 'S' for saagu became spinach rice and in a similar fashion",
        "Beans Potato Curry": "Ingredients: veggies and breads were all vegan., , Aloo beans tastes great with plain old roti. I made this a while back but didn’t get the opportunity to post this until now. I thought it is the right time to share this recipe, now that we all want to eat something simple and homemade : ), , , , 1x, 2x, 3x, ▢, 200, , gram, , green beans, , chopped into small pieces, ▢, 2, , potatoes, , medium, sliced, ▢, 1, , onion, , finely chopped, ▢, 1.5, , tablespoons, , vegetable oil, ▢, ¼, , teaspoon, , cumin seeds, ▢, ¼, , teaspoon, , mustard seeds, ▢, 5, , curry leaves, ▢, ¼, , teaspoon, , red chili powder, ▢, ¼, , teaspoon, , turmeric powder, ▢, ¼, , teaspoon, , garam masala powder, ▢, ⅛, , teaspoon, , dried mango powder [amchur], ▢, salt, , to taste, ▢, coriander leaves, , chopped, for garnishing, , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Save, , , , , Meet Manali, , , , , , , , , Related Recipes, , , , , , , , North Indian, , Simple Masoor Dal Recipe (Red Lentil Dal), , , , , , , Navratri, , Vrat Wale Aloo (No Onion & Garlic), , , , , , , Indian Main Course, , Urad Dal Recipe (Maa ki Dal), , , , , , , Instant Pot, , Saag Paneer Recipe (Instant Pot & Stovetop), , , , , , , , , , 5 from 2 votes (, 1 rating without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me if there is a reply to my comment, , , , , Δ, , , 16 Comments, , , , , , DeeGee, , says:, , , , July 5, 2021 at 7:17 pm, , , , , Great recipe! I’ve made it many times. Thanks!, , , Reply, , , , , , , , Kevin, , says:, , , , May 21, 2021 at 9:56 am, , , , , What an easy, lovely, healthy dish! All were satisfied. On a lark, I topped mine with some spicy pickled lime––went great with it! Thanks, Manali!, , , Reply, , , , , , , , Manali, , says:, , , , May 23, 2021 at 2:30 pm, , , , , welcome Kevin!, , , Reply, , , , , , , , , , Manali, , says:, , , , January 8, 2015 at 12:37 am, , , , , it gives a tangy flavor to the dish…you can add lemon juice in place!, , , Reply, , , , , , , , Manali, , says:, , , , January 8, 2015 at 12:34 am, , , , , Thanks Dannii! More to come 🙂, , , Reply, , , , , , , , Manali, , says:, , , , January 8, 2015 at 12:33 am, , , , , Thanks Kelly! Yes don’t feel like eating out these days!, , , Reply, , , , , , , , Manali, , says:, , , , January 6, 2015 at 8:21 pm, , , , , Thanks Kristi! Mango powder gives the dish a tangy flavor. you can find it easily at any Indian grocery store. Also you can leave it out of the recipe and squeeze in some fresh lemon juice in place at the end 🙂, , , Reply, , , , , , , , Manali, , says:, , , , January 6, 2015 at 3:25 pm, , , , , Anytime Jen! 🙂, , , Reply, , , , , , , , Manali, , says:, , , , January 6, 2015 at 3:24 pm, , , , , Yes I do know varan bhaat Karishma! 🙂 It’s like the ultimate comfort food…in Hindi we call it dal-chawal..same thing! I swear too much of junk I had..nowadays it’s only comfort food for me!, , , Reply, , , , , , , , Manali, , says:, , , , January 6, 2015 at 3:20 pm, , , , , Thanks Savita! I never liked it as a child but now I do! 🙂, , , Reply, , , , , , , , Jessica @ Jessica in the Kitchen, , says:, , , , January 6, 2015 at 10:11 am, , , , , Seriously. I love coming to your blog. It literally brightens my day. Your photos are so bright and colourful and so authentic. You have one of my favorite blogs Manali! Anyway, , , Meet Manali, , , , , , , , , Popular, , , , , , , , Indian Main Course, , Kadai Paneer, , , , , , , Indian Main Course, , Chole Recipe (Punjabi Chole Masala), , , , , , , Indian Main Course, , Aloo Gobi – Potatoes & Cauliflower, , , , , , , Instant Pot, , Instant Pot Brown Rice, , , , , , , , , , Easy Air Fryer Recipes, , , , , , , , Air Fryer, , Air Fryer Sweet Potatoes (10-Minutes!), , , , , , , Air Fryer, , Crispy Air Fryer Tofu, , , , , , , Air Fryer, , Air Fryer Aloo Gobi, , , , , , , Air Fryer, , Air Fryer Onion Pakoda, , , , , , , As Seen In, , , , , , , , , , , , , , Back to top, Cook With Manali, Home, , Recipes, , Web Stories, , About, , Contact, , , , , , , ©2025 Cook With Manali. All rights reserved., , Privacy Policy, •, Disclosure Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , In a pan heat 1.5 tablespoons of oil on medium heat. Once the oil is hot, add cumin and mustard seeds and let them crackle., , Once the seeds crackle add the chopped onion and curry leaves. Saute till onion becomes translucent, around 2 minutes., , Add red chili powder, turmeric powder and dried mango powder (amchur) and mix. Cook the spices with the onion for a minute or two., , Add the sliced potatoes next., , Mix the potatoes so that they are well coated with the onion and spice mixture., , Cover the pan and let the potatoes cook on medium heat till slightly tender [but not completely cooked], around 2-3 minutes. I sliced the potatoes thinly and hence they cooked faster., , Now add the chopped green beans, salt and mix. Cover and cook till beans are tender and done. The potatoes will also be completely cooked by now., , Sprinkle garam masala powder and mix., , Garnish with chopped coriander leaves., , , Serve hot with roti. You can also eat it with naan, pita bread or paratha., , , * Adjust spice levels to taste., , * Cut the potatoes into thin slices. They cook faster that way., , , , Aloo Beans, , 5, from, 2, votes, , By, Manali Singh, , Servings:, 2, , , , , , Save, Saved, , Pin, , Print, , , , Indian Recipe of Spiced Potatoes with Green Beans. [Vegan], , , , In a pan heat 1.5 tablespoons of oil on medium heat., Once the oil is hot, add cumin and mustard seeds and let them crackle., Once the seeds crackle add the chopped onion and curry leaves. Saute till onion becomes translucent, around 2 minutes., Add red chili powder, turmeric powder and dried mango powder (amchur) and mix., Cook the spices with the onion for a minute or two., Add the sliced potatoes next and mix so that they are well coated with the onion and spice mixture., Cover the pan and let the potatoes cook on medium heat till slightly tender [but not completely cooked], around 2-3 minutes., Now add the chopped green beans, salt and mix., Cover and cook till beans are tender and done. The potatoes will also be completely cooked by now., Sprinkle garam masala powder and mix., Garnish with chopped coriander leaves and serve immediately with naan or roti., , , , Nutrition, Calories:, 274, kcal, , , Carbohydrates:, 39, g, , , Protein:, 8, g, , , Fat:, 11, g, , , Saturated Fat:, 8, g, , , Sodium:, 34, mg, , , Potassium:, 1170, mg, , , Fiber:, 9, g, , , Sugar:, 5, g, , , Vitamin A:, 860, IU, , , Vitamin C:, 90.6, mg, , , Calcium:, 124, mg, , , Iron:, 8.3, mg, , Nutrition information is automatically calculated, so should only be used as an approximation., , , , Additional Info, , Cuisine:, Indian, , , , , Your feedback is valuable!, Please share your comments, ratings, and any suggestions or adaptations below to help us improve and make our recipes more successful., , , , , Like this recipe? Share it with friends!, , Pin, Facebook, Tweet, Yummly, Email, , , , , Categorized as:, , Gluten Free, , , Indian Main Course Vegetarian Recipes, , , North Indian, , , Vegan, , , , , , , , , Hi, I’m Manali!, , Bringing you easy, delicious vegetarian & vegan recipes! Eating veggies can be fun, , , Reply, , , , , , , , Manali, , says:, , , , January 6, 2015 at 3:22 pm, , , , , Jessica, you are way too kind! This really made my day especially coming from one of my favorite bloggers! Thank you so much Jessica, you need to try Indian food because it’s the hub of vegetarian and vegan food!, , , Reply, , , , , , , , , , Shikha @ Shikha la mode, , says:, , , , January 5, 2015 at 11:17 pm, , , , , Seriously, I need all the (healthy) food I can get!, , , Reply, , , , , , , , Manali, , says:, , , , January 6, 2015 at 3:19 pm, , , , , haha me too Shikha!, , , Reply, , , , , , , , , , Manali, , says:, , , , January 5, 2015 at 8:01 pm, , , , , Thank you Mira!, , , Reply, , , , , , , , Manali, , says:, , , , January 5, 2015 at 8:00 pm, , , , , Glad to hear I’m not alone Marcie! Yes no to desserts for sometime although considering how much I love to bake it will be very hard, like really hard!, , , Reply, , , , , , , , , , Hi, I’m Manali!, , Bringing you easy, delicious vegetarian & vegan recipes! Eating veggies can be fun"
    }
}