{
    "ingredients": {
        "Beetroot Poriyal": "beetroot,coconut,"
    },
    "recipe_url": {
        "Beetroot Poriyal": "https://www.vegrecipesofindia.com/beetroot-poriyal/"
    },
    "Recipe": {
        "Beetroot Poriyal": "Ingredients: green chillies, curry leaves, urad dal, asafoetida and some coconut. Make it gluten-free by not adding the asafoetida., , Whether you want to chop or grate the beetroot, the choice is yours. The poriyal is tasty both ways. Though, using grated beetroot will always lessen the time to cook the vegetable., , I always cook the Beetroot Poriyal in coconut oil as that’s what is the essence of this dish. But you can substitute it with sesame oil (gingelly oil) as well., , You can make the poriyal with other veggies like the ones I have mentioned in the above section. There is no end to that. Each one will be just as fab as the other, this much I can assure you., , At home, I had this Beetroot Poriyal with a yummy sambar and steamed foxtail millet combo. For regular times, this poriyal goes good with a, Sambar, -rice or, Rasam, -rice combination. You can have it with chapati too for a wholesome meal., , Step-by-Step Guide, , How to make Beetroot Poriyal, , 1. In a pan, heat 2 tablespoons coconut oil or sesame oil (gingelly oil). Keep the heat to a low and add 1 teaspoon mustard seeds., , , , 2. Let the mustard seeds crackle., , , , 3. When the mustard seeds begin to crackle, add 1 teaspoon urad dal (split and husked black gram)., , , , 4. Stirring often, fry the urad dal on low heat., , , , 5. Fry till the urad dal turns golden., , , , 6. Then, add 1 chopped green chili (about ½ to 1 teaspoon, chopped), 10 to 12 torn or chopped curry leaves and 1 pinch asafoetida (hing). Mix well., , , , 7. Now, add 2 cups finely chopped beetroot (or 2 medium to large beetroot or 250 grams finely chopped beetroot). You can also add grated beetroot., , , , 8. Mix very well., , , , 9. Add salt as per taste and mix again., , , , 10. Add ⅓ cup water or add as required., , , , 11. Cover the pan with a lid and let the beetroot cook on low to medium-low heat., , , , 12. Do check and stir, in between. If the water dries up, add some water and then continue to cover and cook., , , , 13. The beetroot should soften and get cooked completely. Before proceeding to the next step, ensure there is no water in the pan., , If the beetroot pieces are softened and there is some water, then cook without the lid, so that all the water evaporates., , , , 14. Lastly, add 3 to 4 tablespoons grated fresh coconut., , , , 15. Mix very well. Switch off the heat and cover the pan., , , , 16. Serve the Beetroot Poriyal hot or warm as a side dish with sambar-rice, rasam-rice or even dal-rice. It can also be had with chapatis, plain paratha or bread., , , , More Beetroot Recipes To Try!, Vegetable Recipes, Beetroot Thoran (Kerala Style Sautéed Beetroot), Chutney Recipes, Beetroot Pachadi Recipe (Beetroot Chutney), Snacks Recipes, Beetroot Cutlet | Beetroot Tikki | Beet Patties, Breakfast Recipes, Beetroot Paratha (Stuffed Beet Flatbread), , , Please be sure to rate the recipe in the recipe card or leave a comment below if you have made it. For more vegetarian inspirations, , Sign Up, for my emails or follow me on, Instagram, , , Youtube, , , Facebook, , , Pinterest, or, Twitter, ., , , Beetroot Poriyal, , , By, Dassana Amit, , , Beetroot Poriyal is a lightly spiced South Indian special preparation made with beets, coconut, spices and herbs. The addition of spices and coconut add to the earthiness of this tasty dish., , , 5, from, 13, votes, , , , Print, , Pin, , Save, Saved!, , Rate, , , , , Prep Time, 5, minutes, , mins, , Cook Time, 15, minutes, , mins, , Total Time, 20, minutes, , mins, , , , , Cuisine, South Indian, , Course, Side Dish, , Diet, Vegan, Vegetarian, , Difficulty Level, Moderate, , , Share, Email, Facebook, Tweet, , , Servings, 2, , Units, US Customary, Metric, , , , ▢, 2, , tablespoons, , coconut oil, , or sesame oil (gingelly oil), ▢, 2, , cups, , beetroot, , (finely chopped or grated) or 2 medium to large beetroot or 250 grams, ▢, ½ to 1, , teaspoon, , chopped green chillies, , or 1 green chilli, ▢, 10 to 12, , curry leaves, , – chopped or kept whole, ▢, 1, , teaspoon, , black mustard seeds, ▢, 1, , teaspoon, , urad dal, , (split and husked black gram), ▢, 1, , pinch, , asafoetida, , (hing), ▢, salt, , as required, ▢, ⅓, , cup, , water, , or add as required, ▢, 3 to 4, , tablespoons, , coconut, , – fresh and grated, , Cook Mode, Prevent your screen from going dark while making the recipe, , aloo, etc and love them. Even this one is so simple. I will definetly try it out., Thanks for putting up all your lovely recipes. And I’m greedy so I will say keep adding to your list 🙂 !!, , , Reply, , , , , , , , dassana amit, , says:, , , , Jul 04, 2019 at 8:28 pm, , , , , thank you mansi. glad to read your comment. do try beetroot poriyal and you will like it. yes, i will be adding more recipes., welcome and happy cooking., , , Reply, , , , , , , , , , Winnie, , says:, , , , Apr 01, 2019 at 3:16 pm, , , , , Tried this recipe using boiled beet roots and it turned out simply delicious., , , Reply, , , , , , , , dassana amit, , says:, , , , Apr 01, 2019 at 7:30 pm, , , , , thanks again winnie. boiled vegetables can also be used to make various poriyals. to save time and an extra pans going for washing, i simply cook the vegetables in one pan., , , Reply, , , , , , , , , , Indrani, , says:, , , , Jan 05, 2016 at 5:50 pm, , , , , Hello Mam, I have been following your recipes lately and I must say that you simplify the recipes to such an extent that even a lazy person likes me gets into cooking..and WRT this recipe: What if coconut is not added? Will that affect the dish? Thanking u in advance. 🙂 and keep posting more yummy recipes..xo, , , Reply, , , , , , , , dassana amit, , says:, , , , Jan 05, 2016 at 7:51 pm, , , , , thanks indrani. not adding coconut will affect the taste. however, still you can make without coconut, if there is no grated coconut available., , , Reply, , , , , , , , Meet Dassana, Hi, I am Dassana. Running the kitchen for decades, I share tried and tested Vegetarian recipes on my food blog since 2009, with a step-by-step photo guide & plenty of tips so that your cooking journey is easier. I also have a professional background in cooking & baking., , Learn More about Dassana, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, , Popular, Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Breakfast Recipes, Upma Recipe, Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Paneer Recipes, Paneer Butter Masala Recipe, , Snacks Recipes, Samosa Recipe (With Potato & Green Peas), Dal (Lentils) & Legumes, Rajma Recipe | Rajma Masala (Restaurant Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), As Seen In:, Dassana's Veg Recipes, Recipe Glossary, , Press & Media, , Privacy Policy, , Terms & Conditions, , Accessibility Statement, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, © Dassana’s Veg Recipes 2009-2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , Instructions: , In a pan heat the coconut oil or gingelly oil (til ka tel or sesame oil made from raw sesame seeds). Keep heat to a low and add mustard seeds., When the mustard seeds begin to crackle, add urad dal. Stirring often fry the urad dal till they get golden and aromatic., Then add chopped green chillies, curry leaves (chopped or whole) and asafoetida. Mix well., Then add finely chopped or grated beetroot., Mix very well., Add salt as per taste and mix again., Add ⅓ cup of water or add as required., Cover the pan with a lid and let the beetroot cook on a low to medium-low heat., In between do check and stir. If the water dries up, then you can add some water and then continue to cover and cook., The beetroot should soften, become tender and get cooked completely. Before proceeding to the next step ensure there is no water in the pan., If the beetroot pieces have softened and there is some water, then cook without lid, so that all the water evaporates., Lastly add 3 to 4 tablespoons grated fresh coconut. Mix very well. Switch off the heat and cover pan., Serve the Beetroot Poriyal hot or warm as a side dish with sambar-rice or rasam-rice or even dal-rice. It can also be had with chapati or paratha., , , Notes, , Use fresh, tender and juicy beets., , You could skip coconut if you do not have it or add desiccated coconut instead. Note that with desiccated coconut the taste will change slightly., , The recipe can be doubled or tripled., , This approximate nutrition info is per serving (made with coconut oil)., , , , Nutrition Info (Approximate Values), , Nutrition Facts, , Beetroot Poriyal, , , Amount Per Serving, , , Calories, 277, , Calories from Fat 198, , , , , % Daily Value*, , , Fat, 22g, 34%, Saturated Fat 19g, 119%, Polyunsaturated Fat 1g, Monounsaturated Fat 2g, Sodium, 761mg, 33%, Potassium, 497mg, 14%, Carbohydrates, 19g, 6%, Fiber 7g, 29%, Sugar 11g, 12%, Protein, 4g, 8%, , , Vitamin A, 231IU, 5%, Vitamin B1 (Thiamine), 1mg, 67%, Vitamin B2 (Riboflavin), 1mg, 59%, Vitamin B3 (Niacin), 58mg, 290%, Vitamin B6, 1mg, 50%, Vitamin C, 110mg, 133%, Vitamin E, 1mg, 7%, Vitamin K, 1µg, 1%, Calcium, 52mg, 5%, Vitamin B9 (Folate), 732µg, 183%, Iron, 2mg, 11%, Magnesium, 43mg, 11%, Phosphorus, 89mg, 9%, Zinc, 1mg, 7%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , This Beetroot Poriyal recipe from the archives first published on July 2013 has been republished and updated on November 2022., , Share This Recipe:, WhatsApp, Facebook, Pin, Tweet, Email, Shares, 184, Meet Dassana, Welcome to Dassana's Veg Recipes. I share vegetarian recipes from India & around the World. Having been cooking for decades and with a professional background in cooking & baking, I help you to make your cooking journey easier with my tried and tested recipes showcased with step by step photos & plenty of tips & suggestions., , Learn More about Dassana, Get My Secrets to Great Indian Food, Sign up for my FREE Beginners Guide to Delicious Indian Cooking, Please enable JavaScript in your browser to complete this form., First Name, *, Email, *, Website, SIGN UP, , More Vegetarian Recipes You'll Love, , Indian Street Food Recipes, Pav Bhaji Recipe (Stovetop & Instant Pot), Indo Chinese Recipes, Manchurian Recipe | Veg Manchurian Gravy, Mushroom Recipes, Kadai Mushroom Recipe, South Indian Food Recipes, Sambar Recipe, , , , Leave a Comment, Cancel reply, Your email address will not be published. We moderate comments and it takes 24 to 48 hours for the comments to appear. We thank you for your understanding and patience. If you have made the recipe, then you can also give a star rating., , Your Recipe Rating, , , , Your Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Your Name, *, , , Your Email, *, , , , , , Δ, , , 9 Comments, , , , , , , Khush, , says:, , , , Feb 23, 2025 at 2:00 am, , , , , I never thought i could make something with beetroot other than salad but this recipe turned out really good … thank you for this amazing dish., , , Reply, , , , , , , , Maya Asarpota, , says:, , , , Aug 08, 2019 at 12:04 pm, , , , , thank you it was a good and clear recipe with illustrative pics., , , Reply, , , , , , , , dassana amit, , says:, , , , Aug 08, 2019 at 7:31 pm, , , , , thank you and welcome., , , Reply, , , , , , , , , , Mansi, , says:, , , , Jul 04, 2019 at 10:39 am, , , , , Hi Dassana"
    }
}