{
    "ingredients": {
        "Carrot Poriyal": "carrot,chana dal,coconut,garlic,ginger,",
        "Gajar Methi ki Sabji": "carrots,methi"
    },
    "recipe_url": {
        "Carrot Poriyal": "https://www.indianhealthyrecipes.com/carrot-poriyal-recipe/",
        "Gajar Methi ki Sabji": "https://www.whiskaffair.com/gajar-methi-recipe/"
    },
    "Recipe": {
        "Carrot Poriyal": "Ingredients: , Substitutions, , Substitute fresh coconut with frozen dried coconut, idli podi, peanut podi or sesame podi. If you have none, cool them and powder. Use that to spice your carrot poriyal., , On a medium flame dry roast 2 red chilies, 1 tbsp chana dal and 1 tablespoon urad dal until golden. Then add 1 tbsp sesame seeds, 1 tablespoon dried coconut and 1 teaspoon cumin seeds. Roast for 1 minute., , Cool all of these and make a fine powder with 1 clove of garlic. Use 1 tablespoon or as needed to spice your carrot poriyal just before you turn off the stove., , Variations, , Here are some variations you may want to try., , Add ¾ cup of green peas. A mix of fine chopped veggies like beetroot, beans and peas also go well to make this dish., , Sometimes I soak about ¼ cup of moong dal (skinned & split yellow beans) for 2 hours in warm water. Drain the water and add it to the pan along with carrots. Cover and cook until tender. If required sprinkle water to provide moisture so the lentils cook well. Moong dal should be fully cooked yet not become mushy., , For a change I also use 100 grams of fine chopped spinach or palak in this recipe., , Pro Tips, , I have chopped the carrots to make this poriyal. However you may also grate it using a thick grater. Avoid using a thin grater as the whole dish becomes mushy. You can also use a food processor., , You may completely skip the lentils in the tempering as aged people and young kids may not like the crunchy dal., , More recipes you may like, Carrot Curry, , Carrot Rice, Easy Carrot Pickle, Beans Poriyal, , , , , Photo Guide, , How to make Carrot Poriyal (Stepwise Photos), , 1. Rinse 250 grams carrots well under running water. Peel them and chop them to bite sized pieces. You can also use a onion or vegetable chopper to dice the carrots., , 2. Pour 1½ tablespoon oil to a pan and heat it. Add ¼ to ½ teaspoon mustard seeds to the hot oil. Followed by 1 tablespoon chana dal, ½ to ¾ tablespoon urad dal and 1 dried red chili (broken). Fry them on a medium heat., , , , 3. When they turn golden, add 1 sprig curry leaves, 1 teaspoon fine chopped ginger or 1 garlic clove (optional) and 1 to 2 chopped green chilies. Leave out green chilies and ginger for kids., , , , 4. Soon the curry leaves will turn crisp then add a pinch of hing (optional), chopped carrots, ¼ teaspoon salt and ⅛ teaspoon turmeric. Adding salt at this stage is important as it lets the carrot sweat and cook in their own moisture., , , , 5. Stir fry for 2 minutes., , , , 6. Cover and cook on a low heat until carrots become tender. In between keep stirring so they don’t burn. If the carrots are too dry then you may sprinkle some water. Continue to cook covered. If using grated carrots, do not cover and cook. Instead stir fry on a low to medium heat as required until tender., , , , 7. When the carrots are fork tender and not mushy add ¼ cup grated coconut and mix well. If you do not have coconut, use the spice powder I mentioned in the intro or sprinkle idli podi or peanut podi. Taste test and add more salt if needed., , , , 8. Stir fry for a minute and turn off. If using frozen coconut, stir fry until it becomes hot., , , , Serve Carrot Poriyal with rice, chapati or, Rasam, -rice or, Sambar, -rice., , , , , Related Recipes, , Carrot Curry, , , Carrot Chutney, , , Carrot Halwa Reci..., , , Carrot Juice Reci..., , , Carrot Rice Recip..., , , Carrot Pickle Rec..., , , , , Recipe Card, , , , , , Carrot Poriyal (Carrot Fry), , , 5, from, 13, votes, , , , Simple Tamilnadu style carrot poriyal made with carrots, spices and curry leaves. Serve it as a side with rice or roti., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 10, minutes, , minutes, Cook Time, 10, minutes, , minutes, Total Time, 20, minutes, , minutes, , Servings, 3, , Author, Swasthi, , , , ▢, 250, , grams, , carrot, , (chopped or grated), ▢, 1½, , tablespoon, , oil, ▢, ¼ to ½, , teaspoon, , mustard seeds, , (adjust to taste), ▢, ½ to ¾, , tablespoon, , urad dal, ▢, 1, , tablespoon, , chana dal, , (optional), ▢, 1, , dried red chili, , (broken to 2 pieces), ▢, ⅛, , teaspoon, , asafoetida, , (hing, optional), ▢, 1, , sprig, , curry leaves, ▢, 1 to 2, , green chilies, , (chopped, Indian/ Thai or Serrano peppers), ▢, 1, , teaspoon, , fine chopped ginger, , or 1 clove garlic crushed (optional), ▢, ⅛, , teaspoon, , turmeric, ▢, ¼, , teaspoon, , salt, , (adjust to taste), ▢, ¼, , cup, , grated coconut, , (fresh or frozen or 1 to 1½ tbsp idli podi or peanut podi),  Instructions: ▢, Wash carrots well in lot of water or under running water. Peel them and cut off both the ends., ▢, Chop to ¼ inch pieces or grate them with a thick grater. Avoid using a thin grater as it makes the poriyal mushy., How to make Carrot Poriyal, ▢, Heat oil in a pan. Add mustard, urad dal, chana dal and red chili., ▢, Saute until the dal turns golden. Then add green chili, ginger and curry leaves. Saute for a while until the curry leaves turn crisp., ▢, Add hing, chopped carrots, turmeric and salt. Saute for 2 mins., ▢, Cook covered for 2 to 3 mins on a low flame. This helps to release the moisture and cook the carrots. (If using grated carrots avoid covering the pan and just stir fry on a low to medium heat until tender.), ▢, If the carrots are too dry and not tender, sprinkle little water. Cover and cook until soft and tender but not mushy. Taste test and add more salt if needed., ▢, Add fresh grated coconut. If the heat from green chili is not sufficient you can also add little chilli powder or sambar powder at this stage., ▢, Mix well and saute for a minute. Switch off and serve carrot poriyal with rice or roti as a side., , , Notes, If you do not have coconut, make your own spice powder which I shared in the intro of this post., , , Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Carrot Poriyal (Carrot Fry), , , Amount Per Serving, , , Calories, 169, , Calories from Fat 108, , , , , % Daily Value*, , , Fat, 12g, 18%, Saturated Fat 5g, 31%, Sodium, 302mg, 13%, Potassium, 339mg, 10%, Carbohydrates, 14g, 5%, Fiber 4g, 17%, Sugar 4g, 4%, Protein, 3g, 6%, , , Vitamin A, 15962IU, 319%, Vitamin C, 22mg, 27%, Calcium, 20mg, 2%, Iron, 1mg, 6%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 292, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 13 votes (, 7 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 19, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Priyanka Kancharla, , , , , , August 9, 2024 6:53 pm, , , , , , Can you share more about the cookware you’re using for this recipe in the pictures and in general? Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Priyanka Kancharla, , , , August 10, 2024 6:10 am, , , , , , Hi Priyanka,, I used a cast iron enameled cookware from le creuset in this post. I also use Staub and triply steel cookware from WFM, Stahl and other brands . Steel cookware are my favorite for everyday use. Since they reflect in the photos and videos I use cast iron cookware more for the website. For anyone who is not going to shoot videos or pictures I highly recommend triply or sandwiched bottom high quality steel cookware. Hope this helps., , , , , , Reply, , , , , , , , , , , Sandy, , , , , , January 8, 2021 1:14 am, , , , , , Sasthi, I made this and the bean poriyal yesterday.  I used the dal soak for 15 minutes.  Drained and fried as per recipe still gave a lovely nutty contribution.  Great recipes., , , , , , Reply, , , , , , , , , , , , , , Sandy, , , , , , Reply to, Sandy, , , , January 8, 2021 1:15 am, , , , , , SWASTHI that is 🙂  apologies., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sandy, , , , January 10, 2021 1:45 pm, , , , , , No Problem Sandy,, Glad to know it turned out good. Thank you!, , , , , , Reply, , , , , , , , , , , Nisha, , , , , , Reply to, Sandy, , , , May 14, 2024 2:39 pm, , , , , , Swasthi u r as awesome as ur recipes .. and sandy didnt meant any bad by saying nutty contribution it was a compliment no need to apologise dear and yes i made carrot poriyal ill try bean poriyal next time mnn to ho gya he banane ko sandy bhai ne bola to hehe ciyaa have great day ahed bye swasthi and sandy, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Nisha, , , , May 14, 2024 3:13 pm, , , , , , Thanks Nisha, , , , , , Reply, , , , , , , , , , , Tanusree, , , , , , November 20, 2020 10:33 am, , , , , , Excellent. Perfectly goes well with rasam.., Thank you Swasthi., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Tanusree, , , , November 23, 2020 3:44 am, , , , , , Welcome Tanu, Glad you liked it, , , , , , Reply, , , , , , , , , , , Sandy, , , , , , September 19, 2020 11:52 pm, , , , , , Swasthi, I cooked the dish again last night. I did check yesterday so you must have replied later and I missed it – but thank you for your advice.  Anyway, some advice from my friend in Chennai was to fry the dal in a little oil until golden, then soak for 20 minutes in a little water, then drain and add into the cooking.  There was a nutty earthy flavour which was good and while the dal was obvious in the dish, it was softer., , Thought I might share that with you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sandy, , , , September 21, 2020 2:43 pm, , , , , , Hi Sandy,, Yes I am quite late in replying the comments. I like your friend’s suggestion. Glad the dish turned out good. Thanks again, , , , , , Reply, , , , , , , , , , , Sandy, , , , , , September 18, 2020 9:28 am, , , , , , Lovely addition to your lamb korma and jeera rice i cooked last week.  I knew the chana dal was going to be a bit challenging on the bit for some.  No problem with the urad dal., , Would dry roasting it beforehand maybe present it a little softer in the dish?  Or replace with chopped cashew nuts?  I love the flavour of the dals but …, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sandy, , , , September 19, 2020 8:21 am, , , , , , Hi Sandy, Glad to hear that! Yes some cashews will be better. Soaking the lentils doesn’t roast the dals well and the aroma is not same. So I usually temper with the dal and then pour little water. Cook in the pan itself until slightly tender, then add the veggies. I have a teething kid at home. He complains even after cooking them with little water in the tempering. I think skipping is the only option. But cashews will work well too. Thanks for trying the recipes and sharing the outcome., 🙂, , , , , , Reply, , , , , , , , , , , Guru, , , , , , December 23, 2019 5:03 am, , , , , , Tried this veggie recipe for my 8 year daughter and she liked it! Delicious and nutritious accompaniment to a meal, thank you!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Guru, , , , December 23, 2019 5:05 pm, , , , , , Hi!, You are welcome! Glad your kid liked it. Thank you!, , , , , , Reply, , , , , , , , , , , Kavitha, , , , , , March 28, 2017 9:09 am, , , , , , Hope  my query is not irrelevant to the blog., , Which is the best way to store vegetables in fridge to keep them fresh for long? Closed in plastic bags or in openly net baskets?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Kavitha, , , , March 29, 2017 3:42 pm, , , , , , Hi Kavitha, No problem. For freshness plastic bags with holes are best., I usually keep them in a moist cloth and use up in 3 to 4 days as I prefer not to keep them in plastic bags. I saw my mum using net bags and felt they are just not of much use, , , , , , Reply, , , , , , , , , , , vidya, , , , , , February 17, 2017 11:26 am, , , , , , Look yummy recipe. Thanks for sharing., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, vidya, , , , March 29, 2017 3:43 pm, , , , , , Welcome Vidya, , , , , , Reply, , , , , , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Gajar Methi ki Sabji": "Ingredients: , Carrots, – This sabzi tastes best when made using red winter carrots, but you can also use regular orange carrots., , Fenugreek Leaves (Methi), – In many places, methi is available only during the winter, but many places sell it year-round. Use fresh methi leaves and discard the thick stems. You can use the tender stems, though., , Spice Powders, – This simple stir fry uses basic spice powders such as coriander powder, turmeric powder, Kashmiri red chili powder, garam masala powder, and salt., , Ginger and Garlic, – Fresh ginger and garlic add a unique taste, but you can skip adding them to make a Jain version., , Oil, – I made the sabji using canola oil, but you can also make it with mustard oil., , Others, – You will also need asafetida (hing) and cumin seeds., , Skip adding asafetida for a gluten-free version., , , , How To Make Gajar Methi, , Preparation, , Wash 9 oz (250 g) of carrots and peel them using a vegetable peeler. Discard ½ inch of the top and bottom and cut the carrots into ¼ inch pieces., , Pluck the methi leaves and discard the thick stems. You can keep the tender stems as they are very flavorful. Wash 5 oz (150 g) of methi leaves very well with water 3-4 times. Drain well and chop the leaves roughly., , Grate the ginger, peel and chop the garlic, , , , Make Gajar Methi, , Heat 2 tablespoon oil in a pan over medium-high heat., , , Once the oil is hot, add ¼ teaspoon asafetida and 1 teaspoon cumin seeds and let them crackle for 4-5 seconds., , , , , Add 1 teaspoon grated ginger and 2 teaspoon chopped garlic and cook for 5-6 seconds., , , Now add 9 oz (250 grams) of cubed carrots and saute them for a minute., , , , , , , 1 tablespoon coriander powder, , ½ teaspoon turmeric powder, , 1 teaspoon Kashmiri red chili powder, , ½ teaspoon garam masala powder, , ½ teaspoon salt, , , , , , , Reduce the heat to low., , Cover the pan with a lid and cook on low heat until the carrots are tender (10-12 minutes). Stir a few times during cooking., , , Add a splash of water if the masala is getting dried and burning., , , Once the carrots are tender, add 5 oz (150 grams) of chopped fenugreek leaves and cook for 3-4 minutes. Stir a few times., , Check for salt and add more if required., , , Serve hot., , , , , , , 5, from 1 vote, , Gajar Methi Recipe (Carrot Fenugreek Stir Fry), , By:, Neha Mathur, , Gajar Methi (Carrot Fenugreek Stir Fry) is a simple Indian sabji made using carrots, fresh fenugreek leaves, and some spices. Serve it for your everyday meals or pack for lunch boxes with roti or paratha., , Prep:, 10, minutes, , mins, Cook:, 20, minutes, , mins, Total:, 30, minutes, , mins, Servings:, 4, , people, , , , , , Save Recipe, Saved Recipe, , Pin Recipe, , Rate Recipe, , Print Recipe, , , , , , 1x, 2x, 3x, ▢, 9, , ounce, , carrots, , (, 250, g, peeled and cut into ¼ inch cubes), ▢, 2, , tablespoons, , oil, ▢, ¼, , teaspoon, , asafetida (hing), , (skip for gluten-free version), ▢, 1, , teaspoon, , cumin seeds, ▢, 1, , teaspoon, , grated ginger, ▢, 2, , teaspoons, , chopped garlic, ▢, 1, , tablespoon, , coriander powder, ▢, ½, , teaspoon, , turmeric powder, ▢, 1, , teaspoon, , Kashmiri red chili powder, ▢, ½, , teaspoon, , garam masala powder, ▢, ½, , teaspoon, , salt, , (or to taste), ▢, 5, , ounce, , fenugreek (methi leaves), , (, 150, g, roughly chopped), US Customary, –, Metric, , Want to save this recipe?, Just enter your email and get it sent to your inbox! Plus you’ll get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , Cook Mode, Prevent your screen from going dark,  Instructions: Heat oil in a pan over medium-high heat., Once the oil is hot, add asafetida (hing) and cumin seeds and let them crackle for 4-5 seconds., Add ginger and garlic and cook for 5-6 seconds., Now add the carrots and saute them for a minute., Add coriander powder, turmeric powder, Kashmiri red chili powder, garam masala powder, and salt and mix well., Reduce the heat to low., Cover the pan with a lid and cook on low heat until the carrots are tender (10-12 minutes). Stir a few times during cooking., Add a splash of water if the masala is getting dried and burning., Once the carrots are tender, add fenugreek leaves and cook for 3-4 minutes. Stir a few times., Check for salt and add more if required., Serve hot., , Video, , , , , , , , , , Notes, Red carrots are best to make this recipe but you can use orange carrots too., , Skip adding ginger and garlic to make the Jain version., , Nutrition, Calories:, 112, kcal, , , Carbohydrates:, 10, g, , , Protein:, 2, g, , , Fat:, 7, g, , , Saturated Fat:, 5, g, , , Sodium:, 56, mg, , , Potassium:, 242, mg, , , Fiber:, 2, g, , , Sugar:, 3, g, , , Vitamin A:, 10670, IU, , , Vitamin C:, 6.7, mg, , , Calcium:, 181, mg, , , Iron:, 1.7, mg, , , , , , , , Like this recipe? Rate and comment below!, , , , , 5 from 1 vote (, 1 rating without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , Hey! Nice to meet you, , Hi! I’m Neha, Blogger & Recipe Expert behind Whisk Affair. I’ve nurtured Whisk Affair since 2012 by trying & testing every recipe published. Be sure that it will turn out good each time!, , , Read more about me, , , , , , , , My cookbook, , , Click to Buy Now on Amazon, , , , , , Most Popular, , Rice, Hibachi Fried Rice (Japanese Style Fried Rice), Main Course, GF, Global Gluten Free, Spicy Lemon Garlic Baked Tilapia, Cooking Basics, Creamy Garlic Parmesan Sauce, Indian Beverages, Lemon Tea, Soups, GF, Global Gluten Free, Chicken Clear Soup, Global Breakfast, Scrambled Egg Whites, Featured In, , , Back to top, Whisk Affair, , , , , About Neha, , Diwali E-Book, , My Cookbook, , Sign up for emails and updates, , Contact Me, , ©2025 Whisk Affair. All rights reserved., , Privacy Policy, •, Terms & Conditions, •, Accessibility Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,"
    }
}