{
    "ingredients": {
        "Egg Kadhai Sabji": "boiled eggs,capsicum,onions,tomato"
    },
    "recipe_url": {
        "Egg Kadhai Sabji": "https://www.indianhealthyrecipes.com/kadai-egg-masala-egg-capsicum-curry/"
    },
    "Recipe": {
        "Egg Kadhai Sabji": "Ingredients: , , 2 tablespoons coriander seeds, , 1 to 2 Kashmiri deseeded dried red chilies (leave out for kids), , 1 teaspoon fennel seeds, , 2 to 3 green cardamoms, , 2 cloves, , ¼ inch very small piece of cinnamon (if you add more you will ruin the dish), , , If your spices are soft due to weather conditions, you may toast them first in a pan until crunchy, cool and grind them. I use the spices form the refrigerator so they are crisp., , , , 3. Grind to a fine powder. Kadai masala is usually ground to a coarse powder. But if you leave it too coarse you may get the grits in the gravy. So make sure it is fine or slightly coarse., , , , Make Onion Tomato Masala, , 4. Heat a pan with half tablespoon oil on a high flame. Saute 1 heaped cup of cubed onions along with 6 cashews until they turn transparent or lightly golden., , , , 5. Add 1½ to 2 cups chopped tomatoes and continue to saute on a medium heat until tomatoes turn mushy and soft. If needed add little salt or cover and cook to fasten the cooking., , , , 6. Cool this completely., , , , 7. Add the cooled onion tomatoes to a grinder jar., , , , 8. Blend it to smooth paste without adding water., , , , Make Kadai Paneer, , 9. Add another half tablespoon of oil or ghee to the pan and heat up on a high flame. To get the restaurant style smoky flavor, use the same pan used for sauteing onion tomatoes earlier. Add capsicum and onions, saute on a high flame just until half cooked (must remain crunchy). Constantly toss to prevent burning., , , , 10. Add paneer. Make sure it is not too moist before you add. Toss it in the hot pan for 60 to 90 seconds on a medium heat. Less than 2 mins. Do not overcook else the paneer turns hard. Transfer all these to a plate., , , , 11. Add 1 tablespoon oil or ghee and heat it on a medium flame. Saute 1 teaspoon ginger & garlic paste until the raw smell goes away., , , , 12. Add the ground spices – kadai masala and saute it well on a medium to low heat. We have not toasted the spices earlier so we need to do it well here until it turns aromatic & the raw flavor goes away., , , , 13. Add onion tomato puree., , , , 14. Saute it well for about 2 mins. Add half tsp garam masala and half tsp kashmiri red chilli powder., , , , 15. Next saute well for 2 mins again. You may taste the onion tomato masala first and then add more red chili powder as needed. Since we have sauteed onions and tomatoes well in the earlier steps, we don’t need to cook the masala a lot., , , , Make Kadai Paneer Gravy, , 16. Add 1½ to 2 cups water and add ½ teaspoon salt. Mix well and bring this to a boil on a medium high heat., , , , 17. Reduce the heat and cook until the gravy turns thick and flavorful. Make sure the gravy doesn’t look runny at this stage. After boiling it well, you will see traces of oil on top of the gravy. Next towards the end add 1 teaspoon crushed kasuri methi., , , , 18. Add the sauteed onion, capsicum and paneer that we had set aside. Mix well and turn off the stove. Taste test and add more salt and garam masala if required., , , , 19. Mix well. Add ginger juliennes and chopped coriander leaves. Cover and set aside for 2 mins. Do not leave on the hot stove since it will continue to cook further. Transfer to a serving bowl., , , , Allow kadai paneer to rest for at least 15 mins so the paneer absorbs the flavors. You can also smoke the curry if you like following my, dal makhani, post., , This delicious kadai paneer gravy goes very well with roti / chapathi, , plain paratha, , , butter naan, or plain basmati rice or flavored rice like jeera rice, , ghee rice, or, Pulao, ., , , , Pro Tips, , Kadai masala:, The key to a good kadai paneer is in using the right combination of spices to make kadai masala. So use them as mentioned in the recipe. Substituting it with a regular or normal garam masala will give you a regular paneer curry. However it will still taste good but you won’t find any kadai flavors in it., , Dry roasting the whole spices before grinding is optional. But if you do not have a good grinder/blender then you may roast them to crisp up. I do not roast them as I keep all my spices in the fridge and they remain crisp., , Dried red chilies, are used in this recipe as they impart a smoky flavour to the dish. Using good quality dried red chilies that are not too spicy or pungent is very important. I usually use Kashmiri or byadgi red chilies. Otherwise the dish may turn very spicy with bitter tones. You can also reduce the amount of red chilies and use red chilli powder., , Ginger:, Adding ginger julienne towards the end of cooking infuses a great aroma to the dish. Do not skip this., , Paneer:, Using good quality fresh paneer makes a lot of difference to the dish. If you prefer to make your own paneer at home, you can follow this post on, How to make paneer, . If using store bought paneer then immerse it in slightly hot water for 15 mins. Drain completely and use it., , How to make best kadai paneer, , Always saute the powdered kadai masala in oil until it turns fragrant. This is the key to an aromatic kadai paneer., , Smoky flavour: Kadai paneer served in some restaurants get a mild smoky flavor as the bell peppers & onions are tossed on a high flame on large burners., , To get similar flavors toss the veggies on the highest flame as mentioned in the recipe. This lends a mild smoky aroma to the dish., , Substitutions:, , , You can use any store bought kadai masala., , For a creamy version you can also use a few tablespoons of cream towards the end., , You can easily substitute tofu for paneer in the recipe., , If you do not eat onions and garlic, you may skip both of them completely. Without onions the dish will be on the tangy side. So to balance that you may need to add some cream at the last stage. Without onions, the quantity of the prepared kadai paneer will be lesser., , For the gravy version, I have used cashews. You may substitute them with blanched almonds., , , , Photo Guide, , Recipe 2 – Kadai Paneer Semi Dry, , Semi dry kadai paneer is the most common one served in restaurants. This is easier to make than the first recipe as it needs only sautéing the basic masala with ground kadai masala. Then bell peppers are sautéed and lastly paneer is added to it. This goes well with rotis and can also be used to make roti rolls., , , , Unlike the first gravy version, , To make this creamy, pour, , , 200 grams (1 ½ cup paneer cubed), ½ cup onions finely chopped (optional), 1½ cup tomatoes finely chopped or pureed (300 to 325 grams), ¾ cup cubed capsicums (green or red or both), 1½ teaspoon ginger garlic paste or only ginger paste, 1/8 tsp ground turmeric, 2 tablespoons oil (or 1 tbsp oil + 1 tbsp butter), ½ to 1 teaspoon red chilli powder (adjust to taste), ½ to ¾ teaspoon garam masala, 1 teaspoon kasuri methi, ¾ teaspoon salt (adjust to taste), ¼ cup heavy cream or whipping cream (optional), 2 tbsps coriander leaves chopped for garnish, ½ inch ginger juliennes, , For the kadai masala, 1 tablespoon coriander seeds, 2 to 3 kashmiri dried red chilies, ¾ teaspoon fennel seeds (saunf), 1 green cardamom, , Preparation – recipe 2, , 1. Rinse tomatoes & bell peppers. Chop tomatoes very finely. Alternately you can puree the tomatoes and use. Make a fine paste of ginger and garlic or grate them. Cube paneer and bell peppers to ¾ inch pieces. Set aside. If you want to use onion, you can fine chop 1 medium onion., , 2. Add 1 tablespoon coriander seeds and 2 to 3 dried red chilies to a pan and toast them until crisp on a low heat. When the red chilies turn crisp remove to a plate and cool them. To the same pan add ¾ teaspoon fennel seeds and roast on a medium heat until aromatic. Remove these as well to the same plate and cool them completely., , 3. Next add them to a grinder or spice blender along with 1 green cardamom., , , , 4. Make a fine powder and set aside., , , , How to make, , 5. Pour 2 tablespoons oil to the kadai and heat it. When the oil turns hot, add 1½ teaspoon ginger garlic paste. Saute on a medium heat until the ginger garlic turns aromatic. Do not burn them., , , , 6. Then add 1½ chopped tomatoes, 1/8 teaspoon turmeric and half teaspoon salt., , , , 7. Fry all of them until the tomatoes turn fully mushy. If needed cover and cook. Then add ½ to 1 teaspoon red chilli powder and ground kadai masala., , , , 8. Mix well and fry until the masala turns aromatic and begins to release some oil on the sides. This is an indication that the masala is cooked well. This step is very important to bring out the flavors. Then add garam masala., , , , 9. Pour 4 to 5 tablespoons of water at this stage and cook the masala until it thickens. Add capsicum and saute for 2 to 3 mins until they begin to smell good., , , , 10. Then add the cubed paneer and 1 teaspoon crushed kasuri methi. Mix well to coat the paneer with the masala., , , , 11. Cover the pan. Cook on a very low heat for 2 to 3 mins. Cooking for too long will make the paneer harder. If you prefer to use cream pour 3 to 4 tbsps at this stage and give a good stir. Taste test and add more salt if needed., , , , 12. Sprinkle coriander leaves and mix well. Add the half inch ginger juliennes and turn off the heat., , , , Allow kadai paneer to rest in the pan covered for 10 to 20 mins so the paneer absorbs all of the flavors of kadai masala. Serve with roti, plain parathas or stuff it in your sandwich., , , , Variations for recipe 2, , Usually there is no cream or cashews added to it like it is done for most other paneer recipes. If you prefer to serve this with rice, then you can also make the below mentioned variations:, , , You can pour 3 to 4 tbsps of heavy cream to this to make it creamy. If using cream you will need to up the heat level as cream tones down the heat., , If you like it to be moderately creamy then puree the tomatoes with 8 cashews and use it here. Also you will need to pour half cup water to cook the masala. This makes a semi dry kadai paneer which will go well with roti or even with basmati rice., , To make it kids’ friendly reduce the chilies or skip the chilli powder. Keep the rest of the spices as mentioned in the recipe., , , This kadai paneer recipe is roughly being adapted from chefs Nita Mehta’s and Sanjeev Kapoor’s cookbooks. I have made several changes to the original recipes to suit our taste buds., , Faqs, , What is in kadai paneer?, , Bell peppers, onions, tomatoes, ginger, garlic, paneer, kadai masala (coriander, red chilies, cardamoms, fennel seeds, cloves and cinnamon) go into kadai paneer., , , What is the difference between kadai paneer and shahi paneer?, , Kadai paneer is made with kadai masala, bell peppers, tomatoes, sweetish and is not spicy., , , How to reduce heat & spice in kadai paneer?, , To reduce the heat & spice, skip the red chilies completely or cut down to half the quantities in the recipe. If your cooked kadai paneer is too spicy and hot, then you can bring down the heat by adding some dairy cream or cashew cream., , , , , Related Recipes, , Paneer Curry Reci..., , , Matar Paneer Reci..., , , Paneer Butter Mas..., , , Paneer Recipes, , , Malai Kofta Recip..., , , Palak Paneer Reci..., , , , , Recipe Card, , , , , , Kadai Paneer Recipe, , , 5, from, 640, votes, , , , Kadai paneer is a restaurant style delicious spicy paneer recipe made with fresh ground kadai masala, paneer, onions, tomatoes & bell peppers. It's full of flavors and one of the best paneer gravy recipes you can make at home. It is best served with plain basmati rice, flavored rice, roti, naan or any flatbread., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 10, minutes, , minutes, Cook Time, 25, minutes, , minutes, Total Time, 35, minutes, , minutes, , Servings, 4, , people, , Author, Swasthi, , , , For Kadai Masala, ▢, 2, , tablespoons, , coriander seeds, , (daniya), ▢, 1 to 2, , Kashmiri dried red chilies, , (deseeded, less spicy variety, leave out for kids), ▢, 2 to 3, , green cardamoms, ▢, 1, , teaspoon, , fennel seeds, , (saunf), ▢, 2, , cloves, ▢, ¼, , inch, , cinnamon, , (Ceylon cinnamon and not cassia), To saute & puree, ▢, 1, , tablespoon, , oil, ▢, 1 cup (125 grams), , onions, , (sliced or diced, 1 large), ▢, 1½ to 2 cups (300 grams), , tomatoes, , (chopped, 2 large or 3 medium), ▢, 6, , cashew nuts, , (can substitute with 3 tbsp cream), ▢, 1 to 1½, , tablespoon, , oil, , or ghee (divided ½ + ½), ▢, 1, , teaspoon, , ginger garlic paste, , or crushed, ▢, ½, , teaspoon, , Kashmiri red chili powder, , (adjust to taste), ▢, ½, , teaspoon, , garam masala, , (adjust to taste), ▢, 1, , teaspoon, , kasuri methi, , (dried fenugreek leaves), ▢, ½ to ¾, , teaspoon, , salt, , (adjust to taste), ▢, 1½ to 2, , cups, , water, , for gravy, ▢, 1, , onion, , Optional (medium, cubed, layers separated), ▢, ½, , cup, , capsicum, , (bell peppers cubed), ▢, 200 to 250, , grams, , paneer, , (Indian cottage cheese), ▢, ½ to 1, , teaspoon, , ginger, , julienne, ▢, 2, , tablespoons, , coriander leaves, , (cilantro chopped finely), , , , , Video Instructions: , This Kadai paneer gravy is good when you are home for a meal. It goes well with hot, butter naan, , roti & even with, jeera rice, or plain basmati rice., , Recipe 2 – Quick kadhai paneer semi dry curry just in 15 minutes. This recipe can be made without onions (optional). So it saves a lot of time as there is no chopping and sautéing of onions involved., , I often make this for the school and the office lunch box along with, jeera rice, & simple vegetable salad. This also goes well inside roti or wraps as a filling., , About Kadai Paneer, , Kadai paneer is a simple yet amazingly flavorful paneer dish made by cooking paneer and bell peppers with fresh ground spices known as kadai masala. It is called as kadai paneer since it is cooked in a special Indian wok called kadai, which is a basic kitchen essential of Indian Cuisine., , However the dish can be prepared without a kadai just like the way I cooked it in a regular pan., , How is Kadai Masala made?, , Kadai masala is a unique blend of spices specially used to make kadai dishes. It is much more flavourful and stronger than the regular garam masala that is used in regular Indian cooking. Kadai masala is made with coriander seeds, red chilies, cloves, cardamoms, cinnamon & fennel seeds., , These whole spices are dry roasted to bring out the aroma and then ground to a slightly coarse powder., , Here coriander seeds are used in higher quantity than it is used for the regular garam masala. So if you do not have all of these spices, then the simple trick is to use coriander seeds, red chilies & garam masala., , Since most garam masala powders already have cinnamon, cloves, cardamoms and fennel seeds, sometimes I go the easy way and use coriander seeds, red chilies & garam masala., , Related, Paneer Recipes, ., Dhaba Paneer Curry, Paneer Butter Masala, Paneer Lababdar, Malai Kofta, Palak Paneer, Matar Paneer, , , Photo Guide, , How To Make Kadai Paneer Gravy (Stepwise photos), , Make Kadai Masala, , 1. Prepare the following:, , , Cube 1 heaped cup onions (to saute, 1 medium, 125 grams after prep), , Chop/cube 1½ to 2 cups tomatoes (3 medium tomatoes, 300 grams after prep), , Cube 1 more medium onion (separate the layers), , Cube ½ cup capsicum /bell peppers, preferably the same size as paneer, , Measure 2 cups cubed paneer (¾ inch, 200 to 250 grams), , , 2. To make kadai masala, Preparation, ▢, To a small grinder jar, add red chilies, cardamoms, fennel seeds, coriander seeds, cloves & cinnamon. If you add more cinnamon it can ruin the dish. Make a fine powder and keep aside., 2 tablespoons coriander seeds, , 1 to 2 Kashmiri dried red chilies, , 2 to 3 green cardamoms, , 1 teaspoon fennel seeds, , 2 cloves, , ¼ inch cinnamon, ▢, Heat oil in a pan. Add onions & cashew nuts. Saute them on a medium high flame until the onions turn transparent or pink., 1 tablespoon  oil, , 1 cup (125 grams) onions, , 6 cashew nuts, ▢, Add tomatoes and saute until completely mushy., 1½ to 2 cups (300 grams) tomatoes, ▢, Cool this completely and add to a blender jar. Blend to a smooth paste or puree. Set this aside., ▢, To the same pan, add oil and heat it., 1 to 1½ tablespoon oil, ▢, Saute onion and capsicum on the highest flame until half done. They must be slightly tender yet crunchy., 1 onion, , ½ cup capsicum, ▢, Add paneer and toss for 1 to 2 mins. Set all these aside. Do not over fry these., 200 to 250 grams paneer, How to Make Kadai Paneer, ▢, Heat the rest of the oil and saute ginger garlic paste until the raw smell goes off., 1 teaspoon ginger garlic paste, ▢, Next transfer the ground kadai masala and saute on a low to medium heat for 2 to 3 mins until it turns fragrant. Do not burn., ▢, Add the ground onion tomato paste and saute for 2 mins., ▢, Next add garam masala and red chili powder. Saute for another 2 mins until the masala turns fragrant., ½ teaspoon Kashmiri red chili powder, , ½  teaspoon garam masala, ▢, Pour 1 cup water and salt. If you feel the gravy is too thick, pour ¼ to ½ cup more water. Allow it to boil until the gravy thickens and traces of oil appear on top., ½ to ¾ teaspoon salt, ▢, Then crush and add kasuri methi. Stir well again. Taste the gravy and add more salt or garam masala as needed., 1 teaspoon kasuri methi, ▢, Add the sauteed paneer, capsicum and onion., ▢, Stir well & finally add ginger juliennes and coriander leaves., ½ to 1 teaspoon ginger, , 2 tablespoons coriander leaves, ▢, Cover and rest for 2 mins. Transfer to a serving bowl and rest for at least 15 mins for the paneer to absorb the flavors., ▢, Enjoy kadai paneer gravy with roti, , butter naan, , paratha or jeera rice., , , Notes, , Make sure your dried chilies are not too hot else the dish can turn out too spicy. Leave out for kids., , Kadai masala, is usually made of coriander seeds, red chilies, cardamom, cinnamon, cloves, jeera, saunf, pepper and a small piece of bay leaf. But coriander seeds are used in higher quantity when compared to any garam masala., , , NUTRITION INFO (estimation only), , Nutrition Facts, , Kadai Paneer Recipe, , , Amount Per Serving, , , Calories, 255, , Calories from Fat 153, , , , , % Daily Value*, , , Fat, 17g, 26%, Saturated Fat 9g, 56%, Cholesterol, 41mg, 14%, Sodium, 104mg, 5%, Potassium, 357mg, 10%, Carbohydrates, 15g, 5%, Fiber 4g, 17%, Sugar 6g, 7%, Protein, 11g, 22%, , , Vitamin A, 810IU, 16%, Vitamin C, 35.8mg, 43%, Calcium, 353mg, 35%, Iron, 1.6mg, 9%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , Kadai Paneer Recipe first published in May 2014. Updated & Republished in November 2022., , , , , 25.1K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 640 votes (, 477 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 400, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , raerae, , , , , , February 26, 2025 3:44 am, , , , , , My first time to make this was last week. It was so good OMG. Thank you very much for this recipe. I am making again later haha, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, raerae, , , , February 26, 2025 4:13 am, , , , , , Thank you. So glad you like it!, , , , , , Reply, , , , , , , , , , , Andy, , , , , , February 9, 2025 12:28 pm, , , , , , I made this recipe yesterday evening. It was delicious and my whole and friends enjoyed and loved it ! Thank you so much. Will surely try your other dishes., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Andy, , , , February 9, 2025 12:47 pm, , , , , , Thank you Andy, , , , , , Reply, , , , , , , , , , , Kavi, , , , , , November 23, 2024 11:09 pm, , , , , , Super delicious- guests loved it the best recipe, , , , , , Reply, , , , , , , , , , , Carol, , , , , , November 23, 2024 12:19 am, , , , , , I can’t even say how absolutely amazing this is! That is coming from a veteran cook who’s favorite food is Indian…the many wonderful varieties d/t regions.  I usually share what I make with some family members…not sure that’s happening this time., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Carol, , , , November 23, 2024 9:56 am, , , , , , So happy to read that Carol. Thank you so much for sharing back!, , , , , , Reply, , , , , , , , , , , Neha, , , , , , October 9, 2024 1:49 am, , , , , , Thank you so much for sharing this recipe. Whenever I cook this dish, people always likes it., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Neha, , , , November 23, 2024 9:56 am, , , , , , Happy to know that Neha. Thank you, , , , , , Reply, , , , , , , , , , , Sangita, , , , , , September 23, 2024 8:18 am, , , , , , Kadhai paneer dry is superb. My dish came out yummmm. Your recipes are so easy to follow.  Keep up the great work!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sangita, , , , November 23, 2024 9:56 am, , , , , , Thanks Sangita. Glad you like them, , , , , , Reply, , , , , , , , , , , Priya Divakar, , , , , , July 17, 2024 2:04 am, , , , , , This recipe was a great hit!! Thanks for sharing. I love the detailing in your recipies. For anything tried new I totally go with ur ratios and it turns out to be a hit . Thank you so much., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Priya Divakar, , , , November 23, 2024 9:56 am, , , , , , Happy to read that Priya. Thank you for sharing back, , , , , , Reply, , , , , , , , , , , Minal, , , , , , July 3, 2024 2:07 am, , , , , , This kadai paneer turned out spectacular. Our guests loved it with your jeera rice. Thank you & I am bookmarking this for future, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Minal, , , , July 3, 2024 5:00 am, , , , , , Glad you all like it. Thank you for writing back, , , , , , Reply, , , , , , , , , , , Deepa Srinivasan, , , , , , May 5, 2024 8:37 am, , , , , , Very nice reciepe😊👍 thanks for sharing, keep sharing 😊😊, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Deepa Srinivasan, , , , May 5, 2024 8:56 am, , , , , , Glad you like it Deepa. Sure I will keep sharing, , , , , , Reply, , , , , , , , , , , Travis, , , , , , May 5, 2024 3:06 am, , , , , , When you go the easy way and to make kadai masala by adding coriander seeds, and red chilies to garam masala, how much coriander seeds and red chilies do you use?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Travis, , , , May 5, 2024 3:12 am, , , , , , Hi,, This post has 2 recipes, if you are making the first one (saucy) try with 1 to 1½ teaspoon garam masala, 1 tablespoon coriander seeds (or 1½ tsps coriander powder) and 2 to 3 deseeded red chilies (or ½ teaspoon chili flakes). Hope you enjoy the dish, , , , , , Reply, , , , , , , , , , , srp, , , , , , April 9, 2024 4:19 am, , , , , , Thanks for a fun recipe. In the Kadai Masala, do you peel the green cardamom before grinding or put it in grinder with husk/shell?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, srp, , , , April 9, 2024 4:36 am, , , , , , Use them whole with the skin. I have step by photos showing the details. Hope you enjoy the dish, , , , , , Reply, , , , , , , , , , , Viraj, , , , , , March 15, 2024 4:46 pm, , , , , , I am making this right now. But after cooking the gravy for over 15 mins, I don’t see any oil being released. What is happening?  Did I put too less of oil to begin with. Also my gravy is popping too much and making a mess around lol, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Viraj, , , , March 16, 2024 1:08 am, , , , , , Yes, less oil in the gravy. You should see small traces because this recipe does not use a lot of oil. But don’t worry it tastes delicious. Cover the pot and cook, thick gravy often splatters., , , , , , Reply, , , , , , , , , , , Test, , , , , , March 3, 2024 2:24 pm, , , , , , we  don’t need  jeera for Kadai masala?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Test, , , , March 3, 2024 2:33 pm, , , , , , If you want you may add half teaspoon cumin. It is already used in garam masala so it won’t make much difference, , , , , , Reply, , , , , , , , , , , , , , Test, , , , , , Reply to, swasthi, , , , March 3, 2024 4:14 pm, , , , , , Thank you very much!, , , , , , Reply, , , , , , , , , , , Samatha, , , , , , February 22, 2024 4:20 pm, , , , , , I tried the second recipe with crushed tomatoes and no onion. It turned out delish! It took me only 15 minutes and I am surprised! Thank You., , , , , , Reply, , , , , , , , , , , Mona, , , , , , January 17, 2024 10:26 am, , , , , , Made this kadai paneer again to use up all the frozen paneer tikka left from New Year dinner party. It tastes so good, love the kadai masala and next time going to try it in my fish too., , , , , , Reply, , , , , , , , , , , Andrea Lee, , , , , , December 28, 2023 2:01 pm, , , , , , This recipe was easy and very tasty, thank you!, , , , , , Reply, , , , , , , , , , , Reshma, , , , , , December 14, 2023 2:41 pm, , , , , , At what stage should I be adding the cream to omit the cashews. Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Reshma, , , , December 16, 2023 9:57 am, , , , , , Add it at the end, last stage before turning off the heat, , , , , , Reply, , , , , , , , , , , Dipti, , , , , , November 26, 2023 3:53 pm, , , , , , Hello Swathi,, , , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Dipti, , , , December 16, 2023 9:59 am, , , , , , Hi Dipti,, Sorry! I am late! Just wondering if you made the same recipe. So many freshly ground whole spices + garam masala + ginger garlic is supposed to be so flavorful. A simple way to add flavor is to add more garam masala. Hope this helps, , , , , , Reply, , , , , , , , , , , Ojasvi, , , , , , November 15, 2023 6:02 pm, , , , , , Made this kadai paneer for a party and everyone liked it, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ojasvi, , , , December 16, 2023 10:00 am, , , , , , Thank you Ojasvi, , , , , , Reply, , , , , , , , , , , Eshwari, , , , , , November 2, 2023 7:52 am, , , , , , This kadai paneer has really become my go-to paneer dish. Made it again tonight, so good! It stores well for a couple of days and so easy to reheat., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Eshwari, , , , December 16, 2023 10:00 am, , , , , , So glad to hear that Eshwari, Thank you, , , , , , Reply, , , , , , , , , , , Keyur, , , , , , October 14, 2023 9:14 pm, , , , , , The recipe is amazing. Swasthi’s recipes is my go to., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Keyur, , , , December 16, 2023 10:00 am, , , , , , Thank you so much Keyur, , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,"
    }
}