{
    "ingredients": {
        "Air Fried Malai Kofta": "potato, paneer, tomato, cashews",
        "Paneer Lababdar": "paneer,tomato,cashews,onion,cream"
    },
    "recipe_url": {
        "Air Fried Malai Kofta": "https://thebellyrulesthemind.net/instant-pot-air-fryer-malai-kofta-video-recipe/",
        "Paneer Lababdar": "https://www.vegrecipesofindia.com/paneer-lababdar-recipe-restaurant-style/#wprm-recipe-container-137504"
    },
    "Recipe": {
        "Air Fried Malai Kofta": "Ingredients: like the paneer and ghee, with tofu and oil, to make the recipe vegan., , , Watch Malai Kofta Video Recipe, , , , , Boiled or mashed potatoes, Paneer or cottage cheese, Cardamom powder, Salt, Raisins, Cashews, , , Tomatoes, Cashews, salt, Chili powder, Yogurt, Garam masala powder, Dried Fenugreek leaves, , Do you love Indian Recipes and do not know where to start ? Check out post om Indian Spices and How to Use Them You can read more about the, Indian spices here, ., , , How to make Malai Kofta, , There are two parts to the recipe. You need to make the fried balls in the Air Fryer and the gravy or sauce in the Instant Pot. Here’s how to do it., , For the Kofta, , You want to use boiled potatoes to make the balls. Boiled potatoes are mashable and help to hold the structure of the balls together. Once the potatoes are cool, you can grate them., , In a large mixing bowl, add the grated paneer and boiled potatoes. Next, , , Using your hands or spoon, scoop about 2 tablespoons of the paneer and boiled potato mixer out of the bowl into a well-greased hand. Press the mixture into your palm and add a few raisins and cashews in the center. Roll the mixture into a ball. Make sure the ball is about two bites so that they cook evenly and thoroughly., , Set the air fry them to 375 *F for 15 minutes or until they turn golden brown on the outside. If you prefer, you can deep fry them in a deep fryer or large pot and oil until they are golden brown., , , You could also cook them instead in an appe pan. For some tips and tricks on using the appe pan, check out our post full of appe pan recipes and tips, here, ., , For the Gravy, , First, add the tomatoes, cashews, salt, red chili powder, yogurt, and water into the inner pot of your electric pressure cooker. Close the lid and close the pressure valve so that it is sealing. Set the pressure cooker to cook for 6 minutes. When it is done cooking, do a quick release of the pressure., , Carefully remove the lid when the pressure has released. Give the gravy a few minutes to cool. Then use a hand blender or an immersion blender to carefully blend the sauce until it is smooth., , , Now strain the mixture to get rid of skin and seeds. You may need to strain it more than once until it is a silky, smooth tomato puree. Then, r, inse the inner pot and remove any leftover gravy., , Set Instant Pot to Saute mode and heat the ghee or oil. When it is hot, add the red chili powder and garam masala. Add in the strained tomato puree and sugar and mix well., Cover the pot and cook until the mixture starts to thicken. This will take about 5 -8 minutes., , , Once the sauce has thickened, add in the crushed kasoori methi (dried Fenugreek leaves) and cream if you are using cream. Omit the cream if you are keeping it vegan., , Finally, pour the curry over the kofta. Serve the malai kofta  with our better than restaurant, Garlic Naan, , Pro Tips to make Malai Kofta, , Here are some great tips for making perfect malai kofta:, , you can use sweet potatoes or raw bananas instead of the potatoes for slightly sweeter balls, blend and strain the gravy for the smoothest consistency, use heavy cream or light cream for the creamiest texture, you can use either store bought or homemade paneer, , , Can I Fry the Malai Kofta?, , Yes, you can fry the recipe. If you are frying the kofta, you need to add 2 tablespoons of cornstarch or all purpose flour. If you prefer, you can use a slice of bread crumbled into small pieces or bread crumbs., , Add the balls in the frying pan once the oil is hot or use an electric fryer or a large pot or pan that can heat the oil. You need to fry them until they are golden brown and crisp. Friers and stove tops vary so you may to need to experiment with timing for best results., , , How to make the Kofta in Appe Pan / Aebleskewer pan?, , An appe pan is a great, traditional Indian tool to make kafta and other favorites like, veg manchurian, . To use the appe pan, fill the cavities with the kofta balls. After a minute of cooking over medium-high heat, turn the balls over and cook the other side. The balls should be golden brown and crispy., , How to make the Kofta using the Crisplid?, , If you have an Instant Pot with the Crisplid, , For kofta, , , , , 2 boiled potatoes /mashed, , 1 cup paneer / cottage cheese, grated, , Cardamom powder, , ½ tsp salt, , 2 tbsp raisins, , 2 tbsp cashew, , , , , For gravy:, , , , , 1 tablespoon ginger-garlic paste, , 3  Tomatoes, , 1/4 cup cashews, , salt  to taste, , 1 teaspoon red chili powder, , 1/2 cup yogurt, , 1/2 cup water, , , , Final gravy, , , , 1 tablespoon ghee or oil, , 1 teaspoon red chili powder, , 2 teaspoon garam masala, , 2 tablespoon sugar, , cream optional, , 2 tablespoon dried fenugreek leaves, , , , , , , , , , , , , , GoWISE USA 1700-Watt 5.8-QT 8-in-1 Digital Air Fryer and 50 Recipes for your Air Fryer Book (Black), , , , , , , , , Mealthy CrispLid for Pressure Cooker - Turns your Pressure Cooker into an Air Fryer - Air fry, Crisp or Broil fits 6 & 8 Q Pot Basket, Trivet, Silicone Mat, Tongs plus Instant access Free Recipe App, , , , , , , , , Instant Pot Vortex 6-Quart 4-in-1 Air Fryer, , , , , , , , , Rani Kashmiri Chilli Powder, , , , , , , , , , , , , , Follow us for more delicious Recipes !, , Did you make recipe? don’t forget to come back and leave your feedback and star rating., , , , , , , © Soniya Saluja, , , , Cuisine:, Indian, , /, , Category:, Instant Pot, , , , , , , , , More Vegetarian, Tandoori Paneer Tikka Skewers (Gas Stove Top & Grill Pan Recipe), Street Style Hakka Noodles / Chowmein Recipe, Easy Sheera Recipe – Make Perfect Sooji Halwa at Home!, How to Make Sabudana Vada in Appe Pan, Comments, , , , , , Ameeta, , says, , , April 03, 2024 at 1:31 pm, , , , The recipe looks amazing and am looking forward to trying it. One quick question - if I want to keep it vegan what would you  recommend instead of the yogurt?  Would cashew yogurt be ok or something else or just skip the yogurt? Thank you., , , Reply, , , , , , , , Smitha, , says, , , February 20, 2021 at 4:46 pm, , , , This recipe was a huge hit at home especially with the kids! They only just discovered malai kofta in restaurants and now they can eat it at home knowing exactly what is going into the dish! Love it!, , , Reply, , , , , , , , Soniya Saluja, , says, , , February 21, 2021 at 11:40 am, , , , Hello Smith, so glad to hear your experience ? do try other recipes  from our blog!, , , Reply, , , , , , , , , , Angelica, , says, , , September 18, 2020 at 3:08 pm, , , , Can extra kofta balls be frozen? If so, no garlic recipie, , , Reply, , , , , , , , Soniya Saluja, , says, , , July 18, 2020 at 3:09 pm, , , , Hi GL, Thanks! we have taken care of it. You can add garlic if you like or even skip it. As mentioned in the notes., , , Reply, , , , , , , , , , Akshatha pai, , says, , , July 17, 2020 at 1:10 pm, , , , Hi when did u add the onion .. it says onion tomato mixture but it does not say when to add the onion!!, , , Reply, , , , , , , , Soniya Saluja, , says, , , July 17, 2020 at 6:43 pm, , , , Hi Akshatha, It's  a typo mistake... it's taken care  of it's just tomatoes  :), , , Reply, , , , , , , , , , SHANIKA, , says, , , July 17, 2020 at 1:04 pm, , , , This dish looks so bright and perfect for an easy weeknight meal! YUM!, , , Reply, , , , , , , , Tawnie Kroll, , says, , , July 17, 2020 at 11:40 am, , , , This was so fun to make and very flavorful! Will be making again and cant wait!, , , Reply, , , , , , , , Emily, , says, , , July 17, 2020 at 11:17 am, , , , My husband loves Indian food so I definitely need to make this for him. Looks delish!, , , Reply, , , , , , , , kavitafavelle, , says, , , July 17, 2020 at 11:16 am, , , , Love malai kofte, and these ones look great. Good to know airfryer can also be used., , , Reply, , , , , , , , Jen, , says, , , July 17, 2020 at 11:12 am, , , , I have been wanting to try my air fryer with new dishes and this one looks like a winner. Adding this to the menu for this weekend, thanks!, , , Reply, , , , , , , , shahin, , says, , , September 27, 2016 at 4:41 am, , , , Great cooking ideas mam ! Made my dinner menu easy . Thankyou so much., , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , Welcome!, , A vegetarian & vegan food blog where we (Anvita & Soniya) share everyday healthy-ish recipes, some occasional treats, and even-you-can-do-this ideas., , , Read more, , , , Popular Recipes, , Instant Pot 2 Ingredient Homemade Yogurt !, Instant Pot Vegetable Chowmein Recipe, Date & Walnut Loaf Cake, Minestrone Soup (Copycat Olive Garden), , , Trending Now, , , , , , Footer, , , , freebie alert!, , Download our Vegetarian Grazing Table Grocery List, , Download our, FREE, Vegetarian Grazing Table Grocery List so you can start setting up an Instagram worthy spread for your next gathering., , , Get the list!, , , , , , , , , About Us, , Privacy Policy, , Contact, , ↑ back to top, , , , , , , Copyright © 2024, The Belly Rules The Mind, •, Powered by Feast+, , , , , Skip to Recipe, , , , , , , , , , , Instructions: videos and pictures., , What is Malai Kofta?, , Malai kofta is a popular Indian vegetarian recipe. Malai means cream in English. Kofta means fried balls. Malai kofta is fried balls in a rich, creamy sauce., , In our malai kofta, setting the fryer to cook for 15 minutes at 375 degrees. You want the balls to be golden brown on the outside., , , Can I make Malai Kofta Vegan?, , You can make malai kofta vegan with a few replacements. Instead of using paneer, you can use tofu. Also, you want to skip the ghee and use oil instead. Finally, don’t add cream to the sauce, though you could try using almond or coconut milk if you want a bit of extra creaminess., , Can you freeze malai kofta?, , You can freeze it if you keep the sauce separate. First, cooled sauce into a freezer safe bag or container. For the kofta, add the cooled balls to a freezer bag or freezer safe container. Wrap the balls with paper towels to help prevent extra moisture from building on the balls., , When you are ready to eat, defrost the balls and sauce in the fridge. Heat up the balls in your air fryer for about 2 to 3 minutes at 350 degrees or place them in the microwave for about 1 minute. Reheat the sauce in a pan or pot and add the balls once the sauce is warmed through., , , What to serve with Malai Kofta?, , We often like to serve the recipe with foods that can soak up the extra gravy. Some of our favorite pairings are naan,, , paratha, , and jeera rice. They let you enjoy every ounce of the gravy., , For a tasty and easy recipe to make, jeera rice, , check out this, stove top rice recipe, . You could also serve this with, dal makhani, or, bhindi masala, . You can serve it with a side of, Garlic Naan, or, Roti, , Chapati, , , Are you an Indian food lover? Then you will love our recipes, , Navratan korma, Rajma Chawal, Jeera Rice, Palak Paneer, , Make this delicious Malai Kofta for a flavorful indulgence you and your family will love!If you make this  recipe, don’t forget to come back and leave your feedback and star rating. We would be THRILLED if you would, take a pic and tag us on Instagram @dbellyrulesdmind or Facebook @, thebellyrulesthemind, , , , , Continue to Content, , , , , , , , Restaurant - Style Malai Kofta Recipe, , , , Yield:, , 4-6 people, , , , Prep Time:, , 15 minutes, , , , , Cook Time:, , 30 minutes, , , , , Total Time:, , 45 minutes, , , , , , Malai kofta is a delicious fried potato and cottage cheese (Paneer) ball in a rich tomato based curry sauce. This popular Indian recipe creates delicious dumplings, perfect for soaking up all the velvety sauce. The air fryer lightens up the traditionally deep fried dumplings while the Instant Pot makes putting together the curry sauce effortless., , , , , , Print, , , , , , , For the kofta, In a large mixing bowl add grated paneer and grated boiled potatoes., Add in the cardamom powder and salt to taste. Bind everything together nicely ., Take approximate 2 tablespoon of the paneer and boiled potato mixer  in you greased palm., Press them on your palm and add a few raisins and cashews in the center and prepare small ball sized kofta., The ball size should not be more than 2 bites to ensure they cook properly from inside., Air fry them at 375 *F for 15 minutes or till golden brown Or Deep fry the until golden brown or make them in appe pan, For the Gravy, Add the tomatoes, ginger, garlic, cashews, salt, red chili powder, yogurt and water in your inner pot of the electric pressure cooker., Place the lid and Close with pressure valve to sealing position., Pressure cook for 6 minutes followed by quick release., Open the electric pressure cooker, allow to cool for a couple of minutes., Using a hand blender / immersion blender, carefully blend the sauce until smooth., Strain the mixture to get rid of skin and seeds. Strain until silky smooth tomato puree is attained., Rinse the inner pot and remove any left over gravy., Set Instant Pot on Saute mode and heat ghee or oil add red chilli powder, garam  masala., Add in the strained tomato puree  and sugar and mix well., Cook until the mixture starts to thickens for 5 -8 minutes., Lastly add some crushed kastoori methi (dried Fenugreek leaves) and cream ( optional ), Finally, pour the curry over kofta and malai kofta is ready to enjoy., , , , Notes, , , You can skip the garlic if you prefer. Cream is optional too, , , , , , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , , , Reply, , , , , , , , Soniya Saluja, , says, , , September 18, 2020 at 5:23 pm, , , , Hi Angela, just thaw them at room temperature and air fry them at the same time. Hope this helps, , , Reply, , , , , , , , , , Molly, , says, , , July 28, 2020 at 11:00 pm, , , , Looks amazing, I'm planning on making it tomorrow! I want to add the cream, but it doesn't say a quantity. Can you advise how much cream I should use? Also, can I use cayenne in place of red chili powder? Thank you!, , , Reply, , , , , , , , Soniya Saluja, , says, , , July 29, 2020 at 9:12 am, , , , Hi Molly ,use around  1/4 cup of cream .add it when the strained  puree is sautéing and yes you can use cayenne  pepper too. If you  don't like too much spice skip it when adding  it in tomatoes  and yogurt.  Do share your feedback with us., , , Reply, , , , , , , , , , Shobhna, , says, , , July 23, 2020 at 9:45 pm, , , , I say your post 2 days ago on the IP FB page and have been planning to make it! Well, tonight I made it and served it with plain home made parathas! My family loved it!!, , , Reply, , , , , , , , Soniya Saluja, , says, , , July 24, 2020 at 12:55 am, , , , Hi Sobhana, so glad to hear that you and your family loved it! Hope you try other Recipes from our blog:), , , Reply, , , , , , , , , , Heather, , says, , , July 23, 2020 at 11:39 am, , , , , , Reply, , , , , , , , Soniya Saluja, , says, , , July 23, 2020 at 12:14 pm, , , , Hi Heather.. sorry about that. It's dried fenugreek leaves., , , Reply, , , , , , , , , , GL, , says, , , July 18, 2020 at 9:35 am, , , , Hi, couple of questions- tomato onion mixture is not edited yet looks like....second",
        "Paneer Lababdar": "Ingredients: , , , Paneer (Indian cottage cheese):, This is the main ingredient in the dish and it is important to use a good quality paneer. In fact, as with all my paneer recipes, I recommend using, Homemade Paneer, , Tomatoes:, Giving the dish a bit of tang, tomatoes are an important ingredient in the gravy. Be sure to choose tomatoes that aren’t too tangy or sour., , Cashews:, The creamy consistency in paneer lababdar comes from cashews. The cashews are ground to a paste with the tomatoes. Cashews also add a lovely sweetness to the dish., , Cream:, Adding cream also adds to the sweetness and richness in the gravy making it a restaurant style dish., , Onions:, In the curry, onions are not pureed, but chopped and lightly caramelized. Thus they add some sweetness and a slight sharp flavor to the curry., , Spices and Herbs:, Most of the spices and herbs used in this recipe are common and you probably already have them in your kitchen. The garam masala powder can be purchased, but is also a great spice to make from scratch and have on hand. Here I share the recipe for making, Garam Masala Powder, ., , , Step-by-Step Guide, , How to make Paneer Lababdar, , Preparation, , , , 1.5 cups chopped tomatoes (Use tomatoes that are not too tangy or sour), , 10 to 12 cashews, , 1 inch chopped ginger, , 2 to 3 chopped garlic cloves (medium-sized), , 1 green cardamom, , 2 cloves, , ½ cup water, , , , , 2. Switch on the stovetop and simmer this mixture on a low heat., , , , 3. Cook until the tomatoes are softened. If the water dries up and the tomatoes are not softened, then add about 2 to 3 tablespoons water and continue to cook. When I cooked, almost all the water had evaporated., , , , , , , 5. Grind or blend to a smooth paste. There should not be any cashews or tomato chunks in the paste., , You may add some water if required while grinding or blending. Set this ground tomato-cashew-spices paste aside., , , , Sautéing onions and tomato paste, , 6. Heat 2 tablespoons butter in a pan, kadai or wok. You can also use ghee (clarified butter) or a neutral-tasting oil., , Heat the butter on a low to medium heat ensuring that it does not burn., , , , 7. Add 1 tej patta (Indian bay leaf) and saute for a couple of seconds., , , , 8. Add ½ cup finely chopped onions., , , , 9. Stir and mix well., , , , 10. Then continue to saute as well as stir and cook until the onions become light golden or golden on medium-low to medium heat., , , , 11. Then add the tomato-cashew-spices paste. The mixture will splutter if there is water in it, so be careful., , , , 12. Stir and mix thoroughly., , , , 13. Add the following ground spice powders:, , , ½ teaspoon cumin powder (ground cumin), , ½ teaspoon coriander powder (ground coriander), , ½ teaspoon red chili powder or cayenne pepper, , , , , 14. Stir the ground spices. Saute this masala on low to medium-low heat. You will see the masala clumping and gathering around itself., , , , 15. Sauté until you see fat leaving the sides of the masala paste. The masala will also look glossy and shiny., , , , Making Paneer Lababdar, , 16. Then add 1 cup of water to the perfectly sauteed masala., , , , 17. Mix very well., , , , 18. Add 1 or 2 slit green chilies., , , , 19. Stir and allow the gravy to come to a simmer on medium-low to medium heat., , , , 20. Then season with salt according to your taste preferences., , , , 21. Add sugar. I added ½ teaspoon of sugar but you can add as per your taste., , , , 21. Add 200 grams paneer which has been cut into cubes or squares. Also add 2 tablespoons grated paneer., , Here I used fresh homemade paneer. If using frozen paneer, then keep it in warm water for some minutes and then slice as well as grate it., , , , 22. Gently mix and switch off the heat., , , , 23. Then sprinkle 1 teaspoon kasuri methi (dry fenugreek leaves) which have been crushed along with ¼ teaspoon garam masala powder. Mix very well again., , , , 24. Add ¼ cup low fat cream or 1 to 2 tablespoons of heavy whipping cream., , , , 25. Mix again gently very well taking care that the paneer cubes do not break. You can also add 1 tablespoon of butter at this step or dot the gravy with butter while serving. This is optional., , , , 26. Garnish paneer lababdar with chopped coriander leaves (cilantro) and ginger julienne., , Paneer labadar goes very well with Indian flatbreads, including roti, naan, or pudina paratha. Also, this creamy gravy can be served with jeera rice or vegetable pulao., , , , FAQs, , Can I use canned tomatoes or tomato puree?, , Yes definitely. Add 1.5 cups of canned tomatoes while blending cashews. You do not need to cook the canned tomatoes with cashews. For tomato puree, add ¾ cup of it directly when sautéing with the cashew paste. You just need to make the cashew and spices paste if you use tomato puree., , , What can I use instead of kasuri methi?, , Kasuri methi are dried fenugreek leaves. If you don’t have them, just skip them., , , Can I make paneer lababdar without onion and garlic?, , Yes of course! To get the mild flavors of onion and garlic without actually using them in the recipe, add 1 pinch of asafetida or hing (that is if you have it) when sautéing the tomato-cashew paste., , , Can I skip cream?, , Yes you can easily skip adding cream., , , Can i use malai?, , Malai which is the clotted cream that collects on the top of boiled milk has to be whipped to a smooth flowing consistency before you add it to the gravy., , , What can I replace cashews with?, , Add almonds which have been blanched in hot water for 30 minutes with their peels removed., , , , , For tomato-cashew paste, ▢, 1.5, , cups, , chopped tomatoes, , (ripe and red), 250 grams, ▢, 10 to 12, , cashews, ▢, 1, , inch, , ginger, , – chopped, ▢, 2 to 3, , garlic, , (medium-sized) – chopped, ▢, ½, , cup, , water, ▢, 1, , green cardamom, ▢, 2, , cloves, ▢, 2, , tablespoons, , Butter, ▢, 1, , tej patta, , (Indian bay leaf), ▢, ½, , cup, , finely chopped onions, , – 100 grams, ▢, ½, , teaspoon, , cumin powder, , (ground cumin), ▢, ½, , teaspoon, , Coriander Powder, , (ground coriander), ▢, ½, , teaspoon, , red chili powder, , or kashmiri red chili powder or cayenne pepper, ▢, 1 or 1.25, , cups, , water, , or add as required, ▢, 1 or 2, , green chilies, , or serrano peppers – slit, ▢, salt, , as required, ▢, ¼ to ½, , teaspoon, , sugar, , or add as required, ▢, 200, , grams, , Paneer, , (cottage cheese), ▢, 2, , tablespoon, , grated paneer, ▢, ¼, , teaspoon, , Garam Masala, ▢, 1, , teaspoon, , kasuri methi, , (dry fenugreek leaves) – crushed, ▢, ¼, , cup, , low-fat cream, , or 1 to 2 tablespoons heavy whipping cream, ▢, 1, , tablespoon, , Butter, , added later – (optional), For garnish, ▢, 1, , tablespoon, , chopped coriander leaves, , (cilantro leaves), ▢, 1, , inch, , ginger, , – julienne, , Cook Mode, Prevent your screen from going dark while making the recipe,  Instructions: , , , How do I make a vegan recipe of paneer lababdar?, , Replace firm tofu, seitan, tempeh with paneer. Skip adding cream altogether or replace it with coconut cream. Add a neutral tasting oil instead of butter., , , Can I make a large batch and freeze it, , Yes you can definitely do that. My recipe can be easily scaled. If freezing, paneer lababdar gravy stays well for about a month. In the refrigerator, it stays good for a couple of days., , , , More Restaurant Style Paneer Curries!, Paneer Recipes, Paneer Butter Masala Recipe, Paneer Recipes, Shahi Paneer Recipe (Royal Paneer Dish), Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Paneer Recipes, Paneer Pasanda Recipe (Restaurant Style), , , Please be sure to rate the recipe in the recipe card or leave a comment below if you have made it. For more vegetarian inspirations, , Sign Up, for my emails or follow me on, Instagram, , , Youtube, , , Facebook, , , Pinterest, or, Twitter, ., , , Paneer Lababdar (Restaurant Style Recipe), , , By, Dassana Amit, , , Paneer Lababdar is an easy-to-prepare, restaurant-style curry of paneer (cottage cheese cubes) in a creamy, mildly tangy and faintly sweet gravy. This vegetarian Paneer Lababdar recipe is also naturally gluten-free., , , 4.84, from, 117, votes, , , , Print, , Pin, , Save, Saved!, , Rate, , , , , Prep Time, 15, minutes, , mins, , Cook Time, 25, minutes, , mins, , Total Time, 40, minutes, , mins, , , , , Cuisine, North Indian, Punjabi, , Course, Main Course, , Diet, Gluten Free, Vegetarian, , Difficulty Level, Moderate, , , Share, Email, Facebook, Tweet, , , Servings, 4, , Units, US Customary, Metric, , , Preparing tomato-cashew paste, Take chopped tomatoes, cashews, chopped ginger and garlic, green cardamom, cloves and water in a small pan. Use tomatoes which are not too tangy or sour., Turn on the stovetop and simmer this mixture on a low heat., Cook until the tomatoes are softened. If the water dries up and the tomatoes are not softened, then add about 2 to 3 tablespoons water and continue to cook., Allow this mixture to become warm or cool completely and add to a grinder or blender jar., Grind to a smooth paste without any cashews or tomato chunks or pieces. You may add some water if required while grinding. Keep this ground tomato-cashew-spices paste aside., Sautéing onions and tomato-cashew paste, Heat butter in pan or kadai or wok. Add the tej patta and sauté for a couple of seconds., Add finely chopped onions. Stir well., Then continue to saute as well as stir and cook till the onions become light golden or golden., Then add the tomato-cashew-spices paste. The mixture will splutter if there is water in it, so be careful. Stir very well., Add cumin powder, coriander powder and red chili powder., Stir and saute this masala. You will see the masala clumping and gathering around itself., Saute till you see fat leaving the sides of the masala paste., Making paneer lababdar, Then add water. Mix very well., Add the slit green chilies., Stir and allow the gravy to come to a simmer. Then season with salt and sugar., Add paneer cubes and grated paneer., Gently mix and combine., Then sprinkle kasuri methi which has been crushed with the garam masala powder. Stir very well again., Lastly add the low-fat cream or heavy whipping cream. Switch off the heat & combine very well. You can also add 1 tablespoon butter at this step. This is optional., Garnish paneer lababdar with chopped coriander leaves and ginger julienne. Serve with chapati, tandoori roti or naan. It also goes well with cumin rice or veg pulao., , Video, , , , , , , , , , , Nutrition Info (Approximate Values), , Nutrition Facts, , Paneer Lababdar (Restaurant Style Recipe), , , Amount Per Serving, , , Calories, 353, , Calories from Fat 270, , , , , % Daily Value*, , , Fat, 30g, 46%, Saturated Fat 18g, 113%, Cholesterol, 81mg, 27%, Sodium, 442mg, 19%, Potassium, 205mg, 6%, Carbohydrates, 12g, 4%, Fiber 3g, 13%, Sugar 4g, 4%, Protein, 10g, 20%, , , Vitamin A, 1021IU, 20%, Vitamin B1 (Thiamine), 1mg, 67%, Vitamin B2 (Riboflavin), 1mg, 59%, Vitamin B3 (Niacin), 1mg, 5%, Vitamin B6, 1mg, 50%, Vitamin B12, 1µg, 17%, Vitamin C, 14mg, 17%, Vitamin D, 1µg, 7%, Vitamin E, 1mg, 7%, Vitamin K, 7µg, 7%, Calcium, 303mg, 30%, Vitamin B9 (Folate), 13µg, 3%, Iron, 1mg, 6%, Magnesium, 23mg, 6%, Phosphorus, 52mg, 5%, Zinc, 1mg, 7%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , This Paneer Lababdar Recipe post from the blog archives first published in Feb 2015 has been updated and republished on June 2022., , Share This Recipe:, WhatsApp, Facebook, Pin, Tweet, Email, Shares, 7.1k, Meet Dassana, Welcome to Dassana's Veg Recipes. I share vegetarian recipes from India & around the World. Having been cooking for decades and with a professional background in cooking & baking, I help you to make your cooking journey easier with my tried and tested recipes showcased with step by step photos & plenty of tips & suggestions., , Learn More about Dassana, Get My Secrets to Great Indian Food, Sign up for my FREE Beginners Guide to Delicious Indian Cooking, Please enable JavaScript in your browser to complete this form., First Name, *, Email, *, Phone, SIGN UP, , More Vegetarian Recipes You'll Love, Paneer Recipes, Paneer Pasanda Recipe (Restaurant Style), Paneer Recipes, Paneer Makhani Recipe (Easy & Tasty), Paneer Recipes, Shahi Paneer Recipe (Royal Paneer Dish), Paneer Recipes, Paneer Curry Recipe (Paneer Gravy), , , , Leave a Comment, Cancel reply, Your email address will not be published. We moderate comments and it takes 24 to 48 hours for the comments to appear. We thank you for your understanding and patience. If you have made the recipe, then you can also give a star rating., , Your Recipe Rating, , , , Your Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Your Name, *, , , Your Email, *, , , , , , Δ, , , 237 Comments, , , , , , , Asha Agarwal, , says:, , , , Mar 06, 2025 at 5:57 am, , , , , Excellent., , , Reply, , , , , , , , Mani Bilimoria, , says:, , , , Mar 05, 2025 at 7:10 am, , , , , It is simple to follow & turns out very delicious., , , Reply, , , , , , , , Jaydev Panchal, , says:, , , , Mar 30, 2023 at 11:20 am, , , , , My last experience of making Paneer by myself was very bad but after following this recipe the food was amazing. I am just 20 and made this for me and my younger sister. We loved it. Thank you for the amazing., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Apr 17, 2023 at 1:49 pm, , , , , Great and thanks a lot for sharing your experience. Welcome., , , Reply, , , , , , , , , , Sangeeta, , says:, , , , Feb 26, 2023 at 5:49 am, , , , , Thanks for this wonderful recipe. It is truly restaurant style in taste and presentation ., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Feb 28, 2023 at 10:44 am, , , , , Great and thanks for sharing the feedback., , , Reply, , , , , , , , , , Beverly Payne, , says:, , , , Jan 21, 2023 at 6:55 pm, , , , , Hello Dasana,, I came across your recipe and made it today…It has turned out absolutely delicious and a big hit especially with my grandchildren., Thank you for sharing your recipe ., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Jan 21, 2023 at 7:31 pm, , , , , Happy to hear! Thanks a lot for this lovely feedback and the rating on the recipe., , , Reply, , , , , , , , , , Ash, , says:, , , , Aug 21, 2020 at 9:40 am, , , , , I tried this today and it was delicious. Thank you for the recipe. My question is that in some recipe I have seen dry Kashmiri chili added to make the paste. Does adding this change the flavor of the dish and only makes it more spicy? Thank you., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Aug 21, 2020 at 6:34 pm, , , , , Thanks for the feedback on my recipe and glad to know. Kashmiri chillies will change the taste and flavor of the dish but it will it give a nice red or orange color. The spiciness will depend on how many Kashmiri chillies are added in these recipes., , , Reply, , , , , , , , Ash, , says:, , , , Aug 25, 2020 at 9:10 pm, , , , , Thank you for your feedback! Looking forward to trying many more of your recipes. So far I have tried your dal Bukhara and tomato and coconut chutney and all were excellent., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Aug 26, 2020 at 6:05 pm, , , , , Welcome. Sure, do try more recipes and I hope you like them as well. Thanks for the feedback on the recipes you have made., , , Reply, , , , , , , , , , , , , , Shilpi Gupta, , says:, , , , Aug 27, 2019 at 10:57 pm, , , , , Hi Ma’am, I have tried many of your recipes and they come out really delicious., I tried paneer lababdar today. It was too good!, This is one site which I can trust for every recipe., , Thank you and much love., , , Reply, , , , , , , , dassana amit, , says:, , , , Aug 28, 2019 at 6:07 pm, , , , , hi shilpi, thank you very much. it feels good to read your feedback. thanks for the trust., , hugs and regards, dassana, , , Reply, , , , , , , , , , Anju, , says:, , , , Jul 25, 2019 at 8:10 am, , , , , Sab recipes aapki main try karti . Aur sab recipes wow and delicious hoti hai, Thank you so much., , , Reply, , , , , , , , dassana amit, , says:, , , , Jul 25, 2019 at 6:45 pm, , , , , dhanyawad anju. aapka comment padke achcha laga. most welcome and happy cooking., , , Reply, , , , , , , , , , Aparna Saini, , says:, , , , Jul 23, 2019 at 10:12 pm, , , , , The dish turned out to be very tasteful., I made it on my husbands demand and he was very happy after having it., Thank you so much., , , Reply, , , , , , , , dassana amit, , says:, , , , Jul 25, 2019 at 5:40 pm, , , , , thanks and welcome aparna. glad to know. happy cooking., , , Reply, , , , , , , , , , Tanya, , says:, , , , Jul 20, 2019 at 4:59 pm, , , , , Hi I really like your recepies. This is my favorite site from where I can follow recipes without any second thought. You deserve all the five stars in a row., , , Reply, , , , , , , , dassana amit, , says:, , , , Jul 20, 2019 at 8:43 pm, , , , , thank you much tanya. felt good to read your comment. it definitely encourages me. thanks again., , , Reply, , , , , , , , Meghana sunil, , says:, , , , Aug 20, 2020 at 9:27 am, , , , , Hi mam good morning. Your recipes are really great. My, Family really loves it when I refer your recipes and do., , , Reply, , , , , , , , Dassana Amit, , says:, , , , Aug 20, 2020 at 7:11 pm, , , , , Hi Meghana, thank you for sharing your feedback and experience. Glad to read., , , Reply, , , , , , , , , , , , Neha, , says:, , , , Jul 03, 2019 at 10:31 am, , , , , Hi,I tried your this Paneer recipe & it came out so good.My kids just loved it., I was wondering if you can give the exact ratio of everything for 30 people., , , Reply, , , , , , , , dassana amit, , says:, , , , Jul 03, 2019 at 7:00 pm, , , , , thanks neha for this feedback and review. in the recipe card, just increase the servings to 30 people and you will get the ingredient proportions to be used accordingly., , , Reply, , , , , , , , , , Jordan, , says:, , , , Jul 02, 2019 at 5:45 am, , , , , Delicious ! Just like my favourite restaurant ! Thank you!, , , Reply, , , , , , , , dassana amit, , says:, , , , Jul 02, 2019 at 8:07 pm, , , , , thanks for the feedback and rating. welcome., , , Reply, , , , , , , , , , Priya, , says:, , , , Jun 26, 2019 at 1:16 pm, , , , , Thank you so much for the wonderful restaurant style recipe. As soon as my kids had their first bite, they said wow very yummy Mumma, it’s like restaurant paneer. Superb and continue posting wonderful recipes., , , Reply, , , , , , , , dassana amit, , says:, , , , Jun 26, 2019 at 7:11 pm, , , , , that is so nice. thanks for sharing this lovely review on paneer lababdar. glad to know that your kids loved the recipe. i have already added many recipes on the blog and will continue to add them., , , Reply, , , , , , , , , , Shraddha, , says:, , , , Jun 24, 2019 at 2:59 pm, , , , , Hello madam,, As usual ur recipes are more than perfect.. Thanks to the detailed descriptions and pics every dish I try goes well.., I have recently shifted out of India so need small help, what can I use instead of kasuri methi.. Also in rasgulla, or any Chena recipe which milk can be used, here I get 0.5%,1.5% and 3.5%fat milk.. Totally confused..  Plz help, , , Reply, , , , , , , , dassana amit, , says:, , , , Jun 24, 2019 at 8:08 pm, , , , , you can skip kasuri methi. use whole milk which is available outside india., , , Reply, , , , , , , , Shraddha, , says:, , , , Jun 25, 2019 at 8:54 am, , , , , Hello mam,, Thank you for your prompt response., With whole milk, do you mean to say, 3.5%fat milk or there is something else called whole milk that is available outside India., , , Reply, , , , , , , , dassana amit, , says:, , , , Jun 25, 2019 at 7:53 pm, , , , , welcome shraddha.3.5% milk is whole milk., , , Reply, , , , , , , , , , , , , , Gunjan, , says:, , , , Jun 17, 2019 at 6:43 pm, , , , , I am your huge huge fan. All your recipes are hit in my family!!, I never loved cooking but loved tasty food…and your recipe inspire me to cook., , , Reply, , , , , See More Comments, , , Meet Dassana, Hi, I am Dassana. Running the kitchen for decades, I share tried and tested Vegetarian recipes on my food blog since 2009, with a step-by-step photo guide & plenty of tips so that your cooking journey is easier. I also have a professional background in cooking & baking., , Learn More about Dassana, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, , Popular, Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Breakfast Recipes, Upma Recipe, Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Paneer Recipes, Paneer Butter Masala Recipe, , Snacks Recipes, Samosa Recipe (With Potato & Green Peas), Dal (Lentils) & Legumes, Rajma Recipe | Rajma Masala (Restaurant Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), As Seen In:, Dassana's Veg Recipes, Recipe Glossary, , Press & Media, , Privacy Policy, , Terms & Conditions, , Accessibility Statement, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, © Dassana’s Veg Recipes 2009-2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , ,"
    }
}