{
    "ingredients": {
        "Ker Saangri": "ker berries, sangri beans, dahi,fennel seeds",
        "Aaani Bassar": "besan,poppy seeds,onion,tomato,ginger paste",
        "Nashpati ki Sabji": "pears",
        "Tamatar ka Choka": "tomatoes"
    },
    "recipe_url": {
        "Ker Saangri": "https://www.whiskaffair.com/ker-sangri/#recipe",
        "Aaani Bassar": "https://ribbonstopastas.com/sindhi-aani-bassar-fried-lentil-cakes-in-thick-gravy/#recipe",
        "Nashpati ki Sabji": "https://www.parentlane.com/recipes/child-food-recipes/nashpati-ki-sabji",
        "Tamatar ka Choka": "https://www.vegrecipesofindia.com/tomato-chokha-recipe/#wprm-recipe-container-135347"
    },
    "Recipe": {
        "Ker Saangri": "Ingredients: , This delightful dish from Rajasthani cuisine is very simple to make and delicious to eat. It, is made in almost all Rajasthani households, especially in the Marwad region of the state., , The berries and beans are washed very well to remove dirt and then soaked to, rehydrate, them. They are then cooked in a yogurt-based spicy masala., , Every household, has its way of making this sabji. While some add yogurt (curd, dahi)  to it, some stir fry it with everyday spices., , Ker Sangri is a great dish when you are, out of vegetables, . It is also a great sabji to make for travel as it says well at room temperature for 2-3 days., , , , Ker & Sangri, that can be eaten with Poori, Paratha, or Phulka., , Yogurt (Dahi, Curd), adds a slight tanginess to this dish. If using homemade curd, make sure it is not sour., , Spices, – This Rajasthani sabzi uses everyday Indian spices such as coriander powder, red chilli powder, turmeric powder, garam masala powder, dry mango powder (amchoor), and salt., , These spices add a spicy and tangy taste to the dish, which makes it even more delicious., , Raisins, are added to the sabzi, making it rich and adding light sweetness to this spicy, tangy dish., , Oil, – You can use any cooking oil to make this dish. Some households in Rajasthan make it in ghee., , Others, – You will also need asafetida (hing), cumin seeds, fennel seeds (saunf), dry red chilies, and cilantro (fresh coriander leaves)., , You can also add Kumathiya (another berry) with ker sangri to this sabji., , To make the ker sangri recipe gluten-free, skip adding asafetida., , , , How To Make Ker Sangri Ki Sabzi, , Prepare Ker And Sangri, , Wash ½ cup dried Ker and 1 and ½ cup dried Sangri separately 2-3 times to remove all the dirt., , Soak separately in 4-5 cups of water for 8-10 hours., , Wash again 2-3 times., , Note, – Both ker and sangri grow in the deserts of Rajasthan and have a lot of dirt on them. So washing them very well is very important., , Sometimes, sangri still have stalks attached to them. Make sure to remove them before cooking., , Add the soaked Ker and Sangri to a pressure cooker., , , , , Add, 2 cups of water and 1 teaspoon salt, and stir gently., , , Close the lid of the cooker and pressure cook for 1 whistle on high heat. Remove the cooker from the heat., , , Let the pressure release naturally, and then open the cooker., , Drain the water and wash ker sangri once more. Keep them aside., , , , , Make The Sabji, , Heat 5 tablespoon of oil in a pan over medium-high heat., , , Once the oil is hot, add, and sauté for 3-4 seconds., , , ¼ teaspoon asafetida, , 1 teaspoon cumin seeds, , 1 teaspoon fennel seeds, , , , , , Add 4-5 dry red chilies and fry for 4-5 seconds., , , Now add, the following spice powders, and saute for 10-12 seconds., , , 3 teaspoon coriander powder, , 2 teaspoon Kashmiri red chili, powder, , 1 teaspoon turmeric powder, , 1 teaspoon garam masala powder, , 2 teaspoon dry mango powder, , , , , , , , Add the cooked ker and sangri, and mix well., , , , Add, and mix well., , , 2 tablespoon whisked plain yogurt, , ¼ cup of raisins, , 1 teaspoon salt, , , , , , Reduce the heat to low., , Cover the pan with a lid and cook for 6-8 minutes., , Check for salt and add more if needed., , , Garnish with chopped cilantro and serve hot., , , , Frequently Asked Questions, , Where can I buy Ker and Sangri?, , If you ever travel to Rajasthan, remember to stock up on dried Ker berries and Sangri beans. They are easily available at any local grocery store in Rajasthan and are reasonably priced there., You can also find them in your city’s Rajasthani stores or even try them at nearby Indian grocery stores., You can always order them online, too. Many online grocery portals sell dried Ker Berries and Sangri Beans, including Amazon., , , How to make it vegan?, , To make it vegan, You can skip adding yogurt to this sabzi. Just follow the same steps and avoid adding yogurt. You can add some grated tomatoes to replace it., , , How to make it with buttermilk?, , To make it with buttermilk, Ker and Sangri are soaked in buttermilk for 4 to 5 hours or overnight. Once done, they are washed under running water and then cooked with yogurt and spices. They soak up the buttermilk and taste delicious., , , , Serving Suggestions, , Traditionally, Ker Sangri Sabzi is served with Makki Ki Roti or, Bajre Ki Roti, ., I like making it with dal bati churma for a traditional Rajasthani meal. I also make my popular, lal maas, to go along., , You can also serve it with, Phulka, , , Plain Tawa Paratha, , , Missi Roti, ,, and, Poori, ., , You can also serve it as a side dish along with Dal, Phulka, and Rice for everyday Indian-style meals., , Storage Suggestions, , Rajasthani Ker Sangri lasts, 2-3 days at room temperature and 10 days in the refrigerator, when stored in an airtight container., , If you make it in large quantities, only heat the amount of sabzi you want to serve., Reheating again and again can decrease the shelf life., , , You can, reheat, it in the microwave or a pan until it is nice and warm. If you feel it has become dry, sprinkle a little water and give it a nice mix while reheating., , You can also freeze it for up to, 2 months, . Thaw, reheat, and serve., , , You Might Also Like, , Mutton Curries, Laal Maas (Rajasthani Red Mutton Curry), Veg Curries, Besan Bhindi, Pickle Recipes, V, Indian Vegan, Mirchi Ke Tipore, Veg Curries, Papad Ghatiya Sabji, , , , , 3.75, from, 8, votes, , Ker Sangri Recipe, , By:, Neha Mathur, , Ker Sangri, is a traditional Rajasthani dish made with dried ker berry and sangri beans. Here is a tried and tested authentic recipe to make it at home., , Prep:, 10, minutes, , mins, Cook:, 30, minutes, , mins, Soaking Time:, 10, hours, , hrs, Total:, 10, hours, , hrs, , 40, minutes, , mins, Servings:, 8, , people, , , , , , Save Recipe, Saved Recipe, , Pin Recipe, , Rate Recipe, , Print Recipe, , , , , , 1x, 2x, 3x, ▢, ½, , cup, , dried Ker berries, ▢, 1 and ½, , cups, , dried Sangri beans, ▢, 2, , teaspoons, , salt, , (divided, or to taste), ▢, 5, , tablespoons, , oil, ▢, ¼, , teaspoon, , asafetida (hing), ▢, 1, , teaspoon, , cumin seeds (jeera), ▢, 1, , teaspoon, , fennel seeds (saunf), ▢, 4-5, , whole dry red chilies, ▢, 3, , teaspoons, , coriander powder, ▢, 2, , teaspoons, , Kashmiri red chili powder, ▢, 1, , teaspoon, , turmeric powder, ▢, 1, , teaspoon, , garam masala powder, ▢, 2, , teaspoons, , dry mango powder (amchoor), ▢, 2, , tablespoons, , plain yogurt (dahi, curd), ▢, ¼, , cup, , raisins (kishmish), ▢, 2, , tablespoons, , chopped cilantro (fresh coriander leaves), US Customary, –, Metric, , Want to save this recipe?, Just enter your email and get it sent to your inbox! Plus you’ll get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , Cook Mode, Prevent your screen from going dark,  Instructions: Prepare Ker And Sangri, Wash Ker and Sangri separately 2-3 times to remove all the dirt., Soak separately in, 4-5, cups of water for 8-10 hours., Wash again 2-3 times., Note, – Both ker and sangri grow in the deserts of Rajasthan and have a lot of dirt on them. So washing them very well is very important., Note, – Sometimes sangri have stalks still attached to them. Make sure to remove them before cooking., Add the soaked Ker and Sangri to a pressure cooker., Add, 2, cups of water and, 1, teaspoon salt and stir gently., Close the lid of the cooker and pressure cook for 1 whistle on high heat. Remove the cooker from the heat., Let the pressure release naturally and then open the cooker., Drain the water and wash ker and sangri once more. Keep them aside., Make The Sabji, Heat oil in a pan over medium-high heat., Once the oil is hot, add asafetida, cumin seeds, and fennel seeds and saute for 3-4 seconds., Add dry red chilies and fry for 4-5 seconds., Now add coriander powder, chili powder, turmeric powder, garam masala powder, and dry mango powder and saute for 10-12 seconds., Add the cooked ker and sangri and mix well., Add yogurt, raisins, and, 1, teaspoon salt and mix well., Reduce the heat to low., Cover the pan with a lid and cook for 6-8 minutes., Check for salt and add more if needed., Garnish with chopped cilantro and serve hot., , Video, , , , , , , , , , Notes, Both ker and sangri have lots of dust in them. So make sure to wash them multiple times before cooking., , Sometimes sangri have the stalk still attached to it. Make sure to remove it before cooking., , Nutrition, Calories:, 114, kcal, , , Carbohydrates:, 10, g, , , Protein:, 1, g, , , Fat:, 8, g, , , Saturated Fat:, 1, g, , , Cholesterol:, 1, mg, , , Sodium:, 48, mg, , , Potassium:, 143, mg, , , Fiber:, 1, g, , , Sugar:, 2, g, , , Vitamin A:, 369, IU, , , Vitamin C:, 33, mg, , , Calcium:, 22, mg, , , Iron:, 1, mg, , , , , , , , Like this recipe? Rate and comment below!, , , , , 3.75 from 8 votes (, 8 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , 9 Comments, , , , , , Umeshkumar Mohanlal Joshi, , says:, , , , April 30, 2024 at 8:18 pm, , , , , Thanks for sharing the recipe, , , Reply, , , , , , , , Rakesh Kumar, , says:, , , , April 11, 2020 at 11:49 am, , , , , It is definitely delicious. I just had today at lunch. We in Thar of Pakistan has an abundance of it. The idea of selling packaged in market is wonderful. Someone outside Thar wanted a guide. You explained very well. Thanks, Neha., , , Reply, , , , , , , , Neha Mathur, , says:, , , , April 11, 2020 at 12:37 pm, , , , , Thanks, , , Reply, , , , , , , , , , Anthony Lee, , says:, , , , February 24, 2020 at 7:20 am, , , , , This look amaizng. Cant wait to do this with my gf xD, , , Reply, , , , , , , , Neha Mathur, , says:, , , , February 24, 2020 at 8:58 am, , , , , Do try 🙂, , , Reply, , , , , , , , , , ratna, , says:, , , , April 22, 2015 at 7:15 pm, , , , , I heard about Ker Sangri in the Masterchef show recently, and always wondered what that was. Thanks Neha. I’m putting it in my to do list for my Rajasthan trip later in the year., , , Reply, , , , , , , , msnehamathur, , says:, , , , April 23, 2015 at 1:46 am, , , , , Thnx Ratna, , , Reply, , , , , , , , , , Prash@YummilyYours, , says:, , , , April 21, 2015 at 1:46 pm, , , , , I have never had this but the photos are screaming out to me.. YUMMY!!, , , Reply, , , , , , , , msnehamathur, , says:, , , , April 22, 2015 at 11:20 am, , , , , Thnx Prash, , , Reply, , , , , , , , , Hey! Nice to meet you, , Hi! I’m Neha, Blogger & Recipe Expert behind Whisk Affair. I’ve nurtured Whisk Affair since 2012 by trying & testing every recipe published. Be sure that it will turn out good each time!, , , Read more about me, , , , , , , , My cookbook, , , Click to Buy Now on Amazon, , , , , , Most Popular, , Rice, Hibachi Fried Rice (Japanese Style Fried Rice), Main Course, GF, Global Gluten Free, Spicy Lemon Garlic Baked Tilapia, Cooking Basics, Creamy Garlic Parmesan Sauce, Indian Beverages, Lemon Tea, Soups, GF, Global Gluten Free, Chicken Clear Soup, Global Breakfast, Scrambled Egg Whites, Featured In, , , Back to top, Whisk Affair, , , , , About Neha, , Diwali E-Book, , My Cookbook, , Sign up for emails and updates, , Contact Me, , ©2025 Whisk Affair. All rights reserved., , Privacy Policy, •, Terms & Conditions, •, Accessibility Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Aaani Bassar": "Ingredients: , Aani, , Chickpea Flour or Besan, : Use a good quality organic besan. It is easily available in grocery stores. Make sure to sieve it to get rid of any lumps., , Onion, : Onions give a crunch and a caramelized flavor. Add finely chopped onions., , Green Chilly, : Finely chopped medium-spiced green chilies are the best to use in Aani., , Coriander Leaves, : Coriander leaves add their aroma and are a must in Aani., , Mint Leaves, : Mint leaves are optional, but I love their flavor. They help in digestion too., , Oil:, Use oil for Moyan as well as for frying the Aani., , Anardana | Dried Pomegranate, : Most Sindhis add a handful of anardana to the Aani. It gives a slight tanginess., , Poppy Seeds, : A teaspoon of poppy seeds give a wonderful crunch and flavor to the Aani., , , Gravy, , Onion:, I use red onions, but white ones will work too. Use a chopper to make work easy., , Tomato, : I prefer to roughly blend the tomatoes for this gravy., , Herbs and Spices, : I have used ginger, green chilly, and the basic everyday spices like turmeric, red chilly powder, and coriander powder. A pinch of Garam Masala enhances the flavor of the curry., , , How to make Sindhi Aani Bassar, , To make Sindhi Aani Basaar, first, we will make the Aani., , Aani, , First, soak the poppy seeds for about an hour. Use a thin sieve to drain the water., Now take besan in a wide bowl. Add chopped onions, green chili, coriander leaves, poppy seeds, dry pomegranate seeds, salt, and oil., , Mix everything very well. Rub in the oil so the flour resembles breadcrumbs. Knead the dough adding water gradually. The dough should be stiff., Next, pinch out small balls, the size of a small lemon, and flatten them to shape them into a tikki. We call these tikki Aani., Heat oil in a kadai and fry the Aani in medium to hot oil. Do not add all the tikkis at a time, they might disintegrate. Fry the tikkis till golden. Keep aside. Let them come to room temperature., , Now immerse them in water. ( This is a tip that my mom taught ) The Aanis absorb water and become soft., Alternatively, we add the fried Aanis., , Next, we will make the gravy, ., , Aani | Tikki, 2, , cup, , Besan / Gram Flour, 1, , Onion, , finely chopped, 2, , Green Chilly, , finely chopped, 1/4, , cup, , Coriander Leaves, , finely chopped, 1, , teaspoon, , Poppy Seeds, 1, , teaspoon, , Dry Pomogranate Seeds/ Anardana, 4, , tablespoon, , Oil, Salt to taste, Water to knead, Oil to Fry the  Aani, Gravy, 4, , tablespoon, , Oil, 8, , Onions, , chopped, 1, , teaspoon, , Ginger Paste, 6, , Tomato, , chopped, 2, , Green Chilli, , finely chopped, 1, , teaspoon, , Coriander Powder, 1/8, , teaspoon, , Turmeric Powder, 1/2, , teaspoon, , Red Chilly Powder, 1/2, , teaspoon, , Garam Masala, Salt to Taste,  Instructions: Seyal., , Heat about 4 tablespoons of oil in a pan. Add the chopped onion and saute till translucent. Now add ginger paste, and chopped green chilli., , Gently remove the tikkis from the water and add them to the onion. Sprinkle salt and turmeric. Do not mix, simply cover the pan with a lid and pour about half a cup of water over the lid. Simmer the flame., , ( If you are using fried tikkis we will still add them at the same time and sprinkle a little water over them, cover with a lid, and cook similarly. Add tomatoes only after the tikki is soft., , After 10-12 minutes the onions become soft. Remove the lid and now add tomatoes, coriander powder, and red chilly powder. Give a gentle stir, so everything combines well. Put back the lid and let the tomatoes cook., , After about 5 minutes or till the tomatoes are mushy increase the flame and cook till all the moisture is absorbed. We will see a sheen of oil on the soft onions. Sprinkle Garam Masala. Garnish with coriander leaves. Serve hot with Sindhi Fulko or Paratha., , , Serving Suggestions, , We serve Aani Bassar with a ghee-smeared roti, , Fulko, . We can also serve it with, Chapati, or, Paratha., , Storage Suggestions, , We can store the Aani Bassar Sabzi in the frig for a day. Since it is an onion-based dish, I prefer not to store more than that., , The Aani has a good shelf life and we can store them in the refrigerator for a week. You can store them in the freezer for almost three months. Prepare fresh gravy and add the Aanis., , , Notes & Tips, , To make Aani, ensure that the dough for the Aani is hard. While kneading the dough add water spoon by spoon. A Tikki made from soft dough will make the tikki hard., , While frying the Tikki, do not fry it in very hot oil. They will become dark, but will not cook from inside., , Do not overcrowd the Tikkis while frying., , I immerse the Tikkis in water, but this is an optional step., , The Tikki has a good shelf life and you can store it in the refrigerator for almost a week. You can stock them in the freezer too., , After adding the Tikki to the onions, do not stir, as it will break the Tikki. When you need to stir, stir gently with a spatula., , You can enjoy the Tikki as it is, as a snack too., , , , I have updated the post with better pics and content., , Here are some more curries with Besan, ., , , , 1, , , , , , Takey Paise, , , Takey Paise are cooked gram flour dumplings, which are added to a spicy yogurt gravy. The delicious curry is from Uttar Pradesh., , , Check out this recipe, , , , , 2, , , , , , Rajasthani Gatte Ki Sabzi, , , , Check out this recipe, , , , , 3, , , , , , Gatte ka Pulao, , , Gatte ka Pulao is a Rajasthani variety of rice pulao which has very flavorful rice and gattas which are steamed cakes.The pulao is a meal by itself., , , Check out this recipe, , , , , 4, , , , , , Gatta Capsicum, , , Gatta Capsicum is a Rajasthani side dish made with Gattas, the famous chickpea rolls and capsicum. This makes an excellent side dish., , , Check out this recipe, , , , , , , , , , Print, , Pin, , 5, from, 3, votes, , , Sindhi Aani Bassar, , , Sindhi Aani Bassar is a famous Sindhi style Besan ki Sabzi. It is delicious with fried lentil dumplings that are coated with a thick gravy of onion and tomatoes., , , , Course, Lunch, , Cuisine, Indian Cuisine, Sindhi Cuisine, , Keyword, Gluten Free, , , , Prep Time, 25, minutes, , minutes, , Cook Time, 20, minutes, , minutes, , , , Servings, 4, , , Author, Vaishali Sabnani, , Equipment, Pan / Kadai / Wok, Slotted Spoon, , Aani / Tikki, First soak the poppy seeds for about in hour. Use a thin seive to drain the water., Now take besan / gram flour in a wide bowl. Add chopped onions, green chilly, coriander leaves, poppy seeds, dry pomogrante seeds, salt and oil., Now mix everything very well. Rub in the oil so the flour resembles breadcrumbs. Knead the dough adding water gradually. The dough should be stiff., Now pinch out small balls, the size of a small lemon, flatten them to shape into a tikki., Heat oil in a kadai and fry the tikkis in medium to hot oil. Do not add all the tikkis at a time, they might disintegrate. Fry till golden. Keep aside. Let them come to room temperature., Traditionally we add these fried tikkis to the onions, but I immerse them in water for a few minutes. This makes the tikkis soft and reduces the cooking time. A tip that my mom taught ! You can decide to choose to add wither of the tikkis., Gravy, Heat about 4 tablespoon oil in a pan. Add the chopped onion and saute till translucent. Now add ginger paste, and chopped green chilli., Gently remove the tikkis from water and add them to the onion. Sprinkle salt and turmeric. Do not mix, simply cover the pan with a lid and pour about half cup water on it. At this time simmer the flame., ( If using fried tikkis we still add them at the same time and sprinkle a little water, cover and cook similarly. Add tomatoes only after the tiki is soft), After 10-12 minutes the onions become soft. Remove the lid  and now add tomatoes, coriander powder, red chilly powder and garam masala. Give a gentle stir, so everything combines well. Put back the lid and let the tomatoes cook., After about 5 minutes or till the tomatoes are mushy increase the flame and cook till all the moisture is absorbed. We will see a sheen of oil on the soft onions. Garnish with coriander leaves. Serve hot with Sindhi Fulko or Paratha., , , Notes, To make Aani, ensure that the dough for the Aani is hard. While kneading the dough add water spoon by spoon. A Tikki made from soft dough will make the tikki hard., , While frying the Tikki, do not fry it in very hot oil. They will become dark, but will not cook from inside., , Do not overcrowd the Tikkis while frying. I immerse the Tikkis in water, but this is an optional step., , The Tikki has a good shelf life and you can store it in the refrigerator for almost a week. You can stock them in the freezer too., , After adding the Tikki to the onions, do not stir, as it will break the Tikki. When you need to stir, stir gently with a spatula., , , , Related Posts:, Chaat Board, Tweet, Pin, 1, Share, 1, Shares, , , , , Category :, All, , , Blogging Marathon, , , Curries, , , Sindhi Cuisine, , , Vegan, , , , , , , , ←, Hare Chane ki Chaat, , , , Punjabi Chole – Ek masale wale / Just one spice, →, , , , , 17 thoughts on “Sindhi Aani Bassar”, , , , , , , , Suma Gandlur, , says:, , , , July 4, 2015 at 7:07 am, , , , , It is a new one for me. For the uninitiated ones like me, these sound like pakodas in a thick gravy. Must be delicious., , , Reply, , , , , , , , , Rajani S, , says:, , , , July 5, 2015 at 10:43 am, , , , , I love learning so many new recipes from your space Vaishali. I sometimes come and camp at your space, just to look at the varieties and spread :-). The best part is you make it look so simple as well :-). I love this gravy and curry here, just making my mouth water!!, , , Reply, , , , , , , , , Kalyani, , says:, , , , July 5, 2015 at 10:43 am, , , , , Looks sooooooo delicious ???, , , Reply, , , , , , , , , Pavani N, , says:, , , , July 7, 2015 at 1:10 am, , , , , What a tempting dish that is Vaishali. Love those deep fried chickpea tikkis. They must have tasted amazing in that gravy.., , , Reply, , , , , , , , , Sandhiya, , says:, , , , July 7, 2015 at 1:11 am, , , , , It's totally new to me..It reminds me of \"Pakoda kulambu\" in south indian..Looks delicious.., , , Reply, , , , , , , , , Ruchi Indu, , says:, , , , July 10, 2015 at 3:21 pm, , , , , This is very new to me. It seems similar to the vada curry which is famous in some part of TN-INDIA, , , Reply, , , , , , , , , Ruchi Indu, , says:, , , , July 10, 2015 at 3:22 pm, , , , , This is very new to me… The recipe seems similar to vada curry which is famous in some parts of TN – INDIA, , , Reply, , , , , , , , , Harini-Jaya R, , says:, , , , July 10, 2015 at 3:22 pm, , , , , Wow! sounds very new to me. The pakoda like dumplings in the gravy are inviting., , , Reply, , , , , , , , , sneha datar, , says:, , , , July 10, 2015 at 3:22 pm, , , , , Love the lentil cakes, very tempting., , , Reply, , , , , , , , , Sandhya Ramakrishnan, , says:, , , , July 10, 2015 at 3:23 pm, , , , , What a lovely recipe this is Vaishali! I love all your traditional dishes and I am bookmarking each and every one of them., , , Reply, , , , , , , , , Priya Suresh, , says:, , , , July 10, 2015 at 3:24 pm, , , , , Looking at those lentil cakes, my mouth is just watering here… truly irresistible.., , , Reply, , , , , , , , , praba bubesh, , says:, , , , July 12, 2015 at 2:26 am, , , , , looks so yum…very related to the the vada curry we make..except we use whole channa dal to make vadas.., , , Reply, , , , , , , , , Chef Mireille, , says:, , , , July 13, 2015 at 4:29 am, , , , , what an interesting gravy, , , Reply, , , , , , , , , Srivalli, , says:, , , , July 28, 2015 at 6:43 am, , , , , Vaishali, this is so new for me, so lovely to learn about this dish..and yes by the looks and sounds I will love it!..I agree with Rajani and do the same most times!, , , Reply, , , , , , , , , Rafeeda - The Big Sweet Tooth, , says:, , , , June 17, 2023 at 1:17 am, , , , , Wow, now that is something really new and interesting to me… Love that onion and tomato masala rolled up all over those vadas… I don’t need the chapathi, just that bowl… Yum…, , , Reply, , , , , , , , , Preeti garg, , says:, , , , July 8, 2023 at 1:07 am, , , , , Every time you came with very unique and regional recipes .. love this looks alike besan ke gatte., , , Reply, , , , , , , , , Radha, , says:, , , , July 9, 2023 at 10:24 am, , , , , This is a new one for me. I love the detailed info you had shared about the origin of the dish. This looks very flavorful and tasty., , , Reply, , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , , , , , , , , , , Sign up for delicious recipes in your Inbox !, , Email address:, , , , , , Leave this field empty if you're human:, Recent Posts, Pani Poori Cubes | Instant Pani Poori, Chaat Board, Curry Leaves Chutney | Kadi Patta Chutney, Brinji Rice | Brinji Sadam, Tikho Khichado | Chadeli Gahu no khichado, Follow on Instagram, , , , , , , , Linen bed runner with matching pillow covers. All, , , , , , , , , Linen hand crafted bed runner ! The big flowers ar, , , , , , , , , Simple and easy stem stitch adorns these roses on, , , , , , , , , , , A Needle Manager! The jam jar is recycled with lac, , , , , , , , , Stamping with leaves gives a wonderful effect on t, , , , , , , , , , , An old box, refurbished with decoupage. \n.\n.\n.\n#de, , , , , , , , , Blessed to visit Harminder Sahib 🙏\n.\n.\n.\n#amrit, , , , , , , , , A visit to Dera Baba Nanak, Shri Kartarpur Sahib, , , , , , , , , Years back mom made a landscape using felt, I alw, , , , , , , , , , , , Load More..., , , , , , , , , Follow on Instagram, , , , , , , , , Archives, , Archives, , , Select Month, , April 2025  (1), , February 2025  (1), , August 2023  (2), , July 2023  (1), , June 2023  (3), , May 2023  (3), , April 2023  (3), , March 2023  (2), , February 2023  (4), , January 2023  (1), , July 2022  (3), , June 2022  (4), , May 2022  (6), , April 2022  (6), , March 2022  (6), , February 2022  (5), , January 2022  (5), , December 2021  (4), , November 2021  (3), , October 2021  (6), , September 2021  (6), , August 2021  (3), , July 2021  (6), , June 2021  (6), , May 2021  (6), , April 2021  (6), , March 2021  (6), , December 2020  (21), , November 2020  (7), , October 2020  (8), , September 2020  (52), , August 2020  (7), , July 2020  (6), , June 2020  (6), , May 2020  (6), , April 2020  (6), , March 2020  (6), , February 2020  (6), , January 2020  (6), , December 2019  (6), , November 2019  (6), , October 2019  (7), , September 2019  (26), , August 2019  (4), , June 2019  (12), , May 2019  (7), , April 2019  (26), , March 2019  (7), , February 2019  (12), , January 2019  (13), , December 2018  (13), , October 2018  (1), , September 2018  (27), , August 2018  (3), , July 2018  (6), , June 2018  (6), , May 2018  (7), , April 2018  (27), , March 2018  (15), , February 2018  (6), , January 2018  (7), , December 2017  (21), , November 2017  (12), , October 2017  (13), , September 2017  (26), , August 2017  (12), , July 2017  (12), , June 2017  (12), , May 2017  (7), , April 2017  (26), , March 2017  (12), , February 2017  (12), , January 2017  (13), , December 2016  (12), , November 2016  (12), , October 2016  (13), , September 2016  (43), , August 2016  (7), , July 2016  (12), , June 2016  (12), , May 2016  (13), , April 2016  (25), , March 2016  (7), , February 2016  (7), , January 2016  (6), , December 2015  (1), , October 2015  (13), , September 2015  (63), , August 2015  (7), , July 2015  (12), , June 2015  (12), , May 2015  (14), , April 2015  (29), , March 2015  (14), , February 2015  (12), , January 2015  (13), , December 2014  (14), , November 2014  (13), , October 2014  (13), , September 2014  (69), , August 2014  (14), , July 2014  (13), , June 2014  (13), , May 2014  (9), , April 2014  (30), , March 2014  (1), , February 2014  (1), , December 2013  (6), , November 2013  (8), , October 2013  (8), , September 2013  (30), , August 2013  (19), , July 2013  (18), , June 2013  (19), , May 2013  (19), , April 2013  (37), , March 2013  (18), , February 2013  (4), , December 2012  (7), , November 2012  (6), , October 2012  (14), , September 2012  (20), , August 2012  (19), , July 2012  (46), , June 2012  (11), , May 2012  (19), , April 2012  (18), , March 2012  (10), , February 2012  (17), , January 2012  (18), , December 2011  (4), , November 2011  (12), , October 2011  (11), , September 2011  (7), , August 2011  (19), , July 2011  (5), , June 2011  (15), , May 2011  (24), , April 2011  (18), , March 2011  (4), , February 2011  (4), , January 2011  (1), , , , Categories, Categories, , Select Category, , A – Z  Pick One Indian State and Make Three Dishes, , A to Z Thali Recipes, , A-Z Baking around the World, , A-Z Breakfast on Indian Streets, , A-Z Challenge, , African, , Air Fryer, , All, , American, , Andhra, , Around the World in 30 Days, , Arunachal Pradesh, , Assam, , Australia, , Bake-a -thon, , Baked Casseroles, , Barfis, , Basics, , Bengali Cuisine, , Beverages, , Bihari Cuisine, , Biryani, , Biryani, , Biryani, Pulao, Khichadi Festival, , Biscuits / Cookies, , Blog Hop Wednesday, , Blogging Marathon, , Breads, , Breakfast, , British, , Brownies / Bars, , Buffet on the Table, , Burmese, , Burmese & Thai, , Cakes, , Cakes & Cup Cakes, , Cambodian, , Chinese, , Chutneys, , Condiments, , Condiments, Pickles and Preserves, , Continental, , Cooking Carnival, , Cooking with Alphabets, , Crafts, , Curries, , Daals, , Daals / Curries, , Desserts, , East Indian Cuisine, , Eggless Baking, , European, , Everything Else, , Explore the Flavors, , Festival Recipes, , Fire up your oven, , Flatbreads and More, , Food Craft, , Food Crafts and Garnishings, , Fried Snacks, , Fusion, , Goan Cuisine, , Greek, , Gujarati Cuisine, , Halwas, , Haryana, , Himachal Pradesh, , Indian Breads, , Indian Cooking Challenge, , Indian Cuisine, , Indian Food Odyssey, , Indian Sweet, , Indian Sweets and deserts, , Indonesian Cuisine, , International Cuisine, , Italian, , Japanese, , Jar Snacks, , Karnataka, , Kashmir, , Kebabs, , Kebabs, Tikkis & Tikkas, , Kerala, , Kheers, , Kheers & Payasam, , Khichadi, , Kids Delight, , Korean, , Kulfis, , Ladoos, , Madhya Pradesh Cuisine, , Maharashtrian Cuisine, , Malaysian, , Malaysian & Indonesian, , Mega Marathon & Recaps, , Methi / Fenugreek Recipes, , Mexican, , Middle East, , Mizoram, , Nagaland, , North Indian Cuisine, , One Pot Meal, , Orrisa, , Other sweets, , Others snacks, , Paneer Dishes, , Paper Craft, , Parsi Cuisine, , Party Recipes, , Pasta, , Pickles and Preserves, , Pizza, , Pizzas & Pastas, , Platter, , Pondicherry, , Protein Rich, , Pulao, , Pulao, , Punjabi Cuisine, , Rajasthani Cuisine, , Re cap, , Recipe Index, , Recycled Craft, , Rice, , Round up, , Sadya, , Salad, , Sandwiches, , Side Dishes, , Sikkim, , Sindhi Cuisine, , Snacks, , Soups, , Soups & Salads, , South Indian Cuisine, , Spinach / Paalak Recipes, , Sri Lanka & Pakistan & Nepal, , Steamed Snacks, , Street Food, , Sweet Rice, , Sweets and Snacks, , Swiss, , Tamil Nadu, , Thaali, , Thaali & Spreads, , Thai, , Thali and Platter Festival, , Travel & Occasions, , Travel Food, , Uncategorized, , Uttar Pradesh, , Uttarkhand, , Vegan, , Vietnamese & Cambodian, , , , , , , , , , , , , , , , , © 2025, Ribbons to Pastas, | \n\t\t\t\t\t\t\tDesigned by:, Theme Freesia, | \n\t\t\t\t\t\t\tPowered by:, WordPress, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Nashpati ki Sabji": "❌ Error scraping https://www.parentlane.com/recipes/child-food-recipes/nashpati-ki-sabji: HTTPSConnectionPool(host='www.parentlane.com', port=443): Max retries exceeded with url: /recipes/child-food-recipes/nashpati-ki-sabji (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1000)')))",
        "Tamatar ka Choka": "Ingredients: sattu as an individual ingredient, has a lot of health benefits too., , One of the noteworthy ones being its cooling properties. Thus, it is a preferred choice of ingredient in areas with extreme weather conditions during summers., , Litti Chokha together forms a really brilliant combo consisting of varied flavors and textures. An original recipe for any chokha will have the main vegetable (brinjal, potato or tomato) being roasted or boiled, then skinned off (if needed)., , garlic, green chilies, coriander leaves, salt, lemon juice and a generous quantity of mustard oil., , , , You can even make a chokha combining all the 3 veggies or combine just the baingan and tamatar to make one chokha. I have shared the recipes of Baingan Ka Chokha (made with eggplants), , , Tomato Chokha, , (made with tomatoes) in this post., , For the chokha made with potatoes, check the recipe here of, Aloo Chokha, , To prepare this chokha, you will need bharta baingan or the large dark purple aubergine or eggplant. Fire roasting gives a smoky flavor to the dish. Though you can even roast the eggplant in an oven., , Again like Tomato Chokha and Aloo Chokha, this recipe is very easy. Apart from serving with litti, you can also have baingan ka chokha with roti or paratha or as a side accompaniment with any North Indian meal., , , , For litti dough, ▢, 2, , cups, , whole wheat flour, , (atta) or 240 grams whole wheat flour, ▢, ¼, , teaspoon, , salt, ▢, 1, , tablespoon, , Ghee, , or oil, ▢, ¾ to 1, , cup, , water, , or add as required, For stuffing, ▢, 1, , cup, , roasted black chickpea flour, , (sattu), ▢, ½, , teaspoon, , cumin seeds, ▢, ½, , teaspoon, , fennel seeds, , (saunf, aniseeds), ▢, ½, , teaspoon, , carom seeds, , (ajwain, bishops weed), ▢, ½, , teaspoon, , nigella seeds, , (kalonji), ▢, ½, , teaspoon, , red chilli powder, ▢, 1 to 2, , teaspoons, , green chilies, , – chopped, ▢, 1, , teaspoon, , ginger, , – finely chopped, ▢, 1, , teaspoon, , garlic, , – finely chopped, ▢, 2, , tablespoons, , coriander leaves, , – chopped, ▢, ¼, , teaspoon, , black salt, ▢, salt, , as per taste, ▢, 2, , teaspoons, , lemon juice, ▢, 2, , teaspoons, , mustard oil, ▢, 1 to 2, , tablespoons, , of water, , or add as required, For Baingan Chokha, ▢, 420, , grams, , eggplant, , – large or 1 large bharta baingan, ▢, ⅓, , cup, , onions, , – finely chopped or 1 medium sized or 50 grams, ▢, ½, , teaspoon, , green chilies, , – chopped, ▢, ½, , teaspoon, , garlic, , – chopped, ▢, 1 to 2, , tablespoons, , coriander leaves, , – chopped, (cilantro), ▢, 1, , teaspoon, , mustard oil, ▢, ¼ to ½, , teaspoon, , lemon juice, , – optional, ▢, salt, , as required, For Tomato Chokha, ▢, 200, , grams, , tomatoes, , or 2 medium to large tomatoes, ▢, ½, , teaspoon, , green chilies, , – chopped, ▢, ½, , teaspoon, , garlic, , – finely chopped, ▢, ½, , teaspoon, , lemon juice, ▢, ½, , teaspoon, , mustard oil, ▢, 1, , tablespoon, , coriander leaves, , (cilantro), chopped, For serving, ▢, Baingan Chokha, , – recipe mentioned below, ▢, Tomato Chokha, , – recipe mentioned below, ▢, Aloo Chokha, , – recipe mentioned below, ▢, ¼, , cup, , melted ghee, , or use as required, , Cook Mode, Prevent your screen from going dark while making the recipe,  Instructions: , The Litti accompanied with the chokha is not just a flavorful pairing, but is a wholesome one too. It is one of the most popular street foods as well in Bihar and eastern Uttar Pradesh in North India., , During my travels to this side of the country, I did find a lot of street stalls serving Litti Chokha., , About Litti Recipe, , I had seen quite a few ways of preparing both the Litti and chokha on various YouTube channels. But finally, I made them in my own way and this post shares exactly that. For the stuffing of the Litti, usually, Red Chilli Pickle, or, Mango Pickle, is added., , As I wanted to do something different, I added some similar spices and not the pickles itself. You can definitely use the North Indian style mango or red chili pickle masalas, if you have it at home., , both are miles apart and have distinct flavors in them., , To get the most authentic feel, it is best to serve the Litti with a chokha. Hence, inspite of being easy to make, the recipe is time consuming as you will have to prepare the elements one by one. So, you must take your own pace and time in doing so, and not rush into it., , For the stuffing of the Litti, sattu or roasted black chickpea flour is the primary ingredient. If you don’t have it at home, then use roasted chana dal without husk and grind it. Then, sift the flour and use it for this Litti Recipe., , Traditionally, these wheat dough balls in a Litti Chokha are roasted on hot charcoal or dried cow dung fire. This also makes the flavor, a typical one., , Although at homes, an oven can be used to bake the Litti. If you have a charcoal-based open grill, then you can even use that for roasting. The Litti can be roasted on a tawa or fried too., , Ways to cook Litti, , , Baking in oven:, This post mentions this way of cooking., Roasting on tawa:, Flatten the shaped Littis and roast them on a hot tawa on low flame. You have to cook these till you see charred spots on them., Grilling on tandoor:, If doing so, grill till they are cooked and slightly charred., Deep frying in oil:, For doing so, shape them like kachoris and deep-fry in hot oil. Make sure to seal them properly or else they can disintegrate or fall apart while being fried., Step-by-Step Guide, , How to make Litti Chokha, , Prepare Dough For Litti, , 1. In a mixing bowl, take 2 cups (240 grams) whole wheat flour (atta), ¼ teaspoon salt and 1 tablespoon ghee or oil., , , , 2. Add water in parts and begin to knead. I added ¾ cup water. Depending on the quality of flour, you can add ¾ to 1 cup water., , , , 3. Knead to a smooth and soft dough. Cover the dough and set aside the dough to rest., , , , Make Stuffing, , 1. In a mortar-pestle, take ½ teaspoon cumin seeds (jeera) and ½ teaspoon fennel seeds (saunf). Lightly crush and keep aside., , , , 2. Take 1 cup roasted gram flour or roasted black chickpea flour (sattu) in a mixing bowl or pan., , , , 3. Add the crushed cumin seeds and fennel seeds., , , , 4. Now, add ½ teaspoon carom seeds (ajwain), ½ teaspoon nigella seeds (kalonji) and ½ teaspoon red chili powder., , , , 5. Next, add 1 to 2 teaspoons chopped green chilies, 1 teaspoon finely chopped ginger and 1 teaspoon finely chopped garlic., , , , 6. Add 2 tablespoons chopped coriander leaves, ¼ teaspoon black salt and regular salt as per taste., , , , 7. Add 2 teaspoons lemon juice., , , , 8. Next, add 2 teaspoons mustard oil., , , , 9. Mix very well., , , , 10. Sprinkle 1 to 2 tablespoons water all over and mix the flour with water evenly. Add more water, if required., , The stuffing mixture should not be too dry or too wet. If the mixture is dry, then the dryness is felt while eating Littis., , , , Assemble, Shape and Make Litti, , 11. After the dough has rested for 30 minutes, make small or medium sized balls from the dough., , , , roll each dough ball to a circle of about 5 to 6 inches., , , , 13. Place 2 to 3 tablespoons of the stuffing in the center., , , , 14. Pleat and join the edges., , , , 15. Press the joined part and lightly roll the stuffed dough balls in your palms, so as to get a round shape. Keep aside., , , , , , , 17. Now, place the stuffing., , , , 18. Gently bring together the outer dough cover in the center, while pressing the stuffing. Join and seal the edges., , This is a bit tricky. So, , , , so that the dough does not dry out., , , , Bake Litti, , 20. Place the prepared Littis on a baking tray, which has been greased with some oil. Grease baking tray well, otherwise the Littis can stick to the tray., , , , 21. Place the tray in the preheated oven at 200° C/390° F. Preheat the oven at 200° C/390° F for 20 minutes, prior to baking., , , , 22. After 10 to 15 minutes, remove the tray and flip each Litti. Keep the tray back in the oven., , , , 23. Again after 10 to 15 minutes, remove the tray and flip each Litti. Place the tray back in the oven. You will have to do this once or twice more, for even baking., , , , 24. Bake for a total of about 30 to 35 minutes till the crust looks done with some light brown or golden brown spots on them., , Timing will vary upon the size and capacity of the oven. It took me about 40 minutes., , , , 25. Brush them all over with some melted ghee., , , , 26. This step is optional and only to get charred spots on the Litti. Secure it in a pair of tongs and place on fire. Rotate for a few seconds till you see some charred spots on it., , , , 27. Serve the Bihari style Litti with a chokha of your choice accompanied with a small bowl of melted ghee., , The litti is broken, dipped in ghee and then eaten with the chokha. You can also sprinkle some ghee on the Litti and then eat them., , , , Step-by-Step Guide, , Baingan Chokha Recipe, , Baingan ka Chokha or Baingan Chokha as it is called in Bihar is a delicious fire-roasted mashed aubergine dish that is served with litti or sattu ka paratha. It is a low fat, gluten-free and vegan dish., , This is a Bihari style delicious baingan chokha and it tastes very different than the Punjabi recipe of, Baingan Bharta, ., , Apart from baingan, , 1. Rinse 1 large baingan (eggplant or aubergine) in water. Place it on a wired rack on a stovetop or you can place it directly on the stovetop flame., , , , 2. Keep turning the eggplant after 2 to 3 minutes on the flame so that it is evenly cooked., , , , 3. Roast the eggplant till its completely cooked and tender. With a knife check the doneness., , The knife should slid easily in eggplant without any resistance. Remove the eggplant and immerse in a bowl of water till it cools down., , , , 4. Then peel it and chop., , , , 5. Add the chopped eggplant in a mixing bowl along with its juices., , , , 6. Then add ⅓ cup finely chopped onions, ½ teaspoon finely chopped green chilies, ½ teaspoon finely chopped garlic and 1 to 2 tablespoons chopped coriander leaves., , , , 7. Add 1 teaspoon mustard oil. If you want, you can add ¼ to ½ teaspoon lemon juice for a slight tang., , , , 8. Season with salt according to taste., , , , 9. Mix everything very well. Check the taste and add more salt, mustard oil and green chilies if required., , , , 10. Serve Baingan ka Chokha with litti or sattu ka paratha or roti or paratha., , , , Step-by-Step Guide, , Tomato Chokha Recipe, , Tomato Chokha is a smoky relish or bharta made from fire roasted tomatoes, herbs and mustard oil. Gluten-free, low fat and vegan., , It is served with litti chokha and as  mentioned above comes from the cuisine of Bihar and Jharkand in India., , Now this Tomato Chokha is not your regular Tomato Bharta. It is very different. Rustic, smoky with robust flavors coming from mustard oil, garlic, green chilies and lemon juice. Totally yum., , Apart from serving Tomato Chokha with litti, you can also serve it with paratha or even roti. You can also serve it as a side relish with dal-rice. The recipe is very quick and easy and gets done within 15 to 20 minutes., , , 1. Rinse 200 grams (2 medium to large) tomatoes very well in water first. Then, place them on a wired grill rack placed on top of a stovetop. Begin to roast the tomatoes., , You can even place them directly on the stovetop. You can also grill the tomatoes or roast in the oven. But then, you won’t get the smoky flavor., , Turn them after a few minutes for even roasting., , , , 2. The tomatoes should get charred. Roast the tomatoes till they are completely cooked from within., , , , 3. With a knife check the doneness. The knife should slid easily in the tomatoes without any resistance. Keep aside the roasted tomatoes to cool in a plate., , , , 4. Once the tomatoes cool, then remove the charred skin. Chop them and add the chopped tomatoes along with its juices in a mixing bowl., , , , 5. Add ½ teaspoon chopped green chilies, ½ teaspoon chopped garlic and 1 tablespoon chopped coriander leaves., , , , 6. Add ½ teaspoon mustard oil., , , , 7. Now add ½ teaspoon lemon juice., , , , 8. Season with salt as per taste., , , , 9. Mix very well. Check the taste and add more salt, green chilies, lemon juice or mustard oil if required., , , , 10. Serve Tomato Chokha with litti or sattu paratha or even regular paratha (plain or stuffed) or chapati., , , , Expert Tips, , If sattu is not available at home, then use roasted split or whole chana dal without husk. Grind ¾ cup of it to a fine powder. Sift and then use. This split roasted chana dal is the same that is used in coconut chutneys. You could roast the roasted chana dal for a few minutes if you prefer., Depending on the quality of whole wheat flour, you’ll have to add the water while making the litti dough. So, it is usually ¾ to 1 cup., Make sure that the sattu stuffing mixture is neither too dry, nor too wet. If it is dry, then the dryness is felt while eating the Litti., Place the Littis to be baked in a well-greased baking tray. If not greased, then they can stick to the tray., The time to bake the Littis will depend on the size and capacity of your oven. You will have to keep flipping the dough balls a couple of times (after every 10 to 15 minutes), for even baking., The most apt way of having it is to break the Litti, dip it in ghee and have with the chokha. Some ghee can also be drizzled on the Litti and then consumed., More UP & Bihari Style Recipes To Try!, Beverages, Sattu Drink | Sattu Sharbat, Peas Recipes, Chura Matar | Delicious Matar Poha, Sweets Recipes, Thekua Recipe (Chaath Puja Special Sweet), Ladoo Recipes, Sattu Ke Laddu | Sattu Ladoo, , Please be sure to rate the recipe in the recipe card or leave a comment below if you have made it. For more vegetarian inspirations, , Sign Up, for my emails or follow me on, Instagram, , , Youtube, , , Facebook, , , Pinterest, or, Twitter, ., , , Litti Chokha Recipe | Litti Recipe, , , By, Dassana Amit, , , Litti Chokha is a rustic and traditional dish of stuffed whole wheat dough balls, where the stuffing is a spiced mix of roasted gram flour or roasted black chickpea flour also called sattu. I also share the recipes for Baingan Chokha (made with eggplant) and Tomato Chokha., , , 4.91, from, 21, votes, , , , Print, , Pin, , Save, Saved!, , Rate, , , , , Prep Time, 1, hour, , hr, , Cook Time, 45, minutes, , mins, , Total Time, 1, hour, , hr, , 45, minutes, , mins, , , , , Cuisine, Bihari, , Course, Main Course, , Diet, Vegetarian, , Difficulty Level, Moderate, , , Share, Email, Facebook, Tweet, , , Servings, 4, , Units, US Customary, Metric, , , Preparing litti dough, In a mixing bowl, take the whole wheat flour (atta) and salt. Also add ghee or oil., Now add water in parts and knead to a smooth soft dough. I added ¾ cup water. Depending on the quality of flour, you can add ¾ to 1 cup water., Knead till smooth and soft. Cover the dough and keep aside to rest for 20 minutes., Making stuffing for litti, In a mortar-pestle take the cumin seeds and fennel seeds. Lightly crush them and keep aside., Take the sattu or roasted black chickpea flour in a mixing bowl or pan., Add the slightly crushed cumin seeds and fennel seeds., Next add carom seeds, nigella seeds, red chilli powder, chopped green chilies, finely chopped ginger and garlic, chopped coriander leaves and black salt., Also add regular salt as per taste., Add lemon juice and mustard oil., Mix very well., Sprinkle 1 to 2 tablespoons water all over and mix the flour with water evenly. Do add more water if required., The sattu stuffing mixture should not be too dry or too wet. If the mixture is dry, then the dryness is felt when eating litti., Stuffing & shaping litti, After 30 minutes, now make small or medium sized balls from the dough., Sprinkling some flour, roll each dough ball to a circle of about 5 to 6 inches., Place 2 to 3 tablespoons of the stuffing in the center., Pleat and then join the edges. Press the joined part and lightly roll the stuffed dough balls in your palms, so as to get a round shape. Keep aside., Now place the stuffing., Gently bring together the outer dough cover in the center, while pressing the stuffing. Join and then seal the edges., Keep the prepared littis under a cotton towel or napkin, so that the dough does not dry out., Prepare all stuffed littis this way and place them on a baking tray, which has been greased with some oil., Do grease baking tray well, otherwise the littis can stuck to the tray., Baking litti, Place the littis in a preheated oven at 200° C/390° F. Preheat the oven for 20 minutes at 200° C/390° F prior to baking., After 10 to 15 minutes of baking, remove the tray and flip each litti. Keep the tray back in the oven., Again after 10 to 15 minutes, remove the baking tray and flip each litti. Place the tray back in the oven. This has to be done once or twice more for even baking of littis., Bake for about 30 to 35 minutes or till the crust looks done with some light brown or golden brown spots on them., Timing will vary upon the size and litres of the oven. It took me about 40 minutes for these to bake., Brush the littis with some melted ghee all over., This particular step is optional and only to get charred spots on the litti., Secure the baked litti in a pair of tongs and place it on fire. Rotate for a few seconds till you see some charred spots on litti., Serve these Bihari style litti with baingan chokha, aloo chokha and tomato chokha accompanied with a small bowl of melted ghee., The litti is broken, dipped in ghee and then eaten with the chokha., Making baingan chokha, Rinse the bainga/eggplant/aubergine in water a few times. Place it on a wired rack on a stovetop or you can place it directly on the stovetop flame., Keep turning the eggplant after 2 to 3 minutes on the flame, so that it is evenly cooked., Roast the eggplant till its completely cooked and tender. With a knife check the doneness., The knife should slid easily in the eggplant. Remove the eggplant and immerse in a bowl of water till it cools., Then peel it and chop., Add the chopped baingan in a mixing bowl along with its juices., Then add the finely chopped onions, chopped green chilies, chopped garlic and chopped coriander leaves., Add mustard oil. If you want, you can add ¼ to ½ teaspoon lemon juice for a slight tang. Season with salt., Mix everything very well., Making tomato chokha, Rinse tomatoes very well in water first. Then place them on a wired grill rack placed on the stovetop and begin to roast the tomatoes., You can also place them directly on the stovetop flame. You can also grill the tomatoes or roast in the oven. But then you won't get the smoky flavor., Turn them after a few minutes for even roasting. The tomatoes should get charred., Roast the tomatoes till they are completely cooked from within. With a knife check the doneness. The knife should slid easily in the tomatoes., Once the tomatoes cool, then peel them and remove the charred skin. Chop them and add the chopped tomatoes along with its juices in a mixing bowl., Add chopped green chilies, finely chopped garlic, chopped coriander leaves, mustard oil and lemon juice., Season with salt as per taste. Mix very well., Check the taste and add more lemon juice or mustard oil or green chilies or salt if required., Making aloo chokha, First boil or steam 2 medium potatoes (160 grams) adding water as needed. till they are thoroughly cooked., You can steam them in a pan or electric rice cooker or pressure cook them in 1.25 to 1.5 cups water for 5 to 6 whistles in a 2 litre pressure cooker., Allow them to become warm., When the potatoes become warm, peel and mash them., Add ⅓ cup finely chopped onions, ½ teaspoon chopped green chilies, ½ teaspoon finely chopped garlic, ½ teaspoon mustard oil and ½ teaspoon lemon juice., Mix very well. Check the taste and add more salt, lemon juice or green chilies if required. Serve with litti., , , Notes, Mustard oil is a must in the these recipes. So do not skip on it., , If sattu is not available, then use roasted chana without the husk (split or whole). Grind ¾ cup of the roasted chana in a grinder jar till fine powder. Sieve it and then use. The whole or spilt hulled roasted chana is the same chana we use in coconut chutneys., , The approximate nutrition info is for one serving of 4 Litti served with Baingan Chokha, Tomato Chokha and ghee., , , , Nutrition Info (Approximate Values), , Nutrition Facts, , Litti Chokha Recipe | Litti Recipe, , , Amount Per Serving, , , Calories, 481, , Calories from Fat 108, , , , , % Daily Value*, , , Fat, 12g, 18%, Saturated Fat 3g, 19%, Polyunsaturated Fat 2g, Monounsaturated Fat 4g, Cholesterol, 10mg, 3%, Sodium, 919mg, 40%, Potassium, 979mg, 28%, Carbohydrates, 81g, 27%, Fiber 13g, 54%, Sugar 6g, 7%, Protein, 17g, 34%, , , Vitamin A, 690IU, 14%, Vitamin B1 (Thiamine), 1mg, 67%, Vitamin B2 (Riboflavin), 0.2mg, 12%, Vitamin B3 (Niacin), 5mg, 25%, Vitamin B6, 0.4mg, 20%, Vitamin C, 14mg, 17%, Vitamin E, 1mg, 7%, Vitamin K, 10µg, 10%, Calcium, 138mg, 14%, Vitamin B9 (Folate), 143µg, 36%, Iron, 5mg, 28%, Magnesium, 170mg, 43%, Phosphorus, 399mg, 40%, Zinc, 4mg, 27%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , This Litti Chokha recipe from the archives, originally published in September 2016 has been updated and republished on February 2023., , Share This Recipe:, WhatsApp, Facebook, Pin, Tweet, Email, Share, 1.2k, Meet Dassana, Welcome to Dassana's Veg Recipes. I share vegetarian recipes from India & around the World. Having been cooking for decades and with a professional background in cooking & baking, I help you to make your cooking journey easier with my tried and tested recipes showcased with step by step photos & plenty of tips & suggestions., , Learn More about Dassana, Get My Secrets to Great Indian Food, Sign up for my FREE Beginners Guide to Delicious Indian Cooking, Please enable JavaScript in your browser to complete this form., First Name, *, Email, *, Email, SIGN UP, , More Vegetarian Recipes You'll Love, , Paneer Recipes, Paneer Butter Masala Recipe, Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), , , , Leave a Comment, Cancel reply, Your email address will not be published. We moderate comments and it takes 24 to 48 hours for the comments to appear. We thank you for your understanding and patience. If you have made the recipe, then you can also give a star rating., , Your Recipe Rating, , , , Your Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Your Name, *, , , Your Email, *, , , , , , Δ, , , 32 Comments, , , , , , , Sarika, , says:, , , , Aug 10, 2020 at 8:08 am, , , , , Nice receipe, , , Reply, , , , , , , , Aparna, , says:, , , , Aug 09, 2020 at 12:35 am, , , , , Awesome recipe. Made this for my husband who loved it and I am sure will make again in the future!, , , Reply, , , , , See More Comments, , , Meet Dassana, Hi, I am Dassana. Running the kitchen for decades, I share tried and tested Vegetarian recipes on my food blog since 2009, with a step-by-step photo guide & plenty of tips so that your cooking journey is easier. I also have a professional background in cooking & baking., , Learn More about Dassana, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, , Popular, Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Breakfast Recipes, Upma Recipe, Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Paneer Recipes, Paneer Butter Masala Recipe, , Snacks Recipes, Samosa Recipe (With Potato & Green Peas), Dal (Lentils) & Legumes, Rajma Recipe | Rajma Masala (Restaurant Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), As Seen In:, Dassana's Veg Recipes, Recipe Glossary, , Press & Media, , Privacy Policy, , Terms & Conditions, , Accessibility Statement, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, © Dassana’s Veg Recipes 2009-2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , ,"
    }
}