{
    "ingredients": {
        "Black Bean Soup": "celery,carrots,green pepper,black beans,cilantro"
    },
    "recipe_url": {
        "Black Bean Soup": "https://runningonrealfood.com/spicy-vegan-black-bean-soup/"
    },
    "Recipe": {
        "Black Bean Soup": "Ingredients: , , Table of Contents, Recipe Highlights, Ingredient Notes, Variations & Additions, , This recipe calls for a few vegetables, hearty black beans, has a, wonderful depth of flavor., , Whether you’re making this hearty soup for a, quick weeknight meal or making it in advance, , you can’t go wrong with this popular recipe., , , For more, simple vegetable soup recipes, , this, Chickpea Vegetable Chowder, , , Easy Vegan Red Lentil Tomato Soup, and, Kale and Cauliflower Soup, are also easy and delicious., , For more black bean recipes, these, Chipotle Butternut Squash Chili with Black Beans, and, Sweet Potato Black Bean Tacos with Chipotle Sauce, are a must!, , , Recipe Highlights, , , Quick and easy 30 minute recipe., , Budget-friendly and a great family meal., , Low in fat, high in protein and fiber., , Vegan and gluten-free., , Hearty, filling and delicious!, , 5-star rated., , Great recipe for meal prep., , , , Ingredient Notes, , , , Onion, : White or yellow onion is best. Substituted red onions if needed., , Jalapeno, : Remove seeds. Double for more heat. Omit if sensitive to spice., , Broth, : Any store-bought or homemade vegetable stock, bouillon cubes or powder is suitable., , Bell Pepper:, The recipe calls for green bell peppers but red bell pepper also works., , Tomato Sauce:, Use canned or jarred plain tomato sauce or any plain tomato pasta sauce., , Black Beans:, Canned black beans work great but you can use dried black beans cooked from scratch too., , , 1x, 2x, 3x, ▢, 1, , heaping cup diced onion, , , 160 g, approx. 1 small or 1/2 a large, ▢, 1, , heaping cup peeled and diced carrot, , , 160 g, approx. 2 medium, ▢, 1, , green bell pepper, , , de-seeded and diced, ▢, 1, , cup, , chopped celery, , , 150 g, approx. 3 ribs, ▢, 1, , small jalapeno, , , de-seeded and minced, ▢, 3, , cloves, , garlic, , , minced, ▢, 2, , tsp, , cumin, ▢, 2, , tsp, , dried oregano, ▢, 2, , tsp, , chili powder, ▢, 3-4, , cups, , vegetable broth, ▢, 1, , cup, , 250 mL tomato sauce, ▢, 1 19, , oz, , can black beans, , , drained and rinsed (330 g, about 2.5 cups), ▢, 1/2, , cup, , finely chopped fresh cilantro, ▢, salt and pepper, , , to taste, ▢, squeeze of fresh lime juice, , Cook Mode, Prevent your screen from going dark,  Instructions: Recipe FAQs, Expert Tips, Slow Cooker, Instant Pot, Vegan Black Bean Soup Recipe, , , , , This, easy black bean soup, has been a reader-favorite since 2018. It has the most delicious creamy texture, is made with, , , Variations & Additions, , , Sweet Potato:, Add up to 2 cups peeled and cubed sweet potatoes. You may need to increase the amount of liquid used., , Corn, : Stir in up to 1 cup corn kernels after blending the soup., , Cabbage, : Stir in up to 1 cup finely shredded green cabbage after blending the soup and cook over low heat for a few more minutes to soften., , Smoky Black Bean Soup:, Add 1-2 minced chipotle peppers in adobo and up to 2 tsp of adobo sauce when you add the spices., , Pinto Bean Soup:, Swap the black beans for pinto beans., , Topping Ideas:, Crushed tortilla chips, hot sauce, diced avocado, sour cream, grated cheese, cotija cheese, chopped cilantro, chives or green onions, corn, salsa, salsa verde or pico de gallo., , Greens, : If you’d like to add spinach or kale, stir in a few handfuls at the end until wilted., , Grains, : Add up to 1 cup cook grains such as brown rice, farro or quinoa at the end., , , , , , , , Step 1., Add the, onion, carrot, celery, garlic, jalapeno and bell pepper, to a large pot with a splash of the vegetable broth and, cook for 6-7 minutes until fragrant and softened., You can use olive oil to cook if you prefer., , , , , Step 2., Stir in the, cumin, oregano and chili powder, and cook for a few more minutes., , , , , , , Step 3., Add the, broth, tomato sauce and black beans, and bring to a simmer., , Simmer lightly until the carrots are tender, , about, 15 minutes., , , , , Step 4., Scoop a portion of the soup into a, blender, and puree until smooth. Pour the pureed soup back into the pot and stir to combine. For a creamier soup, you can blend all of it., , , , , Finally, stir in the cilantro and lime and season with salt and pepper, if needed. Add any toppings you enjoy or serve with more lime wedges and cilantro on the side., , , Recipe FAQs, , How long can I store black bean soup?, , You can store black bean soup in an airtight container in the fridge for up to 5 days. Reheat leftovers on the stovetop in a pot until heated through or in individual servings in the microwave., , , Can you freeze black bean soup?, , Yes. To freeze, let cool then store in a freezer-safe airtight container in 1 batch or individual portions for up to 2 months. Thaw in the fridge and reheat as needed on the stovetop or in the microwave., , , Can I use diced tomatoes instead of tomato sauce?, , Yes. You can substitute a 14 oz can of diced tomatoes for the tomato sauce. Crushed tomatoes are also suitable., , , , , , Expert Tips, , , Omit the jalapeno, if you’re sensitive to spice., , For spicer soup, , add up to 1/2 tsp cayenne pepper or red chili flakes, or additional jalapeno., , Vegetable amounts don’t have to be exact, so don’t worry if you’re a little short or over here and there! You can use a bit more carrot and less celery, for example., , , , , , Slow Cooker, , , Add everything except the cilantro and lime to a slow cooker and cook on low for 5-6 hours or high for 2-3 hours., , Scoop out about half of the soup and blend until smooth. Pour back into the pot and stir to combine., , Stir in the cilantro and lime and serve., , , , , Instant Pot, , , Add 2-3 tbsp of broth to the Instant Pot or other pressure cooker. Add the celery, onion, jalapeno, carrot and bell pepper and use the Saute function to cook for 3-4 minutes, stirring often., , Add the spices and cook for another 1-2 minutes, stirring often., , Add everything except for the cilantro and lime. Seal the lid with the valve set to Seal., , Cook on high pressure for 5 minutes. Quick release the pressure and carefully open the lid., , Blend half of the soup then combine with the unblended portion., , Stir in the cilantro and lime and serve., , , , , , You Might Also Like, , Bowls, Cauliflower Shawarma Bowls, Soups, Vegan 3 Bean Chili, Soups, Lentil Potato Soup, Salads, Crispy Rice Salad, , , , 4.92, from, 60, votes, , Vegan Black Bean Soup, , By:, Deryn Macey, , This delicious vegan black bean soup is easy to make in under 30 minutes for an easy dinner any night of the week., , Prep:, 10, minutes, , mins, Cook:, 20, minutes, , mins, Total:, 30, minutes, , mins, Servings:, 6, , servings, , , , , , Save Recipe, Saved Recipe, , Pin Recipe, , Rate Recipe, , Print Recipe, , , , , , Save Recipe, Enter your email & get the recipe!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , Add the onion, carrot, bell pepper, celery, jalapeno and garlic to a large soup pot with 2 tbsp of vegetable broth and saute over medium heat for 6-7 minutes until fragrant and softened., Stir in the cumin, dried oregano and chili powder and cook for 2-3 more minutes. If the pan is starting to dry out, add another splash of broth to loosen any bits from the bottom of the pan., Add the broth, tomato sauce and black beans and bring the soup to a light simmer. Simmer lightly, uncovered, until the carrots are tender, about 15 minutes., Carefully scoop a few cups of the soup or about half into a blender and blend until smooth. Be sure to allow steam to escape from the blender when blending. Alternatively, use an immersion blender and pulse the soup 5-6 times right in the pot to create texture. If you used a blender, pour the blended portion back into the pot with the remaining soup., Stir in the cilantro and lime juice and season with salt and pepper, if needed. Serve right away with toppings like avocado, grated dairy-free cheese or sour cream and crushed tortilla chips., , Video, , Notes, Sub 2-3 chili peppers in adobo sauce for the jalapeno for a smoky flavour or increase the jalapeno to 1-2 if you want more spice., , Start with 3 cups of vegetable broth and add a bit more if it seems too thick, it just depends on the exact amount of veggies you use and how thick you want your soup., , Store leftovers in a sealed container in the fridge for up to 5 days or freezer for up to 2 months. Reheat as needed in the microwave or stovetop until heated to your preference., , Nutrition, Serving:, 1, /6th of recipe (350 g), , , Calories:, 157, kcal, , , Carbohydrates:, 30, g, , , Protein:, 7, g, , , Fat:, 1, g, , , Fiber:, 9, g, , , , , , , , Like this recipe? Rate and comment below!, , Originally published January 18, 2018., , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 131 Comments, , , , , , Sharon Faibish, , says:, , , , January 3, 2025 at 4:10 pm, , , , , Delicious and so easy especially since I used my food processor to dice the vegetables., , , Reply, , , , , , , , Deryn Macey, , says:, , , , January 3, 2025 at 4:37 pm, , , , , Perfect! Glad you enjoyed it., , , Reply, , , , , , , , , , Carie T, , says:, , , , November 8, 2024 at 7:50 pm, , , , , Is the tomato sauce like a jar of marinara pasta sauce or like crushed tomatoes? Looks good, I want to make it!, , , Reply, , , , , , , , Deryn Macey, , says:, , , , November 10, 2024 at 3:14 pm, , , , , Hi – a tomato sauce like a plain pasta sauce, yep, marinara sauce would be fine. I find crushed tomatoes too thick but you could also substitute canned diced tomatoes., , , Reply, , , , , , , , , , Donna Feiner, , says:, , , , November 3, 2024 at 3:18 pm, , , , , Yummy soup and so easy to make . Thank you  Daryn for yet another fabulous recipe.😊, , , Reply, , , , , , , , Deryn Macey, , says:, , , , November 3, 2024 at 5:15 pm, , , , , You’re so welcome!, , , Reply, , , , , , , , , , Denette, , says:, , , , October 9, 2024 at 1:06 pm, , , , , This was really good.  Even omni hubby liked it.  3 cups of water was plenty for me.  Buzzed with immersion blender but left it chunky., , , Reply, , , , , , , , Deryn Macey, , says:, , , , October 9, 2024 at 2:42 pm, , , , , So glad to hear that!, , , Reply, , , , , , , , , , pam mirick, , says:, , , , May 1, 2024 at 5:03 pm, , , , , Absolutely delicious!, , , Reply, , , , Comment navigation, Older Comments, , , , Hi, I'm Deryn!, , Welcome to Running on Real Food!, Here you'll find simple, delicious and healthy, plant-based recipes and everything you need to eat, live and thrive., , , Read more about me, , , , , , Winter Recipes, , Soups, Vegan Enchilada Soup, Soups, Chickpea Lentil Soup, Soups, Tomato Orzo Soup, Bowls, Cauliflower Chickpea Potato Bowls, Bowls, Vegan Lentil Nourish Bowl, Bowls, Vegan Farro Bowl, More Summer Recipes, , , Most Popular, , Hand-Held, Chickpea Veggie Burgers, Cookies, Flourless Peanut Butter Banana Oatmeal Cookies, Curries, Vegan Coconut Red Lentil Dahl, Pancakes, 4-Ingredient Fluffy Vegan Protein Pancakes, Pancakes, Fluffy Vegan Whole Wheat Pancakes, Snacks, Healthy Pumpkin Oat Cookies, all recipes, As Seen In, , , Back to top, Running on Real Food, , , , Recipe Index, , About, , Contact, , eBooks, , ©2025 Running on Real Food. All rights reserved., , Accessibility, •, Cookie Policy, •, Disclosure, •, Privacy Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , ,"
    }
}