{
    "ingredients": {
        "Carrot and Bell pepper Soup": "carrot, red pepper, veg broth",
        "Carrot and Ginger Soup": "carrot,ginger,onion,veg stock,herbs",
        "Carrot and Onion Soup": "carrot, potato, veg broth",
        "Roast Carrot and Coriander Soup": "carrots,onion,garlic,veg stock, coriander powder,coriander",
        "Carrot and Coriander Soup": "carrot,coriander",
        "Ginger and Tumeric Carrot Soup": "leek,fennel,carrots,butternut squash,veg broth,coconut milk"
    },
    "recipe_url": {
        "Carrot and Bell pepper Soup": "https://pipingpotcurry.com/roasted-carrot-bell-pepper-soup/",
        "Carrot and Ginger Soup": "https://www.vegrecipesofindia.com/carrot-ginger-soup-recipe/#wprm-recipe-container-147867",
        "Carrot and Onion Soup": "https://www.thetomatotart.com/recipe/vegan-carrot-soup/",
        "Roast Carrot and Coriander Soup": "https://www.facebook.com/watch/?ref=saved&v=2053519718113789",
        "Carrot and Coriander Soup": "https://www.tarladalal.com/carrot-and-coriander-soup-37602r",
        "Ginger and Tumeric Carrot Soup": "https://www.simplyquinoa.com/anti-inflammatory-ginger-turmeric-carrot-soup/"
    },
    "Recipe": {
        "Carrot and Bell pepper Soup": "Ingredients: How to make Red Pepper & Carrot Soup in Instant Pot?, Pro-Tips, How to Serve?, How to Store?, More Soup Recipes You’ll Love, Vegan Roasted Carrot and Red Pepper Soup Recipe, , Nutrient packed Carrots & Red Peppers, , Bell peppers, also called sweet peppers or capsicums, are low in calories and rich in vitamin C and other antioxidants, making them a great addition to a healthy diet., , Carrots are a great source of beta-carotene, fiber, vitamin K, potassium, , , , Olive Oil:, Used for drizzling over the veggies when roasting them., , Onion:, I prefer to use yellow onions in this soup., , Garlic, :, Freshly minced garlic cloves add wonderful flavor to the soup., , Carrot:, The star ingredient of this soup, along with bell peppers. Use whole carrots or baby carrots. I like to peel them before roasting., , Red Bell Pepper:, I used fresh bell peppers and roasted them in the oven along with the carrots. You can also buy roasted red peppers in a can or jar. Fire-roasted bell peppers would work well too., , Broth, : I use vegetable broth to keep this soup vegan. Feel free to use any broth you have on hand., , Seasoning, : I used a basic seasoning of salt, pepper, and cumin in this soup. Feel free to adjust the seasoning to your liking. Add some paprika for heat. Use, garam masala, for a deeper flavor instead of ground cumin. You can also add herbs to taste, such as basil or thyme., , How to make Red Pepper & Carrot Soup in Instant Pot?, , There are two main steps to making this soup – Roasting and cooking., , Roast Carrots & Red Peppers, , Cut the red peppers into half, remove the seeds, and place them face down on a large baking tray., , Peel the carrots and place them along with the red peppers. Drizzle with a generous amount of olive oil and sprinkle salt over them., , , Roast for 30 minutes. Remove from oven & let them cool., , , Peel the blackened portion from the red peppers. You can transfer the warm red peppers to a container with a lid. Shake and let it rest for 5-10 minutes. This makes it easier to remove the peels., , , If you prefer, you can also roast the veggies in the air fryer. Here is my, air fryer carrots recipe, ., , Cooking the Soup in Instant Pot, , , Sauté garlic and onions in the instant pot for a few minutes., , Add the roasted red pepper and carrots to the, instant pot, . Add the spices, bay leaf, and broth., , Pressure cook for a few minutes in the instant pot. Then, let the pressure release naturally and open the lid., , , Cooking the Soup on Stovetop, , , Add oil to a large dutch oven or heavy bottom pot over medium heat.  Saute the onions and garlic., , Add the roasted red pepper and carrots. Add the spices, bay leaf, and broth., , Bring to a boil. Then, reduce heat and simmer., , Then, turn off the heat and follow the finishing steps., , , Finishing Steps, , , Then, remove the bay leaf and blend to get a smooth texture using an, immersion blender, . You can also transfer it to a blender such as, Vitamix, , The soups looked so rich, even though I added no cream.  Some days you want to indulge, so add heavy cream (or coconut milk for vegan) if you like., , Garnish with cilantro or parsley leaves., , , , Pro-Tips, , Roasted Red Pepper Soup:, If you like, skip the carrots and make roasted red pepper soup. Add some San Marzano tomatoes to the soup if you like the flavor., , Blend:, It is best to blend the soup completely smooth. Use an immersion or countertop blender, but make sure to blend smoothly., , How to Serve?, , We love to add toppings to soups. Add a spoonful of Greek yogurt or cream if you like. Sprinkle some pumpkin seeds or sesame seeds., , You can have this soup as a complete meal with some crusty bread or grilled cheese for dipping. Or pair it with a salad. We love this healthy, chickpea salad, or, rotini pasta salad, ., , How to Store?, , Let the soup cool down completely. Then store in airtight containers in the refrigerator for u to 4 days., , This soup has no cream or cheese. Hence it will freeze well in freezer-safe containers or bags for up to 3 months., , , , More Soup Recipes You’ll Love, , Soups, Easy Instant Pot Carrot Soup with Ginger & Coconut Milk, Soups, Vegan Instant Pot Cauliflower Soup, Soups, Instant Pot Creamy Tomato Soup, Soups, Instant Pot Minestrone Soup, , Check out, 20+ Instant Pot Vegetarian Soup Recipes, collection for more delicious soups!, , , , , , Save, Saved, , Rate, , Print, , , , , , 4.80, from, 55, votes, , Vegan Roasted Carrot and Red Pepper Soup, , By:, Meeta Arora, , A healthy and delicious roasted red pepper & carrot soup made in the instant pot or stovetop. This vegan and gluten free soup has deep bold flavors from roasting the red peppers and carrots., , Prep Time:, 5, minutes, , minutes, Cook Time:, 55, minutes, , minutes, Total Time:, 1, hour, , hour, Servings:, 3, , , , , Equipment, Immersion Blender, Instant Pot/Pressure Cooker, , 1x, 2x, 3x, ▢, 4, , Carrot, ▢, 2, , Red pepper, , , cut in to large pieces, remove stem and seeds, ▢, 1/2, , Onion, , , cut into large pieces, ▢, 4, , cloves, , Garlic, ▢, 2, , tablespoon, , Olive Oil, , , divided, ▢, 3, , cups, , Vegetable Broth, , , or Water, Spices, ▢, 1, , teaspoon, , Salt, , , divided, ▢, 1, , Bay leaf, ▢, 1, , teaspoon, , Ground Cumin (Jeera powder), To finish, ▢, 1/4, , teaspoon, , Black pepper, , , (optional), ▢, 3, , tablespoon, , Cilantro, , , to garnish (optional), ▢, 1/2, , teaspoon, , Sesame seeds, , , to garnish (optional), US Customary, –, Metric, , , , American, , , Blender, , , Dairy-free, , , Gluten-free, , , Instant Pot, , , Paleo, , , Soups, , , Stovetop, , , Vegan, , , Vegetables, , , Vegetarian, , , Whole30, , About Meeta, I strongly believe that each one of us has a chef inside us, and wholesome recipes made using Instant Pot & Air Fryer, that are well tested, so you can cook with confidence., , Read More About Me, , , You May Also Like, , Soups, Instant Pot Broccoli Cheddar Soup, Soups, Instant Pot Mushroom Wild Rice Soup, Lentils & Beans, Red Lentils – Instant Pot & Stovetop (Masoor Dal), Soups, Vegetarian Taco Soup – Pressure Cooker, , , Get new recipes sent to your inbox!, Don't miss out! Subscribe and get all the new recipes first., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Subscribe, , , , , , 4.80 from 55 votes (, 40 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , 35 Comments, , , , , , Caroline, , says:, , , , April 18, 2021 at 1:22 pm, , , , , , , , Just made this for first time, and will definately mae it again !! So easy.., , , Reply, , , , , , , , Piping Pot Curry, , says:, , , , April 19, 2021 at 8:42 am, , , , , Hi Caroline – So good to hear that. Thank you for sharing it 🙂, , , Reply, , , , , , , , , , Alex, , says:, , , , January 10, 2021 at 10:46 am, , , , , I can’t wait to try this recipe this weekend!  I saw a comment about milk or cream, but didn’t see any in the recipe.  Should I add milk or coconut cream to the soup?  Thanks!, , , Reply, , , , , , , , Meeta Arora, , says:, , , , January 11, 2021 at 3:18 pm, , , , , Hi Alex – I did not add any milk or cream to this recipe. I think it tases great on it’s own. However if you prefer a creamier texture, you can definitely add coconut milk or cream to it. Hope you enjoy the soup!, , , Reply, , , , , , , , , , Joann, , says:, , , , January 3, 2021 at 3:36 pm, , , , , Can this be made in a regular pot? Don’t have an InstaPot, , , Reply, , , , , , , , Meeta Arora, , says:, , , , January 11, 2021 at 3:14 pm, , , , , Hi Joann – Sure, you can make it in a pot on stovetop. You might need an extra cup of broth on the stovetop. Just boil, , , Reply, , , , , , , , , , Vicki, , says:, , , , December 21, 2020 at 9:47 am, , , , , , , , This is a great, easy soup, and it’s easy to double the recipe.  I like to roast a few jalapenos with the peppers and carrots, just for a little kick.  The soup is delicious and creamy on it’s own, but adding a few crumbles of feta (or goat cheese, or gorgonzola) with richen it up a little more.  Wonderful recipe!, , , Reply, , , , , , , , vicki, , says:, , , , December 21, 2020 at 10:29 am, , , , , Ooops!  It skipped my mind that this was a vegan recipe.  Forget the part about the cheese – sorry!, , , Reply, , , , , , , , Meeta Arora, , says:, , , , December 28, 2020 at 11:15 pm, , , , , No problem, Vicki. Thanks for the wonderful ideas!, , , , , , , , , , , Piping Pot Curry, , says:, , , , December 22, 2020 at 9:42 am, , , , , Hi Vicki – So good to hear that. Thank you for sharing your experience 🙂, , , Reply, , , , , , , , , , Poet DeHart, , says:, , , , November 30, 2020 at 7:17 am, , , , , I am in the process of making this. Are there any other tricks to peeling the skin from the bell peppers? I gave up after 30 minutes of trying to peel the thin skins off!, , , Reply, , , , , , , , Meeta Arora, , says:, , , , November 30, 2020 at 11:30 am, , , , , Hello – After roasting the bell peppers, it should be easy to remove the skin. If it is taking effort, , , Read More About Me, , , , , , , , , , , Popular, , Side Dishes, Air Fryer Roasted Sweet Potatoes, Chicken, Lamb & Seafood, Instant Pot Coconut Chicken Curry, Soups, Instant Pot Minestrone Soup, Vegetables, Air Fryer Beets, , , Get new recipes sent to your inbox!, Don't miss out! Subscribe and get all the new recipes first., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Subscribe, , , As Seen In, Back to top, Piping Pot Curry, Home, , Recipes, , Resources, , Subscribe, , About, , , , , , , ©2025 Piping Pot Curry., , Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: Roasting the veggies:, Preheat oven to 400°F. Place carrots and red peppers (cut side down) on a large baking tray in a single layer. Drizzle some olive oil over the tray and sprinkle some salt., Roast in oven for 30 mins. Remove from oven. Let the peppers cool, so you can peel the blackened skin. You can also transfer the peppers to a bowl with  lid on. Shake and let them rest for 5-10 minutes. This will make it easier to remove the skin., Add oil to a large dutch oven or heavy bottom pot over medium heat. Saute the onions and garlic., Add the roasted red pepper and carrots. Add the spices, bay leaf, and broth., Bring to a boil. Then reduce heat and simmer for 25 minutes. Then turn off the heat and follow the finishing steps., Start the instant pot in sauté mode and let it heat. Add olive oil, bay leaf, garlic and onions. Let them saute for about 3 minutes., Add the roasted carrots, red peppers and broth. Add ground cumin and salt. Press cancel and close lid with the vent in sealing position., Start the instant pot on manual or pressure cook mode for 3 minutes. When the instant pot beeps, let the pressure release naturally., Finishing, Remove the bay leaf. Using an immersion blender, blend the soup to a smooth consistency. Add black pepper to taste.  (Note: You can also can also transfer to a blender such as a vitamix. Make sure the soup is cooled down), Garnish with cilantro and sesame seeds. Soup is ready to be enjoyed., , Notes, , You can also use, garam masala, for a deeper flavor instead of ground cumin., , This recipe was created in a 6qt, Instant Pot, DUO60 Multi-use Pressure Cooker., , , , Nutrition, Calories:, 171, kcal, Carbohydrates:, 19, g, Protein:, 2, g, Fat:, 10, g, Saturated Fat:, 1, g, Sodium:, 1776, mg, Potassium:, 470, mg, Fiber:, 4, g, Sugar:, 10, g, Vitamin A:, 16600, IU, Vitamin C:, 108.7, mg, Calcium:, 44, mg, Iron:, 0.6, mg, , , , Additional Info, , Course:, Soup, Cuisine:, American, Diet:, Gluten-free, Vegan, Vegetarian, , , , , , , Tried this recipe?, Mention, @pipingpotcurry, or tag, #pipingpotcurry, !, , , , , , 3.0K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , Like this recipe? Share it with friends!, Pin, Facebook, Tweet, Yummly, Email, , Categorized as:, , , Reply, , , , , , , , , , Angeline, , says:, , , , October 25, 2020 at 10:32 am, , , , , , , , Love this Delicious Soup!! Easy to follow recipe. Thank You 🙂 Sharing this recipe w/my peeps 🙂, , , Reply, , , , , , , , Piping Pot Curry, , says:, , , , October 26, 2020 at 11:08 am, , , , , Hi Angeline – So good to hear that. Thank you for sharing back 🙂, , , Reply, , , , , , , , , , Neha Kamdar, , says:, , , , April 2, 2020 at 2:03 pm, , , , , , , , I make this soup recipe atleast once a month & it is liked by all! Very easy vegan soup recipe!, , Thank you pipingpotcurry for the recipe!, , , Reply, , , , , , , , Poonam, , says:, , , , March 21, 2020 at 1:37 pm, , , , , Would love to make this soup tonight but was wondering can we also add any other color bell peppers to it?, , , Reply, , , , , , , , Anja, , says:, , , , September 12, 2020 at 10:11 am, , , , , , , , I’ve just made this soup with a mix of bell peppers (green, yellow and red). Still tastes excellent., , , Reply, , , , , , , , Piping Pot Curry, , says:, , , , September 14, 2020 at 11:08 am, , , , , Hi Anja – So good to hear that. Thank you for sharing it! 🙂, , , , , , , , , Comment navigation, Older Comments, , , , Hi, I'm Meeta, , I strongly believe that each one of us has a chef inside us",
        "Carrot and Ginger Soup": "Ingredients: this endlessly adaptable naturally vegan Carrot Ginger Soup recipe is a perfect option for any busy weeknight. Light, bright, and filled with vegetable goodness, one bowl is sure to lift your spirits!, , WhatsApp, Facebook, Pin, Tweet, Email, Share, 1.8k, , Table of Contents, About Carrot Ginger Soup, How To Make Carrot Ginger Soup (Stepwise Photos), Optional Variations, FAQs, Recipe Card, , About Carrot Ginger Soup, , this recipe for Carrot Ginger Soup is shockingly full of flavor. Best of all, it’ll be ready in just 30 minutes, making it the perfect meal for even your busiest weeknights!, , Naturally sweet carrots and onions form the base flavor of the soup, , While this carrot ginger soup has a creamy mouthfeel, it is completely dairy-free and naturally vegan. There’s no need to add any thickening agents; the veggies do all the work for you. And, if you prefer a thinner consistency, you’re welcome to add more water or veggie stock to your liking., , As if that weren’t enough to love, this delightfully simple Carrot Ginger Soup recipe is also extremely versatile. Make it spicy by adding chilies, add extra creaminess with a drizzle of coconut milk, make it heartier by adding steamed veggies at the end – the options are nearly endless. Read on below for more ideas on how you can customize it to your needs!, , , Carrots, – While this carrot ginger soup recipe will work with any color of carrots, I highly recommend you use red tender juicy carrots whenever possible. They are exceedingly sweet, have a gorgeous hue, and are loaded with antioxidants to keep you healthy., If you happen to grab a large haul, check out this collection of 23, Carrot Recipes, to help you make your way through it all!, Onions, – Any color of onions (red, white, or yellow) will work here. You can also swap in shallots, leeks, or scallions depending on what you have on hand., Ginger, – Fresh ginger is always best, but you can feel free to use powdered ginger if that is all you have. To peel fresh ginger quickly and easily, simply use a spoon!, Olive Oil, – Feel free to use any neutral flavored oil or butter if you prefer., Water or, Vegetable Stock, – Water will work just fine, but you can add a layer of complexity by opting for flavorful stock., Salt & Pepper, – Everything needs seasoning, but these kitchen staples are so ubiquitous, Fresh Herbs, – If you happen to have some fresh herbs on hand, they make for a very pretty garnish. That said, this is entirely optional., Step-by-Step Guide, , How To Make Carrot Ginger Soup, , Prep and Make Soup Base, , 1. Rinse, peel and chop 350 grams carrots, or approximately 3 medium to large red carrots., , Also, chop 1 medium onion (60 grams or ⅓ cup chopped) and 8 grams (~1 tablespoon chopped) of peeled 1 inch ginger., , , 2. Heat 1 tablespoon olive oil in a pan or saucepan. Add the chopped onions., , , 3. Stir and sauté till the onions soften and turn translucent., , , 4. Add the chopped ginger and sauté till the raw aroma of ginger goes away., , , 5. This should take between 10 to 20 seconds., , , 6. Then add the chopped carrots., , , 7. Season with salt to taste., , , 8. Mix very well and sauté the carrots for a minute., , , 9. Add 1 cup of water or vegetable stock. Stir and mix to combine., , , 10. Cover the pan with its lid and simmer on a low to medium-low heat till the carrots are tender and softened., , , 11. Check occasionally when the carrots are cooking., , , 12. Switch off the heat when the carrots are cooked through and fork tender., , , 13. Set the pan aside on kitchen countertop and let the heat reduce until it is cool enough to handle., , , Make Carrot Ginger Soup, , 14. Then add everything (including the liquids) in a grinder or blender jar, or use an immersion blender or electric blender directly in the pan., , , 15. Add ½ cup water or as needed and grind or blend to a smooth puree., , , 16. Take all of the puréed carrot mixture in the same pan., , , 17. Add ½ cup more water or as required and mix very well., , , 18. Place the pan on the stovetop again and heat carrot ginger soup on a low heat. For a slightly thin consistency, you can add some more water., , , 19. When the soup becomes warm or hot, then add about ¼ teaspoon black pepper powder., , , 20. Mix very well. Pour in soup bowls. Garnish carrot ginger soup with any fresh herb like parsley, coriander, mint, dill leaves, or thyme. Enjoy!, , Make-Ahead Tip:, Leftovers can be refrigerated for up to 3 to 4 days or frozen for up to 1 month and then warmed up before serving., , Optional Variations, , While this simply delicious recipe for carrot ginger soup is a delight as written, there’s always room for customization. Here are a few ideas to get you started:, , Creamy, : Add canned coconut milk for a richer mouthfeel., Spicy, : Add diced green chiles for an added burst of heat., Chunky, : Add your choice of simply seasoned steamed veggies or grains for a heartier soup. You can also check this creamy one pot thick classic, Carrot Soup, (made with only carrots) and this hearty tangy-sweet, Tomato Carrot Soup, (with fresh tomatoes and juicy carrots)., Toddler-Friendly, : Just skip ginger and black pepper, or cut back on both to keep the heat in check. Do not use store brought vegetable stock as most of them are loaded with salt and preservatives. Make the soup in water or homemade vegetable stock., Pressure Cooker:, I have cooked carrots in a pan, but you can also pressure cook carrots for one whistle in a stovetop pressure cooker or in the Instant Pot., FAQs, , Can I make carrot ginger soup ahead of time?, , Absolutely! Any leftovers can be kept in the fridge for up to three to four days, or in the freezer for up to one month., , , Can I freeze this soup?, , Yep! It’ll last for up to 1 month if frozen., PRO TIP, : If you’re freezing the soup, I suggest using a muffin tin to help you portion it. Once frozen into pucks, pop them out of the tin and place them in a zip-top bag. Whenever hunger strikes, heat up 2 to 3 pucks for a single serving of homemade goodness!, , , What should I serve with carrot ginger soup?, , Feel free to serve it as an appetizer or light meal on its own. You can also pair it with a sandwich like my, Corn Sandwich, , , Club Sandwich, , or, Veg Sandwich, ., , , , , More Veggie Soups To Try!, Soup Recipes, Clear Soup Recipe (Clear Veg Soup), Soup Recipes, Spinach Soup Recipe (Palak Soup), Soup Recipes, Minestrone Soup Recipe, Soup Recipes, French Onion Soup Recipe, , Please be sure to rate the recipe in the recipe card or leave a comment below if you have made it. For more vegetarian inspirations, , Sign Up, for my emails or follow me on, Instagram, , , Youtube, , , Facebook, , , Pinterest, or, Twitter, ., , , Carrot Ginger Soup Recipe, , , By, Dassana Amit, , , bright, healthy and filled with vegetable goodness., , , 4.82, from, 11, votes, , , , Print, , Pin, , Save, Saved!, , Rate, , , , , Prep Time, 5, minutes, , mins, , Cook Time, 25, minutes, , mins, , Total Time, 30, minutes, , mins, , , , , Cuisine, American, World, , Course, Side Dish, , Diet, Gluten Free, Vegan, , Difficulty Level, Easy, , , Share, Email, Facebook, Tweet, , , Servings, 3, , Units, US Customary, Metric, , , , ▢, 350, , grams, , carrot, , or 3 medium to large juicy red carrots, ▢, 8, , grams, , ginger, , or 1 tablespoon chopped ginger, ▢, 60, , grams, , onion, , or ⅓ cup chopped onions, ▢, 2, , cups, , water, , or, Vegetable Stock, , add as required, ▢, salt, , as required, ▢, ¼, , teaspoon, , ground black pepper, , or crushed black pepper, add as required, ▢, 1, , tablespoon, , olive oil, , – you can also use butter, ▢, 1 to 2, , tablespoons, , chopped fresh herbs, , –  like parsley, coriander, mint, dill leaves, chives or thyme for garnish, , Cook Mode, Prevent your screen from going dark while making the recipe,  Instructions: , Preparation, Rinse, peel and chop the carrots to small pieces or cubes. Make sure not to chop in large chunks as these will take a longer time to cook., Peel onion and rinse it. Chop onion and set aside. Rinse ginger and then peel it. Chop the ginger and keep aside., Making carrot ginger soup, Heat olive oil in a pan or sauce pan. Add  the chopped onions., Stir and sauté stirring often on low to medium heat till the onions soften and turn translucent., Add the chopped ginger and sauté for about 10 to 15 seconds till the raw aroma of ginger goes away., Next add the chopped carrots. Season with salt as per taste., Mix and sauté the carrots for a minute., Add 1 cup water or vegetable stock. Stir to combine., Cover the pan with its lid and simmer on a low to medium-low heat till the carrots are fork tender and softened., In between do check when the carrots are cooking., Switch off the heat when the carrots are tender and softened. Place the pan on kitchen countertop and let the heat reduce or let the mixture become warm., Then add everything (including the liquids) in a grinder or blender jar. Add ½ cup water/veg stock or as required and grind or blend to a smooth and fine puree. Make sure there are no chunks in the puree., Transfer the entire pureed carrot mixture from the blender to the same pan., Add ½ cup more water/veg stock or as needed and mix very well., Keep the pan on stovetop again and heat on a low flame. For a slightly thin consistency, you can add some more water or veg stock., When the soup becomes warm or hot, then add ground black pepper. Mix very well., Pour Carrot Ginger Soup in soup bowls. Garnish with any fresh herb like parsley, coriander, chives, mint, dill leaves or thyme., Leftovers can be refrigerated for about 2 to 3 days and then warmed up before serving., , , Notes, Black pepper can be added more or less as per your requirements., , For toddlers and small kids, skip ginger and black pepper or add less amounts of ginger., , Instead of olive oil, you can use any neutral flavored oil like avocado oil or sunflower oil. For a richer taste, add butter., , If the carrots are not sweet, then you can add up-to ½ to 1 teaspoon raw sugar, coconut sugar or palm sugar for a sweet taste in the soup., , Instead of cooking in a pan, you can also pressure cook carrots in a stovetop pressure for 1 whistle on medium heat. Alternatively choose to cook carrots in Instant Pot., , Scale up the recipe to make for more servings., , , , Nutrition Info (Approximate Values), , Nutrition Facts, , Carrot Ginger Soup Recipe, , , Amount Per Serving, , , Calories, 100, , Calories from Fat 45, , , , , % Daily Value*, , , Fat, 5g, 8%, Saturated Fat 1g, 6%, Polyunsaturated Fat 1g, Monounsaturated Fat 3g, Sodium, 283mg, 12%, Potassium, 418mg, 12%, Carbohydrates, 14g, 5%, Fiber 4g, 17%, Sugar 6g, 7%, Protein, 1g, 2%, , , Vitamin A, 19527IU, 391%, Vitamin B1 (Thiamine), 0.1mg, 7%, Vitamin B2 (Riboflavin), 0.1mg, 6%, Vitamin B3 (Niacin), 1mg, 5%, Vitamin B6, 0.2mg, 10%, Vitamin C, 9mg, 11%, Vitamin E, 1mg, 7%, Vitamin K, 21µg, 20%, Calcium, 50mg, 5%, Vitamin B9 (Folate), 27µg, 7%, Iron, 0.5mg, 3%, Magnesium, 19mg, 5%, Phosphorus, 48mg, 5%, Zinc, 0.4mg, 3%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , This Carrot Ginger Soup recipe from the archives first published in January 2017 has been republished and updated on 3 July 2022., , Share This Recipe:, WhatsApp, Facebook, Pin, Tweet, Email, Share, 1.8k, Meet Dassana, Welcome to Dassana's Veg Recipes. I share vegetarian recipes from India & around the World. Having been cooking for decades and with a professional background in cooking & baking, I help you to make your cooking journey easier with my tried and tested recipes showcased with step by step photos & plenty of tips & suggestions., , Learn More about Dassana, Get My Secrets to Great Indian Food, Sign up for my FREE Beginners Guide to Delicious Indian Cooking, Please enable JavaScript in your browser to complete this form., First Name, *, Email, *, Website, SIGN UP, , More Vegetarian Recipes You'll Love, , Soup Recipes, Tomato Soup Recipe, Soup Recipes, Mushroom Soup Recipe (Cream of Mushroom Soup), Soup Recipes, Spinach Soup Recipe (Palak Soup), Soup Recipes, Sweet Corn Soup Recipe (Easy & Homemade), , , , Leave a Comment, Cancel reply, Your email address will not be published. We moderate comments and it takes 24 to 48 hours for the comments to appear. We thank you for your understanding and patience. If you have made the recipe, then you can also give a star rating., , Your Recipe Rating, , , , Your Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Your Name, *, , , Your Email, *, , , , , , Δ, , , 17 Comments, , , , , , , ramadevi, , says:, , , , Aug 13, 2020 at 12:16 pm, , , , , thank you so much i will try this today only afterwards i will give my comment, , , Reply, , , , , , , , Winnie, , says:, , , , Feb 03, 2019 at 1:45 pm, , , , , This soup turned out so tasty.So simple and quick to prepare.I have tried so many of your recipes in the last 10 months and each of them has been a hit.Thanks for igniting in me a passion to cook which was never there before., , , Reply, , , , , , , , dassana, , says:, , , , Feb 03, 2019 at 6:16 pm, , , , , thank you winnie for this lovely feedback. glad to read it. happy cooking., , , Reply, , , , , , , , , , shanta, , says:, , , , Feb 02, 2019 at 2:55 am, , , , , Is it possible to use a pressure cooker for this recipe?, , , Reply, , , , , , , , dassana, , says:, , , , Feb 02, 2019 at 3:36 pm, , , , , yes you can use pressure cooker. cook for 1 to 2 whistles and add 1.5 cups water., , , Reply, , , , , , , , , , hetalg, , says:, , , , May 14, 2017 at 11:05 pm, , , , , I tried making this today. First time I made some soup and it’s so easy and what’s even better is that it tasted amazing! Thanks for sharing this recipe and keep up the good work you’re doing ????, , , Reply, , , , , , , , dassana amit, , says:, , , , May 15, 2017 at 9:21 pm, , , , , welcome hetalg. glad to know this., , , Reply, , , , , , , , , , neha, , says:, , , , Feb 12, 2017 at 9:46 pm, , , , , nice recipes.. i prepare the carrot soap which was so yammi.so simple nd so delicious, , , Reply, , , , , , , , dassana amit, , says:, , , , Feb 14, 2017 at 6:05 pm, , , , , thanks neha for your positive feedback on soup recipe., , , Reply, , , , , , , , , , Vidhya ramji, , says:, , , , Jan 27, 2017 at 10:32 pm, , , , , Hi dear friend…, I love all your recipes…excellent explanation ..even one who doesn’t know about cooking can become an excellent cook…, It shows ur dedication interest n hardwork…, Meanwhile could u pls post me the recipe of Tom yum soup.., , I’m very happy to share u this info dassana..my 6 year old  daughter is a great fan of ur blog…she’s very much interested in learning to cook…, , , Reply, , , , , , , , dassana amit, , says:, , , , Jan 28, 2017 at 9:32 pm, , , , , Thanks Vidhya for your positive and sweet feedback. Glad to know that your daughter likes the blog. Give my hugs to her. I have taken the note of your recipe request and will try to add., , , Reply, , , , , , , , , , aashi, , says:, , , , Jan 24, 2017 at 6:13 pm, , , , , Recipes are not updated in app after onion uttapam…, , , Reply, , , , , , , , dassana amit, , says:, , , , Jan 24, 2017 at 8:53 pm, , , , , i know aashi. some problem with the blog feed. we have looked into it, but not able to find the issue. still looking into it., , , Reply, , , , , , , , , , Shravan, , says:, , , , Jan 23, 2017 at 12:24 pm, , , , , I have low grasping power problem. Kindly help me with a brain booster reciepe to boost up my brain and easy to cook., , , Reply, , , , , , , , dassana amit, , says:, , , , Jan 23, 2017 at 8:07 pm, , , , , Shravan, i don’t which recipe will help. but you can try soaking almonds overnight in water and have them first thing in the morning. secondly i have also heard that walnuts are also good for the brain. lastly, chanting of gayatri mantra will helps a lot. read about tratak for improving the concentration., , , Reply, , , , , , , , Pavani, , says:, , , , Jan 23, 2017 at 11:37 pm, , , , , Oh my. I’m impressed by the way you respond to every query. I wish I know you and are my friend. BTW  this soup was so good that my 18 month old loved it.. thank you., , , Reply, , , , , , , , dassana amit, , says:, , , , Jan 24, 2017 at 8:59 pm, , , , , thank you pavani. glad and good to know that your kid liked the soup. its a very healthy soup., , hugs and tc., , , Reply, , , , , , , , , , , , Meet Dassana, Hi, I am Dassana. Running the kitchen for decades, I share tried and tested Vegetarian recipes on my food blog since 2009, with a step-by-step photo guide & plenty of tips so that your cooking journey is easier. I also have a professional background in cooking & baking., , Learn More about Dassana, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, , Popular, Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Breakfast Recipes, Upma Recipe, Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Paneer Recipes, Paneer Butter Masala Recipe, , Snacks Recipes, Samosa Recipe (With Potato & Green Peas), Dal (Lentils) & Legumes, Rajma Recipe | Rajma Masala (Restaurant Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), As Seen In:, Dassana's Veg Recipes, Recipe Glossary, , Press & Media, , Privacy Policy, , Terms & Conditions, , Accessibility Statement, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, © Dassana’s Veg Recipes 2009-2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , ,",
        "Carrot and Onion Soup": "Ingredients: , FOR SOUP, , , 2 large onions, sliced, , 3 tablespoonsolive oil, , 2.5 lbs carrots peeled and sliced into coins, , 1 large yukon gold potato peeled and cut into ½ inch pieces, , ½ cup celery sliced, , 16 oz carton vegetable stock- homemade or low sodium variety, , salt and pepper to taste, , , OPTIONAL GARNISHES, , , Parsley leaves, loosely packed, , Lemon thyme, leaves removed from stem, , Olive oil, , Sea salt, , Piment d'espelette, , , , , , , I haven’t done this, so I can’t say that it will work perfectly that way, but it should be a good guideline., , , , , , , , , , , , , , , , , Jessica, , says, , , April 13, 2014 at 10:21 PM, , , , What a cute dog! The soup sounds terrific, carrot soup is definitely one of my favorites 😉, , , , , , , , , The Tomato Tart, , says, , , April 16, 2014 at 11:12 AM, , , , Thanks Jessica! My poor Ruby passed away just over a year ago, but I am so lucky to have Olive and Benny now. You can see lots of pictures on my site., , , , , , , , , , , Sophia, , says, , , March 6, 2015 at 4:44 AM, , , , How many does this feed. I’m having a dinner party and this is perfect., , , , , , , , , Sabrina Modelle, , says, , , March 6, 2015 at 7:10 AM, , , , Hi Sophia,, This should make 8 small servings or 4-6 larger servings., Have fun at your party!, Sabrina, , , , , , , , , , , Michele, , says, , , April 4, 2015 at 10:06 AM, , , , How many ounces of vegetable broth are in the “carton” that you used?  I’m guessing about 8 from the comments below, but I’d like to be sure as they sell two different size cartons at my grocery store., , , , , , , , , Sabrina Modelle, , says, , , April 5, 2015 at 5:34 PM, , , , Hi Michele,, Great catch. it’s actually a quart/litre sized carton., I scaled the original recipe up for a larger portion., Sabrina, , , , , , , , , , , Nandini Gheware, , says, , , August 28, 2015 at 10:23 AM, , , , Seems so delicious this soup. I’ll definitely try. ☺☺, , , , , , , , , Sabrina Modelle, , says, , , August 31, 2015 at 9:14 PM, , , , Thank you Nandini! I hope you’ll enjoy it., , , , , , , , , , , Sara, , says, , , October 3, 2015 at 8:09 AM, , , , This recipe looks amazing! Quick question: have you tried freezing this, if so does it freeze well?, , I am expecting in January and planning for delicious healthy meals ahead of time!!, , , , , , , , , Sabrina Modelle, , says, , , October 3, 2015 at 8:29 PM, , , , Hi Sara, congratulations on your upcoming addition! I haven’t frozen this particular soup, but I freeze blended soups all the time. This should freeze beautifully., , , , , , , , , , , Sarah, , says, , , November 21, 2015 at 10:44 AM, , , , I don’t have an immersion blender, suggestions on what I should do instead?, , , , , , , , , Sabrina Modelle, , says, , , November 22, 2015 at 2:08 PM, , , , Hey Sarah, super simple to get it pureed in a regular blender, high speed belnder, food processor, or food mill as well. Just add small amounts of the soup if you’re working in a regular blender as they can sometimes get a bit slowed with the thick soups., , , , , , , , , , , MissJubilee, , says, , , December 29, 2015 at 7:10 PM, , , , Thank you for sharing this recipe! I made a batch for my family when I was home for the holidays, and then another big batch for myself tonight (some for leftovers this week, some to freeze). It was nice with the bread bowls I got the other day too. I video recorded my process – do you mind if I post my cooking of your recipe on YouTube? So far there’s very little on my channel, but I’m hoping to add more cooking videos in the future as I work on becoming more proficient. I’ll include a link to this page, of course!, , , , , , , , , , , , Patty, , says, , , February 24, 2016 at 1:37 PM, , , , Your recipe looks great and I will be making it soon, but is it a good idea to freeze in glass jars?, , , , , , , , , Sabrina Modelle, , says, , , February 25, 2016 at 1:19 PM, , , , I hope you love it as much as we do. As for the glass jars, pint-sized Mason jars are recommended for freezing., Just make sure any contents have completely cooled before you put the jar in the freezer and leave plenty of headspace., , , , , , , , , , , Angie, , says, , , April 4, 2016 at 5:03 AM, , , , Made this soup and loved it! Thanks for sharing., , , , , , , , , , , , Sabrina Modelle, , says, , , April 4, 2016 at 12:11 PM, , , , AWWW thank you, Angie! This is the reason I started blogging in the first place. I love sharing recipes 🙂, , , , , , , , , , , Christina, , says, , , April 25, 2016 at 12:14 PM, , , , How many servings does this recipe make? And how large is each serving. Thanks!, , , , , , , , , Sabrina Modelle, , says, , , April 25, 2016 at 1:49 PM, , , , Hi Christina,, This is an older recipe, and I don’t have the exact measurements on hand, but it should serve 6-8 people if you count about a cup of soup per person. Hope you enjoy the soup!, Sabrina, , , , , , , , , Angy Stimson, , says, , , June 26, 2016 at 2:10 PM, , , , This soup was so delicious with 6 servings ! We loved it!, , , , , , , , , Sabrina Modelle, , says, , , July 3, 2016 at 11:29 AM, , , , Awww thanks Angy! Comments like yours are the reason I started blogging. The idea of “sharing a meal” with someone I’ve never met is the most appealing idea in the world, to me. So glad you enjoyed it., , , , , , , , , , , , , , , Emily, , says, , , October 3, 2016 at 11:23 AM, , , , , , , , , , , , , , , Sabrina Modelle, , says, , , October 4, 2016 at 1:17 PM, , , , Oh yay! I’m so glad you enjoyed it!, , , , , , , , , , , Michelle, , says, , , October 8, 2016 at 2:50 PM, , , , Hi Sabrina! Made the carrot soup today. Turned out pretty good but since i like my soup a little thicker I had to add about a cup of milk. I didn’t have any more broth or I would have used that. After that I felt like it was a little bland. When I added the salt, pepper, herb infused oil it helped. Any suggestion of what I could have added in to bring some flavor back in? The salt definitely helped but I hate to add too much salt so I would have rather used some sort of spice but not sure which would be good., , , , , , , , , Sabrina Modelle, , says, , , October 18, 2016 at 11:23 AM, , , , If you like thicker soup, I’d just cook it with less broth in the beginning or even add extra veg. As far as spices Instructions: , , , Cook onions and olive oil over low heat until well-caramelized and a dark golden brown, stirring infrequently (about 50-60 minutes), , Add carrots, potato, and celery and cook for another 10 minutes, tossing well to coat with olive oil and onions., , Add vegetable stock, turn heat to medium high, and bring to a rapid boil. Cook until vegetables are very tender almost falling apart- about 20 minutes., , Blend with an immersion blender until completely smooth, thinning with just a little bit of stock, water, or milk of your choice if you'd like a thinner soup, , Season with salt and pepper and serve with herb oil and a sprinkling of piment d'espelette if using, , , , , While the soup is cooking, finely chop ¾ cup parsley and 2 sprigs thyme in food processor until very tiny., , Add ½ cup olive oil and give it a little whirl. Rest the herb oil at room temperature for at least 20 minutes., , When ready to serve, strain through a fine mesh sieve and add one teaspoon of the herbs back to the strained oil and whisk to incorporate., , , , , , 3.3.3077, , , Share this:, Pinterest, Facebook, Twitter, , , , Filed Under:, Gluten Free, , , Recipe, , , Soup, , , Vegan, , , Vegetarian, , Tagged With:, carrot, , , Comfort Food, , , dog, , , Gluten Free, , , grain free, , , Healthy, , , hearty, , , McLaren Park, , , Olive Oil, , , onion, , , organic, , , paleo, , , potato, , , Ruby, , , San Francisco, , , seasonal, , , Soup, , , Spicy, , , The Excelsior, , , vegan, , , winter, « French Potato Salad with Warm Bacon Vinaigrette, Easy Roast Turkey with Herb Butter », , , , , Easy Roast Turkey with Herb Butter, Vegan Carrot Soup with Caramelized Onions, French Potato Salad with Warm Bacon Vinaigrette, Instant Pot Vegan Lentil and Mushroom Stew (Gluten Free), , Comments, , , , , , Ginny, , says, , , December 31, 2011 at 10:14 AM, , , , Thanks for sharing, I cant wait to make this!  Happy New Year & I love your Ruby.  If you get a chance look at my profile & see my Zoe she is a 153 lb English Mastiff love my puppy!!!  Your recipes are the BEST!!!!, , , , , , , , , The Tomato Tart, , says, , , December 31, 2011 at 10:55 AM, , , , Oh Ginny, I love Mastiffs. I don\\’t see how to get to your profile though, I\\’d love to see your baby. And thanks so much for the recipe love. I really appreciate it. Happy New Year to you., , , , , , , , , , , Dottie Wagner, , says, , , December 31, 2011 at 10:28 AM, , , , Gorgeous photos and that soup looks fabulous!!, , , , , , , , , The Tomato Tart, , says, , , December 31, 2011 at 10:56 AM, , , , Thanks Dottie. I hope your New Year brings love and joy and much deliciousness., , , , , , , , , , , Heather in SF, , says, , , December 31, 2011 at 2:02 PM, , , , What a lovely walk, I could almost feel the chilly air on my cheeks! The soup sounds perfect for this weather too, I will let you know when I try it. Happy New Year!, , , , , , , , , Anna, , says, , , January 1, 2012 at 9:26 PM, , , , Love your clicks! They're as vibrant as the color of your soup. Browned onions add flavor to this dish…Happy New Year! I look forward to a lot more posts…Thanks for sharing!, , , , , , , , , Another Vegan, , says, , , January 2, 2012 at 2:08 PM, , , , sounds yummy and hearty!!, , , , , , , , , The Cozy Herbivore, , says, , , January 5, 2012 at 3:34 PM, , , , Oh my goodness, that picture of your pup near your soup bowl totally made my night. I recognize that face from my own doggie– \"can I have some? Plllleeeeeaseeee?\" So stinkin' cute., , The soup looks wonderful, and those pictures are GORGEOUS. I will take your semi-seasons any day over the cold grayness that is Philly right now…, , , , , , , , , Jamie, , says, , , March 9, 2012 at 4:48 PM, , , , Love all your photos!! This soup is the bomb!! I made it one chilly day just recently and  me and my hubby loved it!! I made a bigger batch and we had it the next day for lunch. It's has a nice flavor and definitely comforting! 🙂, , , , , , , , , The Tomato Tart, , says, , , March 9, 2012 at 11:07 PM, , , , Thanks Jamie,, I\\’m so glad you enjoyed it. We have had it several times now. I made it with dark red/purple carrots most recently, and it really rocked my world. Ah, soup. Makes me happy every time., X, Sabrina, , , , , , , , , , , Jennie, , says, , , August 2, 2012 at 10:38 AM, , , , I made this and it was wonderful. Didn't have vegie stock so I used chicken broth and just added some spices. It was absolutely wonderful! I will make it again and again!, , , , , , , , , The Tomato Tart, , says, , , August 7, 2012 at 2:23 PM, , , , Jennie,, So glad you liked it. It\\’s one of my faves. In the summer, you could thin in and eat it cool. Would be amazing., , , , , , , , , , , Anja, , says, , , January 6, 2013 at 1:18 PM, , , , i'll bet this would be delightful with the carrot tops instead of the parsley….. 🙂, , , , , , , , , BRANCA, , says, , , March 2, 2013 at 11:56 AM, , , , Hello, , I love your blog & photos! Can you please tell me which camera and lenses did you use to meke the photos above?, Thank you!, , Best regards from island Brac, Croatia 🙂, , , , , , , , , Sabrina Modelle, , says, , , October 25, 2013 at 11:43 AM, , , , I used a canon 60D and probably used my 50mm 1.4 for a lens., , , , , , , , , , , Barbara, , says, , , March 20, 2013 at 3:42 PM, , , , Thank you for this glorious recipe!, , I think it’s the best soup I’ve ever had; seriously.  Wow., , , , , , , , , Denise, , says, , , September 28, 2013 at 2:10 PM, , , , I am going out for an autumn walk and coming home and making this soup! Love your atmosphere filled description! Thank you!, , , , , , , , , Wistiu, , says, , , October 12, 2013 at 9:53 AM, , , , Thx for the recipe, and you shouldn't go hiking in Chuck Taylors, bad for your back =P, , , , , , , , , The Tomato Tart, , says, , , October 17, 2013 at 8:15 AM, , , , Thanks 😉, It wasn\\’t exactly a hike though- just a walk through a large urban park. Now that I live in the country, we actually hike a lot and I live in my Ahnu hiking boots., , , , , , , , , , , sondra, , says, , , October 22, 2013 at 4:38 PM, , , , is this correct :cook onions and oil for 50-60 min?, , , , , , , , , The Tomato Tart, , says, , , October 22, 2013 at 9:56 PM, , , , Yes, the key to caramelized onions is low and slow. To get a really deep caramelized flavor, it takes about an hour. I like to do them in big batches so that I always have some in the fridge. You can go for less time, but you won\\’t get that sweet French onion soup flavor., , , , , , , , , , , PRupip, , says, , , November 19, 2013 at 12:46 AM, , , , With only 8 oz of broth, this must only make enough for 2 servings. Is that right? I chop/slice my sweet onions and put in the freezer for winter use, should I use about 3 cups? I share your posts with all my friends that garden and eat fresh/local. What a wonderful site., , , , , , , , , The Tomato Tart, , says, , , November 19, 2013 at 7:24 AM, , , , Thank you so much for your kind words. I also make use of large amounts of caramelized onions. Later today, I am filling my slow cooker with onions so I have them ready for thanksgiving. I\\’ll probably do a total of 10lbs this week. If you freeze them in ice cube trays, it is very convenient to pull out one cube at a time to add to a recipe., To answer your question, this recipe makes about four servings of thick soup. You can add a bit more broth for a thinner soup., This recipe is also very easily scaled up for a crowd., , , , , , , , , Winnie, , says, , , September 2, 2015 at 5:09 PM, , , , I am so intrigued by caramelizing onions in the slow cooker. I love using caramelized onions to thicken gravy for turkey for a gluten free gravy. About how long does it take to do in the slow cooker? I saw that you said that you planned on doing about 10 pounds and freezing.  Can you please share any tips for this? Love the idea of having this on hand. Thank you., , , , , , , , , Sabrina Modelle, , says, , , September 2, 2015 at 7:17 PM, , , , Hi Winnie, I do my onions in the slow cooker all the time. I do between 5-10 lbs and I slice them thinly, put them in the slow cooker on high and let it go for about 12 hours. When the onions are caramelized, I pull the top off the slow cooker and turn the heat down and let them cook until all of the liquid has evaporated between 3-5 hours. Don’t skip the last step because so much of the flavor is right in that liquid., , PS, your gravy sounds totally divine!, , , , , , , , , Zakia, , says, , , November 23, 2015 at 6:31 AM, , , , Hi – I saw this comment about doing the onions in the slow cooker – how about doing the entire soup in the slow cooker? I would love to make this soup as a post Thanksgiving treat. How do you recommend adjusting the recipe? – thanks!, , , , , , , , , Sabrina Modelle, , says, , , November 23, 2015 at 10:26 AM, , , , Hi Zakia, I would do the onions first. Just onions and a bit of oil in the slow cooker on high for 6-8 hours (overnight would work great) and then in the last hours of cooking, remove the lid to reduce the liquid. Don’t throw the liquid out, all the onion flavor is concentrated in there. You must reduce it to make the onions taste good., , Note, if you are only doing the amount of onions necessary for this soup recipe, you could skip the step of reducing the liquid and just reduce the amount of liquid called for in the soup recipe., , I might switch up the herb oil to be cilantro, ginger, and parsley. You could even go Mexican with a bit of chili, lime, and some cumin!  If you wanted to say in the Euro/French family, I would try some dried tarragon and a bit of dried mustard. I’d love to know what you try and see how it turns out., , , , , , , , , , , Megan, , says, , , December 12, 2016 at 1:25 PM, , , , Your dog is so cute! I love how you put potatoes in this, I bet it really helps with a great thickness and mouthfeel!, , , , , , , , , Kristine, , says, , , December 13, 2016 at 4:45 AM, , , , Your pup is adorable!  This soup sounds amazing!  I’m always looking for new soups to try, thanks for the recipe!, , , , , , , , , Annie @ Annie's Noms, , says, , , December 13, 2016 at 6:25 AM, , , , Oh, this soup is just stunning!!! I’m also loving all of your other photos, they’re so atmospheric and pretty; it makes me want to venture outside with my camera!, , , , , , , , , Platter Talk, , says, , , December 13, 2016 at 7:06 AM, , , , This is a very nice and simple recipe that looks sooo good. I felt as tho I was walking next to you thru all your beautiful pictures!, , , , , , , , , , , , Lisa | Downshiftology, , says, , , December 13, 2016 at 7:28 AM, , , , This cold weather definitely has me craving warming and nourishing soups…so this carrot soup (I love carrots!) is right up my alley!, , , , , , , , , , , , Erren, , says, , , December 13, 2016 at 7:39 AM, , , , I love these recipes because they aim for a wider audience within the community, It’s very hard to find some good vegan recipes at the moment and this one warms my heart!, , , , , , , , , , , , Emily @ Recipes to Nourish, , says, , , December 13, 2016 at 8:45 AM, , , , This sounds so delicious with those caramelized onions! Perfect for this chilly weather., , , , , Trackbacks, , , , , , I need some vegetarian recipes! I hate veggies!? - Plant Based Diet Recipes - Mouth Watering Plant Based Recipes - Plant Based Diet Recipes, , says:, , , , September 1, 2012 at 9:30 PM, , , , , […] are not bitter) here's a recipe for carrotsoup. It's avery sweet and lovely tasting soup., https://www.thetomatotart.com/recipe/caraGot, a better answer? Share it below!  Amazon.com WidgetsRelated posts:Uh, I want to be Vegetarian […], , , , , , , , , VEGGIE BOX! « Summer (and Beyond) in Providence, , says:, , , , September 9, 2012 at 6:10 PM, , , , , […] dinner, I had some Healthy Choice quick meal thing and then I made some soup! It has carrots, caramelized onions, celery, and potato. I seasoned it liberally with salt and […], , , , , , , , , Caramelized Onion and Carrot Soup, , says:, , , , September 15, 2012 at 11:40 AM, , , , , […] from Caramelized Onion & Carrot Soup at The Tomato Tart. This recipe is courtesy of Food+Heat |, http://foodplusheat.com, Filed Under: Recipes, Soups […], , , , , , , , , Candida diet, sugar-free, gluten-free,vegan healthy Thanksgiving Recipe Roundup | Ricki Heller, , says:, , , , October 6, 2013 at 5:33 PM, , , , , […] Caramelized Onion and Tomato Soup from The Tomato Tart […], , , , , , , , , 27 Thanksgiving Side DishesTo Make Your Meal Complete - In The Kitchen With KP : In The Kitchen With KP, , says:, , , , November 22, 2013 at 6:32 AM, , , , , […] Caramelized Onion & Carrot Soup […], , , , , , , , , Brain Food 101: How to Make Caramelized Onions - Savvy Eats, , says:, , , , April 14, 2014 at 10:52 AM, , , , , […] Caramelized onions and carrot soup from The Tomato Tart […], , , , , , , , , 37 Tasty and Affordable Vegetarian Thanksgiving Recipes, , says:, , , , November 13, 2014 at 6:23 AM, , , , , […] Caramelized onion and carrot soup: This simple soup from The Tomato Tart would be easy to make ahead of time — and the color just oozes autumn cheer. (GF; vegan) […], , , , , , , , , Yummy Carrot Soup before the ROW80 Check-In 3/4/15 | Angelgal's Realm 2, , says:, , , , March 4, 2015 at 5:59 PM, , , , , […] it recently – but I’m sticking to being vegetarian. I found a recipe on Pinterest for Vegan Carrot Soup With Caramelized Onions. Very good, well worth cutting my thumb for! I love how you can taste the onions, and that the […], , , , , , , , , Carrot Soup #SundaySupper - MohaDoha, , says:, , , , September 13, 2015 at 2:04 AM, , , , , […] table service to rival any Michelin starred restaurant. I was full after the starter – a creamed carrot soup, topped with black beans and caramelized onions. If you’re never tried to get that sweet, […], , , , , , , , , 2015 Summer Harvest CSA Share Week of October 27 | Your CSA, , says:, , , , October 26, 2015 at 11:18 AM, , , , , […] Recipe: Raw Kale, Cabbage and Carrot Chopped Salad with Maple Sesame Vinaigrette, Carrot Potato Soup with Honey Cream, Vegan Carrot Soup […], , , , , , , , , 2015 Summer Harvest CSA Share Week of November 10 | Your CSA, , says:, , , , November 9, 2015 at 2:55 PM, , , , , […] Recipe: Vegan Carrot Soup with Caramelized Onions […], , , , , , , , , More Carrot and Onion Inspiration | Grub du Jour, , says:, , , , December 14, 2015 at 4:07 AM, , , , , […] Tomato Tart has created a gluten free Mac and Cheese, and a soup with caramelised onions, my […], , , , , , , , , 100+ Healthy Recipes, , says:, , , , January 3, 2016 at 12:43 PM, , , , , […] Vegan Carrot Soup with Caramelized Onions | The Tomato Tart […], , , , , , , , , Ten Days of Tracking | Something I Am, , says:, , , , January 5, 2016 at 1:45 AM, , , , , […] the most glam looking dishes but quick, easy and perfect for a single serving!  Afternoon Snacks  Vegan Carrot Soup with Caramelised Onion  50g Turkey Pieces for an extra protein boost Homemade Superfood […], , , , , , , , , 10 Frugal Vegetables To Add Into Your Rotation (+30 Frugal Recipes) - Frugality Gal, , says:, , , , January 8, 2016 at 4:49 PM, , , , , […] recipe ideas featuring carrots as a main ingredient: Balsamic Glazed Carrots | Carrot Salad | Vegan Carrot Soup  4. Eggplant. I don’t personally cook much with eggplant, but I do know that it’s a favorite […], , , , , , , , , Creamy Golden Cauliflower Soup - The Food Charlatan, , says:, , , , January 22, 2016 at 3:28 AM, , , , , […] from Well Fed << I like the “Optional Garnish” ideas she has after the recipe. Vegan Carrot Soup with Caramelized Onions from The Tomato Tart Paleo Stuffed Pepper Soup from Fake […], , , , , , , , , 23 Of Your Favorite Comfort Foods, Without The Gluten – ViralBuzzTrends, , says:, , , , March 16, 2016 at 7:26 AM, , , , , […] 6. Vegan Carrot Soup with Caramelized Onions […], , , , , , , , , Living Desert Ranch + Links to Vegan Recipes for a Copycat Four Course Meal - The Brilliant Balance, , says:, , , , May 10, 2016 at 7:54 AM, , , , , […] Carrot Soup or Tomato Basil […], , , , , , , , , 40 Vegan Recipes for Fall – Honey Lune Hivery, , says:, , , , October 7, 2016 at 9:55 AM, , , , , […] Carrot Soup with Caramelized Onions […], , , , , , , , , Step 4: Small Steps to Big Change Wellness Series – Earth to Erin, , says:, , , , December 8, 2016 at 10:53 PM, , , , , […] Carrot soup with caramelized onions […], , , , , Search, , , , , , Hi, I'm Sabrina Modelle, The Tomato Tart, . I'm here to share  handmade, homemade, , gluten free recipes, ., Check out these links if you want to know more, about me, and, my work, ?, I love hearing from my readers, so please, drop me a line., , , , , , , , Get updates right in your email box. Yummy, right?, , , , Email Address, , , , , , , , , , Subscribe, , , , , , Paleo, Primal & Grain Free, , Oven Roasted Tomatoes With Olive Oil, Lightened Up Polish Cucumber Salad (Mizeria), , Desserts & Sweets, , Gluten Free Brownies with Candy Canes for Holiday Baking, Gluten Free Chocolate Crinkle Cookies with Gingerbread, , Vegan Recipes, , Strawberry Rhubarb Salsa (Gluten-Free & Vegan), Carrot & Ginger Japanese Salad Dressing, , Kitchen Tips, , Holiday Give Away!, Gluten Free Pie Crust Tutorial, , Post Categories, , Post Categories, , Select Category, , Appetizers & Hors D’oeuvres  (24), , Breakfast  (20), , Condiments  (16), , Design & Blogging  (14), , Drinks  (9), , Gluten Free  (172), , Kitchen Tips  (8), , Life  (65), , Main Course  (65), , My Favorite Things  (4), , Paleo, Primal, & Grain Free  (67), , Pasta  (6), , Quotable Fridays  (21), , Recipe  (222), , Recipe Roundups  (2), , Salad  (26), , Sides  (34), , Soup  (12), , Sweets  (65), , Vegan  (68), , Vegetarian  (99), , , , , Homemade Poke Bowls (gluten free & paleo), Gluten Free Boxty AKA Irish Potato Pancakes, Beet and Goat Cheese Napoleon for Valentine’s Day, Gluten Free Chocolate Bundt Cake with Rosemary, , , , , Get updates by email, , , , , Email Address:, , , , , , , , , , sign up, , , , , , RECIPE CATEGORIES, , Gluten Free, , Vegan, , Desserts & Sweet Treats, , Breakfast, , Soups, , Appetizers & Hors D’oevres, , , , The Tomato Tart, , Contact Me, , About Me, , Work with Me, , Kitchen Tips, , Design & Blogging, , Quote Posters, , , , LET’S BE SOCIAL, , , , , , , , , , , , , , , , Copyright © 2025 · The Tomato Tart, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Roast Carrot and Coriander Soup": "Ingredients:  Instructions: ",
        "Carrot and Coriander Soup": "❌ Error scraping https://www.tarladalal.com/carrot-and-coriander-soup-37602r: 522 Server Error:  for url: https://www.tarladalal.com/carrot-and-coriander-soup-37602r",
        "Ginger and Tumeric Carrot Soup": "Ingredients: this is the perfect winter soup., , , It’s not exactly a secret that I love healthy soups, especially when the weather turns cold. And when the holidays roll around? Well that’s when I really love to break out this ginger and turmeric carrot soup. Not only is this soup hearty and comforting for the cold months, turmeric, carrots, so an anti-inflammatory soup can be just what the doctor ordered around the holidays. Plus, it's vegan!, , But this soup isn’t just about being healthy. It’s also bursting with flavor. Ginger, garlic, fennel, and leeks give the soup a vibrant, fresh kick, while carrots, squash, and coconut milk make it rich and creamy. You’re sure to feel cozy, comforted, and healthy after a warm bowl of this easy-to-make soup., , , What You’ll Need, , , , Olive oil, , Leek, , Fennel, – This recipe uses fresh fennel, not fennel seeds., , Carrots, , Butternut squash, – You can use other types of squash, but butternut is definitely preferable., , Garlic, , Ginger, – You’ll need to grate the ginger., , Turmeric powder, , Salt, , Pepper, , Vegetable broth, – I like to use a low-sodium veggie broth., , Coconut milk, – Lite coconut milk is my preference for this recipe, rather than full-fat coconut milk., , , , How to Make Anti-Inflammatory Ginger and Turmeric Carrot Soup, , This soup takes less than an hour to make, but tastes like it’s been simmering away on your stove all day long. Here’s how to make it., , , Cook the veggies., Heat the olive oil in a large pan or dutch oven. Add the carrots, squash, fennel, and leeks, and sauté until the veggies start to soften. This should take 3-5 minutes. Then add the ginger, garlic, turmeric, salt, and pepper, and sauté for 2-3 more minutes., , Add the liquid., Pour in the vegetable broth and coconut milk. Bring the soup to a boil, then lower the temperature, cover, and simmer for 20 minutes., , Blend., Add the soup to a blender, and blend until it is smooth and creamy., , Season., Taste the soup and adjust the seasonings as necessary. Then serve!, , , Tips and Tricks, , Here are some tricks and tips for making the best anti-inflammatory winter soup., , , Make your own broth., As with most soup recipes, this ginger and turmeric carrot soup is excellent with a nice store-bought vegetable broth. But you can turn the soup into something truly special with your own homemade broth. I like to use, Instant Pot mushroom vegan bone broth, for this recipe., , Go light on the salt., When making soup, it’s a good idea to only use a little bit of salt at the start. The reason for this is that different vegetable broths, whether store-bought or homemade, have different sodium levels. And the saltiness of your soup will depend on how much you cook it down. Start small with the salt, and adjust the seasonings at the very end., , Add some fun toppings., I love to top this soup with some vegan coconut yogurt and fresh parsley. But you can have lots of fun with the toppings of your choice. This ginger and turmeric carrot soup would be delicious topped with croutons, lemon or orange zest, vegan crème fraîche, crispy shallots, or fresh basil., , , , Serving Suggestions, , I love serving this healthy soup with an, air fryer grilled cheese sandwich, on the side. It's crunchy, easy to make, and healthier than traditional ways of cooking grilled cheese. You could also serve this soup with, popovers, , , cloud bread, , or even warm tortillas rolled up around some melty cheese., , How to Store Ginger and Turmeric Carrot Soup, , This is one of my favorite soups to make ahead of time, because it stores well. Keep it in an airtight container in the fridge for up to 5 days, and reheat over medium heat on the stove for 3-5 minutes. You can also reheat in the microwave in 30-second intervals on 80% power., , Can This Recipe Be Frozen?, , Yes! Store this soup in an airtight container in the freezer for up to 6 months. Thaw or defrost completely before reheating., , , More Healthy and Cozy Soups to Make, , If you want some more comforting and healing soups to make, then check out these recipes., , , Healing Cauliflower Holiday Soup, , Lemon & Garlic Wild Rice Soup, , Creamy Chili Roasted Pumpkin Soup, , Vegan White Bean & Mushroom Soup, , , , , , Anti-Inflammatory Ginger and Turmeric Carrot Soup, , , 4.9, from, 21, votes, , , This delicious ginger and turmeric carrot soup is as comforting as it is healing. Packed with strong flavors like garlic, fennel, and ginger, this is the perfect winter soup., , , , , author:, Alyssa, , , yield:, 4, , servings, , , , , , , , , Print Recipe, , Pin Recipe, , , , , Prep:, 10, minutes, , minutes, Cook:, 40, minutes, , minutes, Total:, 50, minutes, , minutes, , , , , 1x, 2x, 3x, 1, , tablespoon, , olive oil, 1, , leek, , , cleaned and sliced, 1, , cup, , chopped fennel, , (1 small head), 3, , cups, , chopped carrots, 1, , cup, , chopped butternut squash, , (or more carrots), 2, , garlic cloves, , , minced, 1, , tablespoon, , grated ginger, , (about a 2-inch piece), 1, , tablespoon, , turmeric powder, Salt & pepper to taste, 3, , cups, , low-sodium vegetable broth, 1, , can, , lite coconut milk, , (14.5 ounces),  Instructions: , , Menu Toggle, , , , , , , Blender, , , , Freezer Friendly, , , , Instant Pot, , , , Oven, , , , Slow Cooker, , , , Shop, , About, , , , , , , , , , , , , , , , , , , Search, Search, , Recipe Finder, , , , , , , , , , , , , , , , , Search …, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Main Menu, , , , , , , , , , , , , , , , , , , Home, », Recipes, », Soup, », Anti-Inflammatory Ginger & Turmeric Carrot Soup, , , , , , , , , , , , , Anti-Inflammatory Ginger & Turmeric Carrot Soup, , , , , By:, , Alyssa, , , Published:, , February 3, 2023, , Updated:, , May 17, 2023, , Rating, , , 118 Comments, on Anti-Inflammatory Ginger & Turmeric Carrot Soup, , , DF, FF, GF, Ve, V, , , , , This post may contain affiliated links. Please read my, disclosure policy, ., , , Jump to Recipe, , , , , , , , , , , Share, , , , , Tweet, , , , , Pin, , , , This delicious ginger and turmeric carrot soup is as comforting as it is healing. Packed with strong flavors like garlic, fennel, and ginger, , Heat the olive oil in a large dutch oven or saucepan. Add the fennel, leeks, carrots, and squash. Sauté for 3-5 minutes until the veggies start to soften. Add the garlic, ginger, turmeric, salt, and pepper, and sauté for a few more minutes., Add the broth and coconut milk. Bring the mixture to a boil, cover, and simmer for 20 minutes., Once the soup is cooked, add it to a blender and blend until creamy. You could also use an immersion blender. Taste and adjust the seasonings to your taste., Serve immediately with a dollop of coconut yogurt and enjoy!, , , Notes, Store in an airtight container in the fridge for up to 5 days, or in the freezer for up to 6 months. Reheat on the stove over medium heat., , Nutrition, Serving:, 1.5, cups, |, Calories:, 205, kcal, |, Carbohydrates:, 25, g, |, Protein:, 2, g, |, Fat:, 10, g, |, Saturated Fat:, 7, g, |, Polyunsaturated Fat:, 1, g, |, Monounsaturated Fat:, 3, g, |, Sodium:, 869, mg, |, Potassium:, 618, mg, |, Fiber:, 5, g, |, Sugar:, 9, g, |, Vitamin A:, 20534, IU, |, Vitamin C:, 19, mg, |, Calcium:, 78, mg, |, Iron:, 2, mg, , , , cuisine:, American, , course:, Soup, , , , , ★★★★★, , Did You Make This Recipe?, , Be sure to, share a comment and rating, to let us know!, , , , , , Filed Under:, , Blender, , Dairy Free, , Dinner, , Freezer Friendly, , Gluten-Free, , Grain-Free, , Lunch, , Meal Prep, , Paleo, , Recipes, , Soup, , Stovetop, , Vegan, , Vegetarian, , , , , , , , , , , , , , , , , , , , , , Recipe Key, DF, Dairy Free, Fx, Flexitarian, FF, Freezer Friendly, GF, Gluten-Free, Ve, Vegan, V, Vegetarian, , , , , Hey There!, , I'm Alyssa!, , Nutritionist, Yoga-lover, Dog mom, Author, Photographer, Entrepreneur, , Welcome to Simply Quinoa - an online destination that provides simple, practical and personal steps to living a healthier life so that you can be well + truly healthy., , , Popular Posts, 6 Easy Chia Seed Pudding Recipes, The Ultimate Superfood Quinoa Porridge, 30-Minute Tofu Pad Thai, Detox Turmeric Lentil Soup, , FREE Download, , , 3-Day Reset Guide, , Get back on track in 72 hours!, , , , Let's Go!, , , SQ Cookbooks, , , , , , Simply Nourish Seasonal Meal Plan, , Buy Now →, , , , , , , , SQ Dinner in 30, , Buy Now →, , , , , , , , Ultimate Guide to Energy Balls, , Buy Now →, , , , , , , , , , , , , , , , , , , , , , , Recipe Finder, , , , , By Course, , , Menu Toggle, , , , , , , Breakfast, , , , Lunch, , , , Dinner, , , , By Diet, , , Menu Toggle, , , , , , , Dairy Free, , , , Flexitarian, , , , Gluten-Free, , , , Grain-Free, , , , Vegan, , , , Vegetarian, , , , , , Menu Toggle, , , , , , , Blender, , , , Freezer Friendly, , , , Instant Pot, , , , Oven, , , , Slow Cooker, , , , , , , Start Here, , Work With Me, , Contact, , , , , , , By Course, , , Menu Toggle, , , , , , , Breakfast, , , , Lunch, , , , Dinner, , , , By Diet, , , Menu Toggle, , , , , , , Dairy Free, , , , Flexitarian, , , , Gluten-Free, , , , Grain-Free, , , , Vegan, , , , Vegetarian, , , , , , Menu Toggle, , , , , , , Blender, , , , Freezer Friendly, , , , Instant Pot, , , , Oven, , , , Slow Cooker, , , , , , , , , , , , , , , , , As Seen On:, , , , , , , , , , , , , , , , , , , , , , , FREE 3-Day Reset Guide, , Get Yours Today!, , , , , , , Diet, Gluten-Free, , Paleo, , Vegan, , Vegetarian, , , , , , , Recipes, Breakfast, , Dinner, , Sides, , Dessert, , , , , , , About SQ, Work With Me, , Contact, , Affiliate Disclaimer, , Privacy Policy, , , , , , , , , , , , , © 2025 Simply Quinoa, , , , , , , Site by:, Swift Horse Marketing, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,"
    }
}