{
    "ingredients": {
        "Creamy Vegan White Chickpea Chili": "yellow onion,red pepper,jalapeno,garlic,oregano,chickpeas,pinto beans,green salsa,coconut milk,veg broth,lime,tortillas.cojita cheese",
        "Vegan Chickpea Chowder": "onion,celery,garlic,thyme,oregano,potato,carrot,veg broth,chickpeas,lemon juice",
        "Chickpea Soup": "chickpeas,onion,garlic,tomato,red pepper,spinach,lemon juice",
        "Healthy Spinach Chickpea Soup": "shredded spinach, boiled chickpeas, garlic,spring onions, veg stock,oregano",
        "Garlic Chickpea Soup": "veg broth,chickpeas,garlic,dried herbs,potato",
        "Coconut Chickpea Stew": "onion,garlic,chickpeas,ginger,coconut milk,veg broth,kale,lime juice,lemon peel"
    },
    "recipe_url": {
        "Creamy Vegan White Chickpea Chili": "https://midwestfoodieblog.com/vegan-white-chickpea-chili/",
        "Vegan Chickpea Chowder": "https://runningonrealfood.com/vegan-chickpea-vegetable-chowder/",
        "Chickpea Soup": "https://www.beautybites.org/chickpea-soup-vegan-recipe/",
        "Healthy Spinach Chickpea Soup": "https://www.tarladalal.com/spinach-and-chick-pea-soup-39143r",
        "Garlic Chickpea Soup": "https://theclevermeal.com/vegan-chickpea-soup/",
        "Coconut Chickpea Stew": "fixate_recipes\\Soup\\Fixate_Recipes_Coconut-Chickpea-Stew.pdf"
    },
    "Recipe": {
        "Creamy Vegan White Chickpea Chili": "Ingredients: , , , , 3), , , , Yellow Onion, – You can use white or red onion in place of the yellow onion if you prefer., , Red Bell Pepper, – You can use any color of bell pepper for this chickpea chili. I love the flavor of red bell pepper., , Jalapeno, – You can omit the jalapeno if you don’t have any on hand but it adds delicious flavor. If you like a real spicy chili, don’t remove all the seeds and ribs., , Garlic, – I like to use fresh garlic but if you don’t have any in the pantry, you can use about 3/4 of a teaspoon or more in place of the fresh garlic., , Spices, –, Cumin, , , chili powder, , ground, coriander, , and, dried oregano, combine to create a delicious layering of flavors., , Garbanzo Beans, – Also known as, chickpeas, , the, garbanzo beans, replace the chicken breast that is usually used in white chili., , Pinto Beans, – You can use any type of bean for this recipe –, black beans, , kidney beans, or even, Great Northern beans, , but I love the flavor and creamy texture of, pinto beans, ., , Salsa Verde, – I like to use green salsa (, salsa verde, ) for this recipe because it has a little kick. You could also use red salsa in this chickpea chili recipe., , Coconut Milk, – The, coconut milk, is going to give this chili a deliciously creamy texture. If you aren’t worried about this soup being vegan, you can substitute about half the amount with heavy cream., , Vegetable Broth, – If you aren’t keeping this chili vegan or vegetarian, use, chicken broth, in place of the, veggie broth, ., , , , , Copy to clipboard, , Copy to clipboard, , , , , , , , Units, , US, M, , , , Scale, , 1x, 2x, 3x, , , , , , , 1 tablespoon, , olive oil, , 1, yellow onion, diced, , 1, red pepper, diced, , 1, jalapeno, ribs and seeds removed, petite diced, , 5, cloves garlic, thinly sliced, , 1.5 tablespoons, ground, cumin, , 1 teaspoon, , chili powder, , 1 teaspoon, ground, coriander, , 1 teaspoon, , dried oregano, , 2, (15 oz.) cans, garbanzo beans, , drained and rinsed, , 1, (15 oz.) can, pinto beans, , drained and rinsed, , 16, , oz, ., salsa verde, (green salsa), , 1, (13.5 oz.) full fat, coconut milk, , 2, , cups, , vegetable broth, , juice of, 1, lime (about, 2 tablespoons, ), , Kosher salt, , fresh cracked pepper, , , Serve with:, , , tortilla strips, , sour cream, , crumbled, cotija, cheese, , fresh chopped cilantro, , sliced jalapeno, , lime wedges, , , , , , ,  Instructions: , , , , 4), , Tips, , , , , 5), , Make Ahead, Storage, Freezing, , , , , 6), , Try these easy soups next!, , , , , 7), , Creamy Tuscan Sausage Soup, , , , , 8), , Creamy White Chicken Chili Recipe, , , , , 9), , Curry Potato Soup with Sausage, , , , , 10), , Creamy White Chicken Lasagna Soup, , , , , 11), , Vegan White Chickpea Chili, , , , You Will Love This, , , If you’re a chili lover like me, it’s fun to try something a little different than your traditional tomato-based chili recipe., Although I enjoy classic red chilis (as evidenced by the wide variety of chilies on my site including, Shredded Short Rib Chili, , , Creamy Enchilada Chicken Chili, , and, Vegan Black Bean Chili, ) but I love the unique flavors that this white chickpea chili has and it’s fun to switch it up with some plant-based meals., , You won’t even miss the chicken, I promise!, This type of white chili is typically made with chicken breast, but in this recipe, I’ve replaced the chicken with, chickpeas, , and I’m telling you – it’s AMAZING. Chickpeas can literally replace any meat in any of your favorite dishes and they really shine in this chili. A few of my other favorites that showcase chickpeas instead of meat include my, BBQ Chickpea Sandwich, , , Creamy Chickpea Noodle Soup, , , Greek Chickpea Gyros, , , Sheet Pan Chickpea Fajitas,, and, BBQ Chickpea Pizza, . If you’re looking to add more vegan meals to your family dinner rotation – try switching out the meat in the dish for chickpeas!, , , , , Sauté onion, red pepper, and jalapeno in oil along with a couple large pinches of salt and pepper for 5 minutes., , , Add garlic, , cumin, , , chili powder, , , coriander, , and oregano and cook, stirring frequently for another minute., , , Add a splash of, vegetable broth, and deglaze the bottom of the pot, scraping all the yummy bits off the bottom., , , Add, garbanzo beans, , , pinto beans, , , salsa verde, , , coconut milk, , and, vegetable broth, along with a couple pinches of salt and pepper., , , Stir to combine, then bring to a simmer over medium high heat. Reduce heat to medium low and simmer for 10 minutes. Stir in fresh, lime juice, and season to taste with salt and pepper., , , Garnish with your favorite toppings – don’t forget the, homemade fried tortilla strips, – and enjoy!, , , Tips, , , This chickpea chili has a bit of a kick to it!, Our family enjoys the amount of spice, although for our daughter we added a scoop of sour cream and mixed it in just to mellow it out a bit. If you’d like a more mild chili, try using mild green salsa and omitting the, chili powder, ., , If you like a thicker chili, try adding less, vegetable broth, ., The, coconut milk, will make the chili super creamy and then the, vegetable broth, helps to thin that out a bit, but if you want a creamier chili, add less, vegetable broth, – you can always add more later!, , Be sure to moderately salt this chili!, The ingredient list is simple, and while it does have a few spices in it, salt is going to go a long way in boosting the overall flavors of the dish. I recommend using Kosher salt to season as you have more control over how much you add. It’s easy to get heavy handed with traditional table salt and add too much., , , , Make Ahead, Storage, Freezing, , , Make Ahead:, This chickpea chili is a delicious make ahead meal! It’s perfect for Sunday night meal prep and will taste great throughout the week!, , Storage:, Store this chili in an, airtight container, in the fridge for up to 5 days., , Freezing:, You can freeze this soup for up to 3 months in an, airtight container, . Before eating, thaw in the fridge overnight., , Reheating:, I like to reheat this chili in a, saucepan, over medium heat. You  may need to add a bit of broth to loosen it up. Cook, stirring frequently, until warmed through. Season to taste with salt and pepper and enjoy!, , , Try these easy soups next!, , Creamy Tuscan Sausage Soup, Creamy White Chicken Chili Recipe, Curry Potato Soup with Sausage, Creamy White Chicken Lasagna Soup, , , , , Did you love this recipe?, , Please leave a 5-star rating and review below!, , Follow me on Pinterest!, , , , , , , , , , , , Print, , Vegan White Chickpea Chili, , , , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.9, from, 92, reviews, , , , This White Chickpea Chili is a vegan twist on the ever popular white chicken chili. It’s loaded with veggies, beans and plenty of spice in a broth of, coconut milk, , , vegetable broth, , and, salsa verde, . Make room in your monthly meal rotation for this family favorite!, , , , , Author:, , Kylie, , Prep Time:, , 10 minutes, , Cook Time:, , 20 minutes, , Total Time:, , 30 minutes, , Yield:, , 8, servings, 1, x, , Category:, , Main Dish, , , Stove Top, , Cuisine:, , American, , Diet:, , Vegan, , , , , , , , , , , Heat oil in a, large pot, over medium high heat., , Add onion, red pepper, and jalapeno along with a couple large pinches of salt and pepper. Cook, stirring frequently for 5 minutes., , Add garlic, , cumin, , , chili powder, , , coriander, , and oregano and cook, stirring frequently for another minute., , Add a splash of, vegetable broth, and deglaze the bottom of the pot, scraping all the yummy bits off the bottom., , Add, garbanzo beans, , , pinto beans, , , salsa verde, , , coconut milk, , and remaining, vegetable broth, along with a couple pinches of salt and pepper., , Stir to combine, then bring to a simmer over medium high heat., , Reduce heat to medium low and simmer for 10 minutes., , Stir in fresh, lime juice, and season to taste with salt and pepper., , Garnish with your favorite toppings – don’t forget the, homemade fried tortilla strips, – and enjoy!, , , , , , , , , Equipment, , , Dutch oven, , Buy Now →, , , , measuring cup, , Buy Now →, , , , , Nutrition, , , Serving Size:, , 1/8 of chili, , Calories:, , 294, , Sugar:, , 4.1 g, , Sodium:, , 788.8 mg, , Fat:, , 14 g, , Carbohydrates:, , 34.7 g, , Fiber:, , 10.3 g, , Protein:, , 11 g, , Cholesterol:, , 0 mg, , , , , , , , 197 Comments, , , Comments navigation, , Older comments, , , , , , , , Kay, , says:, , , , March 5, 2025 at 3:54 pm, , , , , Not bad. My problem was that it was too bitter tasting/acidity…not sure where it came from. Almost had a lemony/lime taste, but I didn’t add lemons or limes. It didn’t really give me that wholesome chili taste, but not a bad recipe to build from. I definitely had to add additional seasoning To make it taste better, like chili, , , , Reply, , , , , , , , Ellen, , says:, , , , February 28, 2025 at 6:29 am, , , , , I can’t tell you how many times I have made this. It is that good. My kids love it, my friends love it. It is what I bring to friend’s with new babies, post surgery, etc. I  initially made as is (excellent), but have made some modifications based on my family’s preferences: changed the garbanzo beans to cannelini, less chili powder, add 15 oz of frozen corn. Trader’s Joes salsa verde is the perfect amount of spice for us. Also – for those wondering – I do not detect any coconut flavor from the coconut milk – it just adds a wonderful creaminess. Overall a 10 out of 10!, , , , Reply, , , , , , , , Kylie, , says:, , , , February 28, 2025 at 9:03 am, , , , , Thank you so much for sharing your modifications, Ellen! I’m glad you’ve enjoyed this recipe 🙂 Thanks for leaving a review!, , , Reply, , , , , , , , , , Sandi, , says:, , , , January 8, 2025 at 7:59 pm, , , , , Snow is in our forecast and I was craving chili, unfortunately tomatoes have become problem for me. This was a true lifesaver! Perfect blend of spices, it really took care of my cravings. This will definitely be in regular rotation!, , , , Reply, , , , , , , , Kylie, , says:, , , , January 9, 2025 at 9:25 am, , , , , I am so glad to hear that, Sandi! Stay warm!! 🙂, , , Reply, , , , , , , , , , Sherri, , says:, , , , December 17, 2024 at 8:34 am, , , , , This is really good!  I was using up some veggies post Thanksgiving.  Had a green bell pepper instead of red+ a stalk of celery.  I also have 4 tomotillos and a lonely pablano.  Placed under broiler for a few min. Chopped,it peeled and added it in. I also used one can of navy bean, one can of hominy and a 1\\2 drained and cubed tofu for the protein as my husband doesn’t care for 3 cans beans in anything.  Turned out great.  Thanks for recipe., , , , Reply, , , , , , , , Amy, , says:, , , , December 5, 2024 at 10:43 am, , , , , My favorite white chili recipe! So delicious!, , , , Reply, , , , , , , , Kylie, , says:, , , , December 5, 2024 at 1:15 pm, , , , , Love to hear that, Amy!, , , Reply, , , , , , , , , , Leslie, , says:, , , , December 1, 2024 at 5:49 pm, , , , , This recipe was absolutely delicious!  I will be making this again and putting it in my favorites.  I used a poblano pepper instead of jalapeno and the heat was perfect.  It went together quickly too., , , Reply, , , , , , , , Kylie, , says:, , , , December 1, 2024 at 10:15 pm, , , , , Love a quick and easy dinner!, , , Reply, , , , , , , , , , Lauren, , says:, , , , August 13, 2024 at 6:53 pm, , , , , This was really amazing. I added some homemade cashew cream to thicken it, and added an extra can of pintos, plus about another 1/2 cup or so of green salsa. I airfried some chicken breast to put over the top for the meat eaters of the family and everyone loved it! Even picky guests!, , , , Reply, , , , , , , , Janice, , says:, , , , July 16, 2024 at 10:06 am, , , , , This is my new favorite vegan chili recipe! I did cut the cumin in half; 1.5 tablespoons seemed like a lot because cumin is a potent spice. So, I have a question. Could there be a typo in the recipe, and it should be 1.5 teaspoons instead of tablespoons? Regardless, with this one tweak, we loved it!, , , , Reply, , , , , , , , Kylie, , says:, , , , July 16, 2024 at 2:45 pm, , , , , Haha I’m obsessed with cumin 🙂 No typo. But I’m glad you were able to adjust it to suit your tastes and enjoyed it!!, , , Reply, , , , , , , , , , Anonymous, , says:, , , , March 2, 2024 at 6:10 am, , , , , , , Reply, , , , , , , , Renee, , says:, , , , February 29, 2024 at 8:51 am, , , , , Love this chili. My husband has a tomato allergy so this is an amazing chili we can make in our home. We try to eat vegan a few days per week, so thank you for sharing!, , , , Reply, , , , , , , , Karen, , says:, , , , January 24, 2024 at 8:29 am, , , , , Fantastic! Easy and perfect heat for a winter day!, , , , Reply, , , , , , , , Diane, , says:, , , , December 26, 2023 at 9:05 am, , , , , This vegetarian chili is phenomenal!!! I could eat it every day. Thank you for this awesome recipe., , , , Reply, , , , , , , , Zee, , says:, , , , October 18, 2023 at 11:57 am, , , , , How much is one serving?, , , Reply, , , , , , , , Kylie, , says:, , , , October 18, 2023 at 4:35 pm, , , , , I would guesstimate about 1.5 cups or so. I don’t do specific serving sizes because everyone requires a different amount of food. I honestly don’t love doing nutrition facts in general, but I do it to please the powers that be., , , Reply, , , , , , , , Comments navigation, , Older comments, , , , Please leave a rating, review, or comment!, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, Name, *, , Email, *, , , , , , Δ, , , , , , , , , , , , HELLO FROM THE MIDWEST -, , , I'm Kylie and as a mom and blogger, I understand how hard it can be to get a wholesome dinner on the table at the end of a long day. Here at Midwest Foodie, I focus on sharing simple recipes that make it easy to feed your family real food., , , , More about me, , , Search, , , , LET'S CONNECT!, , , Mail, , Facebook, , Instagram, , Pinterest, , , Cozy Dishes, , , , Cheesy Ground Beef Stuffed Shells, Easy Cheesy Frito Pie Recipe, Creamy Tuscan Sausage Soup, Creamy White Chicken Chili Recipe, Easy Chicken Pot Pie Recipe, Curry Potato Soup with Sausage, , , , Comforting Appetizers, , , , Garlic Butter Steak Bites, Jalapeno Popper Cheese Bread, Mini Chili Cheese Dogs, Crockpot Little Smokies, Meatballs with Grape Jelly and Chili Sauce, Easy Burrata Cheese Appetizer, , , , , , , , , , , AS AN AMAZON ASSOCIATE, I EARN FROM QUALIFYING PURCHASES., , , , , , , , , , , , , , , , , , , Your free cookbook is waiting!, , Get my free e-book with 10 easy weeknight dinner recipes delivered straight to your inbox!, , , , , , Subscribe, , , , , , , , , , , , , , , , , , , , , Facebook, , Instagram, , Pinterest, , , , , , , , , , RESOURCES, , , , Pinterest E-Book, , Income Reports, , Privacy Policy, , Shop, , , , , , , , , , , REACH OUT, , , , Subscribe, , Contact, , About, , , , , , , , , , , , , , , , , , , , About, , Contact, , Blog, , Privacy Policy, , , , , , , , , , , © 2025 Midwest Foodie, , , , , , , , , , , , , , , , , , , Scroll to top, , Scroll to top, , , , , , , , , , , , , , , , , , , Recipes, , About, , Subscribe, , Income Reports, , Pinterest E-Book, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , ,",
        "Vegan Chickpea Chowder": "Ingredients: celery and potato but is always a hit!, , The secret to this, dairy-free vegetable chowder is pureed chickpeas!, Along with potatoes, they add the perfect, , , , , Why You’ll Love It, , , , Vegan (dairy-free), gluten-free, oil-free and sugar-free., , Low in fat with 7 grams of protein per serving., , Satisfying, delicious and, perfect for a warm meal any time of year, ., , Perfect “clean out the fridge” recipe., , Great for meal prep., , Budget-friendly., , , , , , , , , , Potato:, You can use russet or Yukon gold potato. This recipe can also be made with sweet potato., , Broth, : You can use any store-bought or homemade broth. Carton broth or bouillon cubes or powder work. I usually use Better than Bouillon., , Chickpea:, For convenience, canned works great here but you can cook your own from scratch and use those too. You’ll need about 2.5 cups of cooked chickpeas or 1 19 oz can. The amount doesn’t have to exact though so if you only have 2 14 oz cans or 1 28 oz can, that works., , Onion, : White or yellow onion works., , Herbs, : For simplicity, the recipe calls for dried thyme and oregano but you can substitute 2-3 tbsp chopped fresh herbs if you prefer., , , 1x, 2x, 3x, ▢, 1, , cup, , heaping diced white onion, , , 175 g, 1 small onion, ▢, 1, , cup, , chopped celery, , , 150 g, approx. 2 stalks, ▢, 4, , cloves, , garlic, , , minced (20 g), ▢, 1, , tsp, , ground thyme, ▢, 1, , tsp, , dried oregano, ▢, 2, , heaping cups peeled and diced yellow potato, , , 340 g, 1 large potato, ▢, 2, , cups, , peeled and diced carrots, , , 300 g, approx. 4 large carrots, ▢, 4 1/2, , cups, , vegetable broth, ▢, 19, , oz, , can chickpeas, , , rinsed and drained (approx. 2.5 cups, 330 g), ▢, 1, , tbsp, , fresh lemon juice, , , 15 ml, ▢, salt and pepper, , , to taste, ▢, finely chopped parsley, , , optional, for serving, , Cook Mode, Prevent your screen from going dark,  Instructions: FAQs, Storing & Reheating, More Healthy Soups, Vegan Chickpea Vegetable Chowder Recipe, , , , About the Recipe, , , This, simple but delicious soup has been a reader-favourite at Running on Real Food for years., It’s easy to make and features wholesome, , , , , , , Step 1., Start by adding the, celery, onion and garlic, to a large soup pot with 1/4 cup of the vegetable broth. Saute over medium heat for, 5-6 minutes until softened., , Quick Note:, If you prefer to use olive oil to cook the veggies, you can use 1 tbsp oil instead of 1/4 cup of broth., , , , Step 2:, Stir in the thyme and oregano, and cook for a couple more minutes. You can add a little pinch of salt and pepper for seasoning here as well., , , , , , , , , Step, 3:, Add everything but the lemon, and bring the soup to a light simmer over medium-low heat., Simmer the soup uncovered for 15-20 minutes, until the potatoes are fork tender., , , , , , , , Step, 4:, Carefully scoop about half of the soup out, and into a blender., Blend until very smooth and creamy., , Pour the blended portion back into the pot and, stir to combine with the unblended soup., You can also blend all of the soup if you want it completely smooth., , , , , , , , Step, 5: Finally, , squeeze in the fresh lemon juice, and, season with salt and pepper, , if needed., , , , , , , FAQs, , Can I use other vegetables, , Yes, this soup is flexible and easy to customize. Try sweet potato instead of potato, swapping half or all of the the potato or carrot for chopped cauliflower or stirring in green peas, green beans, spinach, kale or corn after blending., , , Do I have to blend the soup?, , No, you don’t have too but I definitely recommend blending at least 1-2 cups of it to add texture and creaminess., , , Can I blend all of the soup?, , Yes! For a completely pureed chickpea soup, go ahead and blend it all., , , Is this soup gluten-free?, , Yes. This soup is naturally gluten-free, however, if you’re using store-bought broth, double check the packaging as some may contain yeast extract made from wheat (most are gluten-free though!)., , , Can I use an immersion blender?, , Sure, if you have a good immersion blender you can use it right in the pot. Pulse 5-6 times to create texture. I really do prefer the texture achieved by a blender here but it’s up to you. Just note it won’t be quite as creamy with an immersion blender., , , , , , , , , Storing & Reheating, , , Let cool before storing., , Fridge, : Store in a sealed container for up to 5 days., , Freezer, : Store in a freezer-safe container in one batch or individual portions. Thaw overnight in the fridge., , Reheating, : Reheat soup as needed on the stovetop or in the microwave. If it’s thickened substantially after storing, adjust the consistency by stirring in some water or broth., , , , , , , More Healthy Soups, , , Vegan Sweet Potato Corn Chowder, , Vegan Potato Leek Soup, , White Bean Kale Soup, , Curried Lentil Soup, , Creamy Cauliflower Wild Rice Soup, , Lemon Lentil Soup, , , , , , You Might Also Like, , Soups, Vegan 3 Bean Chili, Soups, Lentil Potato Soup, Soups, Vegan Enchilada Soup, Soups, Chickpea Lentil Soup, , , , 4.87, from, 79, votes, , Vegan Chickpea Vegetable Chowder, , By:, Deryn Macey, , This vegan chickpea soup is a take on classic vegetable chowder. It’s made with a base of pureed chickpeas with chunks of carrot and potato for a healthy soup that’s full of flavour and nutrition!, , Prep:, 10, minutes, , mins, Cook:, 20, minutes, , mins, Total:, 30, minutes, , mins, Servings:, 5, , , , , , Save Recipe, Saved Recipe, , Pin Recipe, , Rate Recipe, , Print Recipe, , , , , , Save Recipe, Enter your email & get the recipe!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , Add the onion, garlic and celery to a large soup pot with 1/4 cup of the vegetable broth and cook over medium heat for 5-6 minutes until softened and fragrant., Stir in the oregano and thyme and cook for a couple more minutes, stirring often. If the pan starts to dry out, add another splash of broth to loosen any bits sticking to the pan., Add everything except for the lemon, bring to a light simmer and cook for 15-20 minutes, uncovered, until the potatoes and carrots are fork tender., Transfer about 1/2 of the soup to a blender and blend until completely smooth and creamy. Make sure you allow the steam to escape as you're blending. Pour the blended soup back into the pot with the unblended portion and stir well to combine., Stir in the lemon juice and season with salt and pepper, if needed. Serve with fresh chopped parsely., , Video, , Notes, Storing, : Let cool before storing. Store in a sealed container in the fridge for up to 5 days. Store in a freezer-safe container in one batch or individual portions for up to 2 months. Thaw overnight in the fridge if frozen. Reheat soup as needed on the stovetop or in the microwave. If it’s thickened substantially after storing, adjust the consistency by stirring in some water or broth., , Nutrition, Serving:, 400, g (approx. 1/5th of recipe), , , Calories:, 168, kcal, , , Carbohydrates:, 31, g, , , Protein:, 7, g, , , Fat:, 2, g, , , Fiber:, 7, g, , , , , , , , Like this recipe? Rate and comment below!, , Originally published January 18, 2018., , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 177 Comments, , , , , , Muguette, , says:, , , , March 7, 2025 at 4:32 pm, , , , , One of my favorite soups. I Love it and it’s so easy to make and tastes delicious. I make it at least 3 times a month. Thanks, , , Reply, , , , , , , , MARIA, , says:, , , , January 18, 2025 at 11:58 pm, , , , , I have made this soup many times. It’s my favorite!!, , , Reply, , , , , , , , Sassy, , says:, , , , January 16, 2025 at 4:16 pm, , , , , Easy to make and tasty, , , Reply, , , , , , , , Nan, , says:, , , , November 22, 2024 at 8:04 pm, , , , , Really good flavor & super comforting.  I added cauliflower & spinach to the mix.  Will definitely make this again.  Thanks!!!, , , Reply, , , , , , , , Deryn Macey, , says:, , , , November 23, 2024 at 6:55 am, , , , , Thanks! So glad to hear you enjoyed it., , , Reply, , , , , , , , , , Julie Katz, , says:, , , , September 22, 2024 at 6:30 am, , , , , Love this soup!  I’ve been making it on repeat with a Japanese White Sweet Potato.  So comforting and delicous!, , , Reply, , , , , , , , Deryn Macey, , says:, , , , September 22, 2024 at 4:21 pm, , , , , Sounds delicious with white sweet potato! Glad you love it., , , Reply, , , , , , , , , , ann p walsh, , says:, , , , September 10, 2024 at 6:43 pm, , , , , I haven’t made it yet, but i will! Can this be cooked in a slow cooker?, , , Reply, , , , , , , , Deryn Macey, , says:, , , , September 11, 2024 at 5:43 am, , , , , I haven’t tried that, sorry, but I don’t see why not., , , Reply, , , , , , , , , , Laura Newton, , says:, , , , August 13, 2024 at 11:05 am, , , , , Delicious recipe.  I added some nutritional yeast for a bit of a cheesy flavor.  I love how healthy this soup is, yet tastes amazing., , , Reply, , , , , , , , Barbara, , says:, , , , April 20, 2024 at 5:13 am, , , , , I made this last night with leftover carrots and celery from a reception. It was wonderful!  Will be putting this on my “make again” list!, , , Reply, , , , , , , , Deryn Macey, , says:, , , , April 20, 2024 at 2:09 pm, , , , , Thanks! Glad it was enjoyed., , , Reply, , , , , , Comment navigation, Older Comments, , , , Hi, I'm Deryn!, , Welcome to Running on Real Food!, Here you'll find simple, delicious and healthy, plant-based recipes and everything you need to eat, live and thrive., , , Read more about me, , , , , , Winter Recipes, , Soups, Tomato Orzo Soup, Bowls, Cauliflower Chickpea Potato Bowls, Bowls, Vegan Lentil Nourish Bowl, Bowls, Vegan Farro Bowl, Salads, Vegan Roasted Vegetable Salad, Side Dishes, Miso Roasted Broccoli Salad, More Summer Recipes, , , Most Popular, , Hand-Held, Chickpea Veggie Burgers, Cookies, Flourless Peanut Butter Banana Oatmeal Cookies, Curries, Vegan Coconut Red Lentil Dahl, Pancakes, 4-Ingredient Fluffy Vegan Protein Pancakes, Pancakes, Fluffy Vegan Whole Wheat Pancakes, Snacks, Healthy Pumpkin Oat Cookies, all recipes, As Seen In, , , Back to top, Running on Real Food, , , , Recipe Index, , About, , Contact, , eBooks, , ©2025 Running on Real Food. All rights reserved., , Accessibility, •, Cookie Policy, •, Disclosure, •, Privacy Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Chickpea Soup": "Ingredients: canned chickpeas, onion, garlic, tomato, red pepper, mint, cumin, olive oil, spinach, lemon juice, salt, pepper, How To Make Chickpea Soup In 20 Minutes, Chop the onion, grate tomato and the red pepper. Then freshen up your fingers by mincing some garlic., Add all to a heated cooking pot with olive oil, mint and cumin and saute for 1-2 minutes., Go back in time and rinse and drain the chickpeas. Then, add them in and saute for 2 more minutes., , Add water, a good amount of salt and cover with a lid. Cook at medium for around 8‐10 minutes. You can also use stock instead of the salty water., Add in the spinach, taste and add salt or water if needed., Blend ½ the soup using a hand blender and stir. Cook for 2 more minutes and remove from the stove., , Serve immediately and enjoy with some avocado, bread and jalapeno slices., More Healthy Soup Recipes, Well, I hope you enjoy the chickpea soup! If you’re looking for more healthy soup recipes, try these:, Broccoli and Lentil Detox Soup, Bulgur, Lentil and Spinach Soup, 20-Minute Healthy Bean Soup, , Yield: 3, Easy Chickpea Soup Recipe, , , , Print, An easy chickpea soup recipe with spices and herbs to warm you up after a cold day! This chickpea recipe is easy, healthy, vegan, gluten-free and dairy-free., , Prep Time, , 5 minutes, , , Cook Time, , 15 minutes, , , Total Time, , 20 minutes, , 2 cans of chickpeas, rinsed and drained, ½ onion, 3 cloves garlic, 1 small tomato, grated or 2 tsp tomato juice, ⅓ red pepper, grated, 2 tsp mint or a handful fresh mint, 1 tsp cumin, 1 1/2 tbsp olive oil, 1 cup spinach, 1 tsp lemon juice, Salt & Pepper to taste Instructions: Chop onion, grate tomato and red pepper, mince garlic., Add these vegetables to a heated cooking pot with olive oil, mint, and cumin and saute for 1-2 minutes., Add in the rinsed and drained chickpeas and saute for 2 more minutes., Add 2 cups of water or stock, a good amount of salt and cover with a lid. Cook at medium for around 8‐10 minutes., Add in the spinach, taste and add water or stock if needed., Add 1 more garlic clove and a tsp lemon juice. Blend ½ the soup using a hand blender and stir in. Cook for 2 more minutes and remove from the stove., Serve immediately and enjoy with some avocado, bread and jalapeno slices., , Nutrition Information, , Yield, 3, , Serving Size, 1, , Amount Per Serving, , Calories, 298, Total Fat, 10g, Saturated Fat, 1g, Trans Fat, 0g, Unsaturated Fat, 8g, Cholesterol, 0mg, Sodium, 168mg, Carbohydrates, 42g, Fiber, 12g, Sugar, 10g, Protein, 13g, © Beauty Bites, , , Cuisine:, Mediterranean, , /, , Category:, Soups, , Share:, 4 Comments, « 10-Minute Granola Balls | Easier Than Granola Bars, 7-Day No Sugar Challenge and Meal Plan (Gluten Free) », Comments, , Suzanne, , says, 25th July 2024 at 9:07 pm, I had to post, I have never made soup with chickpeas neither have I ever put them in soup, but I had a recipe that required chickpeas so I Bought a few extra cans. I came across your soup recipe and thought why not I’ll try, I have to say I LOVE it !!, I will definitely be saving your recipe thank you so much for sharing., Reply, , Stella, , says, 27th July 2024 at 1:20 pm, So glad you enjoyed it Suzanne!, Reply, , Tammy Bennett, , says, 5th December 2024 at 1:58 am, Made this tonight….   Easy to put together.   It is delicious!   I love soup at lunch…so I have several days of yummy!   It’s a keeper!, Reply, , Stella, , says, 5th December 2024 at 8:49 am, So happy you enjoyed the soup!, Reply, Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, Name, *, , Email, *, , Website, , , , Welcome to Beauty Bites!, Here you’ll find delicious clean eating recipes, healthy meal plans, Mediterranean diet recipes, anti-inflammatory recipes, daily habits for a healthy lifestyle, weight loss tips and so much more! You can read more about me, here, ., Search, Get The Clean Eating Recipe Binder, , Mediterranean Diet, Inflammation, Clean Eating Meal Plans, Mediterranean Diet Plan For Beginners, , 40+ Mediterranean Diet Recipes (30 Minutes Or Less), , 30+ Meal Prep Mediterranean Diet Recipes, , 5-Minute Mediterranean Bowl, , Mediterranean Salmon Bowl, How To Eat To Reduce Inflammation In The Body, , 7-Day Anti-Inflammatory Diet Meal Plan, , How To Make An Anti-Inflammatory Smoothie, , 5 Inflammatory Foods You Should Never Eat, , The 5 Best Anti-Inflammatory Diet Foods, 14-Day Clean Eating Meal Plan For Beginners, , 7-Day No Sugar Challenge and Meal Plan (Gluten Free), , 3-Day Detox Meal Plan To Rejuvenate You, , 7-Day Dairy Free Gluten Free Meal Plan, , Anti-Inflammatory Meal Plan (Weekend Edition), Health & Fitness, Gut Health, , How to Lose 10 Pounds In A Month, , Intermittent Fasting For Beginners: What To Eat & Do, , 7 Healthy Habits For Your Mental And Physical Health, , 7-Day Pilates & Barre Workout Plan, , How To Wake Up Early: 5 Tips That Actually Work, , Clean Eating For Beginners: 6 Steps To Start A Healthy Diet, Gut Health Food List: Improve Your Gut Microbiome, , Inflammation and Gut Health – How Are They Connected, , How To Heal Your Gut For Weight Loss, Clear Skin And Happier Brain, , 7 Activities You Didn’t Know Are Beneficial For Your Digestive System, Disclaimer, All content found on the Beautybites.org, including: text and images or other formats were created for informational purposes only. The content is not intended to be a substitute for professional medical advice, diagnosis, or treatment., Here you can find our, Privacy Policy., Copyright © 2025 · Beauty Bites. All rights reserved., Skip to Recipe, , , , , , , ,",
        "Healthy Spinach Chickpea Soup": "❌ Error scraping https://www.tarladalal.com/spinach-and-chick-pea-soup-39143r: 404 Client Error: Not Found for url: https://www.tarladalal.com/spinach-and-chick-pea-soup-39143r",
        "Garlic Chickpea Soup": "Ingredients: , including chickpeas, garlic, dried herbs and spices, it comes together in, less than 30 minutes, ., , I’m a big fan of chickpeas, these versatile healthy legumes can be used in, so, many ways including, chickpea salad, , , creamy chickpea soup, , , pasta with chickpeas, , and more like in these fabulous, 27 chickpea recipes., , , , They’re also so economical, packed with great, health benefits, , and you can easily turn them into a satisfying full meal in no time., , , Join my newsletter for free weekly recipes!, , , , , , , , , , , , , And while there are many variations of chickpea soup, you can’t go wrong with this simple recipe. It’s so cozy, delightfully filling and warming, definitely a no brainer to put together., , Watch how to make it, , , , , , , , , Serve it with quick, crusty bread, , delicious, pesto bread, or, easy focaccia, , it will be crazy good and you can call it dinner!, , , Chickpeas, Potato, Vegetable broth, Garlic, Olive oil, Dried rosemary, Dried thyme, Paprika, Chili flakes, Salt & pepper, , , How to make this vegan chickpea soup, , (Note: this is simply a quick explanation, the full recipe is at the bottom of the page), , Blend half of the chickpeas., Saute’ garlic in olive oil., Add chickpeas, herbs, spices, and potato., Stir in broth., Cook for 25 minutes., , , Vegan garlic chickpea soup variations, , This simple recipe is also very flexible, you can keep it as simple as it is, , You can start with a flavor base called, soffritto, (diced carrots, celery, and onion), Substitute chickpeas with white beans, Add a splash of white wine at the beginning as in this, white bean soup, Stir spinach or kale into the soup at the end, Top with a spoon of this flavorful garlic, parsley pesto, , , , More easy vegan soup recipes?, , Vegan soups packed with legumes have been staples in my diet for so many years. They’re delicious, easy to put together, inexpensive, and packed with plant-based protein. Here are some of my favorite recipes:, , Italian white bean soup,, super quick and full of flavor, Green lentil soup, , thick and spicy, Spicy red lentil soup, , with turmeric and cumin, Mediterranean chickpea soup,, tasty and filling, , If you make this vegan garlic chickpea soup recipe or if you have any questions, let me know! Leave a comment, send me a message, or rate it., I would love to hear from you!, , , , , Print Recipe, , 4.85, from, 86, votes, , , Vegan Garlic Chickpea Soup, , , This vegan garlic chickpea soup is not only fast and easy, but it’s also super creamy, including chickpeas, garlic, potatoes, dried herbs, it comes together in less than 30 minutes., Quantities yield 3 portions (about 1 ⅓ cup each) or 4 small servings (1 cup each), , , Prep Time, 5, minutes, , mins, Cook Time, 25, minutes, , mins, Total Time, 30, minutes, , mins, , , Course:, Soup, Cuisine:, vegan, Keyword:, Chickpea soup, , Servings:, 3, , servings, , Calories:, 252, kcal, , Author:, Katia, , 1, , Tbsp, , olive oil,, plus more for drizzling, 3, , large garlic cloves, , minced or pressed, 1, , tsp, , paprika, 1, , tsp, , dried rosemary, ½, , tsp, , dried thyme, ¼, , tsp, , chili flakes, 2 cans, , (15 oz each), , chickpeas, 1, , (6oz-180 grams), , large potato, , diced, 2 cups, , (480 ml), , low-sodium vegetable broth, salt & black pepper, to taste,  Instructions: Firstly, pour one of the cans of chickpeas with its liquid into a blender and purée until smooth., Heat the olive oil in a pot over medium heat, add the garlic and sauté for about 1 minute, or just until it's fragrant and smells good., Add the puréed chickpeas, the second can of drained chickpeas, the cubed potato, parprika, rosemary, thyme, chili flakes, and some freshly cracked pepper and give a good stir. Add broth and stir again., Place a lid on the pot, turn the heat up to medium-high, and bring the soup to a boil. Once boiling, turn the heat down to medium low and allow it to simmer for 25 minutes, stirring occasionally., Taste the soup and adjust the seasoning according to your taste (and that depends mostly on the salt content of your broth, I added about ¼ tsp of salt)., Serve hot with freshly ground pepper and a drizzle of olive oil if you wish, and don't skip crusty bread for dipping! 🙂, , , Notes, , keep in the fridge, stored in an airtight container, for up to 3 days., , Freezable:, divide among airtight containers (leaving 1-inch space at the top), and freeze up to 2 months, , I either make my own vegetable broth cooking vegetable scraps and herbs or I use hot water and vegan low sodium vegetable broth cubes., , , Note, : Nutritional values are estimates only, please see my, disclosure policies., , Nutrition, Calories:, 252, kcal, |, Carbohydrates:, 37, g, |, Protein:, 10, g, |, Fat:, 8, g, |, Saturated Fat:, 1, g, |, Sodium:, 729, mg, |, Potassium:, 520, mg, |, Fiber:, 10, g, |, Sugar:, 1, g, |, Vitamin A:, 403, IU, |, Vitamin C:, 13, mg, |, Calcium:, 71, mg, |, Iron:, 3, mg, , , Join my newsletter for free weekly recipes!, , , , , , , , , , , , , , , , Post navigation, , Previous, , Previous, Quick Italian Artichoke Salad, Next, Continue, , Easy Chocolate Cake Recipe {Vegan}, , , 242 Comments, , , Comments navigation, , Older comments, , , , , , , , Melanie, , says:, , , , at, , , , , Obsessed with this soup. I make it often, always paired with a nice crusty baguette. Sometimes instead of dipping baguette I make homemade garlicky croutons. Sometimes I use a whole roasted garlic and blend it with the first can of chickpeas. I just can’t stress how much I love this soup, and I’m not a vegan., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , You’ve made my day, Melanie! : ), Thanks so much for sharing your great feedback, I’m so pleased to hear you LOVE this soup! xx, , , , , , , , , , , Vanessa, , says:, , , , at, , , , , Loved this recipe. Have used 7 or 8 cloves of chopped garlic though and it works well. Have given it to a friend and she and her family also love it., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Wonderful! I’m so pleased you loved it, Vanessa. Thanks for sharing. x, , , , , , , , , , , Kaleigh, , says:, , , , at, , , , , The amount of rosemary in this was way too much for myself and my family. It created a very overpowering taste and was the only thing you could taste in the whole dish. Next time I will opt out for the rosemary and if you aren’t a huge rosemary lover I would suggest the same., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Hey Kaleigh! This is the first time I hear a complaint about the amount of rosemary, but I totally get it if rosemary isn’t your thing. Glad you’re making the recipe again skipping this herb. Thanks for your feedback. x, , , , , , , , , , , Charlene Burns, , says:, , , , at, , , , , Has anyone added heavy cream in lieu of blending and pureeing the chickpeas?  Leaving the chickpeas whole instead?, , , Reply, , , , , , , , Sonia, , says:, , , , at, , , , , Not enough taste – but so easy to make. Will try adding onions and carrots next time., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Thanks for your feedback, Sonia. Make sure to adjust the seasoning to your liking before serving. x, , , , , , , , , , , Maureen, , says:, , , , at, , , , , My son sent me this recipe when he was away and I took the hint and made it after his return, this evening.  Very, very nice.  I did add chopped onion and did not have all the herbs needed, but it was fine with the chilli flakes and paprika.  A wonderful hearty recipe which I will be making again very soon., Thank you so much., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , You’re so welcome, Maureen., I’m so pleased you loved it. : ), , , , , , , , , , , John, , says:, , , , at, , , , , why no onions just wondering?, , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Hi John, I wanted to make an easy recipe using only garlic, dry herbs, and paprika as a flavor base. No extra chopping. But you can add onions, of course. x, , , , , , , , , , , Connie, , says:, , , , at, , , , , This recipe is so delicious and easy to make.  It’s my go to soup recipe., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , That’s great, Connie. Thanks so much for sharing. : ), , , , , , , , , , , elaine, , says:, , , , at, , , , , delicious I’ve made this numerous times except this time I blended it smooth which is great for dipping but I do like it both ways., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Great! I’m so pleased it was delicious, Elaine. Thank you! x, , , , , , , , , , , Pam, , says:, , , , at, , , , , This soup is sooooo delicious. This is the second time I have made it in the last week. Thank you . It can be made in a flash!, , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Wonderful! Thanks so much for sharing, Pam. : ), , , , , , , , , , , Dinah Urban, , says:, , , , at, , , , , This soup is amazing!, I didn’t have a potato so I used potato flakes. It still tasted great. I’ve made it three times and everybody loves it., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , Wonderful! I’m very happy to hear that. Thanks for sharing, Dinah. x, , , , , , , , , , , Mrs S, , says:, , , , at, , , , , This is probably one of the best soups I’ve found on the web. Thank you for sharing., , , Reply, , , , , , , , Katia, , says:, , , , at, , , , , You’re so welcome! I’m so glad it was delicious. : ), , , , , , , , , Comments navigation, , Older comments, , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , , , , , , , , , , , , , , , , , , , , , Welcome to my blog where I share easy, delicious, budget-friendly recipes. I love cooking meatless meals perfect for busy weeknights., Read more…, , , , , , , , , , , , , Join my newsletter for free weekly recipes!, , , , , , , , , , , , , , , Search, , Search, , , , , , , , Trending Now, , , , 50 Italian Appetizers, 35+ YummY Cream Cheese Recipes, 20+ Best Bean Recipes, EASY LEMON RICOTTA PASTA & SPINACH, SPAGHETTI WITH GARLIC AND OLIVE OIL, 10-MINUTE CREAM CHEESE PASTA, THE BEST WHITE BEAN SOUP, 50 DELICIOUS AND EASY VEGAN APPETIZERS, , , , , Browse Recipes, , , , , , Pasta & Grain Recipes, , Soup Recipes, , Salad Recipes, , Vegan Recipes, , Oven Baked Recipes, , Sweet Recipes, , Meal Prep Recipes, , , , , , , , , , , , Seen On, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , © 2025 The clever meal. All rights reserved., , , , , , , , , Privacy Policy, , FAQ, , Contact Me, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Coconut Chickpea Stew": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., COCONUT CHICKPEA STEW, SERVES: 4 (approx. ¾ cup each) Prep Time: 10 min.  Cooking Time: 45 min., CONTAINER EQUIVALENTS (per serving):, ½, 1, 1, ½, VEGAN CONTAINER EQUIVALENTS (per serving):, ½, ½, 1, ½, 1 Tbsp., , olive oil, ½ cup, , \u0007chopped onion (approx. 2⁄3, medium), 3 cloves, , garlic, finely chopped, 2 cups, , \u0007canned chickpeas (garbanzo, beans), drained, rinsed, 1 Tbsp., , \u0007fresh ginger, finely chopped (or, 1 tsp. ground ginger), 1 tsp., , ground turmeric, ½ tsp., , sea salt (or Himalayan salt), ¼ tsp., , ground black pepper, 1 (13.5-oz.) can\t lite coconut milk, 1 cup, , \u0007low-sodium organic vegetable, broth, 2 cups, , \u0007kale or Swiss chard, stems, removed, roughly chopped, 1 Tbsp., , fresh lime juice, 1 tsp., , \u0007finely grated lime peel (lime, zest), 4 tsp., , chopped fresh mint, 1.\t\t Add oil to a large pot and heat over medium heat until fragrant, 1 to 2, minutes., 2.\t\t Add onion, garlic, chickpeas, ginger, turmeric, salt, and pepper; cook for 8, minutes, stirring often, until chickpeas begin to brown., 3.\t\t Gently mash chickpeas with a potato masher or the back of a wooden, spoon. Add coconut milk and broth, stuck to the bottom of the pan., 4.\t\t Bring to a simmer and cook for 30 minutes, stirring occasionally, until stew, has thickened., 5.\t\t Stir in kale and simmer 3 to 5 minutes, until wilted. Remove from heat;, stir in lime juice and lime zest., 6.\t\t Divide stew evenly among four serving bowls. Top each bowl with 1 tsp., chopped mint and serve immediately, or store refrigerated in an airtight, container for up to 4 days., NUTRITIONAL INFORMATION (per serving): Calories: 223  Total Fat: 11 g  Saturated Fat: 6 g  Cholesterol: 0 mg  Sodium: 256 mg  Carbohydrates: 25 g  Fiber: 6 g, Sugars: 6 g  Protein: 7.4 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 3, Instructions: "
    }
}