{
    "ingredients": {
        "Lemony Lentil Soup": "onion,carrot,garlic,veg stock,red lentils,corn",
        "Vegan Lentil Tortilla Soup": "yellow onion,garlic,jalapeno,red bell pepper,fire roasted tomatoes, red lentils,black beans,corn,cashew cream,tomato paste,veg broth,brown sugar,oregano",
        "Minestrone Soup": "onion,carrots,celery,garlic,veg broth,tomatoes,swiss chard,cannellini beans"
    },
    "recipe_url": {
        "Lemony Lentil Soup": "https://www.gimmesomeoven.com/lemony-lentil-soup/",
        "Vegan Lentil Tortilla Soup": "https://eatwithclarity.com/vegan-tortilla-soup/",
        "Minestrone Soup": "fixate_recipes\\Soup\\FXR_Minestrone_Soup_R_03.19.18.pdf"
    },
    "Recipe": {
        "Lemony Lentil Soup": "Ingredients: we just love it because it’s crazy-good and will forever remind us of home., , Let’s make some lemony lentil soup together!, , , Lemony Lentil Soup Recipe | 1-Minute Video, , , , , , , , , , , To make this lemony lentil soup recipe, , , Veggies:, A simple mix of white onion, carrots and garlic., , Veggie stock:, Or you could are welcome to use chicken stock if you prefer., , Red lentils:, Which I love for this soup because they break down quickly and purée easily., , Corn:, Just your basic frozen or canned whole-kernel corn., , Spices:, A cozy mix of ground cumin, curry powder, cayenne and saffron (which is optional, but really delicious if you happen to have some on hand)., , Fresh lemon:, Whose zest and juice we will add to the soup. I also recommend serving the soup with extra lemon wedges, if people would like to make their bowls even more lemony., , Salt and black pepper:, For seasoning, as always., , , , How To Make Lentil Soup:, , , Simmer., Stir in the vegetable stock, lentils, corn, cumin, curry powder, cayenne and saffron (if using) until combined. Cover and cook (or pressure cook or slow cook) until the lentils are tender., , Blend (optional)., Using either a, hand blender, or, traditional blender, , puree the soup until it reaches your desired consistency., , Season., Stir in the lemon zest and juice. Then season the soup with a few generous pinches of salt and pepper as needed., , Serve., Serve warm, garnished with an extra lemon slice, and enjoy!, , , , Possible Variations:, , Feel free to experiment and customize this soup however you might like! For example, you could…, , , Serve the soup chunky., Just skip the puréeing step and enjoy the soup as-is!, , Make it spicier., Add extra cayenne if you would like to give the soup a bit more heat., , Add fresh herbs., Fresh mint and/or cilantro would also be delicious served with this soup., , Add yogurt., Feel free to also serve the soup garnished with plain yogurt for a creamy twist., , Add greens., You could also stir some fresh baby spinach or chopped kale into the soup just before serving if you’d like to add some greens., , , , More Lentil Soup Recipes:, , Looking for more easy lentil soup recipes to try? Here are a few of my faves:, , , Turkish Lentil Soup, , Italian Lentil Soup, , Tomato Lentil Curry, , Vegetarian Lentil Chili, , Mexican-Inspired Chicken Lentil Soup, , , , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , , Lemony Lentil Soup, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.9, from, 351, reviews, , , , , , , , Prep Time:, , 10 minutes, , , Cook Time:, , 25 minutes, , , Total Time:, , 35 minutes, , , Yield:, , 4, servings, 1, x, , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , Description, , , This Lemony Lentil Soup recipe is full of the best bright and zesty flavors, it’s naturally gluten-free and vegan, and it’s easy to make in the Instant Pot, Crock-Pot or on the stovetop., , , , , , , , , , , , Scale, , 1x, 2x, 3x, , , , , , , 1 tablespoon, olive oil, , 1, medium white onion, peeled and diced, , 2, medium carrots, diced, , 5, cloves garlic, peeled and minced, , 6 cups, vegetable stock, (or chicken stock), , 1 1/2 cups, , red lentils, , rinsed and picked over, , 2/3 cup, whole-kernel corn, , 2 teaspoons, , ground cumin, , 1 teaspoon, , curry powder, , (optional) pinch, each, of, saffron, and, cayenne, , zest and juice of 1 small lemon, , fine sea salt, and, freshly-cracked black pepper, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , ,  Instructions: Crock-Pot or on the stovetop. But here is a quick overview:, , , Sauté the veggies., I recommend taking an extra few minutes to sauté the onion, carrots and garlic before adding them to the rest of the soup to bring out their best flavors. (This step may require an extra sauté pan, if using a Crock-Pot, or using the sauté feature in the Instant Pot.)  But if you are in a hurry, , , , , , Sauté the veggies., Heat oil in a, large stockpot, over medium-high heat.  Add onion and carrots and sauté for 5 minutes, stirring occasionally, until the onions are soft and translucent.  Add garlic and sauté for 1 more minute, stirring occasionally, until fragrant., , Simmer., Stir in the vegetable stock, lentils, corn, cumin, curry powder (plus saffron and cayenne, if using) until combined.  Continue cooking until the soup reaches a simmer.  Then cover and cook for 15 minutes, stirring occasionally, until the lentils are completely tender., , Blend (optional)., Using either a, hand blender, or, traditional blender, , puree the soup until it reaches your desired consistency.  (If using a traditional blender, please see notes below.), , Season., Stir in the lemon zest and juice until combined.  Taste and season the soup with a generous pinch or two of fine sea salt and black pepper, as needed., , Serve., Serve warm, garnished with an extra fresh lemon slice if desired., , , , , Sauté the veggies (optional)., Press the “Sauté” button on your, Instant Pot, .  Add oil and let it heat until shimmering. Add onion and carrots and sauté for 5 minutes, stirring occasionally, until the onions are soft and translucent.  Add garlic and sauté for 1 more minute, stirring occasionally, until fragrant.  Press “Cancel”., , Cook., Stir in the vegetable stock, lentils, corn, cumin, curry powder (plus saffron and cayenne, if using) until combined. Cover the pot and set vent to “Sealing”. Cook on high pressure for 8 minutes, followed by a quick release., , Blend., Using either a, hand blender, or, traditional blender, , puree the soup until it reaches your desired consistency.  (If using a traditional blender, please see notes below.), , Season., Stir in the lemon zest and juice until combined.  Taste and season the soup with a generous pinch or two of fine sea salt and black pepper, as needed., , Serve., Serve warm, garnished with an extra fresh lemon slice if desired., , , , , Slow cook., Add onion, carrots, garlic, vegetable stock, lentils, corn, cumin, curry powder (plus saffron and cayenne, if using) to the bowl of a, large slow cooker, , and stir to combine., (No olive oil needed.), Cover and cook on high for 2-3 hours, or on low for 5-6 hours, until the lentils are completely tender., , Blend., Using either a, hand blender, or, traditional blender, , puree the soup until it reaches your desired consistency.  (If using a traditional blender, please see notes below.), , Season., Stir in the lemon zest and juice until combined.  Taste and season the soup with a generous pinch or two of fine sea salt and black pepper, as needed., , Serve., Serve warm, garnished with an extra fresh lemon slice if desired., , , , , , , Equipment, , , Ground Cumin, , Buy Now →, , , , Red Lentils, , Buy Now →, , , , Curry Powder, , Buy Now →, , , , , , Notes, , , If using a, traditional blender, to purée the soup, please exercise caution (as always) as hot liquids expand when blended.  I would recommend blending the soup in two batches, so as not to overflow your blender.  I always slightly tent open the cap on the blender lid (or gently place a kitchen towel over the cap opening) so that excess hot air can escape while the hot soup is being blended.  Once the soup is ready to go, return it to the stockpot and continue on with the recipe., , Sautéing the veggies:, I really recommend sautéing the onions, carrots, garlic if you can before cooking them in the Instant Pot or slow cooker, in order to give them the best flavor. But if you’re in a rush, no worries, Any leftovers can be refrigerated in a, food storage container, for up to 3 days or frozen for up to 3 months., , Source:, Recipe inspired by my favorite lentil soup from Aladdin Cafe in Kansas City., , , , , , , , Let us know if you made this recipe!, , Tag, @gimmesomeoven, on Instagram and hashtag it, #gimmesomeoven, , , , , , , , Share this Post, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , posted on, March 21, 2022, by, Ali, Dairy-free, , , Gluten-free, , , Main Dishes, , , Mediterranean-Inspired, , , Soups / Stews, , , Vegan, , , Vegetarian, , , 499 Comments », , , , , , , , , , You May Also Like..., , , , , Crispy Zucchini Black Bean Tacos, , , , , , , Golden Granola, , , , , , , Potsticker Soup, , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , 499 comments on “Lemony Lentil Soup”, , , « Previous, , 1, , …, , 8, , 9, , 10, , , , , , , , Chloe, —, , October 24, 2024 @ 12:52 pm, , , Reply, , , Made it so many times over the years, always very good!, , , , , , , , , Laura, —, , November 11, 2024 @ 10:43 pm, , , Reply, , , This may be my favorite all time soup recipe, considering how easy it is to throw together and how tasty it is.  It also freezes really well.  I always make a double batch., , , , , , , , , Teresa, —, , November 25, 2024 @ 10:05 am, , , Reply, , , The recipe is delicious. Mine didn’t have the lovely yellow color of your photos but turned more a pea soup color which is not as pleasant. But the flavor is all there. Next time I’ll try to work on color…, , , , , , , , , Steph, —, , January 1, 2025 @ 3:38 pm, , , Reply, , , Over the past 2 years this recipe has become a family staple — so healthy and do delicious! Thank you for sharing it with us!, , , , , , , , , SMARTBLONDE365, —, , January 14, 2025 @ 6:50 pm, , , Reply, , , Delicious. Doubled the spices and added a bit more salt and pepper. Very tasty and satisfying. Served it with garlic croutons., , , , , , , , , Karin Redisch, —, , January 19, 2025 @ 3:36 am, , , Reply, , , Do you use dried tortellini or fresh?, , , , , , , , Kiera, —, , February 9, 2025 @ 8:46 pm, , , Reply, , , I have had this recipe on my list forever and I am SO mad that I didn’t make it sooner. It is so good. It’s bright with a little bit of heat and a beautiful texture. And it’s super quick and easy. It is -30c in Canada right now and this soup warmed up my soul., , , , , , , , Dawn Stockwell, —, , March 3, 2025 @ 2:28 pm, , , Reply, , , Soup was delish! Just what I was hoping for. Something special and different. The site though has way too many pop ups and actually ran my phone down so fast it was crazy., , , , , , , « Previous, , 1, , …, , 8, , 9, , 10, , Leave a Comment », , , , , , , , , Hey, I’m Ali!, , My favorite thing in life is time spent around the table.  And all the better with some seriously tasty food to bring us all together., more about me », , Subscribe via Email:, , , , , , , , , , , , , , , , , , , , , , , , , Food, (more), , , , , , Blender Spinach Banana Muffins, , , , , , , Chili-Lime Roasted Cauliflower Quinoa Bowls, , , , , , , Shakshuka, , , , , , , Life, (more), , , , , , Currently, , , , , , , Meet Milo!, , , , , , , Currently, , , , , , , Travel, (more), , , , , , Ali’s Guide To Istanbul, , , , , , , Ali’s Guide To Mexico City, , , , , , , Ali’s Guide To The Amalfi Coast, , , , , , , , , , , , Home, , About Ali, , Privacy Policy, , Work With Us, , Contact, , , ©2009-2025 Gimme Some Oven., Design by, , Purr, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Vegan Lentil Tortilla Soup": "Ingredients: aside from the lime juice, we’ll add that at the end., , I used 3 cups of veggie broth because I wanted this on the thicker side, if you like it more brothy, use 4. If you’re not sure, start with 3 and add more at the end if you want to thin it out., , Stir everything well to combine and bring to a boil. Reduce heat to low, cover and let simmer for about 20 minutes, stirring occasionally., , , After about 20 minutes, taste to check to see if the lentils are fully cooked. Let simmer for 5-10 more minutes if they still have a crunch to them., , Once the lentils are done, transfer 2 cups worth of soup to a blender and blend until smooth. Transfer back to the pot and stir to combine. Stir in the lime juice. Taste and adjust flavors as desired, and/or add more broth to thin it out if you like., , Garnish with tortilla strips, chopped cilantro, fresh lime juice, avocado and vegan sour cream. Plain yogurt also works well if you don’t like sour cream!, , , Homemade tortilla strips, , I had a hard time finding certified gluten free tortilla strips at the market when I was shopping for this recipe, so I opted to make my own and it was actually SO easy! All you’ll need is a few corn tortillas, oil of your choice (I used avocado) and some salt., , What you want to do is slice the tortillas into thin strips, then slice in the other direction to get about 1 inch long and 1/4 inch wide strips. Add some oil to a pot on the stove (enough to cover the bottom of the pan with about 1/2 inch layer)., , Once it’s hot, throw in the strips and let fry for a few minutes on each side until crispy. It helps to do this in small batches so the tortillas aren’t all on top of each other and crowded., , Remove from the pan and place on a paper towel to absorb any excess oil. Top with a few cracks of salt., , , How to store and freeze, , Once prepared, this vegan tortilla soup will keep in the fridge for about 3 days. You can reheat it on the stove or microwave. It does thicken up a bit as it sits in the fridge, so you may want to add a splash of veggie broth when you reheat it., , Once the soup is cooked, allow it to cool completely, then transfer it to an air tight and freezer safe container. Freeze for up to 2 months. Allow it to thaw in the fridge overnight before reheating., , I like to freeze it in smaller containers so I can thaw just what I need at any time!, , , Serving suggestions, , I like to serve this vegan tortilla soup as the main dish since it’s nice and hearty from the beans and lentils., , My favorite toppings include fresh lime juice, avocado, lots of chopped cilantro and sour cream. Ok, I actually don’t like sour cream, so I just use leftover cashew cream and pretend to the people I’m serving it to that it’s sour cream. Oops!, , , Try these recipes next!, , , Red Lentil and Carrot Soup, , Instant Pot Lentil Soup, , One Pot Vegan Chili, , Lemon Chickpea Soup, , , Lastly, if you want more recipes straight to your inbox, be sure to, subscribe to my email list, . As always, tag me on, instagram, if you make this recipe so I can see your creation!, , , , , , 5, from, 113, votes, , Vegan Lentil Tortilla Soup, , by:, claire cary, , This one pot vegan tortilla soup is made with red lentils, black beans, fire roasted tomatoes, corn and lots of fresh spices! It's incredibly easy to make and the perfect hearty soup for a chilly day., , Print, /, Pin, /, Rate, , , , , Prep:, 10, minutes, , mins, Cook:, 20, minutes, , mins, Total:, 30, minutes, , mins, , 6, , 1x, 2x, 3x, , , Soup:, ▢, 1, , yellow onion, ▢, 2, , tablespoons, , olive oil, ▢, 4, , cloves, , garlic, ▢, 1, , jalapeno, , seeds removed for less spice, ▢, 1, , red bell pepper, ▢, 1, , tablespoon, , tomato paste, ▢, 2, , 15 ounce, , cans fire roasted crushed tomatoes, , see notes, ▢, ¾, , cup, , red lentils, ▢, 1, , can, , black beans, , drained and rinsed, ▢, 1, , cup, , corn, ▢, ⅓, , cup, , cashew cream, , click for recipe, ▢, 3 – 4, , cups, , low sodium vegetable broth, ▢, 2, , teaspoons, , chili powder, ▢, 2 ½, , teaspoons, , cumin, ▢, 1, , tablespoon, , brown or coconut sugar, ▢, 1, , teaspoon, , salt, , use less if broth was not low sodium, ▢, 1, , teaspoon, , oregano, ▢, 1, , tablespoon, , lime juice, , about 1/2 lime, Serving Suggestions, ▢, 1, , cup, , tortilla strips, ▢, 1, , avocado, ▢, 1, , lime, juiced, ▢, ½, , cup, , chopped cilantro, US Customary, –, Metric, , we'll add that at the end., I used 3 cups of veggie broth because I wanted this on the thicker side, if you like it more brothy, use 4. If you're not sure, start with 3 and add more at the end if you want to thin it out., Stir everything well to combine and bring to a boil. Reduce heat to low, cover and let simmer for about 20-25 minutes, stirring occasionally., After about 20 minutes, taste to check to see if the lentils are fully cooked. Let simmer for 5-10 more minutes if they still have a crunch to them., Once the lentils are done, transfer 2 cups worth of soup to a blender and blend until smooth., Transfer back to the pot and stir to combine. Stir in the lime juice. Taste and adjust flavors as desired, and/or add more broth to thin it out if you like., Serve and garnish with tortilla strips (see the body of the post for how to make these homemade!), chopped cilantro, fresh lime juice, avocado and sour cream., , Notes, You can use coconut cream in place of the cashew cream if preferred, but I suggest cashew cream if you can!, , You can also just use one 28 ounce can of fire roasted tomatoes if that’s what you can find/what you have on hand!, , If you can’t find crushed fire roasted tomatoes, you can use diced or chopped fire roasted and just pulse in a blender a few times before adding to the soup., , Serving:, 1, bowl, /, Calories:, 431, kcal, /, Carbohydrates:, 53, g, /, Protein:, 19, g, /, Fat:, 14, g, /, Saturated Fat:, 2, g, /, Fiber:, 19, g, /, Sugar:, 9, g, , , , Did you make this?, , Mention, @eatwithclarity, or tag, #eatwithclarity, !, , , , , , , , , , , , , , , , , , , , , , , , 5 from 113 votes (, 38 ratings without comment, ), , , , leave, a comment and rating, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Name*, , , , , Email*, , , , , Website, , , , , Save my name, email, and website in this browser for the next time I comment., , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , Georgia Postlewaite, , says, , , April 9, 2025 at 12:48 pm, , , , Loving this recipe!! I was looking to incorporate more fiber into my diet and this soup is sooo rich in all the good things your gut needs. As a student this is an awesome recipe to prepare for meal preps and keeps you full for extended times. Thanks for sharing ✨🩷, , , Reply, , , , , , , , Claire Cary, , says, , , April 9, 2025 at 1:26 pm, , , , Thank you, Georgia! So glad you love it., , , Reply, , , , , , , , , , Cheryl, , says, , , March 16, 2025 at 11:56 am, , , , Prepared this soup and it was an absolute hit. Thanks so much for sharing., , , Reply, , , , , , , , Robbie Peakall, , says, , , March 9, 2025 at 1:00 am, , , , Made the recipe last night, needed something substantial as I was not feeling well. Only need a small amount it was tasty and filling. 👌, , , Reply, , , , , , , , Amy, , says, , , February 22, 2025 at 8:08 pm, , , , Soup was delicious!, , , Reply, , , , , , , , Stephanie, , says, , , February 18, 2025 at 4:16 pm, , , , Wow this was just soooooo yummy!! My whole family loved it! I’ll be keeping this in the rotation., , , Reply, , , , , , , , Heather, , says, , , February 9, 2025 at 8:02 am, , , , This was soo good!, I tripled the recipe and it was a huge hit at a charity soup event., I reduced the jalapeño, cooked the veggies for less time to keep some texture since it would be simmering in a crockpot and used a container of vegan sour cream to make it nut-free. Thank you!, , , Reply, , , , , , , , Erica, , says, , , February 6, 2025 at 11:48 pm, , , , Delicious! One of my easy go to’s!, , , Reply, , , , , , , , Melody, , says, , , January 31, 2025 at 1:17 pm, , , , Super easy and fantastic flavor! Bonus points for the cashew cream recipe., , , Reply, , , , , , , , Claire Cary, , says, , , January 31, 2025 at 1:22 pm, , , , Thank you, Melody!, , , Reply, , , , , , , , , , Katie, , says, , , January 16, 2025 at 2:12 pm, , , , I would make this soup the father of my children if I could. No notes. The cashew cream recipe is incredible as well – I used that in the base of the soup and then I topped the soup with protein soy yogurt as a sour cream replacement., , , Reply, , , , , , , , Claire Cary, , says, , , January 17, 2025 at 9:15 am, , , , Haha – love that! Thanks, Katie!, , , Reply, , , , , , , , , , David, , says, , , January 16, 2025 at 7:23 am, , , , Could this recipe be made in a crockpot as well?, , , Reply, , , , , , , , Claire Cary, , says, , , January 17, 2025 at 9:12 am, , , , Yes!, , , Reply, , , , , , , , , , Denise, , says, , , January 4, 2025 at 1:39 pm, , , , I’m allergic to nuts. Do you think this would be good with no cream at all? Can’t have coconut either. Best I can do for a substitute would be oat milk. Thank you., , , Reply, , , , , , , , Claire Cary, , says, , , January 4, 2025 at 2:19 pm, , , , Yeah should be fine without! Or you could try a yogurt of some kind., , , Reply, , , , , , , , , , Natalie, , says, , , December 24, 2024 at 10:30 pm, , , , Great stew/soup “stoup” recipe.  It is great over polenta as well., Having one vegan in the family along with 5 other non-vegans makes is challenging to please everyone.  This “stoup” brought us all to the table and everyone enjoyed it thoroughly.  Will keep this in my bank of recipes., , , Reply, , , , , , , , Claire Cary, , says, , , December 27, 2024 at 10:58 am, , , , Love it! Thank you, Natalie!, , , Reply, , , , , , , , , , Shaniece F, , says, , , December 22, 2024 at 9:42 pm, , , , This vegan lentil soup was everything! I made it as a meal prep item last week, and my customers couldn’t stop raving about it. The flavors were perfectly balanced, super hearty, and satisfying. It’s one of those dishes you could eat all week and still look forward to the next bowl. Definitely a hit!, , , Reply, , , , , , , , Claire Cary, , says, , , December 23, 2024 at 10:16 am, , , , So happy to hear that! Thank you!, , , Reply, , , , , , , , , , Julie, , says, , , December 13, 2024 at 7:06 am, , , , This soup warms the soul! It will be a new staple in the rotation., , , Reply, , , , , , , , Terri, , says, , , December 8, 2024 at 6:29 pm, , , , I made this soup for dinner one night. It was so good, I decided to quadruple the recipe and make it for a crowd. They ate every last bite and several people asked for the recipe. Don’t skip the cashew cream, cilantro, and avocado topping! One of the best soups ever and so easy to make!, , , Reply, , , , , , , , Claire Cary, , says, , , December 9, 2024 at 2:54 pm, , , , Perfect! Thank you, Terri!, , , Reply, , , , , , , , , , Alexandra Meyer, , says, , , December 2, 2024 at 7:51 pm, , , , Yum!, , , Reply, , , , , , , , Dana, , says, , , November 22, 2024 at 11:09 am, , , , This is a fantastic recipe!!  I added some spinach to it in the food processor.  Not only is this delicious but is so healthy and filling!  Thanks for sharing!, , , Reply, , , , , , , , Claire Cary, , says, , , November 22, 2024 at 12:07 pm, , , , Thank you, Dana! So happy you loved it!, , , Reply, , , , , , , , , , Nona, , says, , , November 11, 2024 at 5:12 pm, , , , I love this recipe! Thanks for sharing ☺️, , , Reply, , , , , , , , Claire Cary, , says, , , November 12, 2024 at 9:58 am, , , , Thank you, Nona!, , , Reply, , , , , , , , , , Mandi, , says, , , October 13, 2024 at 12:24 pm, , , , Wow!! This was so good! I was out of red lentils and cashews, so subbed green lentils for the red and skipped the cashew cream and it was still delicious!! I topped it with some shredded cabbage, jalapeno, avocado and a squeeze of lime. Mmmm! Thank you!, , , Reply, , , , , , , , Claire Cary, , says, , , October 14, 2024 at 10:13 am, , , , So glad that worked out! Thanks, Mandi!, , , Reply, , , , , , , , , , J, , says, , , August 16, 2024 at 9:57 pm, , , , Modification:, 1 large can Marzano tomatoes (instead of the fire roasted), – pour into bowl, hand crush, add diced green chillies & spices., 4 cans black beans (varies on family size), 1 cup red lentils, 1 can diced green chillies, Replace cashew with coconut milk, , , Reply, , , , , , , , Megan, , says, , , May 19, 2024 at 4:19 pm, , , , I made this and it’s very delicious, thank you, , , Reply, , , , , , , , Mary, , says, , , May 16, 2024 at 8:20 am, , , , though I’ve made cashew cream many times for vegan beef stroganoff and other plant based recipes and I like it. I also was too lazy to make the tortilla strips so just crumbled some tortilla chips on top of the soup in my bowl. This was a really delicious soup and I thank you for such a great recipe., , , Reply, , , , , , , , Claire Cary, , says, , , May 16, 2024 at 4:16 pm, , , , So glad you enjoyed this one, thanks Mary!, , , Reply, , , , , , , , , , Jess, , says, , , May 14, 2024 at 7:59 pm, , , , This is so good! Have made it a few times, but am wondering if it could be done in the slow cooker??, , , Reply, , , , , , , , Claire Cary, , says, , , May 15, 2024 at 4:39 pm, , , , Yes, , , Reply, , , , , , , , Larissa, , says, , , September 18, 2024 at 7:32 am, , , , Is it cooked on low or high setting in crockpot for 4-5 hours, , , Reply, , , , , , , , Claire Cary, , says, , , September 18, 2024 at 12:03 pm, , , , High for 4 hours, low for about 8!, , , Reply, , , , , , , , , , , , , , Megan, , says, , , May 11, 2024 at 8:20 pm, , , , An absolutely amazing recipe! I’ve made multiple times, and it always hits. The only thing I wish was different, etc., , , Reply, , , , , , , , Claire Cary, , says, , , May 13, 2024 at 4:32 pm, , , , Thanks for the feedback, Megan! Will keep that in mind for future recipes!, , , Reply, , , , , , , , , , Stephanie Ramirez, , says, , , April 20, 2024 at 6:03 pm, , , , Delicious. Great flavor, great texture. Would definitely make again, , , Reply, , , , , , , , Courtney, , says, , , March 17, 2024 at 4:12 am, , , , , , Reply, , , , , , , , Claire Cary, , says, , , March 18, 2024 at 12:18 pm, , , , Thank you, Courtney!, , , Reply, , , , , , , , , , Mikayla, , says, , , March 11, 2024 at 11:18 am, , , , This soup was so good most vegan soups I make are meh but I loved this recipe and so does my, Non-vegan boyfriend. Thanks!, , , Reply, , , , , , , , Claire Cary, , says, , , March 11, 2024 at 11:27 am, , , , Thank you, Mikayla!, , , Reply, , , , , , , , , , Sandi, , says, , , January 23, 2024 at 5:20 pm, , , , Absolutely delicious! Easy to make and hearty. I will definitely be making this again., , , Reply, , , , , , , , Claire Cary, , says, , , January 24, 2024 at 9:29 am, , , , Thank you, Sandi!, , , Reply, , , , , , , , , , Jessica, , says, , , January 7, 2024 at 7:05 am, , , , Could you use another cream/milk that doesn’t have quite as high saturated fat content like soy milk?, , , Reply, , , , , , , , Claire Cary, , says, , , January 7, 2024 at 4:13 pm, , , , Any cream will have a higher fat content than milk, you can just leave it out entirely if you’re worried about that!, , , Reply, , , , , , , , , , Elexis, , says, , , December 20, 2023 at 12:34 pm, , , , This soup tastes more like a chili to me.  It was really good.  I like that it is filling, satisfying, and not heavy.  You can eat a lot of this soup without feeling heavy.  I added kidney beans, as well, and you can add whatever you want in the soup to customize it.  I think it would taste delicious as well.  We had them with quesadillas or toasted and buttered ciabatta bread.  Wondering if what gives a tortilla soup its distinct flavor is all the sour cream and cheese in it, lol, which defeats the purpose of it being vegan.  Despite it not tasting like a tortilla soup, I will be making it again!, , , Reply, , , , , , , , Stephanie, , says, , , December 12, 2023 at 12:57 am, , , , This turned out sooo well! Our family is not vegan but we love rotating meatless dishes in a few times a week and this one did NOT disappoint! I used coconut cream (added a little more than called for) and I skipped the blender step for ease sake. Topped with jalapeño, cilantro, cheese, avocado and tortilla strips. My husband asked if we could have it again later this week! 10/10! Thank you for sharing this delicious recipe 😍, , , Reply, , , , , , , , Claire Cary, , says, , , December 12, 2023 at 10:06 am, , , , Thank you, Stephanie, so glad you all enjoyed this one., , , Reply, , , , , , , , , , Rachel, , says, , , November 14, 2023 at 1:00 pm, , , , this is a really really good recipe and honestly super easy!!!!, , , Reply, , , , , , , , Dani, , says, , , October 23, 2023 at 5:13 pm, , , , I don’t normally leave reviews, but this recipe was easy and delicious. My whole family likes it! Will definitely make again!, , , Reply, , , , , , , , Jessica, , says, , , October 11, 2023 at 7:40 am, , , , Tuesday is generally Taco Tuesday, or something Mexican inspired, and since it is cooling down in Wisconsin, soup felt right. This soup is delicious! One of the first new things I’ve made recently that the boyfriend said it can be put in a regular rotation he thought it was that good. He eats meat and I don’t, but I still want to find things we can both enjoy and the flavor of this soup was it! I may find a way to add a little more heat to it next time, but it’s great as is! I may as well note, though I had everything just in my pantry already, I did not have any bell pepper, so I diced carrots for some of that sweetness and it worked just as well!, , , Reply, , , , , , , , Claire Cary, , says, , , October 19, 2023 at 8:34 pm, , , , Perfect, thanks Jessica! Some jalapeno or lots of res pepper flakes can add some good spice!, , , Reply, , , , , , , , , , Carrie, , says, , , September 16, 2023 at 4:01 pm, , , , Yum! So good. I will be making this soup again!, , , Reply, , , , , , , , Cindy, , says, , , September 6, 2023 at 2:17 pm, , , , Made this last night. Made 2 changes, I added nutritional yeast to the cashew cream and I accidentally forgot to blend the lentils. We loved it! Will make again for sure. Delicious and satisfying!, , , Reply, , , , , , , , Claire Cary, , says, , , September 6, 2023 at 5:50 pm, , , , Perfect! So glad you enjoyed it., , , Reply, , , , , , , , , , Deborah, , says, , , July 31, 2023 at 6:24 pm, , , , We absolutely  loved this Devine soup what Picasso with delicious latino flair…YUM. MARKED AS A FAVORITE🤩, , , Reply, , , , , , , , Claire Cary, , says, , , August 1, 2023 at 10:12 am, , , , Thank you, Deborah!, , , Reply, , , , , , , , , , Sharon, , says, , , July 30, 2023 at 9:41 pm, , , , The flavors in this soup are fantastic! Truly the best soup I have ever made. It will definitely be a favorite recipe!, , , Reply, , , , , , , , Claire Cary, , says, , , July 31, 2023 at 9:31 am, , , , Just made my day, thanks Sharon!, , , Reply, , , , , , , , , , Wes, , says, , , May 2, 2023 at 11:35 pm, , , , I really like the use of red lentils; they add great body and texture. I didn’t puree any of it but it was still nice and thick. Very tasty., , , Reply, , , , , , , , Claire Cary, , says, , , May 4, 2023 at 10:41 am, , , , Perfect, so glad you enjoyed it!, , , Reply, , , , , , , , , , Erin McNamara, , says, , , April 7, 2023 at 9:01 pm, , , , This recipe never disappoints. It is so flavorful and easy to make. Someone who tasted it was convinced there was meat in it. One night someone even put it over tortilla chips to make nachos. Delicous! Don’t hesitate to make this., , , Reply, , , , , , , , Claire Cary, , says, , , April 10, 2023 at 6:07 pm, , , , Thank you, Erin!, , , Reply, , , , , , , , , , Jessi, , says, , , March 21, 2023 at 7:51 pm, , , , This is one of my newest favs! I’ve made it at least half a dozen times and it never disappoints, even when I don’t have the right amounts of everything. Such a comforting soup. Thanks for sharing!, , , Reply, , , , , , , , Claire Cary, , says, , , March 22, 2023 at 6:18 pm, , , , Amazing! Thank you, Jessi!, , , Reply, , , , , , , , , , Faith, , says, , , March 20, 2023 at 12:24 pm, , , , Absolutely delicious! I am the only vegan in my family, had no problem eating this over a few days by myself. I think it’ll become a weekly staple., , , Reply, , , , , , , , Claire Cary, , says, , , March 22, 2023 at 6:17 pm, , , , So so happy to hear that, thanks Faith!, , , Reply, , , , , , , , , , Heather, , says, , , March 5, 2023 at 10:56 pm, , , , Delicious!  This will now be one of my go-to recipes, especially for tortilla soup.  The flavor was great and I loved that it was all vegan., , , Reply, , , , , , , , Claire Cary, , says, , , March 6, 2023 at 8:43 pm, , , , Thanks, Heather!, , , Reply, , , , , , , , , , Jannie, , says, , , February 28, 2023 at 5:32 pm, , , , This was an EXCELLENT  soup ,creamy just the right spices and the tortilla cilantro  and lime to taste was a nice addition  . We have had it a couple times and keep coming back. Thank you, , , Reply, , , , , , , , Claire Cary, , says, , , February 28, 2023 at 9:03 pm, , , , Thank you, Jannie!, , , Reply, , , , , , , , , , Katy, , says, , , February 12, 2023 at 8:59 pm, , , , This soup was so good! The flavors are amazing. I used fire roasted frozen corn from Trader Joe’s and also added some kale. I actually didn’t blend part of it since I like soups chunkier and it still turned out great! I used 3 cups of broth. 10/10 recommend!, , , Reply, , , , , , , , Claire Cary, , says, , , February 13, 2023 at 8:47 pm, , , , Perfect! Thank you, Katy., , , Reply, , , , , , , , , , Lori, , says, , , January 25, 2023 at 6:37 pm, , , , Fantastic! I’m not a black bean fan so I doubled the lentils and it turned out great. The lentils absorb a lot of water, so I used 4 cups of broth and even added a little more water at the end and it was thick and hearty. Thank you for a yummy recipe!, , , Reply, , , , , , , , Claire Cary, , says, , , January 26, 2023 at 10:04 am, , , , Perfect, thanks Lori!, , , Reply, , , , , , , , , , Linz, , says, , , January 25, 2023 at 8:39 am, , , , This recipe was a huge hit in my house! Hubby went back for seconds and he isn’t a big soup guy. I’ll definitely have to keep this recipe in my back pocket. It also wasn’t to time consuming or difficult., , , Reply, , , , , , , , Cory, , says, , , December 21, 2022 at 8:23 am, , , , OMGosh!!  Made this yesterday and WOW!  Lots of flavor and texture…perfect hearty soup for a cold, rainy winter day!  Will definitely be making again., , , Reply, , , , , , , , April, , says, , , December 7, 2022 at 8:29 pm, , , , So tasty! Coconut milk totally works – I ended up using a whole 15ish oz can since I didn’t want to bother storing it for later. I agree with other reviewers that 3 cups broth is plenty! Spices are always a little bit of preference/ trial and error- I likely did them heavy handed. I also went heavy handed with the lime juice at the end. I’ve found with other soups, that I prefer to add lime juice right into the individual bowl as I feel that retains the flavor better. Chopped cilantro and crushed tortilla chips made for a delicious soup! And my meat loving husband gave me the “You could make this for my birthday!” Seal of approval!, , , Reply, , , , , , , , Kendall, , says, , , November 14, 2022 at 1:22 pm, , , , This was fantastic! Already looking forward to the next time I make this soup. Next time I think I will add an extra jalapeño since my husband and I like extra spice. Thank you for this recipe!, , , Reply, , , , , , , , emily, , says, , , October 25, 2022 at 2:40 pm, , , , I am ADDICTED to this soup! I make it at the start of the week and it’s a great dinner to come home to!, , , Reply, , , , , , , , Erin, , says, , , September 22, 2022 at 11:44 am, , , , For the cashew cream, , , Reply, , , , , , , , Claire Cary, , says, , , September 22, 2022 at 12:44 pm, , , , Just the basic one, but savory would also work!, , , Reply, , , , , , , , , , Kathryn, , says, , , September 14, 2022 at 5:11 pm, , , , Thank you for this delicious soup recipe. It’s so yum and easy to make. Will double the batch next time as everyone loved it and wanted more., , , Reply, , , , , , , , Ri Burnside, , says, , , May 11, 2022 at 10:45 pm, , , , AMAZING! This was so good, , , Reply, , , , , , , , Raquel, , says, , , April 29, 2022 at 9:12 am, , , , Do you think cream cheese in place of the cashew cream would work?, , , Reply, , , , , , , , Claire Cary, , says, , , April 29, 2022 at 9:16 am, , , , Yes I think that could work!, , , Reply, , , , , , , , , , Eve, , says, , , April 3, 2022 at 12:04 pm, , , , Best lentil soup ever. I am in love. I made this soup couple times already and everyone is asking for a recipe 👌🏼, , , Reply, , , , , , , , Allyson, , says, , , March 8, 2022 at 10:57 am, , , , OMG!  I made the Vegan Lentil Tortilla Soup last evening.  WOW! There is so much flavor!  It is absolutely delicious!  I have never made a soup that tasted this good!!!  I omitted the jalapeno pepper because I don’t like spice and I used evaporated low fat milk instead of the cashew cream.  Thanks for the recipe!  I will be trying other recipes from your blog., , , Reply, , , , , , , , Claire Cary, , says, , , March 9, 2022 at 7:08 pm, , , , Thank you Allyson! Can’t wait to see what else you make!, , , Reply, , , , , , , , , , Samantha, , says, , , February 21, 2022 at 9:35 pm, , , , SO flavorful! Glad I one-and-a-half the recipe so that we can eat it for 2 nights! YUM!, , , Reply, , , , , , , , Jessi, , says, , , February 15, 2022 at 1:23 pm, , , , This recipe is such a win. I am a newer vegan and still finding replacements to some of my favorite foods, but this is even better than the chicken tortilla soup I used to make. So much flavor, and its hearty and filling… Yum!!, , , Reply, , , , , , , , Claire Cary, , says, , , February 16, 2022 at 9:32 am, , , , Thank you Jessi! So happy you enjoyed it., , , Reply, , , , , , , , , , Linnea, , says, , , January 26, 2022 at 7:52 pm, , , , This was really good! My meat loving husband even said so!  We only used 3 cups broth which was plenty brothy for us. I wasn’t sure what cashew cream was (went looking for it), but found out how easy it was to make-and, yum! This soup is a definite winner!, , , Reply, , , , , , , , Claire Cary, , says, , , January 27, 2022 at 8:22 am, , , , The cashew cream recipe is linked in the recipe card, just click where it is listed!, , , Reply, , , , , , , , , , Lauren, , says, , , January 23, 2022 at 7:28 pm, , , , My meat eating, dairy loving boyfriend just said, “this is the best soup you’ve EVER made”. And I couldn’t agree more. Honestly underestimated this recipe bc I make a lot of tomato and bean based soups and they’re usually… just ok. But holy moly, this is freaking delicious. So much flavor. So glad I took the time to make the cashew cream too. I’ve already recommended to a few friends!, , , Reply, , , , , , , , Claire Cary, , says, , , January 26, 2022 at 4:44 pm, , , , Just made my day! Thanks so much Lauren!, , , Reply, , , , , , , , , , Kara, , says, , , January 21, 2022 at 12:10 pm, , , , This was delicious!! Perfect soup for a snow day., , , Reply, , , , , , , , shelly, , says, , , January 14, 2022 at 9:57 am, , , , Made this last weekend.  It is excellent.  I used 3 cups broth plus half can of beer (why not). I was also generous with the spices, added smoked paprika and about 3 Tbs of nutritional yeast.  The cashew cream is a must.  We used some of the leftover soup on top of baked potatoes for an easy weeknight meal.  Definitely adding to the rotation., , , Reply, , , , , , , , Tanya, , says, , , January 11, 2022 at 8:05 pm, , , , This was so tasty! I doubled the amount of chili powder based on preference and used regular cream because that is what I had – loved this meal and overall super easy to make !, , , Reply, , , , , , , , Carly, , says, , , January 2, 2022 at 3:17 pm, , , , Just made this and I absolutely love it! I added a vegan chick’n bouillon cube to make it feel a little more like a chicken tortilla soup and let the spices simmer with the vegetables before adding the tomatoes and everything else and it’s delicious! I did have to add green lentils instead of red but they’re just fine. Saving this and adding it to my favorites!, , , Reply, , , , , , , , Kim, , says, , , December 8, 2021 at 6:58 pm, , , , Made this tonight and my husband loved it! Could not click the link for the cashew cream but still was great without it. Will be a staple in this house.. Thank you!, , , Reply, , , , , , , , Jenn, , says, , , December 1, 2021 at 10:12 am, , , , Made this for the family last night. I skipped the cashew cream as I just didn’t feel like making it. Added a couple tablespoons of nutritional yeast and a little extra broth. It was huge hit! Everyone licked their bowls clean and went back for seconds. Definitely a keeper!, , , Reply, , , , , , , , Sara, , says, , , November 30, 2021 at 6:03 pm, , , , I have made this twice now, it has been amazing both times. Followed recipe exactly. My co workers have all requested this for weeks and weeks. Finally made a double batch for them! They are in heaven! Great recipe! The cashew cream and sugar make this recipe a game changer., , , Reply, , , , , , , , Claire Cary, , says, , , December 1, 2021 at 9:45 am, , , , Amazing! So glad it’s been a hit!, , , Reply, , , , , , , , , , Patty, , says, , , November 20, 2021 at 8:18 pm, , , , Soup is delicious. The cashew cream adds richness., The heat of the chili peppers does not come from the seeds. It is co rained in the white ribbing. It’s called capsaicin., I also added a 15 oz can of hominy to the soup., , , Reply, , , , , , , , Angela R, , says, , , November 14, 2021 at 1:11 pm, , , , I made this in the crockpot. Made a couple substitutions with what I had on hand. Instead of red lentils I used green, and instead of jalapeño I used green bell pepper and added some chipotle powder. Delicious! I will definitely be making this again and again., , , Reply, , , , , , , , Claire Cary, , says, , , November 15, 2021 at 9:19 am, , , , Delicious! Glad it worked with those subs!, , , Reply, , , , , , , , , , Lesley, , says, , , November 10, 2021 at 2:24 pm, , , , This is really good! You, need to make this!, , , Reply, , , , , , , , Mel, , says, , , November 1, 2021 at 8:46 pm, , , , Don’t hesitate. Just make the soup. One of the best tortilla soups I’ve ever had! 3 cups of vegetable broth is perfect:), , , Reply, , , , , , , , Claire Cary, , says, , , November 2, 2021 at 9:37 am, , , , Thank you Mel! So glad to hear you’re enjoying it!, , , Reply, , , , , , , , , , Sonya, , says, , , October 30, 2021 at 11:12 am, , , , Hello, but that should be about right. let me know if you try it!, , , Reply, , , , , , , , , , Kate, , says, , , October 21, 2021 at 12:53 pm, , , , The cashew cream link isn’t working for me on multiple browsers, just thought I’d update on that! Can’t wait to make this tonight 🙂, , , Reply, , , , , , , , Claire Cary, , says, , , October 23, 2021 at 12:17 pm, , , , Thanks for pointing that out, should be ok now!, , , Reply, , , , , , , , , , Becca, , says, , , September 30, 2021 at 8:54 pm, , , , Holy crap, this is amazing! New favorite at our house, so rich and creamy. Made it exactly as written w/3 cups broth and it is seriously the best soup ever. Thank you!, , , Reply, , , , , , , , Claire Cary, , says, , , October 4, 2021 at 4:30 pm, , , , Thank you Becca! So happy you enjoy it!, , , Reply, , , , , , , , , , Steffani, , says, , , September 30, 2021 at 3:58 pm, , , , I made this the other night and it was delicious! My boyfriend and I are not vegan, but we are trying to eat more veggies, so recipes like this make it easy! I used coconut cream instead of cashew cream and I didn’t blend at the end because I didn’t want to dirty my blender for either, but it turned out fantastic! I used 1/2 onion, 1/2 green bell pepper, and 1/2 orange bell pepper because that is what I had on hand as well. Then I added a can of sliced potatoes because I love potatoes. Topped with sour cream, olives, avocado, and hand-fried tortilla strips. This will be a staple in our house for sure!, , , Reply, , , , , , , , Claire Cary, , says, , , October 4, 2021 at 4:31 pm, , , , Perfect! So glad it worked with those subs!, , , Reply, , , , , , , , , , Emily, , says, , , September 19, 2021 at 3:59 pm, , , , I have dried green split peas, can that be used in place of lentils?, , , Reply, , , , , , , , Claire Cary, , says, , , September 20, 2021 at 7:33 am, , , , I don’t recommend that! It will change the flavor/liquid ratio needed for the recipe., , , Reply, , , , , , , , , , Sable, , says, , , August 18, 2021 at 6:01 am, , , , Hello, In Germany and there is no Fire roasted anything good here. Alternative?, , , Reply, , , , , , , , Claire Cary, , says, , , August 18, 2021 at 12:24 pm, , , , just regular canned tomatoes will be fine!, , , Reply, , , , , , , , , , Christie, , says, , , May 19, 2021 at 8:20 am, , , , Excellent!! Will be making over and over!!, , , Reply, , , , , , , , Jennifer Jacobs, , says, , , April 17, 2021 at 11:33 pm, , , , Really rich, really yummy. The red lentils are a great addition., , , Reply, , , , , , , , Cori, , says, , , March 29, 2021 at 9:33 pm, , , , So GOOD! I only had one can of roasted tomatoes, so I bumped up the coconut cream, vegetable broth, and tomato paste and it was still perfect. 100% recommend!, , , Reply, , , , , , , , Carly Hadley, , says, , , March 18, 2021 at 6:35 pm, , , , The soup is delicious, , , Reply, , , , , , , , Claire Cary, , says, , , March 18, 2021 at 6:54 pm, , , , So happy you enjoyed it! And thank you for the feedback, the recipe card is now updated and in an easier to follow order 🙂 Hope that helps!, , , Reply, , , , , , , , , , Erin, , says, , , March 8, 2021 at 2:56 pm, , , , Best tortilla soup ever! We kept it thick and used tortillas to dip and eat. Savory Cashew crema is a Must!, , , Reply, , , , , , , , Claire Cary, , says, , , March 8, 2021 at 10:10 pm, , , , yum, sounds perfect! So happy you enjoyed it!, , , Reply, , , , , , , , , , Carla @ Foodie Digital, , says, , , January 24, 2021 at 6:23 pm, , , , The whole family loved this! It came together really quickly, even with all of the toppings (don’t skip the cashew cream!). The addition of red lentils is so smart – they boost the nutritional profile and nobody could even tell they were in there., , , Reply, , , , , , , , Claire Cary, , says, , , January 24, 2021 at 7:31 pm, , , , The cashew cream is a must! So happy you all enjoyed this, thanks Carla!, , , Reply, , , , , , , , , , katie, , says, , , January 11, 2021 at 12:16 am, , , , my gf made this soup using this recipe and it was to die for!! love love love it, it’s now a favorite in our household 🙂, , , Reply, , , , , , , , Claire Cary, , says, , , January 11, 2021 at 7:00 pm, , , , Love to hear that!! It’s a favorite over here too 🙂, , , Reply, , , , , , , , , , Alysia, , says, , , January 11, 2021 at 12:11 am, , , , So good!! Super easy to make. Very flavorful and filling! & sooooo tasty, going to be making this a lot. Thank you for sharing the recipe!, , , Reply, , , , , , , , Claire Cary, , says, , , January 11, 2021 at 7:00 pm, , , , Yes! It’s going to be on repeat all winter!, , , Reply, , , , , , , , , , Telina, , says, , , January 10, 2021 at 9:40 am, , , , AMAZING, , I didn’t have cashews so I just used oat milk. Next time I’ll try the cashew cream., Totally hit, I’m glad I had leftovers., , , Reply, , , , , , , , Claire Cary, , says, , , January 10, 2021 at 1:34 pm, , , , Perfect! So happy you enjoyed it, thanks Telina!, , , Reply, , , , , , , , Welcome,, I’m Claire, , Eat With Clarity is a place for gluten free recipes that are just as good as the real thing. With plenty of vegan, vegetarian and paleo options, there is something here for everyone!, , Read Claire’s Story, , , , , , , , , you’ll also love, , , , , , Gluten Free Chicken Tortilla Soup, Instant Pot Lentil Soup, Easy Vegan Lentil Bolognese, Vegan Red Lentil Curry, Red Lentil Dahl, Mediterranean Lentil Salad, , , , , , , get more, clarity, , , , Name, (Required), Email, (Required), , , , , , , , , , , , , , , , , Δ, , , , , More, , About, , eBook, , Disclaimer, , Privacy, , Services, , , Recipes, , Recipe Index, , Breakfast, , Desserts, , Dinner, , Drinks, , , As Seen In, , Buzzfeed, , Yahoo!, , Well + Good, , Parade, , Self, , , , , , Site by, Katelyn Gambler, &, Made To Thrive, , COPYRIGHT © 2021 · EAT WITH CLARITY, LLC. ALL RIGHTS RESERVED., , , , , , , , Recipes, Dinner, ▼, Beef, Chicken, Seafood, Dessert, ▼, Cakes & Cupcakes, Chocolate, Cookies, Ebook, About, ▼, About Claire, Work With Me, Shop, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: In a large pot or, dutch oven, , add the finely diced onion and olive oil. Saute for about 5 minutes., Add in the minced garlic, diced bell pepper, and diced jalapeno. If you want less spice, just remove the seeds from the jalapeno or use less., Saute for about 3 extra minutes, then add in the tomato paste and saute an additional 2 or so minutes., , , Reply, , , , , , , , Claire Cary, , says, , , November 2, 2021 at 9:39 am, , , , I have not made this in an instant pot yet, using the saute function",
        "Minestrone Soup": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., MINESTRONE SOUP, SERVES: 8 (approx. 1 cup each)   Prep Time: 15 min.   Cooking Time: 23 min., CONTAINER EQUIVALENTS (per serving):, 1½, ½, ½, 2 tsp., , olive oil, 1⁄3 cup, , finely chopped onion, , (approx. ½ medium), 1 cup, , chopped carrots, , (approx. 2 medium), 1 cup, , chopped celery, , (approx. 2 medium stalks), 1 clove, , garlic, finely chopped, 6 cups, , low-sodium organic, , vegetable broth, 1 (28-oz.) can, whole peeled tomatoes, crushed, , (preferably San Marzano), 1 lb., , Swiss chard, stems trimmed, , , leaves chopped, 1 (15-oz.) can, cannellini beans, drained, , , rinsed, ½ tsp., , sea salt (or Himalayan salt), ½ tsp., , ground black pepper, 8 tsp., , grated Parmesan cheese, 8 tsp., , chopped fresh flat leaf (Italian), , parsley, 1. \t Heat oil in large saucepan over medium heat., 2. \t Add onion, carrots, and celery; cook, stirring frequently, for about 5, minutes, or until onion is translucent., 3. \t Add garlic; cook, stirring frequently, for 1 minute., 4. \t Add broth and tomatoes. Bring to a boil., 5. \t Add chard; gently boil, stirring occasionally, for 6 minutes., 6. \t Add beans; cook, stirring occasionally, for 2 minutes. Season with salt and, pepper., 7. \t Evenly divide soup into eight serving bowls. Serve immediately sprinkled, with 1 tsp. cheese and 1 tsp. parsley each., NUTRITIONAL INFORMATION (per serving): Calories: 128  Total Fat: 2 g  Saturated Fat: 1 g  Cholesterol: 2 mg  Sodium: 444 mg  Carbohydrates: 20 g  Fiber: 6 g, Sugars: 7 g  Protein: 6 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: "
    }
}