{
    "ingredients": {
        "Rava Idli": "carrot,chana dal,coriander,dahi,yogurt,ginger,rava,yogurt,",
        "Millet Idli": "barnyard millet,urad dal",
        "Sabudana Idli": "sabudana, ghee,mustard seeds,urad dal,chana dal,green chili,cashews,carrot,suji, dahi",
        "Tomato Idli": "ghee,urad dal,chana dal,curry leaves,cashews,rava,mustard seeds,onion,tomato",
        "Millet Coconut Idli": "millet,rolled oats,fresh coconut,carrot,coriander,green chili,baking soda",
        "Vegetable Idli": "suji,dahi,carrot,green peans,green beans,capsicum,ghee,baking soda",
        "Palak Idli": "coconut,coriander,dahi,yogurt,garlic,ginger,rava,spinach,urad dal,",
        "Carrot Idli": "idli batter,carrot",
        "Instant Oats Idli": "carrot,coriander,dahi,yogurt,ginger,rava,urad dal,yogurt,",
        "Chana Dal Idli": "chana dal,rice or millet",
        "Tangy Tomato Idli": "semolina,tomato,sour dahi,green peas,carrot",
        "Moong Dal Idli": "carrot,chana dal,coriander,dahi,ginger,yogurt,",
        "Quinoa Idli": "quinoa,idli rice,urad dal",
        "Methi Dosa and Idli": "methi,rice,",
        "Oats Rava Idli": "coconut,coriander,dahi,yogurt,ginger,rava,",
        "Uttapam Pizza": "capsicum,onion,",
        "Spicy Tava Idlis": "coriander,garlic,onion,tomato,",
        "Vermicelli Nut Idli": "coconut,dahi,yogurt,rava,urad dal,vermicelli,",
        "Kodo Millet Idli": "kodo millet,urad dal,poha",
        "Kancheepuram Idli": "chana dal,coconut,corn,ginger,methi,poha,rice,urad dal,",
        "Curd Idli": "dahi,yogurt,yogurt,"
    },
    "recipe_url": {
        "Rava Idli": "https://www.indianhealthyrecipes.com/rava-idli-recipe/",
        "Millet Idli": "https://rakskitchen.net/barnyard-millet-idli-dosa-millet-idli-dosa-recipe/",
        "Sabudana Idli": "https://www.facebook.com/watch/?ref=saved&v=946162089121888",
        "Tomato Idli": "https://www.facebook.com/watch/?ref=saved&v=2540043519625756",
        "Millet Coconut Idli": "https://www.youtube.com/watch?v=jiwD9EiWtpE",
        "Vegetable Idli": "https://www.facebook.com/watch/?ref=saved&v=2857623244557403",
        "Palak Idli": "https://www.tarladalal.com/palak-rava-idli-recipe-42500r",
        "Carrot Idli": "https://southindianfoods.in/easy-carrot-idli-tamilnadu-style-breakfast-and-dinner-recipe.html",
        "Instant Oats Idli": "https://www.indianhealthyrecipes.com/oats-idli-recipe/",
        "Chana Dal Idli": "https://mytastycurry.com/chana-dal-idli-recipe-my-breakfast-table-mtcnashta",
        "Tangy Tomato Idli": "https://www.betterbutter.in/recipe/136413/tangi-tomato-idli/",
        "Moong Dal Idli": "https://hebbarskitchen.com/moong-dal-idli-recipe-green-gram-idli/",
        "Quinoa Idli": "https://www.sharmispassions.com/quinoa-idli-recipe-soft-quinoa-idli-recipe/",
        "Methi Dosa and Idli": "https://hebbarskitchen.com/methi-dosa-recipe-vendhaya-dosa/",
        "Oats Rava Idli": "https://www.tarladalal.com/oats-rava-idli-39009r",
        "Uttapam Pizza": "https://www.tarladalal.com/uttapam-pizza-22654r",
        "Spicy Tava Idlis": "https://www.tarladalal.com/spicy-tava-idlis-1669r",
        "Vermicelli Nut Idli": "https://www.tarladalal.com/vermicelli-nut-idli-1704r",
        "Kodo Millet Idli": "https://www.smithakalluraya.com/kodo-millet-idli-dosa-recipe-varugu-idli-dosa-millet-recipes/",
        "Kancheepuram Idli": "https://www.tarladalal.com/kanchipuram-idli-kancheepuram-idli-kovil-idli-1702r",
        "Curd Idli": "https://www.archanaskitchen.com/thayir-idli-recipe-south-indian-idli-in-tempered-curd"
    },
    "Recipe": {
        "Rava Idli": "Ingredients: , Table of contents, About Rava Idli, , , Rava, also known as semolina is the key ingredient. You will use fine semolina also known as Bombay rava or upma rava. Avoid using thick semolina like dalia or whole wheat rava., , Curd, also known as Indian yogurt is used. If you want to use Greek yogurt dilute half cup with 1/4 cup water. Also make sure your yogurt is not too sour or tart else your rava idli will have the strong smell of yogurt., , Leavening Agent:, Soda bicarbonate (baking soda) or fruit salt also known as Eno is used to make the steamed cakes airy. If you omit these your rava idlis will turn out dense but they will still be edible., , like mustard, cumin, curry leaves, ginger and green chilies add flavor. The recipe works even without the tempering, just that your steamed cakes may lack flavor., , add a nutty flavor and texture., , , , Photo Guide, , To Temper, ▢, 1, , cup, , semolina, , (bombay rava/ suji/ chiroti rava), ▢, 2, , tablespoon, , ghee, ▢, ½, , teaspoon, , mustard seeds, ▢, ¼, , teaspoon, , cumin seeds, ▢, ½, , tablespoon, , chana dal, , /bengal gram, ▢, 1, , tablespoon, , cashews, , chopped (optional), ▢, 10, , curry leaves, ▢, 2, , green chilies, , chopped (skip if making for kids), ▢, ¾, , teaspoon, , ginger, , grated or paste, ▢, ⅓, , teaspoon, , sea salt, , (or use as needed), ▢, 2 to 3, , tablespoon, , coriander leaves, , chopped finely, ▢, ¾, , cup, , curd/ yogurt, , (or ½ cup diluted with ¼ cup water), ▢, ½, , cup, , water, , to soak rava (+ 2 to 3 tbsps to adjust the consistency), ▢, 1, , teaspoon, , lemon juice, , (omit if using eno), ▢, 1, , teaspoon, , Eno or fruit salt, , or ¼ tsp Soda bicarbonate, ▢, 1, , teaspoon, , oil, , to grease idli plates, ▢, 4, , whole cashewnuts, , or 8 split, ▢, 1, , teaspoon, , carrot, , grated optional, , , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Manju, , , , February 3, 2024 12:31 am, , , , , , Hi Manju, Instructions: Sagu for Rava idli, Expert Tips, Recipe Card, , , The thick batter is then poured to moulds and steamed in a steamer or a cooker. During this process the leavening agent reacts with the yogurt and cooks them up to super soft, fluffy and airy rava idlis. Here yogurt and the leavening agent help to bypass the lengthy traditional process of soaking, grinding and fermenting., , The recipe shared here will give you delicious, soft & light Rava Idlis all without the flavor of curd or soapy taste of soda in it. If you have ever wondered how the Rava Idli from MTR tastes so delicious & good with a light texture then this recipe is a must try. In this post I have also shared the recipe to make potato sagu that is usually served with the rava idli in hotels. You can find it after the step-by-step photos., , , Preparation, , 1. Heat 2 tablespoons ghee in a pan or kadai. Fry 8 split cashews until golden. Remove to a plate and set aside. To the same pan, add ½ teaspoon mustard seeds, ¼ teaspoon cumin seeds, ½ tablespoon chana dal and 1 tablespoon chopped cashews. Saute until the dal turns golden., , 2. Lower the heat. Add 1 sprig chopped curry leaves, 2 chopped green chilies and ¾ teaspoon grated ginger. Saute for 30 seconds until the ginger smells good., , , , 3. Immediately add 1 cup rava/ semolina and begin to mix well. On a low flame fry the rava until crunchy and lightly aromatic. Do not brown the rava. Cool this completely. You can also store the cooled rava idli mix in a jar for further use., , , , Make the Instant Batter, , 4. Add, , , 2 to 3 tablespoons chopped coriander leaves, , 1/3 teaspoon sea salt (or any other)., , ¾ cup fresh curd/ yogurt. I use homemade runny curd. If you are using thick store bought yogurt or Greek yogurt, mix together ½ cup yogurt with ¼ cup water and use., , , , , 5. Mix well and pour half cup water., , , , 6. Mix well. Cover this and rest for 30 mins., , , , Prepare the Steamer & Idli Plates, , 7. After 25 minutes, add few drops of ghee or oil to each idli plate/ mould. Grease the plates lightly and arrange a cashew on each mould. Sprinkle some grated carrots. Keep these aside., , , , 8. Pour water to a cooker or steamer or pot or instant pot as you would do for regular idli., , , To steam in Pot or cooker or steamer:, I use 2 to 2.5 cups water in my pot. After 25 to 30 mins of soaking the rava, bring the water to a boil., , To steam in Instant pot:, I pour 1.5 cups water and bring to a rolling boil on a saute mode. I also cover with a external lid to quicken the process., , , 9. After 30 mins of soaking, semolina absorbs some moisture and turns almost dry. Pour 1 to 3 tablespoons water as needed to bring the batter to a consistency. I used about 3 tablespoons but every time it varies by 1 to 2 tablespoons depending on the thickness of yogurt and the kind of rava., , , , 10. Rava idli batter consistency should be thick and smooth as you see in the picture. When you drop the batter with the spoon it must be smooth on top and not lumpy. It should not be of pouring consistency either. It must be like idli batter. Check video to know the right consistency., , , , Steam Rava Idli, , 11. Skip this step if using eno. Add 1 teaspoon lemon juice to the batter and give a good mix. This will not make the rava idli sour. But is used to activate the soda., , , , 12. When the water in the steamer is turning hot then add 1 teaspoon eno or ¼ teaspoon soda-bi-carbonate to the batter. Mix gently a few times to incorporate the soda into the batter., , , , 13. Quickly pour this to the moulds. Do not let the batter rest after mixing eno/ soda. This recipe will give you 8 rava idli., , , , 14. Place the idli stand in the steamer and steam for 10 minutes on a high flame. The water must be boiling and steaming well at all times. When done, a skewer inserted comes out clean or with little crumbs., , To steam in Instant pot, : Once the water comes to a rolling boil, Place the idli stand in the instant pot. Press cancel. Secure the lid and position the steam release handle to venting. Steam for 11 to 12 mins., , , , 15. Allow to cool down for about 3 to 4 mins. With the help of a moist spoon demould the rava idli. Serve rava idli with coconut chutney or potato sagu. I have shared the recipe to make potato sagu below the recipe card., , , , Sagu for Rava idli, , , 2 medium potatoes, , 1 medium onion sliced, , 2 green chilies, , 1 tsp besan, , ¼ cup water to mix besan, , 1 tbsp oil, , ¼ tsp mustard seeds, , ¼ to ½ tsp cumin, , ½ tsp split urad dal, , 1 pinch hing/ asafoetida, , 1/8 to ¼ tsp turmeric, , 1 sprig curry leaves, , 1 tbsp coriander leaves chopped finely, , , Preparation, , Boil potatoes in a pressure cooker. If cooking in a pressure cooker, dice them to 1 ½ cubes and cook them with ¾ cup water for 1 whistle. If cooking in an Instant pot, then place them in a bowl and pressure cook for 5 mins. When the pressure releases naturally, open the lid. Potatoes must be fully cooked. Set aside., , How to make sagu for rava idli, , , Heat oil in a pan and add mustard and cumin. When they splutter, add hing, curry leaves and green chilies. Add onions and fry until transparent. Do not brown them., , Add turmeric and salt. Pour water just to bring it to a consistency. I use the ¾ cup water in which I boiled the potatoes. Bring it to a boil., , Meanwhile stir in besan with ¼ cup water. Break the lumps and make it a smooth mixture. When the water begins to boil, pour this gently and give a good stir. You can add more water as needed to cook this. Let the mixture cook and thicken., , Meanwhile mash the boiled potatoes keeping small chunks here and there. Add it to the sagu and mix well. Add more water if needed. When it comes to a boil, turn off., , The consistency should be slightly runny as it will thicken when it cools down. Rava idli sagu is not very thick. It should also have some water in it so it is suitable to serve with rava idli. Add coriander leaves and taste test it. Add more salt if needed., , , Notes:, This sagu should have more flavor of aloo and less of the besan. However if you prefer more, you can stir in more besan with some more water and pour it. You may add ½ tsp grated ginger to the tempering but most times you won’t find that flavor in the hotels., , More Instant breakfast recipes, Akki roti, Wheat dosa, Upma recipe, Poha recipe, Eggless pancake recipe, , Expert Tips, , , Roasting semolina or rava, on a low to medium flame until aromatic without changing the color, is the key to prevent them from turning sticky., , The right amount of curd and soda or eno, are the key to making the best rava idli. The leavening agent makes them light & fluffy so do not omit if possible., , I have followed the same rule of using ¼ tsp soda or eno to 1 cup of flour, in this case it is 1 cup of rava. It doesn’t leave a soapy taste as ¾ cup of curd & 1 tsp lemon juice is used to activate the soda., , Do not reduce the amount of ghee or oil, in the recipe as it is very important. With reduced amount of fats, they turn out sticky., , , , Related Recipes, , Idli Recipe (Idli..., , , Coconut Chutney R..., , , Upma Recipe, , , Rava Dosa Recipe ..., , , Masala Dosa Recip..., , , Medu Vada Recipe ..., , , , , Recipe Card, , , , , , Rava Idli Recipe, , , 4.98, from, 267, votes, , , , Instant rava idli are a breakfast food made with semolina, curd, herbs and basic spices. These soft, fluffy rava idlis are great to enjoy with a chutney & potato sagu. Rava idli are very popular in the tiffin centers of karnataka., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 20, minutes, , minutes, Cook Time, 10, minutes, , minutes, Resting, 30, minutes, , minutes, Total Time, 30, minutes, , minutes, , Servings, 8, , rava idli, , Author, Swasthi, , , , Preparation, ▢, Heat 2 tablespoons ghee in a pan and fry the cashews until light golden. Remove to a plate and reserve aside., ▢, Add mustard, cumin, broken cashews and chana dal. Fry until the dal turns golden. Reduce the flame and add curry leaves, green chilies and ¾ teaspoon ginger., ▢, Saute just for 30 seconds and stir in the rava. Mix well and roast on a low to medium heat until crunchy and aromatic (about 5 mins). Cool completely., Make Instant batter, ▢, Once cooled, add salt, coriander leaves, curd and water. Mix well to form a batter and rest for 30 mins., ▢, After 25 mins, grease the moulds and place a cashew in each of the moulds. Sprinkle some carrots., How to Make Rava Idli, ▢, Bring 2 cups water to a boil in a steamer or cooker. (or use 1.5 cups in IP). Meanwhile check the consistency of batter. If it is too thick sprinkle 1 to 2 tbsps water and mix., ▢, The batter consistency should be thick, of dropping consistency not pouring consistency. Stir in lemon juice and soda bicarbonate. If using eno, use only eno and omit lemon juice., ▢, Give a gentle mix and avoid overmixing. Divide the batter to idli moulds. (I get 8 portions in mine), ▢, Place the idli stand in the hot steamer and cover. Steam for 10 mins on a high flame. A tester or a fork inserted into the center comes out clean if it is well cooked., ▢, Cool down for 3 to 4 mins, demould them with a wet spoon., ▢, Serve rava idli with, coconut chutney, or potato sagu (recipe in the post)., , , , Video, , , , NUTRITION INFO (estimation only), , Nutrition Facts, , Rava Idli Recipe, , , Amount Per Serving, , , Calories, 150, , Calories from Fat 54, , , , , % Daily Value*, , , Fat, 6g, 9%, Saturated Fat 2g, 13%, Cholesterol, 9mg, 3%, Sodium, 140mg, 6%, Potassium, 59mg, 2%, Carbohydrates, 17g, 6%, Fiber 1g, 4%, Protein, 5g, 10%, , , Vitamin A, 165IU, 3%, Vitamin C, 26.6mg, 32%, Calcium, 38mg, 4%, Iron, 1.4mg, 8%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 19.7K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 4.98 from 267 votes (, 190 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 208, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Lata, , , , , , March 20, 2025 2:20 pm, , , , , , This recipe is a good way to use excess yogurt. I made rava idli for the first time and we loved them. Thank you, , , , , , Reply, , , , , , , , , , , Mitty Mohanty, , , , , , January 10, 2025 2:48 pm, , , , , , Would you please gsend me your dal chutney, green and tomato chutney recipe,, , , , , , Reply, , , , , , , , , , , Kumari, , , , , , November 2, 2024 4:51 am, , , , , , I have made your rava idli many times and love them. I plan to make these for a small gathering and wondering if I can make the batter ahead to refrigerate. Is there anything I should be knowing? TIA, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Kumari, , , , November 2, 2024 5:13 am, , , , , , Yes you can make it ahead and refrigerate for a day. Keep it out on the counter for sometime and add eno/ baking soda just before steaming. Also steam for a little longer because you will use cold batter., , , , , , Reply, , , , , , , , , , , Mithuna, , , , , , July 30, 2024 12:26 pm, , , , , , Thanks for the recipe! I tried it, and it turned out tasty and wonderfully soft., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Mithuna, , , , July 30, 2024 12:36 pm, , , , , , Glad you like it Mithuna. Thank you, , , , , , Reply, , , , , , , , , , , Sai, , , , , , June 24, 2024 8:11 am, , , , , , Very nice recipe, I make for breakfast and it’s very easy also. Thanks, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sai, , , , November 2, 2024 5:13 am, , , , , , Glad you like them. Thanks for sharing back, , , , , , Reply, , , , , , , , , , , Anu, , , , , , May 27, 2024 11:07 am, , , , , , Hallo, by 1 cup suji you mean 1 cup by volume, right? About 120g, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Anu, , , , May 27, 2024 11:30 am, , , , , , Hello,, 1 cup rava weighs 160 grams, , , , , , Reply, , , , , , , , , , , Hema, , , , , , March 11, 2024 4:50 pm, , , , , , Tried the recipe and it turned out to be too good..thank you, , , , , , Reply, , , , , , , , , , , Nilisha, , , , , , March 4, 2024 8:57 am, , , , , , Made it yesterday, came out uber soft and so delicious and my family loved that addition of cashew. Thankyou so so much for making our day ., , , , , , Reply, , , , , , , , , , , Manju, , , , , , February 2, 2024 7:38 pm, , , , , , Hi Swasthi, , , , , , Reply, , , , , , , , , , , Bhargavi, , , , , , December 20, 2023 12:26 am, , , , , , Hi Swasthi, I made these for my potluck and the item was a super-duper hit! Thank you so much!, , , , , , Reply, , , , , , , , , , , usha B Rao, , , , , , November 26, 2023 12:03 am, , , , , , Thank you so much for the recipe. Never thought it could be so easy as you made it to be., , , , , , Reply, , , , , , , , , , , Pam Sadasivam, , , , , , September 16, 2023 1:35 am, , , , , , Thank you Swasthi.  Excellent recipe for Rava idly. I followed every step of the recipe and it turned out great and I got very soft and delicious idli.  I’m sharing this AMAZING recipe with my friends as well. Thanks once again., , , , , , Reply, , , , , , , , , , , Raghuvardhan, , , , , , April 19, 2023 9:57 am, , , , , , Basically I love any kind of idlis but these rava idli are very close to my heart because I learnt making them from this recipe during the lockdown. They turn out very soft and delicious better than restaurants. I have made these so many times in the last few years and now I regret for not writing a review. Thank you for teaching us how to cook. I also made many recipes from this website and always come out good., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Raghuvardhan, , , , April 20, 2023 2:15 am, , , , , , Happy to know you like these rava idlis. Thanks for trying the recipes, , , , , , Reply, , , , , , , , , , , Sreedevi, , , , , , March 14, 2023 7:44 am, , , , , , Thank you for this awesome recipe. Idlis came out so well., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sreedevi, , , , March 31, 2023 4:13 am, , , , , , Glad to know Sreedevi, , , , , , Reply, , , , , , , , , , , Ankita, , , , , , March 4, 2023 12:56 pm, , , , , , Thank you rava idlis turned out delicious. Many years ago I had these rava idli in a udupi restaurant and also ate them at many different places. But couldn’t find them as delicious as the first restaurant. This recipe helped me make exactly like that. Rava idlis were very fluffy, soft and delicious., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ankita, , , , March 31, 2023 4:19 am, , , , , , So glad to know the recipe worked well for you Ankita. Thank you so much for sharing back how they turned out for you, , , , , , Reply, , , , , , , , , , , Shwetha, , , , , , January 29, 2023 2:12 am, , , , , , I tried this rava idli recipe with semolina flour. They were still fluffy and turned out delicious. Next time I plan to add some grated carrots in the batter. Thank you., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shwetha, , , , February 13, 2023 10:30 am, , , , , , Happy to know Shwetha. Thanks for sharing how you made it., , , , , , Reply, , , , , , , , , , , Meena, , , , , , January 25, 2023 2:49 pm, , , , , , This is an amazing recipe Swasthi. My kids who are generally not fans of idli, loved these rava idlis with your sagu. Thank you., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Meena, , , , January 29, 2023 5:33 am, , , , , , Glad to know Meena. Thank you for trying the recipe, , , , , , Reply, , , , , , , , , , , Mona, , , , , , January 10, 2023 7:48 pm, , , , , , Hi Swasthi, can this be made plain without mustard/curry leaves etc? My child likes plain idlis., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Mona, , , , January 11, 2023 12:36 am, , , , , , Hi Mona,, Yes you can make it with out them. But don’t skip the ghee., , , , , , Reply, , , , , , , , , , , Aruna Charles, , , , , , Reply to, Mona, , , , December 31, 2023 2:41 am, , , , , , Good information to improve knowledge,thank you., , , , , , Reply, , , , , , , , , , , Sadhana, , , , , , January 7, 2023 2:08 pm, , , , , , Thanks for the excellent recipe. I prepared yesterday and the idli came out perfect. I made tomato chutney to go with the idli. I will for sure be making them again., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sadhana, , , , January 29, 2023 5:34 am, , , , , , Glad to know the idlis came out perfect. Thank you so much Sadhana, , , , , , Reply, , , , , , , , , , , Radhika, , , , , , January 31, 2022 3:02 pm, , , , , , The first time I made these I was surprised. Fluffy, soft and better than what I ate in restaurants. Thank you for the amazing recipe., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Radhika, , , , February 13, 2023 10:30 am, , , , , , Glad you like them Radhika. Thank you!, , , , , , Reply, , , , , , , , , , , Nick, , , , , , November 6, 2022 5:40 pm, , , , , , Hi Swathi,, , I have been blindly following up all your recipes and never ever have to worry. My wife and family enjoyed every time and can’t thank you enough., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Nick, , , , January 29, 2023 5:34 am, , , , , , Hi Nick,, Thank you so much for the trust., , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Millet Idli": "Ingredients: 2, , cups, , Barnyard millet, ½, , cup, , Urad dal, , whole, white, ¼, , teaspoon, , Methi/ vendhayam/ fenugreek seeds, , Optional, Salt, , Cook Mode, Prevent your screen from going dark,  Instructions: Soak both millet and urad dal (with methi seeds) separately for 3 hrs. I kept urad dal in fridge for an hour after 2 hrs of soaking.  This prevents the mixier jar getting heated. Also more volume of batter., First grind urad dal, adding water little by little. The consistency should be like a thick cream, it need not be stiff but light and airy. You can see the bubbles in the picture below. I use ice cold water to grind urad dal., Grind millet draining water almost completely. It may not need water so add carefully otherwise will become watery. You can add salt along with millet while grinding., Mix both the ground batter and keep overnight for fermentation. You can see the consistency below, just like regular idli dosa batter. Spoon to idli moulds to make idli., Or mix with little water and make dosa., , , Notes, , Since we grind in mixie, the batter will be runny before fermentation than the regular batter, but next day it should be okay., , Careful while adding water to millets while grinding. It may not need much., , Add water generously while grinding urad dal, the urad dal batter should not be stiff., , I didn’t add methi seeds. Still it was okay. But adding methi will help in better fermentation., , You can grind the same in grinder., , , , , Youtube, Do you like short videos?, Subscribe now!, , , , , , Instagram, Mention, @rakskitchen, or tag, #rakskitchen, if you have tried this recipe., , , 📸 Stepwise photos, , 1. Soak both millet and urad dal (with methi seeds) separately for 3 hrs. I kept urad dal in fridge for an hour after 2 hrs of soaking.  This prevents the mixier jar getting heated. Also more volume of batter., , , 2. First grind urad dal, adding water little by little. The consistency should be like a thick cream, it need not be stiff but light and airy. You can see the bubbles in the picture below. I use ice cold water to grind urad dal., , , 3. Grind millet draining water almost completely. It may not need water so add carefully otherwise will become watery. You can add salt along with millet while grinding., , , 4. Mix both the ground millet idli dosa batter and keep overnight for fermentation. You can see the consistency below, just like regular idli dosa batter. Spoon to idli molds to make idli., , , 5. Or mix with little water and make dosa., , , I loved both idli and dosa and both Vj, Aj could not find any difference., , , , Other Indian Breakfast & Dinner ideas, Bedmi Puri Recipe, Sabudana Thalipeeth Recipe, Oats chilla recipe, Bhatura Recipe | Softy & Fluffy Bhature, Comments, , , , , , Sundari Nathan, , says, , , December 19, 2014 at 9:38 am, , , , Healthy idli/dosa!! A must try .., , , Reply, , , , , , , , Veena Theagarajan, , says, , , December 19, 2014 at 10:35 am, , , , healthy idli.. I like it too, , , Reply, , , , , , , , Sarada, , says, , , January 27, 2020 at 3:24 pm, , , , How long can we store this batter?, , , Reply, , , , , , , , Raks Anand, , says, , , January 27, 2020 at 10:28 pm, , , , Couple of days in fridge. It gets fermented faster than regular ones I feel., , , Reply, , , , , , , , , , , , Divs, , says, , , December 19, 2014 at 11:38 am, , , , healthy and wholesome recipe. looks exactly if not better than the regular idli/dosa, , , Reply, , , , , , , , sujatha venkat, , says, , , December 19, 2014 at 12:43 pm, , , , Wow, healthy dish, my diet is millet varieties nowadays.  Now I can prepare idli too. Thanks, , , Reply, , , , , , , , Vimitha Anand, , says, , , December 20, 2014 at 4:06 am, , , , Thats a very healthy platter Raks, , , Reply, , , , , , , , nithya rajendran, , says, , , December 22, 2014 at 10:41 am, , , , That's a healthy idli/dosa recipe, will try this week, thanku Raks ., , , Reply, , , , , , , , Kathleen, , says, , , December 24, 2014 at 12:42 pm, , , , What did you eat it with?, , , Reply, , , , , , , , Prabha Hari, , says, , , January 13, 2015 at 10:29 am, , , , This is absolutel a healthy dish!!!!!, I luv this!!!!, Will it be soft even after the idli is cooled like the usual one we make with rice...?????, , , Reply, , , , , , , , Raks anand, , says, , , January 13, 2015 at 10:53 am, , , , Yes it was soft, , , Reply, , , , , , , , Rapabi, , says, , , January 21, 2015 at 3:12 am, , , , Loved it try and give u feed back.... Thanks a ton, , , Reply, , , , , , , , Suganya, , says, , , June 29, 2015 at 1:46 pm, , , , Can i try this with varagu instead of kuthiravaali?, , , Reply, , , , , , , , Raks anand, , says, , , June 29, 2015 at 2:02 pm, , , , Yes sure., , , Reply, , , , , , , , Nivedita Thadani, , says, , , April 20, 2017 at 1:35 am, , , , Raks, wow, its just mouthwatering. I am switching to millet, so was searching for the recipes and I got your recipes. cant wait to make it. thanks you., , , Reply, , , , , , , , Harini, , says, , , July 25, 2017 at 10:36 am, , , , Can I use little millet instead of barnyard millet?, , , Reply, , , , , , , , Salini, , says, , , February 01, 2025 at 10:27 am, , , , Hi .. I followed the same proportion but my dosa tasted bitter .may I know what went wrong ? What can I do ? Can I grind little poha and add to the batter ?, , , Reply, , , , , , , , Raks Anand, , says, , , February 03, 2025 at 12:12 am, , , , Hi, is the millet stock fresh? At times it is bitter when it turns too old. Also if it is not fermented properly, there will be mild bitterness. It should not be bitter, there can be a very very mild bitterness.You can add poha sure. I suggest try another batch with different brand, fresh stock of millet. Hope this helps, , , Reply, , , , , , , , , , , , Raks anand, , says, , , July 25, 2017 at 10:40 am, , , , Yes sure., , , Reply, , , , , , , , Sharmi, , says, , , November 29, 2017 at 12:20 pm, , , , Tried and loved it..., , , Reply, , , , , , , , Unknown, , says, , , April 25, 2018 at 8:14 am, , , , Can i use only varagu instead of barnyard millet, , , Reply, , , , , , , , Ahalya Manohar, , says, , , April 25, 2018 at 8:15 am, , , , My dosa turned out to be hard even after fermentation.. dint get this golden Color too.. what could have gone  wrong?, , , Reply, , , , , , , , Raks Kitchen, , says, , , April 25, 2018 at 9:26 am, , , , Sure., , , Reply, , , , , , , , Raks Kitchen, , says, , , April 25, 2018 at 9:27 am, , , , Mix a little more water and try., , , Reply, , , , , , , , Vanilla Sky, , says, , , November 29, 2018 at 12:02 am, , , , It was amazing!! Thanks for uploading this recipe. Have you tried with other millets? were they the same taste?, , , Reply, , , , , , , , Anuja Kapase, , says, , , March 27, 2020 at 2:12 am, , , , Do we need to coarse grind the millet...or we need to full grind the millet,???, , , Reply, , , , , , , , Raks Anand, , says, , , March 28, 2020 at 8:43 am, , , , I always grind smoothly. I feel grinding coarsely affects texture..., , , Reply, , , , , , , , , , Rev, , says, , , April 05, 2020 at 8:31 pm, , , , Hi take,, How many days we can keep this in fridge maximum pls?, , , Reply, , , , , , , , Raks Anand, , says, , , April 06, 2020 at 3:43 pm, , , , Two days, it gets sour fast., , , Reply, , , , , , , , , , Meera Rao, , says, , , October 28, 2020 at 12:56 pm, , , , Tried for  the first time., Excellent soft idilsand dosa  yummmy and golden brown, Thanks for the receipe, , , Reply, , , , , , , , Namitha, , says, , , April 25, 2021 at 10:47 am, , , , Can I mix two millets ..1 cup each of foxtail and little millet?, , , Reply, , , , , , , , Raks Anand, , says, , , April 25, 2021 at 8:27 pm, , , , Yes sure you can., , , Reply, , , , , , , , , , Namitha, , says, , , April 30, 2021 at 12:45 pm, , , , Thanks will try. I made it with little millet and it came out really well. The dosas were quite filling when compared to the normal rice dosas:), , , Reply, , , , , , , , Raks Anand, , says, , , May 01, 2021 at 1:08 pm, , , , , Reply, , , , , , , , , , Indu, , says, , , November 22, 2022 at 2:42 pm, , , , Can  black urad dal be used instead of whole white urad?if so what is the ratio to be used?, , , Reply, , , , , , , , Raks Anand, , says, , , November 24, 2022 at 8:46 pm, , , , For dosa you can use same ratio. for Idli I have not tried so, not sure about the ratio sorry., , , Reply, , , , , , , , , , Sarita Nair, , says, , , April 23, 2023 at 7:24 pm, , , , What is the size of your measuring cup ? How many grams millet it can hold ?, , , Reply, , , , , , , , Raks Anand, , says, , , April 24, 2023 at 7:39 pm, , , , Hi, My one cup holds 240 ml. Here's more details, https://rakskitchen.net/cup-measurements/, , , Reply, , , , , , , , , 5 from 17 votes (, 16 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , , , , Hi, I'm Rajeswari Vijayanand, , I am the person behind Rakskitchen, sharing recipes with pictures & videos., , , More about me, , , , Trending recipes, , Ugadi Pachadi Recipe, ABC juice recipe, Apple Beetroot Carrot juice, Rose milk recipe - With homemade rose syrup, Chandrakala recipe Chandrakala, suryakala sweet, , Tamil New Year Recipes, , Medhu vadai, Ulundu vadai recipe - With video, Masala vada, Masal vadai step by step recipe, Mango pachadi recipe, Manga pachadi, Veppam poo rasam recipe | Tamil new year recipes, , , , , Footer, , ↑ back to top, , , , Links, , , Privacy Policy, , FAQ, , , , , Also from Rakskitchen, , , Rakskitchen Tamil, , , , , Contact, , , [email protected], , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2025, Rakskitchen, , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Sabudana Idli": "Ingredients:  Instructions: ",
        "Tomato Idli": "Ingredients:  Instructions: ",
        "Millet Coconut Idli": "Ingredients:  Instructions: ",
        "Vegetable Idli": "Ingredients:  Instructions: ",
        "Palak Idli": "Ingredients: , , , , , , , , palak rava idli, is a delightful variation of the traditional, South Indian dish, , \", Rava Idli, .\" This idli is infused with the vibrant green color and earthy flavor of spinach (palak), making it not only visually appealing but also packed with additional nutrients., instant suji palak idli, is an instant idli recipe that requires no soaking and grinding. It is made with a batter of semolina and curds, perked up with an aromatic tempering, and reinforced with a vibrant spinach paste. A pinch of fruit salt helps to give the idli a soft texture and good mouth-feel., palak rava idli recipe, Rava, : The primary ingredient, rava, gives these idlis their texture and body. It's a type of coarsely ground wheat and is the base for the idli batter., Palak, (Spinach): Fresh spinach leaves are blanched and blended into a puree to infuse the idli batter with their color and nutrients. Spinach adds a mild, earthy flavor to the idlis., Curd, (Yogurt): Curd is used to add a slight tanginess to the idli batter and to make it soft and fluffy., Serve it hot with, sambar, and, chutney, . You can also try other idli recipes like, Moong dal idli, or, semolina vermicelle idli, ., pro tips to make palak rava idli, : 1. Grease the idli molds with oil to prevent the idlis from sticking. 2. You can also use chopped spinach instead of spinach puree to make this recipe. 3. Instead of fruit salt you can use baking soda to make this, palak rava idli recipe, . 4. Do not whisk the batter vigorously after adding fruit salt to the batter., Enjoy, palak rava idli recipe, |, instant suji palak idli, |, spinach rava idli, | with detailed step by step photos., , Palak Rava Idli Recipe recipe - How to make Palak Rava Idli Recipe, , , , , , , , Tags, , , , , Indian Steamer Recipes, , Indian Breakfast Recipes, , Breakfast Idlis / Dosas / Uttapam, , Indian Travel Food, , Indian Travel Food Idli, Dosa, Upma, , Indian Veg Recipes, , South Indian, , Different types of  Idlis, , , , , , , , , , , , , , , , , , , , Preparation Time, , 12 Mins, , , , , , , Cooking Time, , 20 Mins, , , , , , , Total Time, , 32 Mins, , , , , , , Makes, , 16 idlis, , , , , , , , , , , , , , , For Palak Rava Idli Recipe, , , 1 cup, semolina (rava / sooji), , , 1/2 cup, curd (dahi), , , 1/2 cup, spinach (palak) puree, , , 1 tsp, ginger-green chilli paste, , , 1 tsp, lemon juice, , , , salt, to taste, , 1 tsp, fruit salt, , , , For The Tempering, , , 2 tsp, oil, , , 1 tsp, mustard seeds ( rai / sarson), , , 1/2 tsp, urad dal (split black lentils), , , 1 tbsp, chopped cashew nut (kaju), , , , For Serving, , , , coconut chutney, , , , sambhar, , , , , , , , , , , , , , , , , , , , , , , , , , , how to make the tempering, , , , , , , , , To make, palak rava idli, , heat 2 tsp oil in a small pan., , , , , , Add 1 tsp, mustard seeds ( rai / sarson), . Mustard seeds has a pungent aroma and a distinct taste it also adds a bit of crunch to the dish., , , , , , Add ½ tsp, urad dal (split black lentils), ., , , , , , Sauté on a medium flame for 30 seconds., , , , , , Add 1 tbsp chopped, cashew nuts (kaju), . It adds a nutty flavor and crunch to the dish., , , , , , Sauté on a medium flame for 30 seconds., , , , , , , , , , , , , , , , , , , , how to make the idli batter, , , , , , , , , In a deep bowl, add 1 cup, semolina (rava / sooji), . Rava gives the idlis their structure and helps them to hold their shape., , , , , , Add ½ cup, curd (dahi), . Curd has a slightly sour and tangy flavor and it also helps to soften the idlis., , , , , , Add ½ cup, spinach (palak) puree, . Spinach puree gives the idlis a vibrant green color and also has many health benefits., , , , , , Add 1 tsp, lemon juice, ., , , , , , Add salt to taste., , , , , , Add ½ cup of water., , , , , , Mix well., , , , , , Add 1 tsp, ginger-green chilli paste, ., , , , , , Mix well., , , , , , Cover with a lid and keep aside for 15 minutes., , After 15 minutes, pour this prepared tempering over the batter., , , , , , Mix well., , , , , , , , , , , , , , , , , , , , how to make palak rava idli, , , , , , , , , Just before steaming, add 1 tsp, fruit salt, ., , , , , , Add 2 tsp of water over the batter., , , , , , When the bubbles form, mix gently., , , , , , Pour a little batter into each greased idli mould., , , , , , Steam in a steamer for 10 to 12 minutes or till the idlis are cooked., , , , , , Remove and cool them slightly and demould., , , , , , Serve, palak rava idli, hot with sambhar and coconut chutney., , , , , , , , , , , , , , , , , , , , pro tips to make palak rava idli, , , , , , , , , Grease the idli molds with oil to prevent the idlis from sticking., , , , , , You can also use chopped spinach instead of spinach puree to make this recipe., , , , , , Instead of fruit salt you can use baking soda to make this palak rava idli recipe., , , , , , Do not whisk the batter vigorously after adding fruit salt to the batter., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per idli, Energy, 48 cal, Protein, 1.5 g, Carbohydrates, 7.4 g, Fiber, 0.3 g, Fat, 1.4 g, Cholesterol, 1 mg, Sodium, 8.2 mg, , , , , , , Click here to view, Calories for Palak Rava Idli Recipe, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Foodie #640293, , March 13, 2025, midnight, , Healthy recipe as well as tastes good. \nBut it does not turn out to be fluffy.., , , , , , , , , Post Reply, , , , , 4, , , , , , , , , , , , , Sonal Modi, , March 13, 2025, midnight, , Excellent recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , naman, , March 13, 2025, midnight, , This palak idli was so unusual so I decided to make it for my family one day for dinner, they loved it with a hot bowl of sambhar and coconut chutney., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #679499, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , barley idli recipe | Indian vegetable barley idli | healthy barley idli for breakfast |, , , 34 Calories, , , , , , , , , , , , , , , , , Dal and Vegetable Idli recipe, Idli Recipes, Dosa Recipes, , , 49 Calories, , , , , , , , , , , , , , , , , Double Decker Idlis Stuffed with Potato and Chutney recipe, Healthy Recipes, , , 37 Calories, , , , , , , , , , , , , , , , , farali idli sambar recipe | vrat sambar | navratri, vrat idli chutney |, , , 532 Calories, , , , , , , , , , , , , , , , , Fried Idlis with Curd Dip recipe, , , 0 Calories, , , , , , , , , , , , , , , , , green moong dal vegetable idli recipe | split green gram idli | healthy green moong dal vegetable idli |, , , 43 Calories, , , , , , , , , , , , , , , , , idli chaat recipe | South Indian idli chaat |  how to make idli chaat |, , , 250 Calories, , , , , , , , , , , , , , , , , idli chilli recipe | chilli idli | idli chilli fry |, , , 333 Calories, , , , , , , , , , , , , , , , , Idli Curry recipe | idli sabzi |, , , 371 Calories, , , , , , , , , , , , , , , , , idli upma recipe | idli upma with leftover idli | healthy idli upma |, , , 135 Calories, , , , , , , , , , , , , , , , , Instant Bread Idli, How to make Bread idli, No Fermenting Required recipe, , , 48 Calories, , , , , , , , , , , , , , , , , Kanchipuram Idli, Kanchipuram Idli in A Microwave recipe, , , 89 Calories, , , , , , , , , , , , , , , , , Masala Appe, Masala Paniyaram, Appe Made From Idli Batter recipe, , , 18 Calories, , , , , , , , , , , , , , , , , Mini Cashew Idlis in Milagai Podi recipe, , , 0 Calories, , , , , , , , , , , , , , , , , Mini Pesto Idlis with Olive Cream Cheese Dip recipe, , , 103 Calories, , , , , , , , , , , , , , , , , multi flour idli recipe | healthy multigrain idli | millet flour idli |, , , 33 Calories, , , , , , , , , , , , , , , , , oats rava idli recipe | instant oats rava idli | Indian oats idli no fermentation |, , , 48 Calories, , , , , , , , , , , , , , , , , Paneer Vegetable Idli recipe, , , 50 Calories, , , , , , , , , , , , , , , , , rice and moong dal idli | rice and green gram idli | rice and green moong dal and urad dal idli |, , , 30 Calories, , , , , , , , , , , , , , , , , semolina and vermicelli idli recipe | rava semiya idli | instant vermicelli idli |, , , 88 Calories, , , , , , , , , , , , , , , , , Shepu Sweet Idlis ( Know Your Green Leafy Vegetables) recipe, , , 110 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like palak rava idli recipe, , , , , , , , , What is palak rava idli made of?, , , , , , , , , How to make the tempering, , , , , , , , , How to make the idli batter, , , , , , , , , How to make palak rava idli, , , , , , , , , Pro tips to make palak rava idli, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , palak rava idli recipe, |, instant suji palak idli, |, spinach rava idli, | with 28 amazing images., spinach rava idli, , , , For palak rava idli recipe, , To make, palak rava idli, , heat the oil in a small pan, add the mustard seeds and urad dal and sauté on a medium flame for 30 seconds., Add the cashewnuts and sauté on a medium flame for 30 seconds., In a deep bowl, combine the rava, curds, spinach puree, ginger green chilli paste, lemon juice, salt and ½ cup of water in a deep bowl and mix well., Cover with a lid and keep aside for 15 minutes., After 15 minutes, pour this prepared tempering over the batter and mix well., Just before steaming, add the fruit salt and 2 tsp of water over the batter. When the bubbles form, mix gently., Pour a little batter into each greased idli mould and steam in a steamer for 10 to 12 minutes or till the idlis are cooked., Serve, palak rava idli, hot with sambhar and coconut chutney., , , , , , , , , , , , , , , , Palak Rava Idli Recipe recipe with step by step photos, , , , , , , , , , , , , , , , , , like palak rava idli recipe, , , , , , , , , , palak rava idli recipe | instant suji palak idli | spinach rava idli |, then do try other rava idli recipes also:, , quick rava idli recipe, | instant idli using sooji | easy no fermentation semolina idli |, , semolina and vermicelli idli recipe, | Indian rava semiya idli | instant vermicelli idli |, , , , , , , , , , , , , , , , , , what is palak rava idli made of?, , , , , , , , , ",
        "Carrot Idli": "Ingredients: , , , , Idli batter – 1 cup [Fermented], , Carrot – ½ cup [grated], , Green chilli – 1 or 2 [finely chopped], , Curry leaves – 2 springs [finely chopped], , Coriander leaves – 2 springs [finely chopped], , Red chilli powder – ½ tsp, , Turmeric powder – ¼ tsp, , Mustard seeds – 1 tbsp, , Bengal gram – 1 tbsp, , Urad dal – 1 tbsp, , Oil – 2 tbsp, , Salt to taste, , , , Read More >>, , , , , , , Food Astrology, What you eat will determine what you will be...., , Read More >>, , , , , , , Food Calorie Chart, ‘Know your Calorie values of some common vegetarian,..., , Read More >>, , , , , , , South Indian Meals, , More than 15 items that adorn plantain leaf including..., , Read More >>, , , , , , , Food Photography, Photographs that make your mouth watering..., , Read More >>, , , , , , , South Indian Cooking, Clear information about south Indian cooking..., , Read More >>, , , , , , , Bachelor kitchen, , Hello bachelors! How are you? Being a bechelor/ single..., , Read More >>, , , , , , About Ragi, Ragi has been playing a vital role in building healthy..., , Read More >>, , , , , , , Kitchen Tips, Quick tips and tricks that ease your cooking and saves..., , Read More >>, , , , , , , Menu Idea of the day, Almost all of us know how to prepare healthy..., , Read More >>, , , , , , , Continental Recipes, Collections of continental recipes with indian twist..., , Read More >>, , , , , , , Pongal festival Recipes, Pongal is a Tamil festival which is celebrated during mid..., , Read More >>, , , , , , , Payasam/ Kheer, Healthy & Easy  payasam/kheer..., , Read More >>, , , , , , , Paneer recipes, Healthy & simple  paneer / cottage cheese..., , Read More >>, , , , , , , Spinach recipes, Easy spinach/ Palak breakfast, curry recipes..., , Read More >>, , , , , , , , , , , , Home, , Subscribe, , Contact, , , , , , , , , , , , , Copyright © 2008-2023 SouthIndianFoods.in, , , , , Instructions: , , Heat oil in a pan, add mustard seeds & let it splutter. Then add Bengal gram & urad dal., , Then add curry leaves, green chilli & carrot sauté., , Then add salt, turmeric& red chilli powder sauté then cut off heat., , Finally add coriander mix well., , In a bowl, add idli batter, carrot mixture & mix well., , Heat idli cooker with water & let it boil., , Then grease idly plates with oil, pour batter in each cavity, place it in boiling water, cover lid and steam it for 8 to 10 min., , Then Serve hot with, coconut chutney, ., , , Instant carrot idli, , , Grated carrot idli, , , Idli with carrot seasoning, , , , , , , , , , , Rate this recipe, , , , , , I like it, , I dont like it, , , , , , , , About Us, , , , , , You may also like these recipes, , , Paneer cheese pakora, Paneer [Cottage cheese..., , Read More >>, , , , , , Veg burger with samak rice balls, Bread Bun[Salted,..., , Read More >>, , , , , , Cauliflower Kurma, Cauliflower – 1 cup. Sambar onion..., , Read More >>, , , , , , Hotel Idli Sambar, Though everyone hates hotel food some times we..., , Read More >>, , , , , , , Kara Kuzhambu, Brinjal - 3 nos. Small Onion (Sambar Onion) - 10..., , Read More >>, , , , , , , Veg burger with beetroot balls, Bread bun [Salted,..., , Read More >>, , , , , , , Ven pongal, Rice [Boiled rice, Raw rice] – 1 cup. Moong dal..., , Read More >>, , , , , , , Thinai Idli, Thinai arisi [Foxtail millet]– 2 cups. Urad dal ..., , Read More >>, , , , , , , Thinai dosai, Thinai arisi [Foxtail Millet] - 2 cups. Urad Dal..., , Read More >>, , , , , , , Simple thakkali kuzhambu, Tomato – 4 [chopped]..., , Read More >>, , , , , , , , , , , , , , , Recipes by Categories, , , , , , , , Breakfast recipes, Research proves Idli is one of the best breakfast..., , Read More >>, , , , , , , Navrathri Sundal, Navratri is a Hindu festival which will be celebrated ..., , Read More >>, , , , , , , Diwali Sweets, Diwali festival brings three joyful moments. New..., , Read More >>, , , , , , Diabetic recipes, Food should contain rich in fiber and it should..., , Read More >>, , , , , , , Ganesh chaturthi, Ganesh Chaturthi  is a Hindu festival..., , Read More >>, , , , , , , Millet recipes, Millets and Ragi are called as Live Grains..., , Read More >>, , , , , , , Snacks, Want to have something nutritious and healthy..., , Read More >>, , , , , , , Curry / Kuzhambu, In this section you can find mouth watering gravy...., , Read More >>, , , , , , ",
        "Instant Oats Idli": "Ingredients: , The batter is then steamed in idli molds. How easy.. isn’t it? We love these as much as these MTR style, Rava idlis, which I shared with you all before., , I make oats idli with both semolina and whole wheat rava or daliya or samba rava. Bombay rava or semolina is a processed food and is good to consume in moderation. If you are trying to avoid refined foods, then I suggest using whole wheat rava instead of semolina., , You can find a picture of oats idli made with whole wheat rava at the end of this post., , If you are health conscious and trying to include oats in your diet, you may like this collection of, Oats recipes, ., Oats dosa, Easy oats upma, Oats chilla, Masala oats, Oats uttapam, Oats omelette, , , , Photo Guide, , How to make oats idli (stepwise photos), , Preparation, , 1. Add 1 cup oats to a blender., , , 2. Make a coarse powder. Making a coarse powder prevents stickiness in the oats idli., , , 3. Pour 1½ tablespoon oil to a hot pan. Do not reduce oil. If using cashews, fry them until golden and set aside. Then add ¼ teaspoon mustard seeds, ½ teaspoon cumin seeds and 1 teaspoon urad dal. Saute until the dal turns golden. Sprinkle a pinch of hing., , 4. Add 1 finely chopped green chilies, 1 teaspoon chopped ginger (optional) and few curry leaves. Saute for a min., , , 5. Next add half cup semolina / rava or whole wheat rava /daliya., , 6. Saute on a medium heat until the rava turns fragrant., , , 7. Add the powdered oats. Mix and fry on a low heat without burning until the oats begin to smell good., , 8. Then add salt. Mix this and set aside to cool completely. This is the instant oats idli mix. You can also bottle this and use when ever needed. Keeps good in refrigerator for 1 week to 10 days., , , Making oats idli batter, , 9. Once the mix is cooled completely, add 1 cup water and ¼ cup curd., , , 10. Mix well and Set aside for 10 mins. Drizzle a few drops of oil on each idli plate. Grease them and keep aside. Optionally place fried cashew in each mould., , , 11. After 10 mins, the batter turns slightly thick. If it is too thick then add 1 to 2 tbsps more water to bring it to a thick consistency like that of idli batter. The batter must be thick and not of pouring consistency. Add water only as needed. You can also skip water depending on the kind of oats used., , Transfer lemon juice, finely grated carrots, peas (optional) & few coriander leaves. Do not use too much carrots it lends a sweetish flavor., , , 12. First get the steamer ready with 1.5 to 2 cups water like you do for the regular idli. When the water is getting hot, about to come to a boil, then add ½ teaspoon baking soda or 1 teaspoon fruit salt – eno. You can also reduce 1 to 2 pinches of soda. Mix well. You will begin to see bubbles in the mixture. The mixture has to go right away for steaming otherwise the idli will turn dense., , , How to make oats idli, , 13. This recipe makes around 8 to 9 idlis. Pour the batter to the greased plates. Put the idli stand inside when the water comes to a boil. Cover and steam for 11 to 12 mins on a high flame. The color of the idli depends on the kind of oats used. I had used rolled oats, hence the yellowish color., , , 14. Allow them to cool down a bit. Dip a spoon or knife in water and remove the oats idli., , , Serve oats idli hot with chutney or sambar. These are best served hot., , , Oats idli made with whole wheat., , , Pro tips, , Make sure you roast the semolina very well on a low heat until crunchy. We do not want to brown the semolina as this will also alter the flavor of the oats idli., Do not reduce the quantity of oil as this prevents the idlis from turning sticky., Avoid using slimy or sour yogurt. Slimy yogurt makes the idlis sticky and sour yogurt imparts a sour flavor to the idlis., If you reduce the amount of baking soda or eno your oats idlis will turn out to be dense. The quantities mentioned in the recipe won’t make your idlis have an aftertaste but ensure you use enough lemon juice to leaven it., , , Related Recipes, , Oats Dosa Recipe, , , Oats Upma Recipe, , , Oats Chilla Recip..., , , Masala Oats Recip..., , , Oats uttapam reci..., , , Oats Egg Omelet (..., , , , , Recipe card, , , , , , Oats idli, , , 4.99, from, 55, votes, , , , Steamed cakes made with oatmeal, spices, yogurt and herbs. These make a healthy and delicious breakfast. Serve them with a chutney or sambar., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 10, minutes, , minutes, Cook Time, 15, minutes, , minutes, Total Time, 25, minutes, , minutes, , Servings, 8, , oats idli, , Author, Swasthi, , , , ▢, 1, , cup, , oats, , (prefer rolled oats), ▢, ½, , cup, , rava, , (whole wheat semolina or sooji), ▢, ¼, , cup, , curd, , (dahi or yogurt), ▢, 1, , cup, , water, ▢, ½, , teaspoon, , salt, , (adjust to taste), ▢, ½, , tablespoon, , lemon juice, ▢, ½, , teaspoon, , soda-bi-carbonate, , (or 1 teaspoon fruit salt – eno), ▢, 2, , tablespoon, , carrot, , grated, ▢, 2 to 4, , tablespoon, , water, , (optional) as needed for consistency, Tempering or Tadka for oats idli, ▢, ¼, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , cumin seeds, , (jeera), ▢, 1, , teaspoon, , urad dal, , (optional), ▢, ½, , teaspoon, , channa dal, , (optional), ▢, ½, , teaspoon, , ginger, , grated or fine chopped, ▢, 4, , cashews, , split optional, ▢, 1½, , tablespoon, , oil, , or ghee, ▢, 1, , pinch, , hing, , (asafoetida), ▢, 1, , green chili, , chopped, ▢, 6, , curry leaves, , finely chopped, ▢, 2, , tablespoon, , coriander leaves, , chopped,  Instructions: Preparation, ▢, Add oats to a blender or grinder and make a coarse powder. Set aside., ▢, Heat oil or ghee in a pan. If using cashews (optional), fry them until golden. Remove and set aside. Add mustard, cumin, chana dal and urad dal., ▢, Fry until the dals turn golden. Then add curry leaves, green chilies, hing and ginger. Saute for 30 seconds., ▢, Pour rava and fry until aromatic. Add powdered oats., ▢, Fry until the mixture turns aromatic. Add salt and mix. Cool this completely., making batter, ▢, Once cool, pour water and curd to it. Mix to make a thick batter. Set this aside for 5 to 8 mins., ▢, Heat a steamer with 2 cups water or as required. Meanwhile drizzle a few drops of oil over the idli plates and grease them. Place fried cashews optionally., ▢, After 10 mins, the batter turns slightly thick. At this stage add lemon juice and more water if needed to bring it to a consistency like that of idli batter., ▢, The batter must be thick and not of pouring consistency. But must be smooth and not lumpy., ▢, Add lemon juice, carrots, coriander leaves. Mix a good mix., ▢, Make sure the water is getting hot. Then sprinkle half teaspoon soda or 1 teaspoon fruit salt – eno to the batter. Gently mix it. Do not over mix., How to make oats idli, ▢, Fill the greased plates with batter. This must go right away for steaming. Delaying will make the idlis dense., ▢, When the water in the steamer begins to boil rapidly, place the oats idli stand in the cooker and steam for about 11  minutes. Switch off the heat., ▢, If cooked properly then a skewer inserted in comes clean or with slight crumbs., ▢, Allow them to cool down a bit. Remove them with the help of a spoon., ▢, Serve oats idli hot with a, tomato chutney, or, idli-sambar, ., , , Notes, Notes on oats idli, , To make the oats idli less sticky, making a coarse powder of oats, using enough oil and right amount of moisture are the key., , , , NUTRITION INFO (estimation only), , Nutrition Facts, , Oats idli, , , Amount Per Serving\t\t\t (2 g), , , Calories, 313, , Calories from Fat 117, , , , , % Daily Value*, , , Fat, 13g, 20%, Saturated Fat 1g, 6%, Cholesterol, 2mg, 1%, Sodium, 728mg, 32%, Potassium, 295mg, 8%, Carbohydrates, 37g, 12%, Fiber 7g, 29%, Sugar 1g, 1%, Protein, 12g, 24%, , , Vitamin A, 1375IU, 28%, Vitamin C, 76.7mg, 93%, Calcium, 100mg, 10%, Iron, 4mg, 22%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 3.5K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 4.99 from 55 votes (, 44 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 54, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Sufia nousheen, , , , , , November 23, 2024 3:36 am, , , , , , Awesome making it second time today👍👍, , , , , , Reply, , , , , , , , , , , Shaik Asfiya, , , , , , September 19, 2024 5:02 pm, , , , , , Super 👍👍, , , , , , Reply, , , , , , , , , , , Anil, , , , , , August 27, 2022 11:54 pm, , , , , , Does wheat rava means bansi rava or is it different, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Anil, , , , August 28, 2022 1:51 am, , , , , , No it is different. It is a finer cut of daliya. But this recipe works with bansi rava too, , , , , , Reply, , , , , , , , , , , Jenice, , , , , , July 17, 2022 1:04 am, , , , , , Great recipe! Thank you for sharing, I have a toddler who loves idli, But I wanted to make it more healthier for him and also wanted to avoid urad dal and Suji as these make him constipated ,so I tried your recipe with dalia and it turned out really well. Thanks  again:), , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Jenice, , , , July 18, 2022 5:16 pm, , , , , , Glad to know Jenice. Thank you, , , , , , Reply, , , , , , , , , , , Jaswinder Bedi, , , , , , June 8, 2021 3:17 pm, , , , , , Looks nice, , , , , , Reply, , , , , , , , , , , Aaisha, , , , , , June 8, 2021 5:14 am, , , , , , How can I catagroize oats idli ingridients as a animal or plant source, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Aaisha, , , , June 8, 2021 7:18 am, , , , , , Hi Aaisha, Yogurt is animal source and the rest are plant source, , , , , , Reply, , , , , , , , , , , Ganga, , , , , , April 29, 2021 9:31 pm, , , , , , Hi swasthI,, Can I use wheat puttu flour instead?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ganga, , , , April 30, 2021 2:35 am, , , , , , Hi Ganga, I haven’t tried. It may work., , , , , , Reply, , , , , , , , , , , Melina, , , , , , February 19, 2021 3:15 pm, , , , , , Can you use this batter to make Oats fluffy dosa?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Melina, , , , February 23, 2021 1:30 pm, , , , , , Hi Melina, No this can’t be used. I have another recipe here –, oats uttapam, , , , , , Reply, , , , , , , , , , , Mia, , , , , , September 25, 2020 4:24 pm, , , , , , Hi… Great recipe! Just wondering if you can freeze this? And for how long?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Mia, , , , September 26, 2020 3:13 am, , , , , , Hi,, Thank you! I haven’t tried freezing., , , , , , Reply, , , , , , , , , , , Nida Parveen, , , , , , August 23, 2020 4:26 am, , , , , , I don’t know what went wrong with me,it didn’t increase in size and also after 20 to 30 minutes it felt sticky. One thing I can remember my Oates powder was fine. Only this could be the problem or any thing else you can suggest…., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Nida Parveen, , , , August 23, 2020 6:26 am, , , , , , Hi Nida, Yes they don’t rise but shouldn’t turn sticky. The powder has to be coarse and also rolled oats work best here. Instant oats or slimy yogurt or too much water in the batter can make them sticky. These are best served hot. Oats have a natural tendency to become more sticky after cooling down. Hope these help, , , , , , Reply, , , , , , , , , , , Asha, , , , , , May 8, 2020 4:22 pm, , , , , , Today I made eggless chocolate cake with wheat flour, capsicum rice and oats idly., , All three big success, Thanks a lot., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Asha, , , , May 9, 2020 2:29 pm, , , , , , Welcome Asha!, Glad to know they turned out well. Thank you, , , , , , Reply, , , , , , , , , , , Ashely, , , , , , December 16, 2019 10:53 pm, , , , , , Hi swasthi! Can I use oat flour instead of the powdered oats?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ashely, , , , December 17, 2019 4:27 am, , , , , , Hi Ashley,, I am not sure if it turns sticky with flour. You can give a try with small quantity., , , , , , Reply, , , , , , , , , , , Ruchi, , , , , , November 29, 2019 5:00 pm, , , , , , Tried oats idli recipe. Came out really soft and nice. Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ruchi, , , , November 30, 2019 4:56 am, , , , , , Hi Ruchi,, Glad they turned out good., , , , , , Reply, , , , , , , , , , , Preety rai, , , , , , April 26, 2019 1:33 am, , , , , , Wow, , , , , , Reply, , , , , , , , , , , Radint1, , , , , , March 18, 2018 7:36 pm, , , , , , Thanks for the recipe… it turned really well. I did use extra. corse Rava. It was a bit spongy. Next time I’ll try just coarse Rava., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Radint1, , , , March 19, 2018 1:06 am, , , , , , Welcome., Thanks for trying., , , , , , Reply, , , , , , , , , , , Cherry Jain, , , , , , December 12, 2017 2:37 pm, , , , , , What is whole wheat rava?is it the same as whole wheat flour (atta)?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Cherry Jain, , , , December 14, 2017 3:31 am, , , , , , Cherry whole wheat rava is made from whole wheat and is not the same as atta. It is less processed and so it is healthier than suji or semolina or upma rava. It is coarse like suji, , , , , , Reply, , , , , , , , , , , Anju, , , , , , July 12, 2017 2:19 pm, , , , , , Hi if we use daliya then it needs to be soaked prior or we add dry only?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Anju, , , , July 12, 2017 2:30 pm, , , , , , Hi Anju, After roasting daliya or rawa, you will need to soak it for 10 mins., , , , , , Reply, , , , , , , , , , , shiv, , , , , , September 2, 2016 12:21 pm, , , , , , Rolled oats ?any company name, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, shiv, , , , September 2, 2016 12:26 pm, , , , , , I don’t know where you live. I use anzec brand rolled oats, , , , , , Reply, , , , , , , , , , , shiv, , , , , , August 30, 2016 4:36 am, , , , , , I tried it today….my idly came very sticky inside…wat to do nw, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, shiv, , , , August 30, 2016 9:27 am, , , , , , Hi Shiv, Did you use instant oats? Instant oats are starchy and may make the idli sticky. I suggested rolled oats in the recipe. I do not see any other reason for it to turn sticky., , , , , , Reply, , , , , , , , , , , Arul shiva, , , , , , August 2, 2016 8:15 am, , , , , , Curd should be fresh or sour swathi, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Arul shiva, , , , August 2, 2016 8:24 am, , , , , , It need not be sour. Even fresh curd with react well with soda and eno which makes the idlis soft., , , , , , Reply, , , , , , , , , , , , , , Arul shiva, , , , , , Reply to, swasthi, , , , August 2, 2016 8:59 am, , , , , , Thank u so much I’ll try, , , , , , Reply, , , , , , , , , , , Arul shiva, , , , , , August 2, 2016 8:08 am, , , , , , Whole wheat rava means broken wheat rava?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Arul shiva, , , , August 2, 2016 8:09 am, , , , , , yes whole wheat rava is broken wheat rava /samba rava or dalia, , , , , , Reply, , , , , , , , , , , , , , Arul shiva, , , , , , Reply to, swasthi, , , , August 2, 2016 8:11 am, , , , , , Butter milk should be sour or fresh, , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Chana Dal Idli": "❌ Error scraping https://mytastycurry.com/chana-dal-idli-recipe-my-breakfast-table-mtcnashta: 404 Client Error: Not Found for url: https://mytastycurry.com/chana-dal-idli-recipe-my-breakfast-table-mtcnashta",
        "Tangy Tomato Idli": "❌ Error scraping https://www.betterbutter.in/recipe/136413/tangi-tomato-idli/: HTTPSConnectionPool(host='www.betterbutter.in', port=443): Max retries exceeded with url: /recipe/136413/tangi-tomato-idli/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: certificate has expired (_ssl.c:1000)')))",
        "Moong Dal Idli": "Ingredients: , , , , 5, , How to Make Green Gram Idli with Step-by-step Photos, , , , , 6, , Notes, , , , , , , Moong Dal Idli Recipe | Green Gram Idli | Moong Dal Ki Idli, , they are made with rice and urad dal, which makes a soft and moist white idli. But then there are other variations, like the moong dal idli recipe, which can be an ideal alternative to, the traditional ones., , I am not a massive fan of, the moong dal idli recipe,, and I would always fall back to the traditional rice-based idli., But still, I make it occasionally as it is elementary to make. In particular, the recipe does not have a combination of rice and urad dal and is made with just moong dal batter. In other words, the recipe is very similar to rava idli, which is made with just one ingredient. Moreover, it has all the required spices, which makes it a one-pot meal. You do not need any other side dish with it, but I like it with, green chutney, or, Schezwan chutney, . You can have it with any choice of coconut-based chutney, as it should taste equally good., , , , , , , Furthermore, I would like to highlight some tips, suggestions and variations for the, moong dal idli recipe, . Firstly, I have used split green gram, and I would heavily recommend using the same for this recipe. Please do not go for the whole green gram, which may spoil the taste and flavour. Secondly, I have added curd or yoghurt to add a sour taste to the batter. As an alternative, you can add lemon juice to have the effect. Lastly, I have added eno salt as the fermenting agent. You can add baking soda to the process. In addition, if you want the natural fermentation, use urad dal in a 1:1 ratio and ferment it overnight., , Finally, I request you to check my other, South Indian Idli Recipe Collection, with this post on the, moong dal idli recipe, ., It mainly includes recipes like, Poha idli, , , rava idli, , , Sabudana idli, , , oats idli, , , ragi idli, , , Kanchipuram idli, , , idli upma, , , instant stuffed idli, , and, semiya idli recipe, . in addition, do visit my other related recipes collection,, , , dosa recipes collection, , breakfast recipes collection, , snacks recipes collection, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , About Moong Dal Idli, , It is a healthy and tasty breakfast idli recipe with soaked mung beans and assorted spices., Moong Dal Idli,, or, Mung Beans Idli,, was inspired by Gujarati dhokla, which has a similar texture and taste., Idli recipes made from just lentils can be an ideal alternative to the traditional rice-based idlis, particularly if you do not like rice-based carbs or rice-based recipes or meals. It tastes great with spicy chutney, like green or red chutney, but it is not limited to it. It can be served with chutney, making it an ideal filling morning meal., , There are many ways to make a simple and soft Moong Dal idli recipe. Typically, it is made with just one lentil, i.e. moong dal or mung beans. However, it can be extended by adding different types of lentils to make it even more filling and protein-rich. Add lentils like toor dal, channa dal, or masoor dal. However, toor and channa dal may need more time to soak and grind. In addition, the idli can be made with rice rava too. Adding rice rava helps to get the coarse or grainy texture to the idli. Further, thin or thick Poha can be added, which helps to give a soft and puffy texture., , Video Recipe, , , Recipe Card for Moong Dal Idli, , , , , , , , , Moong Dal Idli Recipe | High Protein Green Gram Idli, , , HEBBARS KITCHEN, , , Easy Moong Dal Idli Recipe | High Protein Green Gram Idli, , , 5, from, 415, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 15, minutes, , mins, Soaking Time, 2, hours, , hrs, Total Time, 2, hours, , hrs, , 25, minutes, , mins, , , , , , , Course, idli, Cuisine, south indian, , , , , , Servings, 20, , idli, Calories, 90, , kcal, , , , , , , 1x, 2x, 3x, ▢, 1, , cup, , moong dal, ▢, 2, , tbsp, , oil, ▢, 1, , tsp, , mustard, ▢, ½, , tsp, , chana dal, ▢, ½, , tsp, , urad dal, ▢, 1, , tsp, , cumin, ▢, pinch, , hing, ▢, few curry leaves, ▢, 1, , inch, , ginger, , , finely chopped, ▢, 3, , chilli, , , finely chopped, ▢, 2, , tbsp, , carrot, , , grated, ▢, ¼, , tsp, , turmeric, ▢, 1, , cup, , rava, , , coarse, ▢, 1, , cup, , curd, ▢, 1, , tsp, , salt, ▢, 2, , tbsp, , coriander, , , finely chopped, ▢, 1, , tsp, , eno fruit salt, ▢, cashew, , , for garnishing,  Instructions: , Firstly, rinse and soak 1 cup moong dal for 2 hours., Drain off the water and transfer to the mixer jar., Add 1 cup curd and grind to a smooth batter., Transfer the batter to the large bowl. Keep aside., In a pan, heat 2 tbsp oil. Add 1 tsp mustard, ½ tsp chana dal, ½ tsp urad dal, 1 tsp cumin, a pinch of salt, and a few curry leaves. Splutter the tempering., Add 1 inch ginger, 3 chilli, and saute slightly., Further add 2 tbsp carrot, ¼ tsp turmeric and saute until it turns aromatic., Add 1 cup of rava and roast till the rava turns aromatic., Cool completely and transfer into the moong dal batter bowl., Add 1 tsp salt and mix well adjusting the consistency., Rest the batter for 20 minutes for rava to soak well., Add 2 tbsp coriander and mix well., After the rava has soaked well, add 1 tsp eno fruit salt and mix gently., Mix the batter until the batter turns frothy., Place the roasted cashew in a greased idli plate and pour the batter into the mould., Place the idli plate in a steamer and steam for 10 minutes., Finally, enjoy Moong Dal Idli Recipe with chutney, , , , , Nutrition, Calories:, 90, kcal, Carbohydrates:, 8, g, Protein:, 7, g, Fat:, 4, g, Saturated Fat:, 1, g, Polyunsaturated Fat:, 1, g, Monounsaturated Fat:, 1, g, Trans Fat:, 0.01, g, Cholesterol:, 6, mg, Sodium:, 217, mg, Potassium:, 40, mg, Fiber:, 1, g, Sugar:, 1, g, Vitamin A:, 348, IU, Vitamin C:, 11, mg, Calcium:, 25, mg, Iron:, 1, mg, , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , How to Make Green Gram Idli with Step-by-step Photos, , , Firstly, rinse and soak 1 cup moong dal for 2 hours., , , , , , , Drain off the water and transfer to the mixer jar., , , , , , , Add 1 cup curd and grind to a smooth batter., , , , , , , Transfer the batter to the large bowl. Keep aside., , , , , , , In a pan, heat 2 tbsp oil. Add 1 tsp mustard, ½ tsp chana dal, ½ tsp urad dal, 1 tsp cumin, a pinch of salt, and a few curry leaves. Splutter the tempering., , , , , , , Add 1 inch ginger, 3 chilli, and saute slightly., , , , , , , Further add 2 tbsp carrot, ¼ tsp turmeric and saute until it turns aromatic., , , , , , , Add 1 cup of rava and roast till the rava turns aromatic., , , , , , , Cool completely and transfer into the moong dal batter bowl., , , , , , , Add 1 tsp salt and mix well adjusting the consistency., , , , , , , Rest the batter for 20 minutes for rava to soak well., , , , , , , Add 2 tbsp coriander and mix well., , , , , , , , After the rava has soaked well, add 1 tsp eno fruit salt and mix gently., , , , , , , , , Mix the batter until the batter turns frothy., , , , , , , , , Place the roasted cashew in a greased idli plate and pour the batter into the mould., , , , , , , , , Place the idli plate in a steamer and steam for 10 minutes., , , , , , , , , Finally, enjoy, Moong Dal Idli Recipe, with chutney., , , , , , , , , Notes, , , Firstly, make sure to add rava as it makes the idli with good porous texture., , Also, adding eno fruit salt makes idli soft and spongy., , Additionally, make sure to roast the rava on low flame, until the rava turns aromatic. Else the idli will be sticky., , Finally,, Moong Dal Idli Recipe, must be soft and fluffy, so make sure to add eno before steaming to the batter., , , , , , , , , Related Recipes, , , , , , , , , , breakfast recipes, , , Paneer Kulcha Recipe | Paneer Stuffed Kulcha Naan, , , , Hebbars Kitchen, , -, , , April 2, 2025, , , , , , , , , , , , breakfast recipes, , , Lemon Rice | South Indian Chitrannam & Gojju..., , , , Hebbars Kitchen, , -, , , March 25, 2025, , , , , , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti –..., , , , Hebbars Kitchen, , -, , , March 24, 2025, , , , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli –..., , , , Hebbars Kitchen, , -, , , March 19, 2025, , , , , , , , , , , , , breakfast recipes, , Tomato Sevai Recipe | Thakkali Semiya – Healthy..., , , , Hebbars Kitchen, , -, , , March 10, 2025, , , , , , , , , , , , , breakfast recipes, , Shavige Uppittu Recipe | Shavige Bath – Shavige..., , , , Hebbars Kitchen, , -, , , February 17, 2025, , , , , , , , , , , 00:01:32, , , , breakfast recipes, , Medu Vada Recipe in Mixer Grinder | Medhu..., , , , Hebbars Kitchen, , -, , , February 13, 2025, , , , , , , , , , , , , breakfast recipes, , Rava Dosa Recipe | Instant Crispy Suji Ka..., , , , Hebbars Kitchen, , -, , , February 11, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 5 from 415 votes (, 415 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , appetizer, , , 00:02:05, , , , Chilli Mushroom Recipe | Mushroom Chilli..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , indian street food, , Kulcha Recipe | Amritsari Aloo Kulcha – Street Style on Tawa, , , , , , , , What's New, , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli – Healthy & Tasty, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Quinoa Idli": "Ingredients: 1, , and 1/2 cups, , quinoa, 1/2, , cup, , idli rice, 1/2, , cup, , urad dal, 1, , teaspoon, , fenugreek, salt, , as per taste,  Instructions: Soak rice and quinoa together for at least 3-4 hours., Rinse well and grind until smooth. Sprinkle water as and when it sticks to the sides, but sprinkle and add. Do not add more. Takes 30-40 mins for grinding., Soak urad dal and fenugreek seeds together for 2 hours, rinse well and grind to a smooth batter. I used my grinder which works best but you can do in mixie too. It takes around 30 mins., Transfer both the batters to a tall container big enough to hold the batter after fermentation. Add salt to it. Mix well., Close with lid and set aside for 8 hours for fermenting. Mix well. The batter will be thick., Grease your idli plates with oil, take a ladle full of the batter and pour into the mould., Steam cook for 10mins or until a spoon or inserted inserted into the idlis comes out clean with sticking. Then its done. Switch off. Remove the idli plates, dip a spoon in water., Using the spoon remove the idlis. Transfer to hot box., Serve Quinoa Idli hot with chutney and sambar!, , , , Nutrition Facts, , Quinoa Idli, , , Amount Per Serving\t\t\t (50 g), , , Calories, 66, , Calories from Fat 2, , , , , % Daily Value*, , , Fat, 0.2g, 0%, Saturated Fat 0.02g, 0%, Polyunsaturated Fat 0.02g, Monounsaturated Fat 0.02g, Sodium, 1mg, 0%, Potassium, 14mg, 0%, Carbohydrates, 13g, 4%, Fiber 2g, 8%, Sugar 0.01g, 0%, Protein, 3g, 6%, , , Vitamin A, 1IU, 0%, Vitamin C, 0.4mg, 0%, Calcium, 9mg, 1%, Iron, 1mg, 6%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @sharmispassions, or tag, #sharmispassions, , , Like our video?, Subscribe, to our youtube channel to get latest updates!, , How to make Quinoa Idli  Recipe, , , Soak rice and quinoa together for at least 3-4 hours.Rinse well and grind until smooth.Sprinkle water as and when it sticks to the sides, but sprinkle and add. Do not add more.Takes 30-40 mins for grinding., , , Soak urad dal and fenugreek seeds together for 2 hours, rinse well and grind to a smooth batter.I used my grinder which works best but you can do in mixie too. It takes around 30 mins., , , Transfer both the batters to a tall container big enough to hold the batter after fermentation.Add salt to it.Mix well., , , Close with lid and set aside for 8 hours for fermenting.This is how the fermented batter will look after 5 hrs.Mix well.The batter will be thick., , , Grease your idli plates with oil, take a laddle full of the batter and pour into the mould., , , Steam cook for 10 mins or until a spoon or inserted inserted into the idlis comes out clean with sticking.Then its done.Switch off.Remove the idli plates, dip a spoon in water., , , Using the spoon remove the idlis.Transfer to hot box., , , , Serve hot with chutney and sambar!, , , Soft quinoa idli ready with sambar and chutney., , , 79, Shares, Filed Under:, Breakfast Ideas, , , Idli Recipes, , , Quinoa Recipes, , , Recent Posts, , , Sharmis Passions, , Reader Interactions, Comments, , , , , , Beta Mathew, , , May 03, 2019 at 11:40 am, , , , Thank you Sharmilee for this healthy idli recipe. Turned out great ! Dosas too were nice & crispy., , , Reply, , , , , , , 4.34 from 9 votes (, 9 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Primary Sidebar, , , , , Hello, I’m Sharmilee – author,recipe creator and photographer behind Sharmis Passions., , More about me →, , , Latest Recipes, , Carrot Rice Recipe, Spring Rolls Recipe, Rose Milk Ice | Rose Milk Popsicle, Spring Roll Sheets Recipe | Spring Roll Wrappers Recipe, , , See more new recipes →, , , Popular Recipes, , Cajun Potatoes Recipe (Barbeque Nation Style), Black Tea, Icing Sugar Recipe | How to make Icing Sugar, Homemade Chocolate, , , , , , , , Footer, , ↑ back to top, , , , Privacy, , , Privacy Policy, , , , , Newsletter, , , Sign Up! for emails and updates, , , , , Stay Connected, , , , , , Copyright © 2025 Text,Images and Content Copyrighted by, Sharmis Passions, , Managed by, Host My Blog, , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Methi Dosa and Idli": "Ingredients: , , , , 4, , how to make methi dosa with step by step photo:, , , , , 5, , idli and dosa batter preparation:, , , , , 6, , methi idli or vendhaya idli preparation:, , , , , 7, , methi dosa or vendhaya dosa preparation:, , , , , 8, , notes:, , , , , , methi dosa recipe | vendhaya dosa | menthya dosa | menthe dosa recipe, with step by step photo and video recipe. dosa recipes have a huge fan base across india and are known for its taste and flavour. the flavour part generally comes from the additional and optional flavouring agent which would describe the dosa recipe. one such easy and flavoured dosa recipe is methi dosa recipe with loads of bitter and savoury taste., , as i mentioned earlier, there are myriad types of dosa variants which mainly differs with its flavouring agent. out of these recipes, , methi dosa, variant is a unique one to be noted. by its appearance, it does not have any distinctive feature, but it does have a strong taste in it. the addition of fenugreek not only adds bitter taste to it, but also helps ferment the dosa batter. as matter of fact, i have not added urad dal to make the batter and hence there isn’t any, fermenting, agent. yet it ferments properly due to bitter taste added. in addition to it, the first bite may be awkward for you, but as you start consuming it, you would certainly start liking it., , , anyway, i would like to highlight some of my tips, suggestions and variations to, methi dosa recipe, . firstly, as i mentioned earlier i have used only rice to make the dosa batter with fenugreek seeds. yet you can experiment the recipe further with rice and urad dal batter which should taste equally great. secondly, if you are living in a cold and dry place the fermentation process may take extra time. to hasten it, you can either store it in a preheated oven or direct in sun light. lastly, the ideal combination for this bitter dosa is to serve it with a spicy and savoury chutney or curry. when a spicy side, mixed with bitter dosa, it makes a nice combination., , finally, i request you to check my other, dosa recipes collection, with this post of, methi dosa recipe, . it mainly includes recipes collection like, rava dosa, , , ghee roast dosa, , , poha uttapam, , , set dosa, , , oats dosa, , , uttapam, , , kara dosa, , , tomato dosa, , , adai, , , onion rava dosa with aloo masala, . further to these i would like to highlight my other recipes collection like,, , , idli recipes collection, , breakfast recipes collection, , rice recipes collection, , , methi dosa and methi idli video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for vendhaya dosa recipe:, , , , , methi dosa recipe | vendhaya dosa | menthya dosa | methi dosa recipe, , , HEBBARS KITCHEN, , , easy methi dosa recipe | vendhaya dosa | menthya dosa | methi dosa recipe, , , 5, from, 19, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 20, minutes, , mins, Fermentation Time, 8, hours, , hrs, , , , , , , Course, Breakfast, dosa, Cuisine, south india, , , , , , Servings, 10, , Servings, , , , , , , 1x, 2x, 3x, ▢, 3, , cup, , idli rice, ▢, 3, , tbsp, , methi / fenugreek, ▢, water, , , for soaking and grinding, ▢, 2, , tsp, , salt,  Instructions: , idli and dosa batter preparation:, firstly, in a large bowl soak 3 cup idli rice and 3 tbsp methi., soak for 5 hours with enough water., drain off the water and transfer to the blender or grinder., blend to smooth batter adding water as required., prepare slightly watery consistency batter as methi absorbs water and thickens batter., ferment the batter for 8 hours or till it doubles., mix the batter gently without disturbing air pockets., add 2 tsp salt and mix gently. idli and dosa batter is ready., methi idli or vendhaya idli preparation:, firstly, grease the idli plate with oil., pour a ladleful of batter in each idli plate., place the idli plate in steamer and steam for 10-15 minutes., finally, enjoy methi idli with kurma or chutney., methi dosa or vendhaya dosa preparation:, firstly, pour a ladleful of batter on hot tawa and spread gently forming slightly thick dosa., sprinkle oil over dosa., cover and cook for a minute or until the dosa is cooked completely., finally, enjoy methi dosa with kurma or chutney., , , , , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make methi dosa with step by step photo:, , idli and dosa batter preparation:, , , firstly, in a large bowl soak 3 cup idli rice and 3 tbsp methi., , , soak for 5 hours with enough water., , , drain off the water and transfer to the blender or grinder., , , blend to smooth batter adding water as required., , , prepare slightly watery consistency batter as methi absorbs water and thickens batter., , , ferment the batter for 8 hours or till it doubles., , , mix the batter gently without disturbing air pockets., , , add 2 tsp salt and mix gently. idli and dosa batter is ready., , , , methi idli or vendhaya idli preparation:, , , firstly, grease the idli plate with oil., , , pour a ladleful of batter in each idli plate., , , place the idli plate in steamer and steam for 10-15 minutes., , , finally, enjoy, methi idli, with kurma or chutney., , , , methi dosa or vendhaya dosa preparation:, , , firstly, pour a ladleful of batter on hot tawa and spread gently forming slightly thick dosa., , , sprinkle oil over dosa., , , cover and cook for a minute or until the dosa is cooked completely., , , finally, enjoy, methi dosa, with kurma or chutney., , , , notes:, , , firstly, adding methi helps to ferment the batter., , also, adjust the consistency of batter as the batter thickens due to methi., , additionally, fermentation best ferments in summer., , finally,, methi dosa recipe, tastes great when served with spicy chutney, kurma or sambar., , , , , , , , , Related Recipes, , , , , , , , , , breakfast recipes, , , Paneer Kulcha Recipe | Paneer Stuffed Kulcha Naan, , , , Hebbars Kitchen, , -, , , April 2, 2025, , , , , , , , , , , , gluten free, , , Besan Ladoo Recipe | Besan Ke Laddu –..., , , , Hebbars Kitchen, , -, , , March 28, 2025, , , , , , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju..., , , , Hebbars Kitchen, , -, , , March 25, 2025, , , , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti –..., , , , Hebbars Kitchen, , -, , , March 24, 2025, , , , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli –..., , , , Hebbars Kitchen, , -, , , March 19, 2025, , , , , , , , , , , 00:01:33, , , , side dish, , Aloo Pakora Recipe | Aloo Bajji | ..., , , , Hebbars Kitchen, , -, , , March 17, 2025, , , , , , , , , , , , , breakfast recipes, , Tomato Sevai Recipe | Thakkali Semiya – Healthy..., , , , Hebbars Kitchen, , -, , , March 10, 2025, , , , , , , , , , , 00:02:05, , , , appetizer, , Chilli Mushroom Recipe | Mushroom Chilli Dry –..., , , , Hebbars Kitchen, , -, , , March 6, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 5 from 19 votes (, 19 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , breakfast recipes, , , , , Akki Roti Recipe | Masala Akki..., , , , , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , dessert, , mug cake | microwave cake recipe | brownie & red velvet mug cake, , , , , , , , What's New, , , , , , , , gluten free, , Besan Ladoo Recipe | Besan Ke Laddu – Halwai Style, , , , , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Oats Rava Idli": "❌ Error scraping https://www.tarladalal.com/oats-rava-idli-39009r: 404 Client Error: Not Found for url: https://www.tarladalal.com/oats-rava-idli-39009r",
        "Uttapam Pizza": "Ingredients: , , , , , , , , , Put on your creative caps and make the, uttapam pizza, just the way you want to. Throw in your choice of toppings from pineapples and sweet corn to olives, top it with your own combo of sauces and perhaps a sprinkling of tandoori masala or chaat masala too, and watch a humble uttapam magically transform into an exciting Farm Fresh Pizza or Tandoori Paneer Pizza. The best part is that you don’t even need an oven to prepare this., , Notes and important tips on, uttapam pizza recipe, . 1. We are using readymade dosa batter. Check the batter for salt and consistency and adjust by adding a little salt and water as per the requirement. If using leftover batter stored in the fridge then bring it to room temperature and then make uttapam. Make sure the uttapam is not very thick or thin. 2. Cook the uttapam on both sides till light brown in color. Press it lightly while cooking from both sides. Do not cook until golden brown as we are going to cook it again. 3. Put 2 tbsp of pizza sauce over it and spread it evenly. Even that is available in the market in packaged form but, if you want to make homemade pizza sauce then check out this recipe of, Quick Pizza Sauce, or, Italian Pizza Sauce, . Jain people can refer to this recipe of, Jain Pizza Sauce, ., , Uttapas Stuffed with Green Peas, , Tricolour Uttapam, and, Sandwich Uttapa, are other exciting ways to make uttapas., , Learn to make, uttapam pizza recipe, |, tava uttapam pizza recipe, |, uttapam pizza with dosa batter, |, vegetable uttapam pizza recipe, | with step by step photos and video below., , , , , , , Tags, , , , , Non-stick Pan, , Innovative Snacks, , Main Course Recipes, , One Dish Vegetarian Meals, , One Meal Dinner, , Starters / Snacks, , Evening Tea Snacks, , , , , , , , , , , , , , , , , , , , Preparation Time, , 10 Mins, , , , , , , Cooking Time, , 20 Mins, , , , , , , Total Time, , 30 Mins, , , , , , , Makes, , 3 uttapam pizzas, , , , , , , , , , , , , , , For Uttapam Pizza, , , 1 cup leftover, dosa batter, , , 6 tbsp, Pizza sauce, , , 1 1/2 tsp, oil, for greasing, , 1/2 cup thinly, sliced onions, , , 1/2 cup thinly, sliced capsicum, , , 6 tbsp, grated mozzarella cheese, , , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , How to uttapam pizza, , , , , , , , , Tips for uttapam pizza recipe, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , uttapam pizza recipe, |, tava uttapam pizza recipe, |, uttapam pizza with dosa batter, |, vegetable uttapam pizza recipe, | with 11 amazing images., , Our easy, uttapam pizza recipe, is made with, dosa batter, and hence called, uttapam pizza with dosa batter, . Aside from cheese, pizza sauce, we have added onion and capsicum to this, vegetable uttapam pizza, ., , What a fun way to make use of leftover, uttapas, ! The, uttapam pizza, is so tasty that your kids will want you to make this every time you make dosa batter., , From onions and capsicum, to pizza sauce and cheese, the, uttapam pizza, , , , For uttapam pizza, To make, uttapam pizza, , heat a non-stick tava (griddle) and grease it using ½ tsp of oil., Pour a spoonful of the batter and spread in a circular motion to make a 150 mm. (6\") uttapam and cook on both the sides till light brown in colour from both the sides., Place the uttapam on a clean, dry surface, put 2 tbsp of pizza sauce over it and spread it evenly., Sprinkle little onion and capsicum evenly over it., Finally sprinkle 2 tbsp of cheese evenly over it., Heat a non-stick tava (griddle), place the uttapam pizza on it, cover with a lid and cook on a slow flame for 3 minutes or till the cheese melts., Repeat steps 1 to 6 to make 2 more, uttapam pizzas, ., Cut the, uttapam pizza, into 4 equal pieces and serve immediately., , , , , , , , , , , , , , uttapam pizza recipe | tava uttapam pizza recipe | Video by Tarla Dalal, , , , , ×, , , , , , Uttapam Pizza recipe with step by step photos, , , , , , , , , , , , , , , , , , , How to uttapam pizza, , , , , , , , , To prepare, uttapam pizza recipe | tava uttapam pizza recipe| uttapam pizza with dosa batter | vegetable uttapam pizza recipe |, heat a non-stick tava (griddle) and grease it using ½ tsp of oil., , , , , , Pour a spoonful of the batter and spread in a circular motion to make a 150 mm. (6\") uttapam. We are using readymade dosa batter. See our, dosa batter recipe, . Check the batter for salt and consistency & adjust by adding a little salt and water as per the requirement. If using leftover batter stored in the fridge then bring it to room temperature and then make uttapam. Make sure the uttapam is not very thick or thin., , , , , , Cook the uttapam on both sides till light brown in color. Press it lightly while cooking from both sides. Do not cook until golden brown as we are going to cook it again., , , , , , Place the uttapam on a clean, dry surface. If you want to avoid bread then this is the best option., , , , , , Put 2 tbsp of pizza sauce over it and spread it evenly. Even that is available in the market in packaged form but, if you want to make homemade pizza sauce then check out this recipe of, Pizza Sauce, or, Italian Pizza Sauce, . Jain people can refer to this recipe of, Jain Pizza Sauce, ., , , , , , , Sprinkle little onion., , , , , , Sprinkle capsicum evenly over it. We are using onions and capsicum as a topping but vary the toppings according to your choice by adding other veggies like mushrooms, spinach, tomatoes, olives, jalapenos, corn, etc., , , , , , Finally, sprinkle 2 tbsp of cheese evenly over it. We are using mozzarella cheese for this vegetable uttapam pizza recipe but, you may use a mix of processed and mozzarella cheese or any other sharp cheese like cheddar, gouda, parmesan, etc., , , , , , Heat a non-stick tava (griddle), place the uttapam pizza on it and cover with a lid., , , , , , Cook on a slow flame for 3 minutes or till the cheese melts. Our pizza uttapam is ready., , , , , , Repeat steps 1 to 6 to make 2 more uttapam pizza. You can sprinkle a little oregano and chilli flakes evenly over it to enhance the taste of, uttapam pizza | tava uttapam pizza | uttapam pizza with dosa batter | vegetable uttapam pizza recipe |, , , Cut into 4 equal pieces and serve, uttapam pizza | tava uttapam pizza recipe | uttapam pizza with dosa batter | vegetable uttapam pizza recipe |, immediately., Uttapas Stuffed with Green Peas, ,, Onion Tomato Uttapam, ,, Mixed Vegetable Uttapa, are some other uttapam recipes you can make using leftover dosa batter., , , , , , , , , , , , , , , , , , , , Tips for uttapam pizza recipe, , , , , , , , , We are using readymade dosa batter. Check the batter for salt and consistency and adjust by adding a little salt and water as per the requirement. If using leftover batter stored in the fridge then bring it to room temperature and then make uttapam. Make sure the uttapam is not very thick or thin., , , , , , Cook the uttapam on both sides till light brown in color. Press it lightly while cooking from both sides. Do not cook until golden brown as we are going to cook it again., , , , , , Put 2 tbsp of pizza sauce over it and spread it evenly. Even that is available in the market in packaged form but, if you want to make homemade pizza sauce then check out this recipe of, Quick Pizza Sauce, or, Italian Pizza Sauce, . Jain people can refer to this recipe of, Jain Pizza Sauce, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, null, , , , , , Click here to view, Calories for Uttapam Pizza, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Purvi, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , grishma Desai, , March 13, 2025, midnight, , it really looks yummy...I''ll definitely try this recipe...., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Super, enjoy the recipe and post your feedback., , , , , , , , , , , , , Foodie #691275, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , RoshN mandal, , March 13, 2025, midnight, , So nic uttampum pizza raite??? cooking bt mem dosa crepse kayse kar te hai dosa ka ghol me kiya kiya dalte hai plz mem ans me, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Asari, , March 13, 2025, midnight, , wow.. lovely idea.. to make pizza from uttapa.. I had made uttapam for breakfast for breakfast.. which was left.. i made them in them in the evening.. and it was finished in minutes.. Thank you for this recipe.., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , pramila kankaria, , March 13, 2025, midnight, , oh it was yummmmmmmmmy!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Payal Parikh 86, , March 13, 2025, midnight, , The look of this recipe is exactly like a pizza, the base should be made crispy, I serve this often and kids as well as adults all enjoy it...., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Asmita, , March 13, 2025, midnight, , Simply delicious recipe .. thank you !!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , bread pizza recipe | bread pizza in oven | Veg bread pizza in tava |, , , 0 Calories, , , , , , , , , , , , , , , , , pizza crackers recipe | Indian veg pizza crackers | quick homemade pizza crackers |, , , 50 Calories, , , , , , , , , , , , , , , , , basic pizza base recipe | | Indian style pizza base | oven cooked base for pizza with yeast | thin pizza base |, , , 352 Calories, , , , , , , , , , , , , , , , , chocolate pizza recipe | Indian style chocolate pizza |, , , 599 Calories, , , , , , , , , , , , , , , , , four cheese pizza recipe | Indian style four cheese pizza |, , , 699 Calories, , , , , , , , , , , , , , , , , herbed pizza strips recipe | Indian style herbed pizza sticks | homemade |, , , 56 Calories, , , , , , , , , , , , , , , , , Nutritious Mini Pizza recipe, , , 0 Calories, , , , , , , , , , , , , , , , , bhakhri pizza recipe | gluten free Indian pizza | healthy bhakri pizza on tava |, , , 172 Calories, , , , , , , , , , , , , , , , , Rosti Pizza recipe, Potatoe Recipes, , , 219 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Spicy Tava Idlis": "❌ Error scraping https://www.tarladalal.com/spicy-tava-idlis-1669r: 522 Server Error:  for url: https://www.tarladalal.com/spicy-tava-idlis-1669r",
        "Vermicelli Nut Idli": "❌ Error scraping https://www.tarladalal.com/vermicelli-nut-idli-1704r: 404 Client Error: Not Found for url: https://www.tarladalal.com/vermicelli-nut-idli-1704r",
        "Kodo Millet Idli": "Ingredients: , 1, , cup, , kodo millet / any millet, 1/4, , cup, , Split Black gram/ Urad dal, 1/2, , tsp, , Fenugreek seeds/ methi, 2, , tbsps, , Thick beaten rice/ Poha, Salt, , , as needed, Oil to grease, , , In a mixer / grinder, add salt and mix well . Set aside overnight / 6-10 hrs for fermentation, , Morning the batter would have fermented well. Mix well before pouring into greased idli moulds / making dosa ., , To make dosa :, Heat a tawa. Grease with oil.Pour a laddle full of batter..Spread it in circular direction .Drizzle few drops of oil or ghee around it.Cover and cook on medium flame for abt 1-2 mins.No need to flip over and cook . Once its done, the dosas come out easily from the tawa ., , , Fold and serve crispy kodo millet dosa accompanied with chutney or sambar or chutney powder of your choice., , To make Idli :, Heat water in a steamer.Grease idli molds with oil .Pour the batter into idli stand., , Steam for 10-12 mins on medium flame.Prick a tooth pick,if it comes clean it means its done.Allow it to cool a bit and remove from molds using a spoon or knife., , That's it soft, spongy and healthy kodo millet idlii's are ready to serve. Serve with Chutney / Sambar / Chutney Powder., , , , , , , , , YOU MAY ALSO LIKE:, BREAD DOSA / BREAD UTHAPPAM - INSTANT DOSA RECIPE, RAGI SEVAI / RAGI SEMIYA / FINGERMILLET VERMICELLI UPMA - INSTANT !!, MENTHE DOSE / METHI DOSA / FENUGREEK SEEDS PANCAKES, FERMENTED RAGI DOSA / NACHNI DOSA /FINGERMILLET CREPE, Twitter, Facebook, Pinterest, Telegram, WhatsApp, Yummly, , , DOSA RECIPES, IDLI RECIPES, MILLET RECIPES, , , , , , May 20, 2015, , By, , Smitha Kalluraya, , , , 14, , , , , , , , , , , AAMLICIOUS - MANGO FESTIVAL AT KHANDANI RAJDAHANI, , AVIAL RECIPE / KERALA STYLE AVIYAL RECIPE, , , , , , , , About, , Smitha Kalluraya, , , , , You Might Also Like, , , , AVAREKALU UPPITTU RECIPE / AVAREKAI RICE RAVA UPMA / AVAREKALU AKKI TARI UPMA, , February 17, 2020, , , , , ASH GOURD DOSA / BOODU KUMBALAKAI DOSA / ASH GOURD RECIPES, , May 20, 2019, , , , , JOLADA PADDU / JOWAR ( SORGUM ) PANIYARAM / JOWAR APPE RECIPE, , February 26, 2016, , , , , 14 Comments, , , , , , , , , Reply, , , Sony P, , May 20, 2015 at 1:33 pm, , Both looks delicious and healthy !, , , , , , , , , , , , , Reply, , , marudhus kitchen, , May 20, 2015 at 1:49 pm, , Very nutrious.Idli and dosa, , , , , , , , , , , , , Reply, , , Kalyani, , March 9, 2019 at 2:09 pm, , Too good. Will try definetely, , , , , , , , , , , , , , , Reply, , , Vibha Sp, , May 20, 2015 at 2:06 pm, , wow very nice idli n dosa, never tasted, , , , , , , , , , , , , Reply, , , Sathya Priya, , May 20, 2015 at 2:51 pm, , very healthy idli,dosa ..Yumm, , , , , , , , , , , , , Reply, , , mrkk08, , May 21, 2015 at 9:17 am, , Healthy and yummy dosao, , , , , , , , , , , , , Reply, , , mrkk08, , May 21, 2015 at 9:17 am, , Healthy and tasty idli dosai, , , , , , , , , , , , , Reply, , , Gloria, , May 22, 2015 at 7:30 am, , healthy and yummy dosa…….looks delicious, , , , , , , , , , , , , Reply, , , Maha Gadde, , May 24, 2015 at 12:29 am, , Healthy n yummy dosa.., , , , , , , , , , , , , Reply, , , Dr. Suhasini, , May 26, 2015 at 9:01 am, , Honestly, I never bothered to look at the millet section in a supermarket Smitha. I immediately got a pack and tried out the idli with a slight modification – I used whole black gram with the skin. It’s really very delicious – my mother also liked it very much. (My mother and I would always like to experiment new healthy veg cooking)Thank you:), , , , , , , , , , , , , Reply, , , Anonymous, , June 29, 2015 at 6:34 am, , Very nice. Will give a try.., , , , , , , , , , , , , Reply, , , Anushs, , August 23, 2017 at 9:44 am, , What can I replace poha with?, , , , , , , , , , , , , Reply, , , Smitha Kalluraya, , August 24, 2017 at 6:04 am, , you can skip …, , , , , , , , , , , , , , , Reply, , , vasantha, , June 14, 2018 at 12:49 pm, , for dosa, 1/2 cup – urad dal, 1/2 cup – bajra, 1/2 cup – Jowar, 1/2 cup – Ragi, 1/2 cup – Brown rice, 1/2 cup – Brown/white Poha, methi seeds, salt as needed, , Soak and grind just like normal dosa batter, ferment and make dosa., , , , , , , , Leave a Reply, Cancel Reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Website, , , , , , Δ, , , , , , , , About Me, , , , , , Hi !! I am Smitha Kalluraya - the face behind this blog.I am based in Bangalore .\r\nFor any queries, business collaboration ,media events etc please feel free to shoot a e-mail to : \r\nreach.smithakalluraya@gmail.com, , , Follow us, , , , , , , , , LATEST YOUTUBE VIDEO …SUBSCRIBE !!!, , , , , , , , , , SIDE DISH FOR ROTI / CHAPATHI, , , , , , , , KARNATAKA CUISINE, , , , , , , , CHUTNEY RECIPES, , , , , , , Subscribe to our mailing list, , , , , , , , , , , , , , , , , MILLET RECIPES, , , , Latest Posts, , , , The Top Cities Around the World for Food Lovers, , March 30, 2025, , , , , , , , , Smart gambling at Lucky Star: bankroll, strategy & self-control tips, , March 21, 2025, , , , , , , , , Strawberry Oats Smoothie | Strawberry Oatmeal Smoothie | Sugar free Strawberry Smoothie for weight loss, , March 13, 2025, , , , , , , , , Spicing Up Life: How Digital Games Flavor Indian Homes, , March 13, 2025, , , , , , , , , Best Food Options at Universal Orlando, , January 28, 2025, , , , , , Search Recipes in Cook With Smile, , , , , , , , , , , Categories, Categories, , Select Category, , Articles  (56), , BEVERAGES, SOUP & SALAD  (40), , Breakfast Recipes  (150), , CAKES & BAKES  (24), , CHUTNEY & RAITA  (74), , Collections  (9), , Dosa & Idli  (48), , flat bread Varities  (28), , No Onion No Garlic  (59), , North Indian Curry  (47), , PALYA / PORIYAL / SOUTH INDIAN SABZI  (28), , Pickles,Jam & Chutney powder  (23), , Poha & Upma  (29), , PRODUCT REVIEW  (77), , RESTAURANT REVIEWS  (31), , Review  (41), , RICE VARITIES  (43), , Sambar,Rasam,Gojju & Dal  (82), , Sandwich Varities  (13), , side dish  (51), , Snacks & Starters  (122), , SPICE BLENDS & PAPAD  (17), , Sweet / Dessert  (76), , travel  (17), , Uncategorized  (54), , VIDEO RECIPES  (198), , , , , , , , , , , , , , , Facebook, , , Twitter, , , Instagram, , , Pinterest, , , Google +, , , Youtube, , , , , , , , Copyright 2022 -, Cook With Smile, . All Rights Reserved.    Here is Our, Privacy Policy, , Top, , Maintained by, WPOrbit, , , , , , , , , , , , , , , , , , , , , , Instructions: , Take kodo millet, urad dal and methi in a bowl . Wash nicely and soak for about 4 hours . Just 30 mins before grinding",
        "Kancheepuram Idli": "Ingredients: , , , , , , , , Also we have prepared, Tamil Kovil idli, using idli moulds for convenience, this batter is traditionally cooked in small greased katoris or in a large, round, flat cooker vessel and then sliced into squares or triangles., Everyone in the family is sure to love, easy South Indian breakfast, and be it for, breakfast, , , lunch, or, dinner, . Besides this idli, you can also make other varieties from my collection of, Idli recipes, , such as the, Palak Rava Idli, which is enriched with iron, then there is the, Stuffed Potato Idli, which is more filling and a good option to serve for lunch or dinner, for a nutty and spicy flavour I make, Vermicelli Nut Idli, which is also good to serve while entertaining., Tips for, kanchipuram idli, . 1. Mixing with hands helps in the fermentation process so don’t skip this step. 2. Depending on the weather, the batter may take about 8-12 hours to ferment. If the temperature is too low, it may take even 14 hours to ferment. 3. Though the list of spices and condiments may look vast, we recommend you add all of them in the said amounts to enjoy the authentic flavours of this idli. 4. Remember to grease the idli moulds with oil, before pouring the batter in it. This step of greasing makes the demoulding of idli very easy., Enjoy, kanchipuram idli recipe, |, kancheepuram idli, |, Tamil Kovil idli, |, easy South Indian breakfast, | | with step by step photos., , Kanchipuram Idli, Kancheepuram Idli, Kovil Idli recipe - How to make Kanchipuram Idli, Kancheepuram Idli, Kovil Idli, , , , , , , , Tags, , , , , Indian Steamer Recipes, , Steam, , Indian Breakfast Recipes, , Breakfast Idlis / Dosas / Uttapam, , Indian Dinner, , South Indian Dinner, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 25 Mins, , , , , , , Total Time, , 40 Mins, , , , , , , Makes, , 25 idlis, , , , , , , , , , , , , , , For The Basic Idli Batter, , , 1/4 cup, urad dal (split black lentils), , , 1/2 tbsp, fenugreek (methi) seeds, , , 1 cup, parboiled rice (ukda chawal), , , 1 1/2 tbsp, thick beaten rice (jada poha), , , , salt, to taste, , , For The Kanchipuram Idli, , , a pinch of, turmeric powder (haldi), , , 1/2 tsp, dried ginger powder (sonth), , , 1/2 tsp, cumin seeds (jeera), , , 3 whole, black peppercorns (kalimirch), , , 1 tsp, sesame (til) oil, , , 1 tbsp, ghee, , , 1/2 tbsp, chana dal (split Bengal gram), , , 1/2 tsp, mustard seeds ( rai / sarson), , , 1/2 tsp, urad dal (split black lentils), , , 1 tsp finely, chopped green chillies, , , 1/2 tbsp, chopped cashew nut (kaju), , , 8, curry leaves (kadi patta), , , , oil, for greasing, , , For Serving With Kanchipuram Idli, , , , kadala curry, , , , kolumbu, , , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , What are Idlis?, , , , , , , , , If you like kanchipuram idli, , , , , , , , , How to ferment the batter of kanchipuram idli, , , , , , , , , For the batter Kanchipuram idli, , , , , , , , , How to cook Kanchipuram idli, , , , , , , , , Tips for Kanchipuram idli, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , kanchipuram idli recipe, |, kancheepuram idli, |, Tamil Kovil idli, |, easy South Indian breakfast, | with 52 amazing images., kanchipuram idli recipe, |, kancheepuram idli, |, Tamil Kovil idli, |, easy South Indian breakfast, | is a special savoury idli which got its name from that small town in Tamil Nadu. Learn how to make, easy South Indian breakfast, ., To make, kanchipuram idli, , to the idli batter after fermentation, add the turmeric powder and dried ginger powder and mix well. Keep this batter aside. Combine the cumin seeds and peppercorns in a mortar pestle (khalbatta), crush to a coarse mixture and keep aside. Heat the sesame oil and ghee in a small non-stick pan, add the chana dal and sauté on a medium flame for 1 minute. Add the mustard seeds, urad dal, cumin seeds-peppercorn mixture and green chillies and sauté on a medium flame for 1 minute. Add the cashewnuts and curry leaves and sauté on a medium flame for another 30 seconds. Add this tempering to the kanchipuram idli batter, mix well and pour spoonfuls of the batter into each of the greased idli moulds. Steam in an idli steamer for 10 minutes or till they are cooked. Repeat with the remaining batter to make more kanchipuram idlis. Allow the kanchipuram idlis to cool slightly and demould them. Serve the, kanchipuram idli, hot with kolumbu and coconut chutney., Kancheepuram idli, is famous for more than silk sarees! In fact, it is offered at the Sri Varadharaja Swamy Temple, and food-lovers are generally prepared to even withstand the hardships of a long queue to buy the prasad of tasty Kanchipuram Idli from there. Indeed, with an elaborate tempering of assorted spices, these idlis are a mouth-watering treat., Here is how you can prepare, kanchipuram idli, in your own kitchen. While we have shown how to make the basic idli batter, , , , For basic idli batter, , Combine the urad dal and fenugreek seeds and enough water in a deep bowl and mix well. Cover with a lid and keep aside to soak for 4 hours., Combine the par-boiled rice and thick beaten rice and enough water in a deep bowl and mix well. Cover with a lid and keep aside to soak for 4 hours., Wash and drain the urad dal and fenugreek seeds and blend in a mixer to a smooth paste using approx. 1/2 cup of water. Transfer the mixture into a deep bowl and keep aside., Wash and drain the par-boiled rice and thick rice flakes and blend in a mixer to a slightly coarse paste using approx. 3/4 cup of water. Add this mixture to the urad dal-fenugreek seeds mixture, add the salt and mix very well., Cover it with a lid and keep aside to ferment in a warm place for 12 hours., How to make the kanchipuram idli, , To make, kanchipuram idli, , after fermentation, add the turmeric powder and dried ginger powder and mix well. Keep this batter aside., Combine the cumin seeds and peppercorns in a mortal pestle (khalbatta), crush to a coarse mixture and keep aside., Heat the sesame oil and ghee in a small non-stick pan, add the chana dal and sauté on a medium flame for 1 minute., Add the mustard seeds, urad dal, cumin seeds-peppercorn mixture and green chillies and sauté on a medium flame for 1 minute., Add the cashewnuts and curry leaves and sauté on a medium flame for another 30 seconds., Add this tempering to the kanchipuram idli batter, mix well and pour spoonfuls of the batter into each of the greased idli moulds., Steam in an idli steamer for 10 minutes or till they are cooked., Repeat with the remaining batter to make more kanchipuram idlis., Allow the kanchipuram idlis to cool slightly and demould them., Serve the kanchipuram idli hot with kolumbu and coconut chutney., , , , , , , , , , , , , , Kanchipuram idli recipe | kancheepuram idli | Tamil Kovil idli | Video by Tarla Dalal, , , , , ×, , , , , , Kanchipuram Idli, Kancheepuram Idli, Kovil Idli recipe with step by step photos, , , , , , , , , , , , , , , , , , , What are Idlis?, , , , , , , , , What are Idlis? Idli is considered to be one of the healthiest breakfasts in Indian cuisine. Although it is traditionally a, South Indian snack, , it has now become extremely popular all over the country – and with good reason too., Idli, is a, steamed food, , made with with a fermented batter of rice,, urad dal, and fenugreek seeds. White and fluffy, it is a delight to bite into. It has a mellow flavour, which gives scope for the accompaniment to shine.  Idli is a standard, South Indian breakfast, item in the South, supplemented with a small quantity of some other dish. What varies is the accompaniment. Usually, Idli is served with, Sambar, and one or more chutneys such as, Coconut Chutney, , Coriander Chutney or, Tomato Chutney, . When in a hurry, the Idli is served with dry chutney powders like, Idli Milagai Podi, , Coconut Powder or Curry Leaves Powder., , There are different variants of Idli, made using different combinations of grains and lentils. You can try the, Rice and Moong Dal Idli, ,, Barley Idli, ,, Poha Idli, ,, Cooked Rice Idli, and Palak Moong Dal Idli. Likewise, you can also add spices, herbs and veggies to the, idli, batter to make variants such as the, Kanchipuram Idli, and, Paneer Vegetable Idli, . Not all, idlis, require you to soak, grind and ferment the batter. You can also make Instant Idli recipes like you make Instant Dosas and Instant Dhoklas. The most famous example of a quick and instant, idli, is the, Rava Idli, or Suji Idli., Vermicelli Nut Idli, and, Palak Rava Idli, extend the idea of, quick Suji Idli, with exciting twists!, Instant Bread Idli, and, Dal Vegetable Idli, are other instant, idlis, worth a try., , Like, dosas, and, chapatis, idlis, can also be stuffed with exciting fillings! Try the, Stuffed Potato Idli, and, Double Decker Idlis Stuffed with Potato and Chutney, . Such, idlis, make wonderful evening snacks. Treat your kids to the, Stuffed Rava Idli Vegetable Sandwich, when they come home from school and watch them finish it off without any fuss!, , If you have some, idli, batter on hand, it becomes very easy to quickly conjure up a meal for your family., Idli, can be served not just for breakfast, but also as an evening snack or for dinner, depending on the form it is cooked in and what it is served with. Regular Idli stays soft and fluffy for a long time if made properly. It can be carried in the, dabba,, or even taken along while travelling. Just smear a little oil on the, idlis, and coat them with Idli Milagai Podi, and it becomes a one-dish meal that is handy to eat on-the-go!, , You can use your, idli, batter to make other snacks like Dosa and Appe. You can also turn your leftover, idlis, into exciting munchies like the, Idli Upma, or, Spicy Tava Idli, !    See, a jar of idli batter in the fridge makes life so easy!, , , , , , , , , , , , , , , , If you like kanchipuram idli, , , , , , , , , If you like, kanchipuram idli,, also try other unique recipes usinf idli like, , idli chilli, , idli chaat, , idli upma, , , , , , , , , , , , , , , , , , How to ferment the batter of kanchipuram idli, , , , , , , , , , To ferment the batter of kanchipuram idli recipe | kancheepuram idli | Tamil Kovil idli | easy South Indian breakfast, , put 1/4 cup, urad dal (split black lentils), in a bowl. Fresh urad dal is best suitable to get soft idlis., , , , , , Add 1/2 tbsp, fenugreek (methi) seeds, . It helps in fermentation and make soft idlis in case you do not find current years harvested urad dal., , , , , , Wash it well., , , , , , Drain it., , , , , , Pour enough water and mix well., , , , , , Cover with a lid and keep aside to soak for 4 hours., , , , , , Drain it once it is soaked., , , , , , In another bowl, add 1 cup, par-boiled rice (ukda chawal), . For the homemade idli batter, we would highly recommend you make use of par-boiled rice which is a variety of short grained rice. Any variety of short or medium grained like sonna masoori, ponni rice works well. We wouldn’t suggest you to make use of long-grained rice like basmati., , , , , , Pour enough water and mix well., , , , , , Add 1 1/2 tbsp, thick beaten rice (jada poha), ., , , , , , Cover with a lid and keep aside to soak for 4 hours., , , , , , After 4 hours, drain the soaked parboiled rice and beaten rice. It will look like this., , , , , , Transfer the soaked and drained urad dal and fenugreek seeds to a mixer jar., , , , , , Add approx. 1/2 cup of water. Do not add all water at once, start with lesser amount and add water as needed. Traditionally, a stone grinder is used to prepare idli/dosa batter. If you have one, make use of it or you can also make use of a wet grinder or mixer grinder like us. Ensure the batter does not warm up while grinding. If your mixer jar gets heated quickly, make use of cold water while grinding. This will prevent the idly from turning hard., , , , , , Blend to a smooth paste, transfer the mixture into a deep bowl and keep aside. A light fluffy batter is a key to soft, pillowy idlis., , , , , , Similarly, drain the par-boiled rice and thick rice flakes. Poha is optional but, it helps in giving a spongy texture to, idli, ., , , , , , Transfer to a mixer jar and add approx. 3/4 cup of water. Add enough water to grind the batter and don’t be scared of the amount because less water results in denser idli. Also, the quantity of water depends upon the quality of rice you use., , , , , , Blend to a slightly coarse paste and add this mixture to the urad dal-fenugreek seeds mixture. Open the mixer jar once in between, push down the contents and blitz it. For the idli to have a fluffy texture, it is important to soak and blend the dal and rice separately., , , , , , Add salt. There are conflicting thoughts about the addition of salt. Many people add before fermentation, many after. But, as per our observation the addition of salt helps in fermentation., , , , , , Mix very well with clean hands. Mixing with hands helps in the fermentation process so don’t skip this step., , , , , , Cover it with a lid and keep aside to ferment in a warm place for 12 hours. Idli batter requires a warm place to ferment. If you live in a warm place, you can leave the batter outside on your kitchen counter and it will ferment. However, if you live in a cold place, place the batter in the oven with the lights on or in a preheated oven. Depending upon the weather, the batter will require somewhere between 8-12 hours to ferment., , , , , , , , , , , , , , , , , , , , For the batter Kanchipuram idli, , , , , , , , , To make, kanchipuram idli recipe | kancheepuram idli | Kovil idli | easy South Indian breakfast, , after fermentation this is how the batter looks like. If you wish you can also buy ready idli batter. It is easily available in the market., , , , , , Add the turmeric powder., , , , , , Add dried ginger powder. This is also called as soonth in Hindi., , , , , , Mix the batter of, kanchipuram idli recipe | kancheepuram idli | Kovil idli | easy South Indian breakfast, very well. Keep this batter aside., , , , , , Then add the cumin seeds into a mortar pestle (khalbatta)., , , , , , Add 3 peppercorns to it., , , , , , Crush it to a coarse mixture. This mixture gives a very unique strong flavour to the idli. Keep aside., , , , , , Next heat the sesame oil and ghee in a small non-stick pan for tempering. Using a combination of both lends a nice pleasing aroma to the, kanchipuram idli recipe | kancheepuram idli | Kovil idli | easy South Indian breakfast, ., , , , , , Add chana dal to it., , , , , , Sauté on a medium flame for 1 minute., , , , , , Then add the mustard seeds., , , , , , Also add urad dal, which is very important in most South Indain tempering., , , , , , Add the prepared cumin seeds-peppercorn mixture., , , , , , Add some finely chopped green chillies for spicy flavour., , , , , , Again sauté on a medium flame for 1 minute., , , , , , To this add the cashewnuts. Addition of cashews is very unique to this idli. Chop them before adding. They add crunch in the idli., , , , , , Add some curry leaves., , , , , , Sauté on a medium flame for another 30 seconds., , , , , , Add this tempering to the kanchipuram idli batter., , , , , , Mix well using a spoon., , , , , , This is how the batter looks after mixing. You will dwell into the aroma of the tempering being mixed with the batter., , , , , , , , , , , , , , , , , , , , How to cook Kanchipuram idli, , , , , , , , , To cook, kanchipuram idli recipe | kancheepuram idli | Kovil idli | easy South Indian breakfast, , first put some water to boil in a idli steamer., , , , , , Grease the idli mould with little oil. This step of greasing makes the demoulding of idli very easy., , , , , , Pour spoonfuls of the batter into each of the greased idli moulds., , , , , , Place the in a steamer and steam in an idli steamer for 10 minutes or till they are cooked., , , , , , Repeat with the remaining batter to make more easy South Indian kanchi idli., , Allow the, kanchipuram idli recipe | kancheepuram idli | Kovil idli | easy South Indian breakfast, to cool slightly and demould them., , , , , , Serve the, kanchipuram idli recipe | kancheepuram idli | Kovil idli | easy South Indian breakfast, hot with, kolumbu, and, coconut chutney, ., , , , , , , , , , , , , , , , , , , , Tips for Kanchipuram idli, , , , , , , , , You can buy readymade idli batter from the market to save time or, make idli batter at home., , , , , , , Mixing with hands helps in the fermentation process so don’t skip this step., , , , , , Depending on the weather, the batter may take about 8-12 hours to ferment. If the temperature is too low, it may take even 14 hours to ferment., , , , , , Though the list of spices and condiments may look vast, we recommend you add all of them in the said amounts to enjoy the authentic flavours of this idli., , , , , , Remember to grease the idli moulds with oil, before pouring the batter in it. This step of greasing makes the demoulding of idli very easy., , , , , , For convenience, this batter is traditionally cooked in small greased katoris or in a large, round, flat cooker vessel and then sliced into squares or triangles., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per idli, Energy, 50 cal, Protein, 1.6 g, Carbohydrates, 8.2 g, Fiber, 0.7 g, Fat, 1.2 g, Cholesterol, 0 mg, Sodium, 2.3 mg, , , , , , , Click here to view, Calories for Kanchipuram Idli, Kancheepuram Idli, Kovil Idli, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Sheetal, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Very nice and new item for me.... thanks, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , jagruti, , March 13, 2025, midnight, , I made kanchipuram idli first time. It turned out very well  delicious and everyone liked it. Thank you for sharing, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback! Well cooked., , , , , , , , , , , , , Harsha deshmukh, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Archana M, , March 13, 2025, midnight, , Flavourful, crunchy and tasty idli. The tempering added to the batter is so aromatic, and the cashewnuts added gives a very rich taste. This is the perfect kanchipuram idli, which i had in kanchipuram., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Dhwani, , March 13, 2025, midnight, , I was always looking for an authentic kanchipuran idli recipe as everyone in my family including me just love it. This recipe is just perfect. Though the major difference is just the tempering, it completely changes the taste of the idli. I served it with kolumbu as mentioned in your recipe and it tastes great with it., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Dileep Adoor, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Cooked Rice Idli recipe with leftover rice, , , 42 Calories, , , , , , , , , , , , , , , , , idli recipe |  idli  batter recipe | South Indian style idli | soft idli |, , , 33 Calories, , , , , , , , , , , , , , , , , Kanchipuram idli recipe | kancheepuram idli | Tamil Kovil idli |, , , 50 Calories, , , , , , , , , , , , , , , , , semolina and vermicelli idli recipe | rava semiya idli | instant vermicelli idli |, , , 88 Calories, , , , , , , , , , , , , , , , , tava idli recipe | spicy tava idli | South Indian tava vegetable idlis |, , , 0 Calories, , , , , , , , , , , , , , , , , Sooji Idli ( Suji Idli) recipe, Instant Rava Idli, instant suji ki idli, , , 44 Calories, , , , , , , , , , , , , , , , , Dal and Vegetable Idli recipe, Idli Recipes, Dosa Recipes, , , 49 Calories, , , , , , , , , , , , , , , , , aloo stuffed idli recipe | Indian style potato stuffed idli | instant aloo masala stuffed idli |, , , 23 Calories, , , , , , , , , , , , , , , , , quick rava idli recipe | instant idli using sooji | easy no fermentation semolina idli |, , , 50 Calories, , , , , , , , , , , , , , , , , instant poha idli | instant avalakki idli | instant aval idli |, , , 42 Calories, , , , , , , , , , , , , , , , , Stuffed Spinach Idli recipe, Idli Recipes, Dosa Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , vegetable idlis recipe | vegetable idlis with coconut milk | healthy South Indian vegetable idlis |, , , 60 Calories, , , , , , , , , , , , , , , , , Double Decker Idlis Stuffed with Potato and Chutney recipe, Healthy Recipes, , , 37 Calories, , , , , , , , , , , , , , , , , vermicelli idli recipe | instant sooji vermicelli idli | semiya rava idli |, , , 79 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Curd Idli": "Ingredients: , , 500 ml, Curd (Dahi / Yogurt), , , 3 cups, Idli Dosa Batter, , , 1 teaspoon, Mustard seeds (Rai/ Kadugu), , , 1/2 teaspoon, Chana dal (Bengal Gram Dal), , , , Asafoetida (hing), , , 1 sprig, Curry leaves, , , 2, Dry Red Chillies, , , 1 teaspoon, Oil, , , , Salt, , to taste, , , , , How to make Thayir Idli Recipe (South Indian Idli In Tempered Curd), , To begin making Idli Thayir Pachadi Recipe, take the curd in a big bowl, season with salt and whisk it to a smooth creamy texture and keep aside., In the mean, steam the mini idlis using an idli steamer and keep aside., Once the idlis are cooled, add it to the bowl of whisked curd., Heat oil in a small tadka pan, add mustard seeds and chana dal and let it crackle., Add the asafoetida, red chillies and curry leaves and let it splutter and switch off the flame., Add this tadka over the idlis dunked in curd and mix well., Serve Idli Thayir Pachadi Recipe along with, masala chai, as a tea time snack., , , , , , , , , , , , , , , , , , , Published in, Indian Snack Recipes, , , , , , , Dahi Recipes (Curd/Yogurt), , , , Chana Dal Recipes (Bengal Gram Dal), , , , , , , , Last Modified On Monday, 16 January 2017 11:01, , , , , , , , , , , , , , , , , , , , , , , , , , , You May Also Like, , , , , , , , , , , , , Foxtail Millet Rava Idli Recipe, , , , , , , , , , , , , Barley Rava Idli Recipe, , , , , , , , , , , , , Godhumai Idli Recipe (Instant Whole Wheat Flour Idli), , , , , , , , , , , , , Veggie Rava Idli Recipe- Healthy Breakfast Idli, , , , , , , , , , , , , , , Instant Oats Rava Idli Recipe, , , , , , , , , , , , , Sabbakki Rava Idli Recipe- Sabudana Rava Idli, , , , , , , , , , , , , Karnataka Style Badnekayi Mosaru Gojju Recipe, , , , , , , , , , , , , नारियल की चटनी रेसिपी - Coconut Chutney Recipe, , , , , , , , , , , , , , , Popular Recipes, , , , , , , , , , , , , , , Vegetarian Thai Green Curry Recipe, , , By, Archana Doshi, , , , , , , , , , , Bhang Thandai Recipe, , , By, Madhuri Aggarwal, , , , , , , , , , , Chicken Momos Recipe -Delicious Steamed Chicken Dumplings, , , By, Archana's Kitchen, , , , , , , , , , , Hariyali Chicken Tikka Recipe, , , By, Archana's Kitchen, , , , , , , , , , , Featured Recipes, , , , , , , , , , , , Mangalorean Style Kuvalyacho Pollav Recipe (Yellow Pumpkin Curry Recipe), , , By, Archana's Kitchen, , , , , , , , , , , Roasted Garlic No Knead Skillet Bread Recipe With Olives, , , By, Archana's Kitchen, , , , , , , , , , , Mysore Style Avarekalu Rasam Recipe, , , By, Archana's Kitchen, , , , , , , , , , , Konkan Style Vali Bhajji Ambat Recipe-Spiced Malabar Spinach Dal, , , By, Archana's Kitchen, , , , , , , , , , , Kale Apple Salad Recipe, , , By, RUBY PATHAK, , , , , , , , , , , Beetroot, Aloo & Amaranth Leaves Sabzi Recipe, , , By, Archana's Kitchen, , , , , , , , , , , Indian Non Veg Recipes, , , , , , , , , , , , Andhra Pepper Chicken Recipe - Dry Restaurant Style Pepper Chicken, , , By, Archana Doshi, , , , , , , , , , , Mangalorean Chicken Ghee Roast Recipe, , , By, Archana's Kitchen, , , , , , , , , , , Dhaba Mutton Recipe-Spicy Mutton Gravy, , , By, Pooja Thakur, , , , , , , , , , , Quick And Simple Egg Curry Recipe, , , By, Archana Doshi, , , , , , , , , , , Hariyali Chicken Tikka Recipe, , , By, Archana's Kitchen, , , , , , , , , , , , , , Kerala Egg Roast Masala Recipe, , , By, Archana Doshi, , , , , , , , , , , Indian Sabzi & Curry, , , , , , , , , , , , Punjabi Style Tinda Sabzi Recipe, , , By, Madhuli Ajay, , , , , , , , , , , Spicy Baby Potatoes Recipe, , , By, Shaheen Ali, , , , , , , , , , , Baingan Tamatar Sabzi - Brinjal/ Eggplant Masala Recipe, , , By, Archana Doshi, , , , , , , , , , , , , , Aloo Simla Mirch Ki Sabzi Recipe - Aloo & Capsicum Sabzi, , , By, Archana Doshi, , , , , , , , , , , , , , , , , , Mission,Vision & Values, Archana's Kitchen Team, Careers, Terms & Conditions, Privacy Policy, Refunds & Cancellation Policy, Pricing Policy, © Archana's Online Media & Publishing Services LLP, , , , , , , , © 2007 - 2025 Archana's Online Media & Publishing Services LLP, , , , , , About Us, Contact Us, Clients, Brands, Press & Media, , , , , , , , , , , , , , , , , Instructions: "
    }
}