{
    "ingredients": {
        "Poha": "coriander,onion,poha,potato,rice,",
        "Kanda Poha": "coconut,coriander,onion,poha,rice,"
    },
    "recipe_url": {
        "Poha": "https://www.indianhealthyrecipes.com/poha-recipe-kanda-batata-poha/",
        "Kanda Poha": "https://hebbarskitchen.com/kanda-poha-recipe-maharashtrian-poha/"
    },
    "Recipe": {
        "Poha": "Ingredients: raw onions or fresh coconut., , About My Poha Recipes, , The first one is the Maharashtrian Kanda batata poha recipe which we make often for our breakfast. Here Kanda translates to onions and Batata to potato in Marathi. So this one is made with onions and potatoes. You can use both or skip any one of them. Or replace potatoes with some green peas., , I prefer to use potatoes as my kids love them in their poha. You can either use boiled/ steamed potatoes or use them raw directly and cook in the pan., , coconut. This is best to serve for a snack. In this recipe poha is not rinsed or steamed. It is eaten in the raw form but is softened. It tastes delicious with good flavors of fried curry leaves and green chilies., , , This is made by mixing chopped onions, fresh grated coconut, coriander leaves, lemon juice, poha, salt and sugar. To soften the poha, little coconut water or plain water is splashed., , Then a tempering of curry leaves, green chilies, mustard seeds and peanuts is poured to the mixture. It is covered so the dadpe pohe absorbs much of the tempering flavour., , This is even easier than the first recipe. Again there are different versions of this. Sometimes I add little grated cucumber, carrots and sometimes tomatoes too. This is best made with fresh coconut and medium poha., , , , 2 cups poha (medium flakes), ¾ to 1 cup fresh grated coconut, 1 medium onion (½ cup finely chopped), 1 to 2 green chilies (chopped, adjust to taste), 1/3 cup coriander leaves (fine chopped), 1 teaspoon powdered sugar (or fine sugar), ½ teaspoon salt (adjust to taste), 1 medium lemon (adjust to taste), 1 to 2 tablespoons coconut water or plain water, ¼ to ½ teaspoon mustard seeds, 1 tablespoon oil (more if needed), 2 sprigs curry leaves (torn or chopped), 1 pinch hing / asafoetida, 1 to 2 pinches turmeric, ¼ cup peanuts, , ▢, 1 ½, , cups, , poha, , (beaten rice flakes )(thick to medium flakes), ▢, 1, , medium, , onion, , finely chopped, ▢, 2 to 3, , green chilies, , slit or chopped, ▢, 1, , sprig, , curry leaves, ▢, 1, , medium, , potato, , (optional)  cubed to ½ inch (or ½ cup mix veggies), ▢, 1½, , tablespoons, , oil, ▢, 3 to 4, , tablespoons, , peanuts, , or cashews, ▢, ¾, , teaspoon, , mustard seeds, ▢, ¾, , teaspoon, , cumin seeds, , (jeera), ▢, 1, , pinch, , hing, , (asafoetida), ▢, ¼, , teaspoon, , turmeric, , (add more if needed for color), ▢, ⅓, , teaspoon, , salt, , (adjust to taste), ▢, ½ to 1, , teaspoon, , sugar, , (optional), ▢, Lemon juice as needed, ▢, 2, , tablespoons, , coriander leaves, , chopped,  Instructions: then it is good to use them boiled., , The second recipe is for dadpe pohe which is more common in the Konkan region. This recipe needs fresh coconut and is quick to make like the first one. I have been making this in the recent times for a change., , Another popular version is the Indori poha which I am yet to share. The use of fennel seeds make it very distinct in flavor from the Maharashtrian version. It is garnished the same way with sev & raw onions., , , More Breakfast recipes,, Chilla recipe, Methi Thepla, Upma recipe, Rava idli, Semiya upma, Akki roti, , , Photo Guide, , How to Make Poha (Stepwise Photos), , 1. Clean 1½ cups poha and add them to a large colander, strainer or bowl or pot. Please note that to make non sticky poha, you will need to use thick or medium flakes. If you use thin flakes poha will turn mushy after rinsing them., , , 2. You have to be quick at this step as doing it slowly will make them too mushy and soggy. Rinse them well with clean filtered water. Drain the water completely. Repeat the rinse & drain the water completely. I usually rinse them twice but if you feel they turn too mushy after the first rinse then stop rinsing further. Keep the bowl aside., , , 3. Meanwhile chop 1 medium sized onion and 1 to 2 green chilies. Also rinse the curry leaves and coriander leaves. Fine chop the coriander leaves. If you want to use potatoes then chop them to half inch cubes and keep them immersed in water until needed., , 4. Check if poha has softened by pressing down a few flakes in between your thumb and fore finger. Run your finger across the flattened rice to break lumps if any. Poha would have absorbed water and softened in about 5 to 7 mins., , If they are not soft yet, then sprinkle some water and set aside until the tempering is ready. Make sure they do not turn mushy. Add salt and sugar (optional). Mix and set aside., , , Temper for Poha, , 5. Heat a pan with ½ tablespoon oil and fry the peanuts until golden and crunchy. Set them aside for garnishing. This way the peanuts remain crunchy. You can also dry roast the peanuts if you prefer., , , 6. Heat the same pan with 1 to 1 ½ tablespoon oil. When the oil becomes hot, add ¾ teaspoon mustard seeds and ¾ teaspoon cumin seeds. Let them splutter., , , 7. Add chopped onions, green chilies and curry leaves., , , 8. Saute until the onions turn pink. If using potatoes, drain the water completely and add the cubes to the pan. Saute for 2 to 3 minutes., , , 9. Cover the pan and cook on a low heat until the potatoes are soft cooked. If needed you may add more oil., , , 10. Once the potatoes are cooked thoroughly, you can saute them on a high flame for 1 to 2 mins. Add turmeric., , , 11. Add softened poha and mix well., , , 12. Cover and steam on a low heat until poha becomes hot. Stir in between to prevent burning. If you feel your poha is too dry, then you may sprinkle some water in between. When done it should be soft and not mushy. Sprinkle coriander leaves and roasted peanuts., , , 13. Take it off the heat. Taste and add more salt if needed. Add lemon juice and keep it covered until served., , , Garnish kanda batata poha with fine chopped coriander leaves and roasted peanuts. You can also sprinkle some grated coconut or crunchy sev., , , Pro Tips, , Choosing poha, : Using the right kind of poha is very important for this recipe. Always choose medium to thick poha flakes and avoid the thin ones. The thin kind are not suitable to make this recipe as they turn mushy when rinsed., , Test your poha if you are a newbie: You can check simply by rinsing a spoonful of poha in little water and drain completely. If they do not turn mushy then they are very much suitable to use in this recipe., , If they turn mushy then you may use them to make dadpe pohe (recipe 2) instead., , Rinsing poha, : Do not over rinse or over soak the poha otherwise they may turn mushy. I generally rinse them twice and drain the water completely. Cover and set aside until the tempering is ready., , After chopping the onions, check if the poha is soft by pressing a few flakes in between the thumb and the fore finger. They should break easily. If not then sprinkle some water. Mix and cover it till needed., , Veggies, : To make it healthier and balanced you may add different kinds of fine chopped veggies like carrots, peas & capsicum. You can also skip the onions and use fine chopped cabbage. Blanch the cabbage in hot water for 2 to 3 mins and then add use them the same way like onions. Use whatever vegetables you like in your poha., , Toppings, : Poha is generally topped with fresh grated coconut, crunchy peanuts, sev or farsan. It tastes pretty much delicious even with peanuts alone., , Make ahead, , You can make this poha recipe ahead by simply preparing the tempering first. Cool, cover and keep the whole pan/pot in the fridge. When you are ready to eat your poha, simply rinse your flattened rice and soften them. Add them to the tempering and mix. Steam them on a low heat. Your poha will be ready in no time., , , Photo Guide, , Recipe 2, , How to Make Dadpe Pohe, , , 1. To begin with I sieve the poha so any fine powdery stuff can be easily separated. Then add them to a large plate. You will be making the dadpe poha in this., , , 2. Add onions, grated coconut, salt, powdered or fine sugar, lemon juice and coriander leaves., , , 3. Mix all of them. You will see the poha is still dry. At this stage splash little coconut water or plain water if needed. Traditionally it is made with coconut water but plain water can be used. Give a good mix. Cover this and set aside until soft. If you think it is too dry sprinkle little more water. But take care not to add a lot else it will turn mushy., , , 4. Taste test. Add more salt, sugar and lemon juice if needed. This is how mine looked after it softened. Cover this until soft for 5 to 10 mins. Onions and fresh coconut release some moisture so sprinkle more water only if needed after 10 minutes., , , How to make, , 5. Pour 1½ tablespoon oil to a pan and heat it. When the oil becomes hot, add mustard seeds, chopped green chilies and torn curry leaves. When the curry leaves turn crisp, turn off. Add 1/8 teaspoon hing and a pinch of turmeric (optional)., , , 6. Pour this to the premixed poha. Cover it immediately so the flavors are absorbed., , , 7. Meanwhile, roast the peanuts in the same pan until golden and crunchy. I do not prefer to do it with the tempering as the peanuts soften a bit when covered. Add these just before serving., , , Let the dadpe pohe soften to your liking. We like ours a bit chewy and not too soft. If it is not soft then you may sprinkle little water or coconut water. Then transfer to serving bowls. Top with roasted peanuts., , , Faqs, , Why is my poha mushy?, , Using thin flattened rice flakes, over rinsing or over soaking them will make your poha mushy., , , Why is my poha hard?, , Thicker flakes won’t soften quickly evenly after rinsing them a few times. Rehydrate them with a splash of water and let them rest until needed., , , Is poha healthy?, , Yes poha is healthy as it is made by minimally processing paddy. To make flattened rice flakes, paddy is soaked, parboiled and then pressed to flatten & separate the husk. Since they are processed with the bran, most of the nutrients are said to be intact., , , Is flattened rice gluten free?, , Yes flattened rice flakes are naturally gluten free. To make the dish gluten-free, skip asafoetida in the recipe or use one that is gluten-free., , , , Troubleshooting tips, , These tips are helpful especially to those living outside India. There are different kinds of poha in the market. Not all are same and many times they are not the same even though they are from the same brand. Often we end up buying whatever is available. These troubleshooting tips will come handy in such times., , Some kinds of poha are too hard, too thick and dense. They remain hard even after rinsing several times under running water. They either need a short soak for 5 to 10 minutes or they need to be steamed properly for few minutes in a steamer or cooker., , I steam the hard brown poha for 3 minutes & hard white ones for 1 minute in my cooker. They come out fluffy & perfect without becoming mushy., , Sometimes poha turns completely mushy though they look like the medium thick flakes. Test a spoonful of flattened rice by rinsing first. If they are mushy, then are no good to be rinsed. Sprinkle water little by little and mix until all of the poha becomes damp. Set aside to soak & soften., , , Related Recipes, , Upma Recipe, , , Besan Chilla Reci..., , , Thepla Recipe, , , Rava Dosa Recipe ..., , , Aloo Paratha Reci..., , , Rava Uttapam (Soo..., , , , , Recipe Card, , , , , , Poha Recipe, , , 5, from, 285, votes, , , , Poha is a simple Indian breakfast & snack made with flattened rice, peanuts & spices. This recipe will help you to make perfect poha within minutes. I have shared 2 ways to make – kanda poha and dadpe pohe., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 10, minutes, , minutes, Cook Time, 15, minutes, , minutes, Total Time, 25, minutes, , minutes, , Servings, 2, , Author, Swasthi, , , , Preparation, ▢, To make poha, choose medium to thick flakes. Avoid thin flakes. Add them to a bowl or a strainer or colander., ▢, Pour 4 to 5 cups of water and rinse them quickly. Drain the water completely. I rinse them twice., ▢, Cover and set aside to soften. Meanwhile prepare the veggies., ▢, Press a few flakes of poha in between your thumb and forefinger, they should be soft & break easily. If they don't then sprinkle little water mix and cover., ▢, When they turn soft enough, add some sugar and salt. Run your fingers through the poha to break the lumps & spread salt., How to Make Poha, ▢, Heat a pan with oil and fry the peanuts on a medium heat until golden and crunchy., ▢, Remove the peanuts to a plate and set aside., ▢, To the same pan add mustard and cumin., ▢, When they begin to pop, add hing, onions, curry leaves and green chilies., ▢, Saute until the onions turn lightly pink., ▢, Optional, – Add cubed potatoes or mix veggies and saute for a min. Cover and cook on a low heat until soft and cooked completely. If needed can sprinkle some water and cook. Once done, saute for another minute., ▢, Add turmeric and poha. Mix well and cover the pan., ▢, Cook on a very low heat until it turns hot. If you feel poha is too dry, you may sprinkle some water and continue to steam., ▢, Turn off the heat when poha has softened & become hot. Remove from heat. Taste test and add more salt if needed & squeeze lemon juice., ▢, Garnish poha with coriander leaves & roasted peanuts. You may top with sev or farsan or fresh coconut. Serve it hot., Make Dadpe Pohe, ▢, Add 2 cups of poha to a wide plate along with ½ cup fine chopped onions, 1 cup fresh grated coconut, ½ teaspoon salt, 1 teaspoon fine sugar and ¼ cup fine chopped coriander leaves., ▢, Squeeze the juice out of 1 medium lemon and mix all of them with your hand. You may optionally add 1 to 2 tbsps of coconut water or plain water to soften them little more., ▢, Cover and set aside for 5 minutes until they soften. Onions and coconut will release some moisture and make the dadpe pohe soft., ▢, After 5 minutes, pour 1 tablespoon oil to a small tadka pan and heat it., ▢, Add ¼ to ½ teaspoon mustard seeds, 2 sprigs of torn curry leaves, 1 to 2 chopped green chilies. Fry all of them until the curry leaves turn crisp., ▢, Then add a pinch of hing and 1/8 teaspoon of turmeric. Pour this to the flattened rice mixture so it absorbs all of the flavors., ▢, Meanwhile add peanuts to the same pan and roast them until golden and crunchy. Once done set these aside to cool., ▢, Mix the poha well and taste test. If needed add more salt and lemon juice. If the poha is not soft to your liking you may add more coconut water or plain water and mix., ▢, Garnish dadpe pohe with fried peanuts., , , Notes, , Always choose thick to medium variety poha. Thin poha is not suitable to make this recipe as they turn mushy when rinsed., , If you are running short of time, just skip potatoes. You can also use boiled potatoes., , , , , , Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Poha Recipe, , , Amount Per Serving, , , Calories, 229, , Calories from Fat 99, , , , , % Daily Value*, , , Fat, 11g, 17%, Sodium, 39mg, 2%, Potassium, 600mg, 17%, Carbohydrates, 29g, 10%, Fiber 3g, 13%, Sugar 2g, 2%, Protein, 4g, 8%, , , Vitamin A, 145IU, 3%, Vitamin C, 46.4mg, 56%, Calcium, 74mg, 7%, Iron, 8.3mg, 46%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , This post was first published in August 2016. Updated & republished in December 2020., , , , , 25.5K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 285 votes (, 243 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 116, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Rana, , , , , , April 6, 2025 7:34 pm, , , , , , Very good, , , , , , Reply, , , , , , , , , , , Gitanjali, , , , , , March 20, 2025 9:29 pm, , , , , , Delicious Poha. Never bored with this and it is one of my favorites recipes from your website., , , , , , Reply, , , , , , , , , , , Victor, , , , , , March 14, 2025 5:15 pm, , , , , , Your recipes are very helpful and this poha is a staple in my kitchen. Turns out perfect every single time, , , , , , Reply, , , , , , , , , , , balabhadra, , , , , , December 17, 2024 5:39 pm, , , , , , what percentage of batata poha is potato ?, in 1 kg raw poha how much potato should be added ?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, balabhadra, , , , December 18, 2024 4:04 am, , , , , , For 1 kg poha, you can use about 250 to 300 grams potatoes., , , , , , Reply, , , , , , , , , , , RICHARD YUDELL MD, , , , , , November 20, 2024 2:36 am, , , , , , Look to be “culturally authentic” recipes.      thank you, , , , , , Reply, , , , , , , , , , , Poorvi Agrawal, , , , , , October 30, 2024 2:26 am, , , , , , It turned out so good!! Thank you for sharing recipe., , , , , , Reply, , , , , , , , , , , Tara, , , , , , October 11, 2024 7:52 am, , , , , , Sooo delicious.. thank you soo much, , , , , , Reply, , , , , , , , , , , Bhavin, , , , , , October 2, 2024 5:01 pm, , , , , , I am new to cooking and made this, it turned out extremely well!  My whole family was impressed especially my wife!, , , , , , Reply, , , , , , , , , , , Ayusha Chavan, , , , , , September 29, 2024 3:07 am, , , , , , This recipe is very helpful for me 😄 thank you, , , , , , Reply, , , , , , , , , , , Jim, , , , , , September 8, 2024 7:13 pm, , , , , , This has become a frequent breakfast for us, it is so delicious! Sometimes we stir in eggs near the end., , , , , , Reply, , , , , , , , , , , Latha Babu, , , , , , August 3, 2024 6:42 pm, , , , , , It really turned out great. Thanks., , , , , , Reply, , , , , , , , , , , Tanya, , , , , , March 17, 2024 1:41 pm, , , , , , I made the poha recipe you shared with viren. It turned out delicious. Thank you, , , , , , Reply, , , , , , , , , , , parvaah, , , , , , January 11, 2024 8:02 am, , , , , , Really great recipe, thanks for sharing., , , , , , Reply, , , , , , , , , , , parvaah, , , , , , January 11, 2024 8:01 am, , , , , , Really great recipe, thanks for sharing, , , , , , Reply, , , , , , , , , , , Pramodini, , , , , , January 7, 2024 1:55 am, , , , , , First attempt and no complaints. Got compliments “very delicious “., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Pramodini, , , , January 7, 2024 4:38 am, , , , , , Glad to know Pramodini, , , , , , Reply, , , , , , , , , , , Viren, , , , , , November 18, 2023 4:25 pm, , , , , , I like this poha recipe and have made it many times. Can you please teach me how to make masala poha with tomatoes and vegetables?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Viren, , , , November 19, 2023 12:19 pm, , , , , , Hi,, Use the first recipe as is with 1 medium tomato (chopped or pureed). After sauteing the onions, saute ginger and cook the tomatoes until it becomes all mushy. Add carrots, peas, and bell pepper. Cover and cook until they soften. Add boiled potatoes, Stir in little pav bhaji masala or garam masala and chili powder. Sprinkle a few tablespoons water and add the softened poha. Steam as mentioned. This is tried and tested. Hope you like this., , , , , , Reply, , , , , , , , , , , Manisha, , , , , , November 4, 2023 6:18 am, , , , , , I love your recipe. It’s now my go to recipe for Poha as a quick breakfast or snack option. ?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Manisha, , , , November 19, 2023 12:09 pm, , , , , , Thank you Manisha, , , , , , Reply, , , , , , , , , , , Sujata Shankar, , , , , , April 24, 2023 3:50 am, , , , , , I want to make Kanda poha for my breakfast for the train journey.I plan to cook it the previous evening . Will it last ? (A. C. Train), , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sujata Shankar, , , , April 24, 2023 4:41 am, , , , , , Even if it keeps good due to the air con I don’t think you should eat it because poha is only steamed in the recipe and not cooked. It may cause stomach problem., , , , , , Reply, , , , , , , , , , , Melanie, , , , , , March 24, 2023 7:22 pm, , , , , , Made this for the first time; fantastic!  I used a mixture of peanuts and cashews since I had both and used a mixture of peas and potatoes. Also increased seasoning just a bit. The recipe was easy to follow and spot on.  Will definitely make this again. One question- can I scramble an egg or two in with the vegetables at the end just before adding the rice, or is that unheard of?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Melanie, , , , March 25, 2023 2:52 am, , , , , , Hi Melanie,, Glad you like it. Yes egg in poha is an unheard thing. But I have done it a lot of times. During the lockdown we literally ate poha everyday and had to make different every time. Scramble the eggs first, spice it with salt and ground spices. Set aside. Stir into the hot steaming poha at the end. I’m sure you will love that., 🙂, , , , , , Reply, , , , , , , , , , , , , , Melanie, , , , , , Reply to, swasthi, , , , April 10, 2023 3:19 am, , , , , , Thanks. I plan on trying that for breakfast tomorrow.  As I don’t have green chiles, can I substitute either dried red chilies or Kashmiri chili or some other type of chili powder?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Melanie, , , , April 10, 2023 3:25 am, , , , , , Yes you can use both 2 dried red chilies and a little chilli powder but it won’t taste the same like green chilies. Stir in the chilli powder just before you add the soaked poha., , , , , , Reply, , , , , , , , , , , Mansi, , , , , , March 4, 2023 3:28 am, , , , , , I’m a student and learning to cook from your website. I have made many recipes like this poha, upma lemon rice and sandwiches. Poha is my favorite food. For a change can I use tomatoes in my poha? Please tell the process and how much to use? TIA., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Mansi, , , , March 4, 2023 1:03 pm, , , , , , Hi Mansi,, Happy to know you are able to cook. Actually Maharashtrian poha does not use tomatoes so I have not used it here. If you want you can add a small to medium tomato to the tempering after sauteing the onions. Cover and cook till they become very soft. Later saute for a few minutes till the raw smell of tomatoes is gone. If you want for a change you can also add some pav bhaji masala and cook the onion tomatoes with little water. Then add the softened poha. Sky is the limit. You can actually make it in so many ways. Hope this helps., , , , , , Reply, , , , , , , , , , , Dhara, , , , , , February 22, 2023 1:54 pm, , , , , , , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Dhara, , , , February 22, 2023 2:04 pm, , , , , , Glad you love the poha recipes Dhara. Thanks for letting me know. I will look into it., , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Kanda Poha": "Ingredients: , , , , 4, , how to make kanda poha with step by step photo:, , , , , 5, , notes:, , , , , , , poha recipe 2 ways | kanda poha | aloo poha | maharastrian style kanda pohe recipe, with step by step photo and video recipe. morning breakfast is perhaps one of the challenging meals to plan and prepare. it is due to the limited time availability, yet we need something special, easy and also supply all the nutrients for the daily first meal. this generally requires a lot of planning, but there are some other recipes like kanda poha or aloo pohe that are easy and healthy morning meals., , i am a huge fan of simple and easy breakfast recipes. there are many favourite easy breakfast recipes and out of those, kanda pohe, and, aloo pohe, are two of my favourite recipes. even though i hail from udupi, but i developed the taste for it while i was briefly living in hubli, north karnataka. in hubli there are so many different ways of, poha avalakk, i is served for morning breakfast, but the onion, oggarne avalakki, also known as kanda pohe was my personal favourite. it was served with fresh coriander and coconut with fresh farsan or mixture topped with it. while the pohe in maharastra is slightly different and i have shared the authentic maharastrian version. particularly i have skipped the fresh coconut toppings which can be added if you wish to. also in the aloo version, i have added tomatoes which makes it an ideal combo with sour and spicy taste in it. you may choose either one of them or combine both to make an ideal breakfast meal., , , , , , , in addition to it, some more additional tips, suggestions and variants to the, poha recipe 2 ways, . firstly, the pohe recipe is typically prepared with thick or medium-sized poha. the thickness of the poha is directly proportional to the soaking time. you may have to increase or decrease based on the thickness. secondly, i generally do not prefer any farsan or mixture toppings, but it is essential for many. you may choose any simple aloo bhujia, bombay mixture or any type of farsan snacks as per your taste buds. lastly, the traditional version is always prepared in an iron, wok, that helps to provide additional flavour. but it may require additional oil, so a non-stick pan is an ideal option to prepare any type of poha variants., , finally, i request you to check my other related, breakfast recipes collection, with this post of, kanda poha, recipe. it includes my other related recipes like, granola bar, , , instant set dosa, , , green papaya roti, , , mtr masala dosa, , , bottle gourd dosa, , , suji ki khandvi, , , stuffed dosa, , , masala dosa, , , aate ka nasta, , , coconut dosa, . further to these i would also like to add some more additional recipe categories like,, , , paratha recipes, , sandwich recipes, , street food recipes, , , poha 2 ways video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for poha 2 ways recipe:, , , , , , , , , poha recipe 2 ways | kanda poha | aloo poha | maharastrian kanda pohe, , , HEBBARS KITCHEN, , , easy poha recipe 2 ways | kanda poha | aloo poha | maharastrian kanda pohe, , , 5, from, 4, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 10, minutes, , mins, Total Time, 20, minutes, , mins, , , , , , , Course, Breakfast, Cuisine, maharashtra, , , , , , Servings, 2, , Servings, Calories, 252, , kcal, , , , , , , 1x, 2x, 3x, for soaking:, ▢, 1.5, , cup, , poha, , , thick, ▢, 1, , tsp, , sugar, ▢, ¾, , tsp, , salt, ▢, ¼, , tsp, , turmeric, for kanda poha:, ▢, 2, , tbsp, , oil, ▢, 2, , tbsp, , peanut, ▢, 1, , tsp, , mustard, ▢, 1, , tsp, , cumin, ▢, pinch, , hing, ▢, few curry leaves, ▢, 2, , chilli, , , finely chopped, ▢, 1, , inch, , ginger, , , finely chopped, ▢, 1, , onion, , , finely chopped, ▢, ¼, , tsp, , turmeric, ▢, ¼, , tsp, , salt, ▢, 2, , tbsp, , coriander, , , finely chopped, ▢, ½, , lemon,  Instructions: , firstly, in a large bowl take 1.5 cup poha. do not take thin poha as it turns mushy as soon as you add water., rinse in water and drain off the water., add 1 tsp sugar, ¾ tsp salt and ¼ tsp turmeric., mix gently using your fingers without making poha mushy., rest for 8-10 minutes, or until the poha softens without turning mushy or sticky., in a large kadai heat 2 tbsp oil and roast 2 tbsp peanut on low flame., roast until the peanuts turn crunchy, keep aside., in the same oil, add 1 tsp mustard, 1 tsp cumin, pinch hing and few curry leaves. splutter the tempering., now add 2 chilli, 1 inch ginger and 1 onion. saute until the onions softens slightly., further, add ¼ tsp turmeric and ¼ tsp salt. saute slightly., add soaked poha and mix well combining everything well., cover and simmer for 3 minutes or unitl the poha is cooked well., now add fried peanuts, 2 tbsp coriander and ½ lemon. mix well., finally, enjoy kanda poha recipe with the mixture as a morning breakfast., , , , , Nutrition, Calories:, 252, kcal, Carbohydrates:, 18, g, Protein:, 5, g, Fat:, 20, g, Saturated Fat:, 2, g, Polyunsaturated Fat:, 6, g, Monounsaturated Fat:, 11, g, Trans Fat:, 1, g, Sodium:, 1207, mg, Potassium:, 475, mg, Fiber:, 4, g, Sugar:, 8, g, Vitamin A:, 567, IU, Vitamin C:, 95, mg, Calcium:, 74, mg, Iron:, 3, mg, , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make kanda poha with step by step photo:, , , firstly, in a large bowl take 1.5 cup poha. do not take thin poha as it turns mushy as soon as you add water., , , , , , , rinse in water and drain off the water., , , , , , , add 1 tsp sugar, ¾ tsp salt and ¼ tsp turmeric., , , , , , , mix gently using your fingers without making poha mushy., , , , , , , rest for 8-10 minutes, or until the poha softens without turning mushy or sticky., , , , , , , in a large kadai heat 2 tbsp oil and roast 2 tbsp peanut on low flame., , , , , , , roast until the peanuts turn crunchy, keep aside., , , , , , , in the same oil, add 1 tsp mustard, 1 tsp cumin, pinch hing and few curry leaves. splutter the tempering., , , , , , , now add 2 chilli, 1 inch ginger and 1 onion. saute until the onions soften slightly., , , , , , , further, add ¼ tsp turmeric and ¼ tsp salt. saute slightly., , , , , , , add soaked poha and mix well combining everything well., , , , , , , cover and simmer for 3 minutes or until the poha is cooked well., , , , , , , now add fried peanuts, 2 tbsp coriander and ½ lemon. mix well., , , , , , , finally, enjoy, kanda poha recipe, with the mixture as a morning breakfast., , , , , , , , notes:, , , firstly, make sure to just rinse the poha in water to remove the dust and do not soak it., , also, you can add aloo and tomato as a variation in poha., , additionally, if you want to reheat the poha then steam it for 3 minutes or microwave., , finally,, kanda poha recipe, tastes great when poha is soft and fluffy yet non-sticky., , , , , , , , , Related Recipes, , , , , , , , , , breakfast recipes, , , Paneer Kulcha Recipe | Paneer Stuffed Kulcha Naan, , , , Hebbars Kitchen, , -, , , April 2, 2025, , , , , , , , , , , , breakfast recipes, , , Lemon Rice | South Indian Chitrannam & Gojju..., , , , Hebbars Kitchen, , -, , , March 25, 2025, , , , , , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti –..., , , , Hebbars Kitchen, , -, , , March 24, 2025, , , , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli –..., , , , Hebbars Kitchen, , -, , , March 19, 2025, , , , , , , , , , , , , breakfast recipes, , Tomato Sevai Recipe | Thakkali Semiya – Healthy..., , , , Hebbars Kitchen, , -, , , March 10, 2025, , , , , , , , , , , , , breakfast recipes, , Shavige Uppittu Recipe | Shavige Bath – Shavige..., , , , Hebbars Kitchen, , -, , , February 17, 2025, , , , , , , , , , , 00:01:32, , , , breakfast recipes, , Medu Vada Recipe in Mixer Grinder | Medhu..., , , , Hebbars Kitchen, , -, , , February 13, 2025, , , , , , , , , , , , , breakfast recipes, , Rava Dosa Recipe | Instant Crispy Suji Ka..., , , , Hebbars Kitchen, , -, , , February 11, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 5 from 4 votes (, 4 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , appetizer, , , 00:02:05, , , , Chilli Mushroom Recipe | Mushroom Chilli..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , appetizer, , capsicum chutney recipe | capsicum tomato chutney recipe, , , , , , , , What's New, , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli – Healthy & Tasty, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,"
    }
}