{
    "ingredients": {
        "Rava Upma": "ginger,onion,rava,urad dal,",
        "Ragi Rava Upma": "carrot,coriander,millet,onion,ragi,rava,",
        "Coriander Upma": "coriander,onion,rava,urad dal,",
        "Quinoa Upma": "beans,carrot,ginger,onion,peas,quinoa,urad dal,",
        "Palak Upma": "rava,spinach,tomato,",
        "Chatpata Dahiwala Bread": "coriander,dahi,yogurt,ginger,onion,",
        "Veg Upma": "rava,onion,carrot,green peas",
        "Pulusu Upma": "rava,onion,coriander,tamarind",
        "Vermicelli Upma": "vermicelli,onion,green chili,curry leaves,ginger,chana dal,urad dal,peanuts,lemon juice,carrot,peas,green peas,coriander",
        "Rava Pongal": "yellow moong dal, rava,ghee,cashews",
        "Bread Upma": "coriander,ginger,milk,onion,tomato,urad dal,",
        "Idli Upma": "coriander,ginger,onion,urad dal,",
        "Maharashtrian Pitla": "besan,coriander,flour,garlic,onion,",
        "Seviyan Pulao": "carrot,green peas,peas,semiya,vermicelli,",
        "Semiya Upma": "beans,carrot,coconut,coriander,ginger,onion,peas,semiya,urad dal,vermicelli,",
        "Haryali Dalia": "broken wheat, mint, dill leaves",
        "Bajra Khichu with Masala Dahi": "bajra,coriander,dahi,yogurt,flour,millet,"
    },
    "recipe_url": {
        "Rava Upma": "https://www.indianhealthyrecipes.com/upma-recipe-how-to-make-upma/",
        "Ragi Rava Upma": "https://www.tarladalal.com/ragi-rava-upma-healthy-nachni-suji-upma-39296r",
        "Coriander Upma": "https://www.tarladalal.com/coriander-upma-39001r",
        "Quinoa Upma": "https://www.indianhealthyrecipes.com/quinoa-upma-recipe/",
        "Palak Upma": "https://www.indianveggiedelight.com/spinach-upma-palak-upma-recipe/",
        "Chatpata Dahiwala Bread": "https://www.tarladalal.com/chatpata-dahiwala-bread-2876r",
        "Veg Upma": "https://thebellyrulesthemind.net/best-vegetable-upma-recipe/",
        "Pulusu Upma": "http://www.chefandherkitchen.com/2014/12/pulusu-upma-tamarind-upma-pulusu-pindi.html",
        "Vermicelli Upma": "https://www.indianhealthyrecipes.com/semiya-upma-vermicelli-upma-recipe/",
        "Rava Pongal": "https://www.facebook.com/watch/?ref=saved&v=286527048723026",
        "Bread Upma": "https://www.indianhealthyrecipes.com/bread-upma-recipe/",
        "Idli Upma": "https://www.vegrecipesofindia.com/idli-upma-recipe-upma-recipes/",
        "Maharashtrian Pitla": "https://www.tarladalal.com/maharashtrian-pitla-pitla-recipe-besan-pitla-recipe-40781r",
        "Seviyan Pulao": "https://www.tarladalal.com/seviyan-pulao-semiya-pulao-vermicelli-pulao-40372r",
        "Semiya Upma": "https://www.indianhealthyrecipes.com/semiya-upma-vermicelli-upma-recipe/",
        "Haryali Dalia": "https://www.tarladalal.com/hariyali-dalia-38997r",
        "Bajra Khichu with Masala Dahi": "https://www.tarladalal.com/bajra-khichu-with-masala-dahi-41294r"
    },
    "Recipe": {
        "Rava Upma": "Ingredients: Time Saving Expert Tip, How to make Upma (Stepwise Photos), Expert Tips, Recipe Card, , , Did you ever wonder how the Upma served in some restaurants and wedding places is so delicious with plenty of flavors? My easy recipe, with plenty of tips and tricks will help you make it. You can also easily customize this dish to your palate., , About Upma Recipe, , The traditional and authentic process to make upma starts by roasting semolina which is also known as suji or Bombay rava. This is the key step in making the dish fluffy without getting sticky. While this cools down, a tempering is made with oil/ghee, mustard seeds, chana dal, urad dal, ginger, green chilies, curry leaves and hing., , before pouring the water. You will smell the beautiful flavors as this comes to a boil. We slowly incorporate the roasted rava into the boiling water, making sure no lumps are formed., , ginger and chana dal in an Andhra & Telangana style upma, you will see the dish being cooked in milk & some recipes use nothing other than mustard, chili and curry leaves for the tempering., , ginger or lentils. You can cook this Upma to a moist porridge-like dish or to a fluffy and non-sticky kind, just by adjusting the water levels., , , , Semolina, : You need fine semolina which is marketed as suji, upma rava or Bombay rava. It is different from semolina flour, bansi rava and dalia (broken wheat). It is available in 3 varieties – regular unroasted, roasted and double roasted. While the first kind needs roasting very well before making upma, the second kind requires a short roast and the last one (double roasted) is good to use directly, without roasting., , Oil/ghee:, You can use any cooking oil, ghee or a mix of both. Ghee gives a better flavor to the dish. Fats are essential to make a delicious upma, so do not cut down the oil/ghee., , Whole spices:, A lot of people use only mustard seeds and do not prefer cumin. However my mom always added cumin seeds for a earthy flavor so I do use them. They also help with digestion. You may omit them if you don’t prefer., , Fresh ginger, imparts a delicious and pungent flavor. Make sure you chop or grate it very fine. You don’t want to bite into the ginger while enjoying your upma., , Onion and green chilies, impart sweet and spicy flavors. A lot of people also use dried red chili (Karnataka style)., , Lentils:, You will use split skinned black lentils (split white urad dal) and chana dal (Bengal dal). They add a nutty aroma and crunch to your upma. However if you roast them too long on a low heat, they will remain hard. So make sure you fry them just until golden and aromatic., , Hing also known as asafoetida, is a tree resin and smells funny but once it gets tempered it adds a beautiful flavor to your dish. You may omit it if you don’t like., , , Time Saving Expert Tip, , I usually roast the whole pack of semolina when I cut it open. Cool it completely and store in a clean air tight jar. This cuts down your roasting time whenever you want to make upma. Plus this step keeps your semolina fresh for longer., , , , More Upma Varieties, Semiya Upma, Aval (Poha) Upma, Oats upma, Bread upma, Tomato upma, Idli upma, , , Photo Guide, , How to make Upma (Stepwise Photos), , Preparation, , 1. Clean 1 cup semolina (Bombay rava). Add it to a pan and roast on a low to medium heat until it turns crunchy. Keep stirring to prevent discoloring. We don’t want the rava to brown. If you are using double roasted semolina, you may omit this step or roast only for a minute. When it is crunchy set aside to cool., , , , 2. While you roast the rava, prepare the following:, , , Slice or fine chop 1 small onion to make ¼ cup, , Peel and mince or grate ½ inch ginger  to make ½ to ¾ teaspoon, , Chop or slice 1 to 2 green chilies, , Rinse and pat dry 1 sprig curry leaves (to avoid splatters), , If you like to add vegetables you may add ¼ cup green peas, ¼ cup fine chopped carrots and 2 tender French beans. Ensure they are very fine chopped else they won’t cook well., , , , , 3. To temper you will need, , , ½ teaspoon mustard seeds, , ½ teaspoon cumin seeds (Jeera, optional), , 1 teaspoon urad dal (skinned black gram whole or split), , 1½ teaspoon chana dal (bengal gram), , 2 tablespoons peanuts (optional – raw or roasted), , 8 to 12 whole cashews (split them, you may leave out if using peanuts), , , , , 4. Using peanuts is optional and may use if you want a crunch in your upma. On a medium heat, fry the raw peanuts in 1 teaspoon oil until deep golden and aromatic but not burnt. Later remove to a plate and set aside to garnish. Omit this step if using roasted peanuts., , , , Temper Spices, , 5. Pour 2 to 2½ tablespoons oil to the hot pan. When the oil becomes hot, add the mustard seeds and cumin seeds if using. When the seeds splutter, add urad dal & chana dal., , , , 6. Fry them until light golden for a minute, then add the cashews & fry until the cashews turn golden and the lentils turn light brown., , , , 7. Next goes in 1 pinch hing (optional), chopped green chilies, chopped ginger & 1 sprig curry leaves. Fry for a minute until the ginger turns fragrant & the curry leaves turn crisp., , , , 8. Then add 1 small chopped onion., , , , 9. Saute just for 3 to 4 mins, until the onions turn transparent., Optional: If using veggies, you can add green peas, carrots & French beans. Cover and cook on a low heat until the veggies turn slightly tender., , , , Make Rava Upma, , 10. Pour 3 cups water and add ½ teaspoon salt. (Use 2¾ cups for a drier upma). Mix it well and taste the water. The water should be slightly salty. If needed add more salt. If you are using a cast iron pan, use up to 3 cups water., , , , 11. Bring the water to a rolling boil on a medium to high flame, then reduce the flame to low heat., , 12. Pour the roasted rava in a very slow stream with one hand and constantly stir the water with the other hand. This incorporates the rava well to the water without turning lumpy. (check the video if you are a beginner). Make sure the water is still boiling well while you add the semolina., , , , 13. Stir well and check for any lumps. Break up if any. Be cautious & quick at this moment, as it begins to splash., , , , 14. You will see all of the water is absorbed. Then cover and cook., , , , 15. After 2 to 4 mins, open and stir the rava upma., , , , 16. Lastly add ghee at this stage. This is optional. Switch off and keep the pan covered for about 5 mins., , , , 17. Let the upma cool down a bit. You can add fresh grated coconut if you like. It will still look clumpy while hot., , , , As it cools down, upma begins to look fluffy. Sprinkle lemon juice while serving. Do not squeeze the lemon when it is very hot. Garnish with fried/roasted peanuts if you want. If you feel your upma is dry, it means your semolina may require more water. Next time try with 1:3 ratio., , , , Serve upma with, peanut podi, , , flaxseed podi, , , coconut chutney, , pickle, papad or sambar. As the rava upma cools down, it becomes fluffy and won’t be mushy., , , , Expert Tips, , , Rava & water proportion:, This recipe will yield you fluffy upma that is not porridge like or sticky. I know some people who love this like a thick porridge. If you like it that way, you can use about 4 cups of water for 1 cup rava., , Upma when made in small quantity ex- ½ cup rava usually absorbs upto 1½ cups water (1:3). When you make in large quantity, 1 cup and above use 2¾ to 3 cups water per 1 cup of rava. If you are using a cast iron pan, use 3 cups. There are different kinds of rava, semolina with a little bran takes up fully 3 cups of water and more refined semolina takes up only 2.5 cups. So use accordingly next time., , Adding rava in a slow stream:, Ensure you keep stirring the water constantly in the pot with your right hand while you pour the rava with your other hand. This incorporate the rava well into the water avoiding lumps., , Quantity of oil:, Do not reduce the amount of oil mentioned in the recipe. Using a good amount of oil prevents the upma from turning sticky., , To make smooth & soft upma like the Karnataka restaurants, , , , Related Recipes, , Curry Leaves Powd..., , , Broken wheat upma..., , , Rava Idli Recipe, , , Semiya Upma Recip..., , , Poha Recipe (Spic..., , , Chutney Powder (P..., , , , , Recipe Card, , , , , , Upma Recipe (Rava Upma), , , 4.94, from, 482, votes, , , , Rava upma is a South Indian savory breakfast made with semolina aka suji, nuts, spices and curry leaves. It is usually eaten with podi, sugar, chutney or sambar., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 5, minutes, , minutes, Cook Time, 15, minutes, , minutes, Total Time, 20, minutes, , minutes, , Servings, 2, , to 3 people, , Author, Swasthi, , , , ▢, 1, , cup, , Rava, , (Bombay rava/ sooji/semolina), To Temper, ▢, 2 to 2½, , tablespoons, , oil, , or ghee, ▢, ½, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , cumin seeds, , (jeera, optional, adds aroma), ▢, 1, , teaspoon, , split urad dal, , (skinned split black gram), ▢, 1½, , teaspoon, , chana dal, , (optional, adds nice aroma, Bengal gram), ▢, 2, , tablespoons, , peanuts, , (optional), ▢, 8 to 12, , cashews, , (you may leave out if using peanuts), ▢, 1, , sprig, , curry leaves, ▢, 1, , pinch, , asafoetida, , (hing) (optional), ▢, ¼, , cup, , onion, , (chopped or sliced thinly), ▢, 1 to 2, , green chili, , slit, ▢, ½, , inch, , ginger, , (½ to ¾ teaspoon minced or grated)(optional), ▢, 3, , cups, , water, , (2¾ cups for a drier upma), ▢, ½ to ¾, , teaspoon, , salt, ▢, 2, , teaspoon, , ghee, , (optional), ▢, lemon juice (optional), , to serve, Optional, ▢, ½, , cup, , mixed vegetables, , (fine chopped carrots, beans and green peas),  Instructions: non-sticky and moist rava upma., , , , , , , Jump To Recipe, , Jump To Video, , , , , 21.4K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Also known as uppittu, this dish is a staple in the South Indian homes and restaurants. It is usually eaten on its own with a squeeze of lemon juice, or with pickle, podi or coconut chutney. Elsewhere on the streets, it is also served with a garnish of sev or farsan. For young kids, a lot of people sprinkle some sugar to tone-down the heat., , Table of contents, About Upma Recipe, ▢, Roast rava:, On a medium heat, dry roast rava in a pan, stirring often until crunchy and aromatic. Do not brown it. Remove to a bowl and keep aside to cool down., ▢, Optional – Roast peanuts to garnish, – Fry peanuts in 1 teaspoon oil until golden, aromatic and crunchy. Reserve aside to garnish., ▢, Temper the spices:, Pour oil to the hot pan & add mustard seeds, cumin seeds, urad dal & chana dal. Fry until the dal turns light golden. Add cashews and fry until they turn golden & aromatic. Stir in hing, green chilies, ginger and curry leaves., ▢, Saute for a minute & add chopped onions. Saute until transparent & add mix vegetables (optional) if using. Stir and cook covered until slightly tender., ▢, Boil water:, Pour water and add salt. Mix and taste test the water. It has to be slightly salty. If required add more and bring the water to a rolling boil., ▢, Make upma:, Lower the heat. With one hand pour rava in a slow stream to the boiling water, while you incorporate it into the water with the other hand. (check video). Be quick at this stage. Stir everything once to check any lumps. Break up if any., ▢, Cover and cook on the lowest flame until the water is completely absorbed. This just takes 2 to 4 mins depending on the kind of pot or pan used. Add ghee and give a quick stir. Turn off and cover back to rest for 5 mins., ▢, Stir in the lemon juice and serve rava upma plain or with spiced, peanut podi, , chutney, pickle or curd. Garnish with roasted/fried peanuts., , , Notes, , Nutrition values are for the basic upma without vegetables., , , , Video, , , NUTRITION INFO (estimation only), , Nutrition Facts, , Upma Recipe (Rava Upma), , , Amount Per Serving, , , Calories, 362, , Calories from Fat 144, , , , , % Daily Value*, , , Fat, 16g, 25%, Saturated Fat 3g, 19%, Trans Fat 0.04g, Polyunsaturated Fat 3g, Monounsaturated Fat 8g, Cholesterol, 9mg, 3%, Sodium, 458mg, 20%, Potassium, 187mg, 5%, Carbohydrates, 47g, 16%, Fiber 4g, 17%, Sugar 1g, 1%, Protein, 9g, 18%, , , Vitamin A, 32IU, 1%, Vitamin C, 16mg, 19%, Calcium, 33mg, 3%, Iron, 3mg, 17%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , Upma Recipe first published in March 2016. Updated and republished in April 2025., , , , , 21.4K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 4.94 from 482 votes (, 352 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 310, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Adinarayana, , , , , , April 5, 2025 2:34 am, , , , , , Whenever time permits, I cook from your website and they all turn out delicious. Love the way you lay the recipes and it really helps novice cooks like me. I made upma using your recipe for the nth time. Please keep posting more new recipes. I would love to see a arisi upma with brown rice if possible please. Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Adinarayana, , , , April 5, 2025 4:34 pm, , , , , , Hello Adinarayana,, Thanks for trying the recipes and we are glad you like them. I will try to share the recipe with brown rice., , , , , , Reply, , , , , , , , , , , Adi, , , , , , April 5, 2025 2:12 am, , , , , , This is my favorite upma recipe and comes out great., , , , , , Reply, , , , , , , , , , , Surabhi, , , , , , March 31, 2025 5:12 am, , , , , , The upma turned out very very very tasty♥️, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Surabhi, , , , March 31, 2025 7:10 am, , , , , , Thanks Surabhi. Glad you liked it, , , , , , Reply, , , , , , , , , , , Jaidev, , , , , , March 5, 2025 3:01 am, , , , , , I have been following this recipe for 2 years and comes out perfect every time. I use 3.5 cups water for a more soft and moist upma. Thank you and keep up the good work, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Jaidev, , , , March 5, 2025 8:41 am, , , , , , Thanks Jaidev. Glad to read that, , , , , , Reply, , , , , , , , , , , S Gauria, , , , , , December 28, 2024 6:52 pm, , , , , , Loved the flavors of this recipe. I made a gluten-free version using Millet and Amaranth in the instant-pot, and that worked out rather well. I posted the details on my tumblr, but seems like I can’t copy that link here. Anyway, thank you very much., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, S Gauria, , , , March 5, 2025 8:42 am, , , , , , Glad to know Gauria. Thank you for sharing back, , , , , , Reply, , , , , , , , , , , Neha, , , , , , December 28, 2024 4:03 pm, , , , , , Tried this upma recipe for the first time and it came out delicious. Next time I would add more ginger and vegetables., , , , , , Reply, , , , , , , , , , , Greeshma Rajan, , , , , , October 25, 2024 4:04 am, , , , , , Best recipe and well explained…loved it, , , , , , Reply, , , , , , , , , , , Rhvankar, , , , , , September 21, 2024 9:11 am, , , , , , I visited Rameswaram. A great pleasure, we can find the south food. The bannana leaves plate brings a life and taste. The use of coconut means the elixir on the food. A great food a great south!!, , , , , , Reply, , , , , , , , , , , Nirmal, , , , , , September 9, 2024 3:18 am, , , , , , I have made upma for years but this takes it to a new level. Thanks for sharing, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Nirmal, , , , September 9, 2024 5:57 am, , , , , , So glad you like it Nirmal. Thank you, , , , , , Reply, , , , , , , , , , , Rita, , , , , , September 2, 2024 11:01 pm, , , , , , This recipe is great. It’s the closest thing I can find to my mom’s, “recipe.” My son loves it for school lunch. I add in a little extra dal and cashews for protein., , , , , , Reply, , , , , , , , , , , April, , , , , , August 7, 2024 6:45 pm, , , , , , I cook this recipe on a regular basis (nearly every week) and it never let’s me down.  It’s very hearty and filling., , , , , , Reply, , , , , , , , , , , Marguerite, , , , , , August 2, 2024 3:35 pm, , , , , , Tried this recipe for the first time and came out great!, Thanks for sharing, , , , , , Reply, , , , , , , , , , , Somali, , , , , , July 15, 2024 10:18 pm, , , , , , simple steps, easy to make and very tasty!, , , , , , Reply, , , , , , , , , , , Anamika, , , , , , July 13, 2024 5:34 am, , , , , , Turned out beautifully! Thank you for posting, , , , , , Reply, , , , , , , , , , , irfan, , , , , , July 6, 2024 12:31 pm, , , , , , nice one, , , , , , Reply, , , , , , , , , , , Riya, , , , , , June 10, 2024 8:45 am, , , , , , My frequent go to breakfast on busy mornings. Very very easy and simple to make. Thanks for the recipe, , , , , , Reply, , , , , , , , , , , Sunita Prakash, , , , , , April 23, 2024 3:57 am, , , , , , How nicely explained with all the subtle nuances of rawa cooking., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sunita Prakash, , , , April 23, 2024 11:02 am, , , , , , Thank you Sunita, , , , , , Reply, , , , , , , , , , , leena alexander, , , , , , April 11, 2024 6:38 am, , , , , , Amazing five star recipe.  My family loved it, Have tried your other recipes and they were delicious too.  congrats Swasthi., , , , , , Reply, , , , , , , , , , , Kris, , , , , , February 23, 2024 5:20 pm, , , , , , We don’t put cumin seeds in South India, or ginger and garlic !, , , , , , Reply, , , , , , , , , , , Pamela Alvares, , , , , , February 20, 2024 5:11 am, , , , , , The Upma was delicious. Thanks for sharing your yummy recipes, , , , , , Reply, , , , , , , , , , , Priti, , , , , , January 4, 2024 12:53 pm, , , , , , When I make upma with sunflower oil a smell comes from it.How can Ifix it next time., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Priti, , , , January 4, 2024 1:01 pm, , , , , , Priti,, I guess you are using unrefined sunflower oil. Actually tempering process for upma takes about 5 minutes and heating unrefined oils for so long without a wet/moist ingredient may not be good. Try using half ghee and half oil. Hope this helps., , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Ragi Rava Upma": "Ingredients: , , , , , , , , , When you want to have a healthy yet easy breakfast, , ragi suji upma, is the answer. This is a healthier option than a upma made solely of semolina. Rava is partially refined and thus devoid of some nutrients., , Ragi or red millet flour, on the other hand, is so full of fibre and iron, thus making this a super-nutritious dish. So, although the colour of this upma is not so appealing, its nutrient quotient is, making it a must-try. Iron is a much needed nutrient to build your hemoglobin reserve. A serving of this, healthy nachni upma, fulfils 10% off your daily requirement of this nutrient., , When mixing after adding water, use a whisk to avoid any unnecessary lump formation. Make sure you serve, ragi upma, immediately or else it will turn lumpy., , Enjoy, ragi rava upma recipe, |, healthy nachni upma, |, ragi suji upma for breakfast, |, healthy breakfast recipe, | with step by step photos., , , , , , , Tags, , , , , Non Stick Kadai Veg, , Indian Breakfast Recipes, , Breakfast Upma, Poha, , Healthy Indian Breakfast, , Healthy Breakfast Upma / Poha, , Iron Rich Indian recipes, , Iron Rich Indian Breakfast, , Low Cholesterol Indian Recipes, , , , , , , , , , , , , , , , , , , , Preparation Time, , 10 Mins, , , , , , , Cooking Time, , 15 Mins, , , , , , , Total Time, , 25 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , For Ragi Rava Upma, , , 1 cup, ragi (nachni / red millet) flour, , , 1/2 cup, semolina (rava / sooji), , , 2 tsp, oil, , , 1 tsp, mustard seeds ( rai / sarson), , , a pinch of, asafoetida (hing), , , 2 to 3, curry leaves (kadi patta), , , 2 1/2 tsp finely, chopped green chillies, , , 1/4 cup finely, chopped onion, , , 1/2 cup finely chopped, carrot, , , , salt, to taste, , 1/4 cup finely, chopped coriander (dhania), , , , , , , , , , , , ragi rava upma, for 1 minute. Use a flat ladle for roasting, that’s the best., , , , , , Add some finely chopped carrot for added fiber., , , , , , Sauté the carrots also on a medium flame for 1 minute., , , , , , Add the roasted ragi- semolina mixture to the veggies., , , , , , Add salt as per taste., , , , , , , , , , , Add 4 cups of hot water to make, healthy breakfast recipe, ., , , , , , Also use a whisk if you feel that the mixture is turning lumpy., , , , , , , Add lots of finely chopped coriander and mix well., , , , , , Close with a lid and keep the, ragi suji upma for breakfast, aside for 2 to 3 minutes. This would help the fresh flavours of coriander mix in the upma., , , , , , Serve, ragi rava upma, immediately., , , , , , , If you like ragi upma recipe then also try other healthy breakfast ideas like, Nutritious Jowar and Tomato Chila, and, Healthy Oats Dosa, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 216 cal, Protein, 4.8 g, Carbohydrates, 42.1 g, Fiber, 5.1 g, Fat, 3.2 g, Cholesterol, 0 mg, Sodium, 15.7 mg, , , , , , , Click here to view, Calories for Ragi Rava Upma, Healthy Nachni Suji Upma, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Foodie #575433, , March 13, 2025, midnight, , i am gluten sensitive. so this recipe is wonderful for me. i substitute semolina with rice flour., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #628482, , March 13, 2025, midnight, , Love this recipe., , , , , , , , , Post Reply, , , , , 3, , , , , , , , , , , , , prachi dash, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , broken wheat upma recipe | healthy dalia upma | godi upma |, , , 111 Calories, , , , , , , , , , , , , , , , , coriander upma recipe | quick kothambir upma | rava coriander upma |, , , 210 Calories, , , , , , , , , , , , , , , , , idli upma recipe | idli upma with leftover idli | healthy idli upma |, , , 135 Calories, , , , , , , , , , , , , , , , , makai upma recipe | bhutte ki kees | healthy sweet corn upma | how to make makai upma |, , , 229 Calories, , , , , , , , , , , , , , , , , oats upma | oats upma with vegetables | healthy Indian oats upma | quick oats upma, , , 207 Calories, , , , , , , , , , , , , , , , , semiya upma recipe | vermicelli upma | semiya upma Kerala style | quick seviyan upma |, , , 337 Calories, , , , , , , , , , , , , , , , , upma | rava upma | sooji upma | quick upma recipe | breakfast upma |, , , 192 Calories, , , , , , , , , , , , , , , , , varagu upma recipe | kodri upma | foxtail millet healthy vegetable snack |, , , 119 Calories, , , , , , , , , , , , , , , , , corn poha recipe | corn poha for a healthy heart | quick sweet corn poha |, , , 213 Calories, , , , , , , , , , , , , , , , , matar poha recipe | green pea poha | healthy matar poha |, , , 281 Calories, , , , , , , , , , , , , , , , , Mixed Sprouts Poha recipe, Healthy Mixed Sprouts Poha, , , 164 Calories, , , , , , , , , , , , , , , , , Oats and Poha Chivda recipe, Oats Chivda, , , 230 Calories, , , , , , , , , , , , , , , , , papad poha recipe | Diwali jar snack | quick Gujarati papad poha chivda |, , , 331 Calories, , , , , , , , , , , , , , , , , poha nachni handvo recipe | snacks for hypertension | Indian snack for high blood pressure |, , , 125 Calories, , , , , , , , , , , , , , , , , poha cutlet recipe | vegetable poha cutlet | veg poha pattice | healthy poha dal cutlet |, , , 74 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , If you like Ragi Rava Upma, , , , , , , , , Benefits of Ragi Rava Upma, , , , , , , , , For Ragi Rava Upma, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , ragi rava upma recipe, |, healthy nachni upma, |, ragi suji upma for breakfast, |, healthy breakfast recipe, | with 20 amazing images., , Ragi upma, is a quick to make breakfast which gains you few nutrients as well. This, healthy nachni upma, is comparatively a healthier option than semolina upma. Learn how to make, ragi suji upma, for breakfast., , To make this, ragi rava upma, , you need to dry roast the ragi flour and semolina first. They are in the ratio of 2:1. The next step is to make a tempering of hot oil, mustard seeds, , , , For ragi rava upma, To make, ragi rava upma, , dry roast the ragi flour and semolina in a broad non-stick kadhai on a medium flame for 4 to 5 minutes or till it turns light brown in colour, while stirring continuously. Keep aside., Heat the oil in a broad non-stick pan and add the mustard seeds., When the seeds crackle, add the asafoetida, curry leaves, green chillies and onions and sauté on a medium flame for 1 minute., Add the carrots and sauté on a medium flame for 1 more minute., Add the roasted ragi- semolina mixture and salt and sauté on a medium flame for 1 to 2 minutes., Add 4 cups of hot water and cook on a slow flame for 2 to 3 minutes or till the water evaporates, while stirring continuously., Add the coriander, mix well and cover and keep aside for 2 to 3 minutes., Serve the, ragi rava upma, immediately., , , , , , , , , , , , , , , , Ragi Rava Upma, Healthy Nachni Suji Upma recipe with step by step photos, , , , , , , , , , , , , , , , , , If you like Ragi Rava Upma, , , , , , , , , If you like, Ragi Rava Upma, , then also try other healthy upma recipes like, , , Broken wheat upma, , , Oats upma, , , Quinoa upma, , , , , , , , , , , , , , , , , , Benefits of Ragi Rava Upma, , , , , , , , , , Ragi Rava Upma, is a healthier choice for breakfast than plain sooji upma which is not very high on nutrient scale., , This upma boosts your iron levels by way of ragi flour and lots of coriander., , Moreover the use of veggies like onions and carrots toss in some antioxidants to build immunity., , These veggies also are a way of adding fiber to your diet and keep you satiated for long hours., , Try and not to overboard with the portion size as ultimately ragi flour also has good amounts of carbs., , , , , , , , , , , , , , , , For Ragi Rava Upma, , , , , , , , , For, ragi rava upma recipe | healthy nachni upma | ragi suji upma for breakfast | healthy breakfast recipe, , the first step is dry roasting. For that first add the ragi flour in a non-stick kadhai., , , , , , To that add semolina as well., , , , , , Dry roast this on a medium flame for 4 to 5 minutes. The ragi flour and rava will turn slightly brown in colour. Remember to keep stirring continuously else the flour and semolina might burn. Keep this aside after roasting., , , , , , Next begin tempering the healthy nachni upma. For that add around 2 tsp of oil in a broad non-stick pan. Allow the oil to heat., , , , , , Immediately add mustard seeds and allow them to crackle., , , , , , To this add asafoetida., , , , , , Add curry leaves also., , , , , , Add some finely chopped green chillies as well., , , , , ",
        "Coriander Upma": "Ingredients: , , , , , , , , , , For Coriander Upma, , , 1 cup, semolina (rava / sooji), , , 2 tbsp, oil, , , 1 tsp, urad dal (split black lentils), , , 1 tsp, mustard seeds ( rai / sarson), , , a pinch of, asafoetida (hing), , , 4 to 5, curry leaves (kadi patta), , , 1/4 cup finely, chopped onion, , , , salt, to taste, , 1 tsp, sugar, , , 2 tbsp finely, chopped coriander (dhania), , , , To Be Blended Into A Coriander Chutney (using Little Water), , , 1/2 cup roughly, chopped coriander (dhania), , , 3, green chilli, , roughly chopped, , 1 tsp, sugar, , , 1 tsp, cumin seeds (jeera), , , 1 tsp, lemon juice, , , , salt, to taste, , , , , , , , , , , Now, lets make the, Coriander upma, . Take semolina in a broad non stick pan and dry roast on a medium flame for 3-4 minutes, , , , , , After roasting it looks like this. Make sure you get nice golden brown color. Do not brown the rava or the, Coriander upma, will taste bitter. Set the roasted Semolina aside., , , , , , Heat oil in a broad non stick pan., , , , , , Add urad dal. Let it brown a little or else it will give a raw taste., , , , , , Add the mustard seeds. Let them crackle., , , , , , Add asafoetida. Asafoetida is always used in Indian cooking as it aids digestion., , , , , , Add curry leaves., Coriander upma, originates from the southern part of India where curry leaves are used in abundance., , , , , , Add onions and saute on a medium flame for 1 minute., , , , , , Add roasted semolina and salt to taste. And saute for a minute on medium flame., , , , , , Add coriander chutney and cook for a minute more., , , , , , Add 2 1/2 cups hot water and cook the, Coriander upma, on a medium flame for 1-2 minutes or until the water evaporates while stirring continuously., , , , , , Add sugar and coriander to the, coriander upma | quick kothambir upma | rava coriander upma |, and mix well. Cook for a minute more., , , , , , Serve, coriander upma | quick kothambir upma | rava coriander upma |, hot along with, Filter coffee, ., , , , , , , , , , , , , , , , , , , , tips for coriander upma, , , , , , , , , We suggest to roast the semolina the previous evening., , , , , , Prepare the coriander chutney the previous evening if you are going to be in a hurry in the morning., , , , , , , You can garnish the colorful and vibrant, coriander upma, with grated coconut., , , , , , Garnish also with coriander., , , , , , , To make quick coriander upma recipe healthier, by add a lot of boiled vegetables like carrots, beans, tomatoes and peas along with the semolina when cooking., , , , , , , Serve rava coriander upma hot in an inverted cup shape, as suggested., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 210 cal, Protein, 4.2 g, Carbohydrates, 30.7 g, Fiber, 0.5 g, Fat, 7.9 g, Cholesterol, 0 mg, Sodium, 10.8 mg, , , , , , , Click here to view, Calories for Coriander Upma, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Rims, , March 13, 2025, midnight, , it''s perfect breakfast.... yummy taste.... Ty Tarla dalal team..., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi, Thank you for your kind words...Do try more and more recipes and let us know how you enjoyed them...happy cooking !!, , , , , , , , , , , , , Payal Parikh 86, , March 13, 2025, midnight, , My family and I are bored of the regular upma recipe, so this coriander upma recipe was loved by all, it has a nice flavour or coriander chutney and also looks very attractive ...., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Loves Food, , March 13, 2025, midnight, , Loved the recipe and a good change to regular upma., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Sneha, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 2, , , , , , , , , , , , , Princy Pinto, , March 13, 2025, midnight, , At which stage we shd add the chopped onions. Its not mentioned in the steps provided above., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi Princy, Thank you for informing us, there was an error from our side. It has been rectified now., , , , , , , , , , , , , Vanita Sadhu, , March 13, 2025, midnight, , Coriander Upma yeh recipe mein jaise bataya hai waise hi banaya, but mere husband upma me kaju  aur lal tamatar pasand karte hai tho wo bhi use kiyee. Unneh bhaot hi pasand aayya. Kaha pher se banana., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , aju, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Sunil m, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Divya Srinivas, , March 13, 2025, midnight, , Love it! My kids who are picky eaters, gobble this up EVERY SINGLE TIME! Thank you for a wonderful recipe! _x0001F60A_, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi,\nThank you so much for the feedback.. Do keep trying more recipes and give us your feedback.., , , , , , , , , , , , , Maulik patel, , March 13, 2025, midnight, , awesome taste...I love it..my grand ma taste it and say...saras banyo 6..( in gujarati) suparb, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Rims, , March 13, 2025, midnight, , awsum instant receipe...super tasty..******\nTy fr Guiding me..., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Vijji, , March 13, 2025, midnight, , Hi madam, I am a big fan of u, ur recipes are awesome, I tried daal batia recipe, it turned out well, I will try this coriander upma tomorrow, please suggest some breakfast recipes, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #679499, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , soya upma recipe | gluten free recipe | healthy breakfast recipe | soya granule upma |, , , 175 Calories, , , , , , , , , , , , , , , , , idli upma recipe | idli upma with leftover idli | healthy idli upma |, , , 135 Calories, , , , , , , , , , , , , , , , , oats upma | oats upma with vegetables | healthy Indian oats upma | quick oats upma, , , 207 Calories, , , , , , , , , , , , , , , , , varagu upma recipe | kodri upma | foxtail millet healthy vegetable snack |, , , 119 Calories, , , , , , , , , , , , , , , , , semiya upma recipe | vermicelli upma | semiya upma Kerala style | quick seviyan upma |, , , 337 Calories, , , , , , , , , , , , , , , , , makai upma recipe | bhutte ki kees | healthy sweet corn upma | how to make makai upma |, , , 229 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like Coriander Upma, , , , , , , , , How to make Coriander Upma, , , , , , , , , Tips for coriander upma, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , coriander upma recipe, |, quick kothambir upma, |, rava coriander upma, | with 18 amazing images., , Coriander upma, is just a tastier variation to traditional, upma, . The, kothambir upma, can be made in a jiffy. Not even an amateur can go wrong with this one., , Looking for something different to relish for breakfast? Here we have a unique, South Indian recipe, which is “, coriander upma, ”, , The procedure of making, coriander upma, is divided into 2 steps. The first is making the coriander chutney and second is tempering. To make the chutney, blend coriander, green chili, sugar, cumin seeds, lemon juice into a smooth paste and keep aside. Further for the tempering, in a non-stick pan, add oil. You can even use ghee if you wish to, it will enhance the taste. Next, add urad dal and mustard seeds. Here, we have only added urad dal but you can add chana dal too, as it is used in the traditional upma recipe. Both together would give, coriander upma, a nice nutty flavor. Next, add asafeotida, curry leaves and onions. Once onions are cooked add the roasted semolina and the prepared chutney. Cook everything together. Add hot water and stir continuously making sure the, coriander upma, is not sticking to the bottom of the pan or burning., , You can garnish the colorful and vibrant, coriander upma, with grated coconut and coriander if you wish to. To make, quick coriander upma, recipe healthier, by add a lot of boiled vegetables like carrots, beans, tomatoes and peas along with the semolina when cooking. This will add more fibre to, sooji coriander upma, making it a lot healthier. Serve, rava coriander upma, hot in an inverted cup shape, as suggested., , We suggest a tip to roast the semolina and prepare the coriander chutney the previous evening and toss up this, coriander upma, quickly in the morning. Use it as and when you wish to make, quick kothambir upma, ., , Enjoy, coriander upma recipe, |, quick kothambir upma, |, rava coriander upma, | with detailed step by step photos and video below., , , , , , , Tags, , , , , Kadai Veg, , Saute, , Indian Breakfast Recipes, , Breakfast Upma, Poha, , Indian Veg Recipes, , South Indian, , South Indian Evening Snacks, , , , , , , , , , , , , , , , , , , , Preparation Time, , 10 Mins, , , , , , , Cooking Time, , 15 Mins, , , , , , , Total Time, , 25 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , , For coriander upma, To make, coriander upma, , dry roast the semolina in a broad non-stick kadhai on a medium flame for 3 to 4 minutes or till it turns light brown in colour, stirring continuously. Keep aside., Heat the oil in a broad non-stick pan and add the urad dal and mustard seeds., When the seeds crackle, add the asafoetida, curry leaves and onions and sauté on a medium flame for 1 minute., Add the roasted semolina and salt and sauté on a medium flame for 1 more minute., Add the coriander chutney and cook on a medium flame for 1 minute., Add 2½ cups of hot water and cook on a medium flame for 1 to 2 minutes or till the water evaporates, while stirring continuously., Add the sugar and coriander, mix well and cook on a medium flame for 1 to 2 minute., How to pack coriander upma, Cool the, coriander upma, slightly, wrap in an aluminium foil and pack in a tiffin box., , , , , , , , , , , , , , , , Coriander Upma recipe with step by step photos, , , , , , , , , , , , , , , , , , Like Coriander Upma, , , , , , , , , Upma, is one of the most popular breakfast delicacy throughtout India. It is made in very different ways in each household., coriander upma recipe | quick kothambir upma | rava coriander upma |, is one of the variations to add in to your breakfast recipe list., , If you like, coriander upma recipe | quick kothambir upma | rava coriander upma |, you can also try these variations in upma., , , Oats Upma, , , Tomato Upma, , , , , , , , , , , , , , , , , , How to make Coriander Upma, , , , , , , , , To make the, coriander upma recipe | quick kothambir upma | rava coriander upma |, lets make the coriander chutney first. Take the coriander in a blender. Make sure the coriander you are using is fresh as it is the main ingredient inthe recipe. Wash it well under running water., , , , , , Add green chillies. you can increase or reduce the spice level as per your prefrence., , , , , , Add sugar and salt to taste., , , , , , Add cumin seeds to add on flavour to the chutney., , , , , ",
        "Quinoa Upma": "Ingredients: , , ¼ teaspoon mustard seeds, , ½ teaspoon cumin seeds, , 1 tablespoon channa dal (or use red lentils, optional), , ½ teaspoon urad dal (optional), , 1 pinch hing or asafoetida (optional, I don’t use), , 12 to 15 cashews split or broken, , ⅓ teaspoon salt (adjust to taste), , ¼ teaspoon turmeric (optional, for color), , , , , 3. Add quinoa to a bowl and pour water. Rub them well with your fingers to get rid of the bitter tasting saponins. Drain the water completely & rinse at least thrice. Later drain to a strainer to get rid of the excess water. Gently shake the strainer to drain the water completely., , , , Make Quinoa Upma, , 4. Pour 1½ tablespoons oil or ghee to the steel insert of the instant pot or to a hot pan placed on the stovetop, on a low to medium heat., , , , 5. Press the saute button on the IP. Add mustard seeds, cumin seeds, chana dal, urad dal and cashews. Fry them until light golden., , , , 6. Stir in curry leaves, ginger, green chilies and hing (optional)., , , , 7. Add sliced onions and saute until transparent for a minute or 2., , , , 8. Stir in the vegetables and saute for a minute., , , , 9. Add turmeric and salt., , , , 10. Add the drained quinoa., , , , 11. If using Instant pot, pour 1¼ cups water & mix well to release any bits of food stuck at the bottom., , Stovetop:, If making it in a pot/ pan on the stovetop, Pour 2 cups hot water and bring it to a rolling boil on a high heat. Cook uncovered on a medium heat, until the water is absorbed and the quinoa is cooked. For the stepwise photos you may scroll down., , , , 11. Cover with the lid. Press cancel and pressure cook for 2 minutes. Let the pressure drop naturally for 8 minutes and then release the rest manually., , , , 12. Taste test the quinoa upma and add more salt if you want., , , , 13. Let cool down for a few minutes and pour the lemon juice as required. Gently mix. Do not stir a lot when the quinoa is very hot., , , , Serve quinoa upma hot with pickle, podi or yogurt., , , , Stovetop Quinoa Upma, , Make sure you use 2 cups hot water and bring it to a rolling boil on a high heat. Reduce and cook on a medium heat. I did not use turmeric here so the color is different., , , , Cook on a medium flame till the quinoa is cooked completely. Keep stirring to a few times. They look transparent when cooked well. If there is extra water left in the pan, evaporate by cooking a little longer., , , , Serve quinoa upma with plain yogurt or pickle. Squeeze in some lemon juice before serving., , Serve quinoa upma with podi, pickle or curd. It goes good even in lunch box or as a breakfast or quick dinner., , Pro Tips, , , Ratio, : Quinoa to water ratio is the key for a fluffy quinoa upma. A lot of times I cook quinoa in an open pot (uncovered) with 1 part of quinoa and 2 parts of water. This gives me good results without making it mushy., , Instant Pot Ratio:, For every cup of quinoa you will need 1¼ cups water., , Instant Pot cook time:, I lately realized that new IPs take just 0 to 1 minutes to cook quinoa fully but due to usage as it becomes old, it requires more time. I now cook for 2 to 3 minutes. So adjust the cook time depending on how old or new your IP is., , Rinsing, : If using regular kind of quinoa rinse-rub-rinse very well at least thrice to get rid of the saponins, bitter tasting toxic compounds. I prefer to rinse even the pre-rinsed quinoa store bought seeds., , , Variations, , , Most often I use carrots, peas and beans and leave out the onions. Both taste different., , Feel free to spice up your quinoa upma with some Indian spice powder. Sometimes I add ¾ teaspoon of, Vangi bath, powder, , Bisi bele bath, powder or store bought, Sambar powder, to this quinoa upma. It turns out very delicious with the flavors of, Khara bath, ., , I have not used tomato in this. But sometimes I do use a tiny deseeded tomato. I saute it very well until the raw smell of the tomato goes away. Then add the veggies., , , , Related Recipes, , Quinoa Fried Rice..., , , Quinoa Pulao (Veg..., , , Oats Upma Recipe, , , Rava Idli Recipe, , , Pesarattu recipe, , , , , Recipe Card, , , , , , Quinoa Upma Recipe (Instant Pot and Stovetop), , , 5, from, 50, votes, , , , Quinoa upma is a simple healthy & filling Indian style breakfast made with quinoa, ▢, 1, , cup, , quinoa, ▢, 1, , sprig, , curry leaves, ▢, ⅓ cup (1 small), , onion, , sliced (optional), ▢, ½, , teaspoon, , ginger, , chopped finely, ▢, 1 to 2, , green chili, , chopped or slit, ▢, ⅓, , teaspoon, , salt, , (adjust to taste), ▢, ¼, , teaspoon, , turmeric, , (optional), ▢, 1, , small, , lemon, , (to serve), Mixed Vegetables (¾ to 1 cup), ▢, ½ cup (1 medium), , carrot, , chopped, ▢, ¼ cup (4 to 5), , green beans, , chopped, ▢, ¼, , cup, , green peas, Water (use any one), ▢, 1¼, , cups, , water to cook in Instant Pot, ▢, 2, , cups, , water to cook on stovetop in a pot, To Temper, ▢, 1½ to 2, , tablespoon, , oil, , or ghee, ▢, ¼, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , cumin seeds, ▢, 1, , tablespoon, , channa dal, , (optional), ▢, ½, , teaspoon, , urad dal, , (optional), ▢, 1, , pinch, , hing, , or asafoetida (optional), ▢, 12 to 15, , cashews, , split or broken,  Instructions: , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 5, minutes, , minutes, Cook Time, 10, minutes, , minutes, Total Time, 15, minutes, , minutes, , Servings, 2, , to 3, , Author, Swasthi, , , , Preparation, ▢, Add quinoa to a bowl or strainer and pour water. Rub them very well and discard the water. Rinse them at least thrice and drain in the strainer. shake off gently to get rid of the excess water., ▢, Rinse and chop the ginger, carrots, beans and onion (optional). Slit the green chili., Instant pot Quinoa Upma, ▢, Press saute button and pour oil to the steel insert of the Instant pot., ▢, When the oil turns slightly hot, add mustard, cumin, chana dal, urad dal and cashews., ▢, Fry them until slightly golden. Then stir in curry leaves, ginger and green chili., ▢, Stir in the onions & saute until transparent. Add the vegetables and saute for a minute., ▢, Add turmeric, salt, quinoa and water., ▢, Press CANCEL button. Secure the lid of the instant pot. Position the steam release handle to sealing. Press PRESSURE COOK button & Set the timer to 2 minutes., ▢, It takes time for the pot to build up pressure and cook. Once the pressure builds up, it cooks for 2 minutes. When it is done cooking the Ip beeps and goes to keep warm, press cancel. Wait for the pressure to release naturally for at least 8 mins. You may release the rest manually., ▢, Open the lid and fluff up the quinoa upma. Sprinkle some lemon juice and serve hot., How to make Quinoa Upma on Stovetop, ▢, Heat oil in a pan and add mustard seeds, cumin seeds, chana dal and urad dal. Fry them for a minute and add the cashews., ▢, Fry them until light golden and add curry leaves, green chilies and ginger. Stir fry for a minute until aromatic and add the onions. Saute for 2 minutes., ▢, Stir in mixed veggies & saute for a minute. Add salt, turmeric and quinoa. Pour water and mix well., ▢, Cook uncovered on a medium flame until quinoa turns tender and absorbs all the water. Cover and Turn off the heat. Let rest for 5 to 6 minutes., ▢, Fluff up the quinoa. Mix and taste test to adjust salt. Squeeze lemon juice before serving quinoa upma., , , Notes, I use pre-rinsed quinoa but still prefer to rinse them at least thrice. However you can also skip rinsing and use the pre-rinsed quinoa directly., , , , , Video, Watch Instant Pot Quinoa Upma Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Quinoa Upma Recipe (Instant Pot and Stovetop), , , Amount Per Serving, , , Calories, 376, , Calories from Fat 126, , , , , % Daily Value*, , , Fat, 14g, 22%, Saturated Fat 1g, 6%, Trans Fat 0.03g, Polyunsaturated Fat 4g, Monounsaturated Fat 7g, Sodium, 321mg, 14%, Potassium, 593mg, 17%, Carbohydrates, 54g, 18%, Fiber 9g, 38%, Sugar 5g, 6%, Protein, 12g, 24%, , , Vitamin A, 292IU, 6%, Vitamin C, 44mg, 53%, Calcium, 68mg, 7%, Iron, 4mg, 22%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , This recipe was first published in May 2015. Updated with new photos., , , , , 1.3K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 50 votes (, 41 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 24, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Radhika, , , , , , August 31, 2024 6:01 am, , , , , , Dear Swasthiji, I always turn to your website whenever I need a new recipe. And all those attempts never failed. You are a boon and thank you so much 🙏, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Radhika, , , , August 31, 2024 7:57 am, , , , , , So glad to read this Radhika. Thank you so much for the note!, , , , , , Reply, , , , , , , , , , , Amisha, , , , , , August 4, 2024 3:05 am, , , , , , Hi, I loved it however I felt I lost some of the flavour when I added the water.  Would it be ok if I cooked the quinoa separately, and then added to the tempering and veges afterwards?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Amisha, , , , August 4, 2024 3:10 am, , , , , , Hi Amisha,, Yes use the same amount of water and cook the quinoa first., , , , , , Reply, , , , , , , , , , , , , , Amisha, , , , , , Reply to, swasthi, , , , August 26, 2024 8:23 pm, , , , , , I’m soooo sorry!!  It turns out I was sick when I first tried your recipe and my tastebuds were affected.., I have made this yummy Upma at least six more times since and there is so much flavour with your original recipe.  Thank you!!!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Amisha, , , , August 27, 2024 5:19 am, , , , , , Thanks for coming back Amisha. Actually this is on a weekly rotation in my kitchen and my family appreciates it. I was a bit surprised when I read your previous comment. Thanks again, , , , , , Reply, , , , , , , , , , , Neha, , , , , , January 30, 2023 1:10 am, , , , , , I have never cooked anything with quinoa before. Have been trying out your recipes with quinoa. Love this quinoa upma. Please share a quinoa and chicken recipe. TIA, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Neha, , , , February 1, 2023 9:29 am, , , , , , Thank you so much Neha for trying. Sure I will share it, , , , , , Reply, , , , , , , , , , , KMW, , , , , , October 23, 2021 6:30 pm, , , , , , I absolutely love your site!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, KMW, , , , February 1, 2023 9:29 am, , , , , , Thank you so much, , , , , , Reply, , , , , , , , , , , SK, , , , , , November 24, 2019 2:28 pm, , , , , , Hi Swasthi,, Does this site has an app .would love to install, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, SK, , , , November 24, 2019 3:28 pm, , , , , , Hi Sk,, We don’t have an app for the site. Thanks for your interest., , , , , , Reply, , , , , , , , , , , Helen, , , , , , October 26, 2019 2:52 pm, , , , , , I made this quinoa. Tasted pretty good with your cucumber Arita, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Helen, , , , October 27, 2019 2:16 am, , , , , , Thank you Helen, , , , , , Reply, , , , , , , , , , , DS PANICKER, , , , , , June 17, 2019 8:03 am, , , , , , Wow, beautiful recipes, I love pumas, I could never forget the taste of Kerala style upmas, thanks for sharing this recipe, Swathi., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, DS PANICKER, , , , June 17, 2019 2:24 pm, , , , , , You are welcome., 🙂, , , , , , Reply, , , , , , , , , , , Shamanth, , , , , , May 18, 2019 7:52 am, , , , , , New easy recipes, Liked it, Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shamanth, , , , May 18, 2019 11:57 am, , , , , , You are welcome Shamanth, Thank you so much for rating the recipe., , , , , , Reply, , , , , , , , , , , Sriramya, , , , , , February 12, 2019 1:38 am, , , , , , Hi Swasthi,, , I thought of trying quinoa for very long time and finally I bought half kg Quinoa from amazon India and was googling online and came across your website., , Thank you and keep posting., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sriramya, , , , February 13, 2019 1:46 am, , , , , , Hi Sriramya, Thanks for trying., , , , , , Reply, , , , , , , , , , , ANANDA SUBRAMANIAN, , , , , , August 21, 2018 1:44 am, , , , , , , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, ANANDA SUBRAMANIAN, , , , August 23, 2018 11:09 am, , , , , , Thank you so much, , , , , , Reply, , , , , , , , , , , neela manogar, , , , , , May 18, 2015 7:40 am, , , , , , A  traditional healthy breakfast. Done perfectly. Nice to see such a wonderful dish., , , , , , Reply, , , , , , , , , , , nandoo, , , , , , May 18, 2015 1:59 am, , , , , , looks yumm… I love these healthy upma varieties…., , , , , , Reply, , , , , , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Palak Upma": "Ingredients: rava upma recipe, with spinach and tomato flavor., , , Rava Upma or Uppittu recipe, is one of the common breakfast recipes prepared in Karnataka. Today when I saw a bunch of spinach in the refrigerator, I decided to give a twist to the regular rava upma and make it more healthy. Trust me, my husband could not figure out that I had added spinach in the upma, but he did ask about the green color., , This recipe is an easy and healthy way to feed your kids hidden green leafy veggies into their diet. My blog's other Upma recipes are, Restaurant Style Rava Upma, , , Avarekalu Upma, , , Cauliflower Upma, , , Vermicelli Upma, ., , Check out the blog post on how to make, Instant Rava Upma mix recipe, at home., , Which Semolina/Sooji/Rava can I use for this recipe?, , There's a huge variety of semolina/rava available in the market. Most commonly used are bansi rava and bombay sooji rava, which are readily available in Indian grocery stores or amazon, ., I have used roasted bombay sooji rava for this recipe., , , How to make Spinach Upma, , Add chopped spinach(palak), tomato, green chilies, and blend to a smooth paste without adding any water in a blender., , , Start by roasting the sooji until it's fragrant on a medium-low flame in a pan. Do not burn or brown the sooji from the bottom, so be careful. Remove it into a clean, dry bowl or plate., Note, : You can do this step of roasting sooji in advance and save time for busy mornings., , Add oil to a heavy-bottom pan. Add mustard seeds, jeera (cumin) seeds, urad dal, and cashew nuts, and saute for 1 minute until they start changing color. Next, add chopped ginger and curry leaves. Saute for another 20 seconds., , , Add spinach tomato puree to this pan and cook for 2-3 minutes. It slightly changes its color., , , Later add the water, salt and let it come to a boil. Once it starts boiling, start adding the roasted sooji at a time. Stir sooji continuously after each addition in one direction with a spatula to avoid lumps., , , Then cover the pan with a lid and set heat to low. Let it remain like that for 2-3 mins still all moisture is absorbed. Turn off the heat., , Remove lid, add lemon juice, coriander leaves, and two tablespoons of ghee. Ghee is optional but recommended. Mix well., , , Serve the spinach upma hot with coconut chutney, pickle, sambar., , What to serve with Spinach Upma?, , Serve Spinach Upma with, coconut chutney, , , sambar, , or, peanut chutney powder, and a cup of filter coffee., , Tips, , , Do not burn the rava while roasting it. Keep the flame on medium-low and mix it constantly until it fragrant. Adding cumin or jeera while roasting rava enhances the upma flavor. But you can completely avoid jeera if you don’t like., , You can roast upma rava beforehand and store it in an airtight container. This saves a lot of time during the busy morning or days., , Sooji to water ratio is another important aspect to get restaurant style upma. So use 3 cups water for 1 cup of sooji – this results in soft and creamy consistency. I have tried 2.5 cups, but I think 3 cups works best.If you like even more thin or watery consistency upma use 4 cups of water for 1 cup of sooji., , Please do not reduce or skip the quantity of oil and ghee. You cannot achieve the restaurant style soft texture. You may use even more for a softer and tastier upma., , Do not add all the rava to the water in one go. Add the roasted rava little at a time stirring after each addition. This way the upma will not form any lumps., , Don’t forget to add lemon or lime juice along with coriander for garnish at the end it really helps to enhance flavors of the upma. Some people also add 2 tablespoon of fresh grated coconut in the end., , The final texture of upma also depends on the type of rava/sooji., , Tastes the best when served hot or warm., , Do not skip curry leaves. More the better., , Add more green chilies If you like spicy upma., , This recipe can also be made using bansi rava (Yellow colored sooji) but I highly recommend to use rava sooji(fine variety) for this recipe., , , Variations, , , Add vegetables of your choice like peas, carrot, beans, capsicum and corn to make healthy vegetable spinach upma., , You can also add onions to this recipe., , You can use bansi rava (yellow-colored sooji) as well., , A few people also add grated coconut before serving., , , More, Breakfast Recipes, , , Vegetable Panniyaram (Paddu), , Restaurant Style Upma, , Mandakki Usli, , Avarekalu Upma|Karnataka Style Avarekai Upittu, , Paneer Uttapam, , Hariyali Poha | Poha in Green Masala, , , Tried this recipe?, Don’t forget to give a ★ rating below, , , , , , Spinach Upma|Palak Upma, , , Bhavana Patil, , , , , 4.67, from, 3, votes, , , , Print Recipe, , Pin Recipe, , , , , , , , , Servings:, 2, , , Calories :, 483, , , Course:, Breakfast, , Cuisine:, Indian, , Diet:, Vegan, Vegetarian, , , , , , , Prep Time :, 10, minutes, , minutes, , Cook Time :, 10, minutes, , minutes, , Total Time :, 20, minutes, , minutes, , , , , 1x, 2x, 3x, 1, , cup, , sooji/semolina/rava, 1.5, , cups, , spinach (palak), 1, , large, , tomato, , (about 1 cup), 3, , green chillies, 2, , tablespoon, , oil, 1, , teaspoon, , mustard seeds, ½, , teaspoon, , cumin seeds(jeera), 1, , teaspoon, , urad dal, few, , cashews, , (optional), 1, , stalk, , curry leaves, 1, , teaspoon, , ginger, , minced, 2.5, , cups, , water, salt, , to taste, juice of half lemon, 2, , tablespoon, , cilantro (coriander leaves),  Instructions: , In a Blender add chopped spinach(palak) ,tomato ,green chillies and blend to a smooth paste without adding any water., Start by roasting the sooji until it’s fragrant on medium low flame in a pan. Do not burn or brown the sooji from bottom so be careful.Remove it into a clean dry bowl or plate.Note:, You can do this step of roasting sooji in advance and save time for busy mornings, ., Add oil in a heavy bottom pan, add mustard seeds, jeera(cumin) seeds ,urad dal ,cashew nuts and saute for 1 minute until they start changing color.Next add chopped ginger and curry leaves. Saute another 20 secs., Add spinach tomato puree to this pan and cook for 2-3 minutes.It slightly changes its color., Later add the water, salt and let it come to a boil.Once it starts boiling, start adding the roasted sooji at a time.Stir sooji continuously after each addition in one direction with a spatula to avoid lumps., Then cover the pan with lid and set heat to low. Let it remain like that for 2-3 mins still all moisture is absorbed.Turn off the heat., Remove lid ,add lemon juice, coriander leaves and 2 tablespoon of ghee.Ghee is optional but recommended.Mix well., Serve the spinach upma hot with coconut chutney ,pickle ,sambar ., , , Notes, , You can also add vegetables of your choice like peas ,carrot ,beans ,capsicum and corn to make healthy vegetable spinach upma., , You can also add onions for this recipe., , You can use bansi rava (Yellow colored sooji) as well., , Few people also add grated coconut before serving., , , , , Note: Nutrition values are my best estimates. If you rely on them for your diet, use your preferred nutrition calculator., , Nutrition, Calories:, 483, kcal, Carbohydrates:, 72, g, Protein:, 13, g, Fat:, 16, g, Saturated Fat:, 1, g, Trans Fat:, 1, g, Sodium:, 264, mg, Potassium:, 523, mg, Fiber:, 8, g, Sugar:, 5, g, Vitamin A:, 2940, IU, Vitamin C:, 47, mg, Calcium:, 69, mg, Iron:, 5, mg, , , , , Keyword, breakfast recipes, easy, healthy, indian, palak recipes, spinach recipes, upma recipe, , , , , , Tried this recipe?, Share your photo and tag, @indianveggiedelight, or, #indianveggiedelight, , ★ Like this recipe? FOLLOW ME on, Facebook, ,, Instagram, ,, Pinterest, , and, Youtube, for more quick & easy recipes., , More Breakfast, Millet Pongal (Thinai Pongal) - Instant Pot, Drumstick Leaves Paratha (Moringa Paratha), Oats Upma Recipe | Vegetable Oats Upma, Veg Cream Cheese Sandwich, , , , 10, , shares, , , , , , , , , , , , , , , , , , , , , Reader Interactions, , , , 4.67 from 3 votes (, 3 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, , , Email, , , , , , , , Primary Sidebar, , , , , Hey, I'm Bhavana, , Here, you'll find easy recipes for your Instant Pot, Air-fryer, Kids Lunch Box, and Keto/LowCarb, plus more wholesome, easy Vegetarian/Vegan Indian recipes that your family will love., , , Learn more about me->, , , , , Popular Recipes, , Healthy Indian Kids Lunch Box Recipes, 40+ Best Vegetarian Indian Dinner Recipes (Easy Dinner Ideas), 25+ Best Indian Breakfast Recipes, The Best Avocado Pasta, 18+ Best Indian Salad Recipes, 20+ Easy Air Fryer Indian Recipes, , , , , Footer, , , , as featured in:, , , , , , , , , , , , , , , , , , , , , , ↑ back to top, , , , , , , Recipes, , , COOKING 101, , INSTANT POT 101, , INSTANT POT RECIPES, , AIR FRYER RECIPES, , KIDS LUNCH BOX, , , , , About, , , ABOUT BHAVANA, , CONTACT, , PRIVACY POLICY, , SHOP, , SUBSCRIBE, , , , , , , As an Amazon Associate, I earn from qualifying purchases., , Copyright © 2025, Indian Veggie Delight, , , , , , , , 10, , shares, , , , , , , , , , , , , , , 10, , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Chatpata Dahiwala Bread": "❌ Error scraping https://www.tarladalal.com/chatpata-dahiwala-bread-2876r: 404 Client Error: Not Found for url: https://www.tarladalal.com/chatpata-dahiwala-bread-2876r",
        "Veg Upma": "Ingredients: , , Semolina - rava or sooji - Indian Cream of wheat farina, Olive oil - great for sautéing your vegetables and making sure they don’t stick, Mustard Seeds-Optional, Curry Leaves-  are aromatic herb used in South Indian cooking, Thai green chilis - or any green chilis add accord  to taste, Red onion - you can use yellow onions too, Carrots - sliced up in small pieces, Green Peas - you can add chopped green beans  too, Water, Salt - seasoning for taste and flavor., Sugar- Just a dash!, Cilantro leaves - for garnish, , You can also add additional veggies if you want to for extra nutrients and flavor., , , Why make upma in the Instant Pot, , The pressure cooker is the perfect tool for making this easy breakfast recipe. The Instant Pot cuts down on the cook time and yields consistently delicious results each and every time you make upma., , New to cooking with the Instant Pot and nervous? Don't be! We break down exactly how to use your Instant Pot in our complete beginner's guide to pressure cooking called, Is the Instant Pot Worth It, ?, , How to make Sooji upma in an instant pot - Step by Step Recipe, , Upma is really easy to make, especially when you use your Instant Pot. Here are the steps you need to take to make delicious tasting upma in a matter of minutes., , , Heat your Instant Pot on Saute mode., Once it is hot, add the oil and mustard seeds and let the mustard seeds splutter., Once they are jumping around a bit, add the curry leaves, green chilies, onions, peas, and the carrots and give it a stir., Add in the semolina and sauté the mixture for 2 minutes., While it sauté's,, keep stirring the semolina and veggies., Next, add in the salt, sugar, and water., , , Use a sturdy spoon to scrape the bottom of the pot and stir the mixture. Close the lid with the vent set to sealing., Set the, pressure to low, and cook for 1 minute. Let the pressure release naturally for 5 minutes., After five minutes, release the remaining pressure and open the lid. Sprinkle the chopped cilantro on top and stir., Serve it warm with chai tea or coffee., , Pro Tips and tricks, , Follow these tips and tricks to make the best tasting homemade upma in your Instant Pot., , To plan ahead, cut up your vegetables the night before. That way it just takes minutes to put everything in the pot., Don’t overcook the grains - they only need, low pressure, and a short natural release to have the perfect texture. If you cook them too long or on high pressure, they may turn to mush., You can add any vegetables you like, green beans and corn work well., You can add extra oil if you desire or use ghee at the end to add extra flavor, Upma tastes best when served fresh and warm., Make sure you use the full 3 cups of water to make sure the grains get the best texture., You can add roasted cashews or peanuts to make it more festive, , , How to Store and Reheat Suji Upma, , Like other creamy grains, upma is best served hot and fresh. You can store leftovers, if you need to or if you want to make a batch over the weekend and serve it during the week. To store, allow it to cool to room temperature and then portion into one or more airtight containers. Place in the refrigerator for about 3 to 5 days., , To serve it, reheat in the microwave. If needed, you can add a small amount of water to help rehydrate the semolina., , Is Sooji Upma healthy?, , Yes! Upma is made with semolina, a type of flour made from durum wheat. It has several vitamins and minerals as well as additional protein. It also has carrots and peas, and you can add as many other vegetables as you like., , , How to make instant upma mix, , If you like to have convenient breakfasts ready to go throughout out the week, you can make an instant upma mix for busy mornings. Here’s how you can do that., , In a large skillet or pan, heat the oil and add the mustard seeds. Allow the mustard seeds to splutter. Once they are jumping around a bit, add the curry leaves, green chilies, onions, peas, and the carrots and give it a stir., Add in the semolina and sauté the mixture for 5 to 7 minutes. While it sautes, keep stirring the semolina and veggies. Next, add in the salt and sugar. Remove from heat., Allow it to cool until it reaches room temperature. Once it is cool, add it to sealable bags, jars, or air tight containers., When you are ready to serve the instant mix, boil 2 cups of water and then add one cup of the instant mix. Mix and cook for 1 minute before serving warm., , How to make Upma in a microwave?, , You can make an instant version of upma in the microwave. To do this, use a premix or instant upma mix and add water to it. Microwave for around 30 seconds, and microwave for another minute. Stir it again and the nuke for another 30 seconds for a total of 2 minutes cook time., , Is Upma vegan?, , Yes, our upma recipe is made using oil and no animal products. It only contains vegetables, wheat, herbs, and spices., , If you want to keep it vegan, just don’t add any ghee at the end. If you like vegan recipes, check out our, Instant Pot Vegan Vermicelli Bowl – Semiya Upma, ., , , Why is my Rava upma lumpy?, , Rava upma is usually lumpy if you do not mix the rava properly with water. When making upma on a stove top, add water slowly to the rava while continuously mixing the rava mixture., , , Why is my Rava upma sticky?, , , , 1 cup Semolina (rava /sooji)/ thick, , 2 tbsp. Oil, , 2 teaspoon Mustard Seeds, , 6-8 Curry Leaves, , 2 Thai green Chilies /chopped, , 1/2 cup red onion /chopped, , 1/2 cup carrots / chopped small bite size, , Salt To Taste, , 1/2 cup Green Peas, , 3 cups Water, , 2 teaspoon Sugar, , Cilantro leaves for garnish, , , , , , but the time  remains  the same., , , Reply, , , , , , , , , , Ashish Patel, , says, , , October 19, 2020 at 11:34 pm, , , , Such A Great Blog. Thank U For Sharing Useful Information about upma. This Article Really Amzing And So Much Helpful For Me. Keep It Up:)., , , Reply, , , , , , , , Traci, , says, , , October 16, 2020 at 11:03 am, , , , I love this recipe! So much flavor with little effort. It's the perfect side dish...thanks! ?, , , Reply, , , , , , , , Lizet F. Bowen, , says, , , October 16, 2020 at 10:37 am, , , , Oh. I love discovering new breakfast dishes, especially savory ones that keep you going all morning!, , , Reply, , , , , , , , Marlynn, , says, , , October 16, 2020 at 10:34 am, , , , What a delicious way to start the day! I'm always looking for new breakfast dishes and this is fantastic. Thank  you!, , , Reply, , , , , , , , Dannii, , says, , , October 16, 2020 at 10:14 am, , , , This looks like a really delicious way to eat some more vegetables. I can't wait to try it., , , Reply, , , , , , , , Kristin, , says, , , October 16, 2020 at 10:03 am, , , , This looks so delicious. I love that it's something a little different to start out the day without all the sugar and empty calories. Thanks for sharing!, , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , Welcome!, , A vegetarian & vegan food blog where we (Anvita & Soniya) share everyday healthy-ish recipes, some occasional treats, and even-you-can-do-this ideas., , , Read more, , , , Popular Recipes, , Instant Pot 2 Ingredient Homemade Yogurt !, Instant Pot Vegetable Chowmein Recipe, Date & Walnut Loaf Cake, Minestrone Soup (Copycat Olive Garden), , , Trending Now, , , , , , Footer, , , , freebie alert!, , Download our Vegetarian Grazing Table Grocery List, , Download our, FREE, Vegetarian Grazing Table Grocery List so you can start setting up an Instagram worthy spread for your next gathering., , , Get the list!, , , , , , , , , About Us, , Privacy Policy, , Contact, , ↑ back to top, , , , , , , Copyright © 2024, The Belly Rules The Mind, •, Powered by Feast+, , , , , Skip to Recipe, , , , , , , , , , , Instructions: , , How do I serve Upma?, , Upma is a breakfast food in India. I often serve fruit alongside the dish as well as chai tea or coffee., Sometimes I serve it alongside this delicious, Khaman Dhokla, recipe. Other times I serve it with my, Homemade Poha, ., , , What vegetables can I substitute?, , You can add several other vegetables if you like. You can add veggies like:, 1. small pieces of cauliflower, 2. broccoli florets, 3. corn, 4. green beans, 5. broccoli, 6. any other veggie you like and have on hand, , , , Make it, tag it, , Did you make this delicious upma recipe in the Instant Pot? Don’t forget to come back and leave your feedback and star rating. We would be THRILLED if you would, take a pic and tag us on Instagram @dbellyrulesdmind or Facebook @, thebellyrulesthemind, , , , , , Continue to Content, , , , , , , , Rava Upma Recipe, , , , Yield:, , 4, , , , Prep Time:, , 5 minutes, , , , , Cook Time:, , 1 minute, , , , , Additional Time:, , 5 minutes, , , , , Total Time:, , 11 minutes, , , , , , Upma is a filling, hearty Indian breakfast food that you will love. This savory porridge will power you and your family through the morning with plenty of energy. This wholesome breakfast has a variety of veggies so you start the day off right. And you can put it together in less than 10 minutes without the stirring and babysitting, which makes it great for weekday or weekend mornings for a warm breakfast everyone will enjoy., , , , , , Print, , , , , , , Press SAUTE mode once HOT add in the oil and mustard seeds and let it splutter., Add the curry leaves, green chilies, onions, peas, and the carrots and give, it a stir., Next goes the Rava/ Semolina and sauté it for 2 minutes, (Keep stirring the semolina and veggies, )., Add in the salt, sugar, and water., Stir it all up and, scrape if anything is stuck to the bottom, . Close, lid with vent in sealing position., Pressure cook it on, Low  pressure, for 1 minutes and let the pressure release naturally for 5 minutes., Release the remaining pressure and open the lid. Sprinkle the chopped cilantro, stir and serve it warm., , , , Notes, , , Follow these tips and tricks to make the best tasting homemade upma in your Instant Pot, ., To plan ahead, cut up your vegetables the night before. That way it just takes minutes to put everything in the pot., Don’t overcook the grains - they only need, low pressure, and a short natural release to have the perfect texture. If you cook them too long or on high pressure, they may turn to mush., You can add any vegetables you like, green beans and corn kernels., Upma tastes best when served fresh and warm., Make sure you use the full 3 cups of water to make sure the grains get the best texture., You can add roasted cashews or peanuts to make it more festive, , , , , , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , Black Mustard Seeds Whole Spice, , , , , , , , , Rani Sooji (Farina, Suji, Rava, Rawa, Semolina) Flour, Coarse 4lbs (64oz) ~ All Natural | Vegan | NON-GMO | Indian Origin, , , , , , , , , , , , , , Follow us for more delicious Recipes !, , Did you make recipe? don’t forget to come back and leave your feedback and star rating., , , , , , , © Soniya Saluja, , , , Cuisine:, Indian, , /, , Category:, Easy Instant Pot Recipes For Beginners, , , , , , , , , , , , About Soniya, , , , Hello, I am Soniya, the cofounder of The Belly Rules The Mind.  Originally from Mumbai, India, I am settled in Virginia US with my husband., , I am a mother of 2 energetic boys, referred to as R2 (15-year-old) and R3 (10-year-old) on the blog. In case you are wondering who is R1, well that is my husband., , , My hubby and I were born in Mumbai, India, where we were spoiled by the wealth of food choices available to us. We could enjoy everything from yummy street food to multi-cuisine restaurants and we became very picky about what we like and what we don't. Come join us on our journey to have \"The Belly Rule The Mind\", , , , More Vegetarian, Tandoori Paneer Tikka Skewers (Gas Stove Top & Grill Pan Recipe), Street Style Hakka Noodles / Chowmein Recipe, Easy Sheera Recipe – Make Perfect Sooji Halwa at Home!, How to Make Sabudana Vada in Appe Pan, Comments, , , , , , Sankalp Packaged Foods, , says, , , August 16, 2023 at 5:02 am, , , , this blog content s very unique way to explain how to make vegetable upma. easy and well manner explain everyhting . how a diffent ways to make upma ., , , Reply, , , , , , , , Tanay Sharma, , says, , , July 14, 2023 at 3:09 am, , , , Good article, Soniya explaining the different ways to cook vegetable upma. The vegetable upma recipe using the microwave is very easy and quick. The article has also listed how to get the recipe right if it gets lumpy or sticky. Vegdietplans has listed this dish in its weight-loss diet plan., Website :, https://vegdietplans.com/recipe/vegetable-upma/, , , Reply, , , , , , , , Sankalppackagedfood, , says, , , June 20, 2023 at 2:53 am, , , , This vegetable upma recipe is a game-changer! It's packed with vibrant flavors, wholesome veggies, and a perfect balance of spices. Simply delicious!, , , Reply, , , , , , , , Jake A, , says, , , June 22, 2021 at 10:02 pm, , , , If I increase the quantity .. 2 cups semolina .. do I use 6 cups water?, , , Reply, , , , , , , , Soniya Saluja, , says, , , June 23, 2021 at 9:45 am, , , , Hi Jake",
        "Pulusu Upma": "Ingredients: , , , , , Vegetables, , , , Vegetables, , Avarekalu|Hyacinth \n\nBeans, , Babycorn, , Baby Potatoes, , Beetroot, , Bell Peppers, , Bittergourd|Karela, , Bottlegourd|Lauki, , Brinjal|Eggplant, , Broad beans|Chikkudukaya, , Broccoli, , Cabbage, , Capsicum, , Carrot, , Cauliflower, , Corn|Sweet Corn, , Cucumber, , Clusterbeans|Gawar phali, , Drumstick|Mulakkada, , French Beans, , Fresh Chickpeas, , Gooseberries|Amla, , Green Peas|Matar, , Ivy gourd|Dondakaya, , Ladies Finger|Okra, , Mushrooms, , Poblano Peppers, , Potatoes, , Radish, , Raw Banana, , Raw Mango, , Red Pumpkin, , Ridgegourd|Beerakaya, , Yam|Kandagadda, , , , , Fruits, , , , Fruits, , Apple, , Banana, , Blueberries, , Mangoes, , Oranges, , Strawberries, , Watermelon, , , , , Green leafy Vegetables, , , , Green leafy Vegetables, , Amaranth leaves, , Basil, , Coriander leaves, , , , Drumstick leaves, , Fenugreek leaves|\n\nMethi, , Mint leaves, , Mustard Greens, , Radish Greens, , Spinach|Palak, , Sorrel greens|\n\nGongura, , , , , Dals,Lentils&Pulses, , , , Dals,Lentils&Pulses, , Black Chickpeas, , Black \n\neyed Beans|Lobia, , Chana dal|Senagapappu, , Chickpeas|Kabuli Chana, , Moong dal|\n\nPesarapappu, , Rajma|Kidney Beans, , Toor dal|Kandipappu, , Urad dal|Minapappu, , Whole Moong|Pesalu, , , , , Flours, , , , Flours, , Besan|Chickpea \n\nflour, , Jowar flour, , Ragi flour|Nachni atta, , Rice flour, , , , , Others, , , , Others, , Bread, , Eggs, , Flattened Rice|\n\nPoha, , Oats, , Paneer, , Pasta|Noodles, , Phool Makhana, , Puffed \n\nRice|Murmur, , Rava|Sooji, , Rice Rava|Biyyam Rava, , Sabudana|Sago, , Soya Paneer|Tofu, , Sprouts, , Tutti Frutti, , , , , , , , , , , , Followers, , , , , , , , , , , , , , , , , , , Mango Pickle Recipes, , , , , , , Click on Image for Recipes, , , , , Payasam|Kheer Recipes, , , , , , , , , , Special Categories, , , , , Bachelor Recipes, , , , Cooking With Family(CWF) Series, , , , Festival Recipes, , , , Healthy Greens Recipes, , , , Low Calorie Recipes, , , , Lunch Box Recipes, , , , Mango Recipes, , , , Microwave Recipes, , , , Monsoon Specials, , , , No Onion-No Garlic Recipes, , , , Party Recipes, , , , Vegan Recipes, , , , Vrat Recipes, , , , Winter Recipes, , , , , , , Festival Recipes, , , , , Christmas Recipes, , , , Diwali Recipes, , , , Festival Recipes, , , , Ganesh Chaturthi Recipes, , , , Gokulashtami Recipes, , , , Holi Recipes, , , , Karwa Chauth Recipes, , , , Navratri Recipes, , , , ONAM Recipes, , , , Sankranti Recipes, , , , Ugadi recipes, , , , Varalakshmi Vratam Recipes, , , , , , , Translate, , , , , , , My Family Recipes-Special Series, , , , , , , , , , , , , , , , , , , , , , , , , , Monday, December 1, 2014, , , , , , Pulusu Upma | Tamarind Upma | Pulusu Pindi, , , , , , , , , , , , , , , , , When it comes to breakfast,we prepare lot of varieties and there are so many recipes which are just common to our community. I have posted many of our community special recipes and today's post is also one among them. 'Pulusu Upma' is basically Tamarind upma which quite tangy,sweet and spicy and tastes much different when compared to regular, upma, the usage of rice rava in this upma makes the texture different compared to regular, upma, .It is known as 'Pulusu pindi' in Andhra and it is slightly different from our version.I prefer this Pulusu Upma over the regular, Sooji Upma, any day because of its distinct taste,you can try this tangy Tamarind upma sometime for a different breakfast recipe., , , , , , Check out more breakfast recipes of our Community style:, , , Billa Kudumulu/Rice Rava Tikkis, , Utha(Plain Rice Flour) Rotti with Avarekaalu Benne Usli, , Kayi Biyyam Uppindi / Coconut-Rice Upma, , Ottu Shavige | Homemade Rice Noodles(String Hoppers), , Bilavalige(Rice Flour Chapati) and Pithikipappu, , Vadappam(Riceflour Poori) and Chintaku Palya, , Mosaru Kodubale/Curd Kodbale, , , , , , , Pulusu Upma | Pulusu Pindi Recipe:, , , , , Serves 2 |, Author: Prathibha, , Prep time:10 mins | Cooking time: 20 mins | Total time: 30 mins, , Cuisine: Andhra | Category: Breakfast, , , , 1 cup fine Rice Rava(see notes for how to prepare it at home), , 15-20 Shallots or 2 large Onions, , 2-3 Green chillies,slit, , 3 cups Water, , 2 tbsp chopped fresh Coriander, , 1/2 tsp Turmeric powder(optional), , 1/4 cup Groundnuts, , 1 large lemon sized Tamarind, , 1 tbsp, Sambar Powder- Karnataka style, , 2-3 tbsp Jaggery, , a sprig of Curry leaves, , 1 tbsp Chana dal, , 2 tsp Urad dal, , 1/2 tsp Mustard seeds, , 2-3 tbsp Oil, , Salt to taste, , 1  tbsp Ghee, , , ,  Instructions: , , Dry roast rice rawa in a kadai until the nice aroma starts from it.Remove it from the pan and let it cool.You can even roast rawa in a tsp of ghee which also gives a nice flavor to upma., , Soak tamarind in 1/2 cup of water for half an hour and extract pulp from it., , Heat oil in a thick aluminium kadai(which is ideal for making upma) or non-stick kadai and crackle mustard seeds., , Add ground nuts  fry until they turn little red in color and add chana dal and urad dal and fry until they turn golden brown., , Add slit green chillies,curry leaves and fry them until they wilt., , Add shallots or sliced onions and fry them until they are pink in color., , Add tamarind pulp extracted and 3 cups of water (1c rawa:3c water) to it., , Add turmeric powder,, sambar powder, ,salt and jaggery to it and let it boil., , Add roasted rava to it with one hand and keep stirring with another hand using a ladle,make sure you make this process very quickly otherwise you will end up having lumpy upma., , Once everything is mixed,keep the lid on and cook it on low flame for 8-10 mins.Switch off the flame., , Add ghee and coriander to it and mix well., , Cover it and let it sit for 4-5 mins before you serve., , , Serve it hot with some boondi/chips/cucumber., , , , , Notes:, , , To prepare Rice rawa, : Clean and Soak the rice for some time and drain it completely and spread over a cloth so that it will drain off excess water.Coarsely grind the pound mixture in a mixer and then sieve it(do it in whipper mode).Use the rawa which is in sieve and the flour that it is sieved can be used for dosa's or regular rice flour., , This upma is sour,sweet and spicy at the same time so adjust the seasoning as per your taste., , We prepare another version called 'Pulusu Biyyam' where the roasted rava is replaced with roasted rice but the rest of the procedure is similar., , I highly recommend to use shallots for this recipe, if you do no have you can use thickly sliced onions instead., , , , , , Check out other Upma recipes in my blog:, , , Avarekalu Akki Tari Uppittu | Rice Rava Upma with Flat Beans, , Godhuma Rava Upma/Lapsi Rava Upma, , Idli Upma - using left over Idlis, , Kayi Biyyam Uppindi / Coconut-Rice Upma, , Kharabath..Bramhins Coffee Bar Style, , Sooji Upma/Upittu/Rawa Upma, , Masala Upma, , Rava (Biyyapurava) Pulihora | Pindi Pulihora, , Rava Vangibath, , , , , , , Technorati \nTags:, pulusu \nupma recipe, ,, pulusu pindi recipe, ,, andhra \npulusu pindi recipe, ,, vysyas recipes, ,, breakfast \nrecipes, ,, upma \nvarieties, ,, tamarind upma recipe, , , , , , , , , , , , , , , , , , , Posted by, chef and her kitchen, , , at, 11:52 AM, , , , , , , , , , , , , , , , , , Labels:, Andhra, ,, Breakfast, ,, Karnataka, ,, Rava | Sooji, ,, South Indian, ,, Tamilnadu, ,, Tiffin, , , , , , , , , 6\ncomments:, , , , , , , , Catherine, said..., , , Looks and sounds delicious. Catherine, , , , , December 1, 2014 at 1:30 PM, , , , , , , , , , , , , Rumana Rawat, said..., , , Really a very nice idea . Looks tempting., , , , , December 1, 2014 at 3:17 PM, , , , , , , , , , , , , Sayantani Mahapatra Mudi, said..., , , I love little tang in everything....this one is so new to me and a must try., , , , , December 1, 2014 at 10:34 PM, , , , , , , , , , , , , Srivalli, said..., , , I don't think I have even heard of this dish..very nicely done Prathibha.., , , , , December 15, 2014 at 4:37 PM, , , , , , , , , , , , , Unknown, said..., , , Dear Prathibha,, It took a moment to get back to the reality that “chefandherkitchen” isn’t a real platter – ‘Pulusu Upma’ made it harder to stand it! We would love to feature your culinary skills on our global platform., This is an exclusive space for your penmanship, where you can publish your unique culinary outputs in the form of brief food blogs; that too you’re the one, who’s going to own this space! We would like to pass it on to others by featuring it on our global platform!, http://indiapulse.sulekha.com/food-recipes/chocolate-pie-easy-to-make-pie_post_7854, http://indiapulse.sulekha.com/food-recipes, http://indiapulse.sulekha.com/, Sulekha.US would be glad to present your food blog to the Indian communities living abroad. We would love to connect them through one of the most vital channels i.e. food., It’s all yours and you’re going to own an exclusive food blog with Sulekha  to share your recipes along with their back links. We would promote it across our wall and social media., Featuring your recipes on our home page would be a perk for our eager Indians, who are waiting for Desi recipes and baked goodies ranging from ‘grand’ to ‘on the go’., Sharing your passion for cooking might rejuvenate the taste buds and senses of millions of Indians living abroad.  We’re awaiting your valuable reply., Bon Appetite!, Thanks & regards, Hamida, Content Manager, Sulekha US, HasanulhameedhaS@sulekha.net, , , , , , December 18, 2014 at 8:01 PM, , , , , , , , , , , , Anonymous\nsaid..., , , Hi can i use idli rava for this recipe., , , , , January 27, 2015 at 1:32 AM, , , , , , , , , , , , , , Post a Comment, , Thank you for visiting The Chef and Her Kitchen., Do leave your comments and feedback,they are always welcome.Please do not leave any links., Hugs,, Prathy, , , , , , , , , , , , , , , , , , , Newer Post, , , , Older Post, , , Home, , , , , Subscribe to:, Post Comments (Atom), , , , , , , , , , Search For a Recipe, , , , , , , , , , , , , , , , , , , , , , FOLLOW ME ON FB, , , , , , , let's connect, , , , , , , , , , , , Follow @prathibhagarre, , , , , , , , , , , , , , Contact Me:, , thechefandherkitchen(at)gmail(dot)com, , , , , Pick up from MENU, , , , -Appetizers | Snacks -, , ----- Appetizers|Finger Food-----, Baked Beans Wrap, Broccoli Cutlets, Canapes with Corn filling, Canape Sev Puri, Chilli Paneer Dry, Chilli Tofu, Fruit Cocktail Sticks, Garlic Bread Exotica, Hara Bhara Kabab, Kothimbir Vadi, Masala Cocktail Idlis, Oats Tikki/Oats Cutlet, Onion Samosa/ Ullipaya Samosa, Paneer Tikka, Pita chips with Hummus, Raw Banana Kebab/Kele ka Kabab, Sabudana(Sago) Cutlets, Stuffed Bell Peppers, Tandoori Aloo, Upma Tikki...left over wonders, Vegetable Chops | Stuffed Cutlets, Vegetable Puffs, Zucchini Patties, , ----- Vada|Pakora|Bajji|Cutlets -----, Alasandula vada/Lobia Fritters, Aratikaya(raw banana) Bajji, Babycorn Pakora, Broccoli Cutlets, Cabbage Pakora, Corn Vada / Mokkajonna Vadalu, Cabbage Muthia, Dahi vada/Perugu Vada/Mosaru Vade, Dahi Bhalla, Instant Sooji Appey/Rava Paniyaram, Maddur Vada, Maggi Noodles Vegetable cutlet, Mangalore Banana Buns, Mangalore Bonda/Goli Baje, Masala vada/Chanadal Vada, Mixed dal Masala Vade/Dal Ambode, Mosaru Kodubale/Curd Kodubale, Mosaru Ambode/ Dahi Masala Vada, Oats Pakora, Oats Tikki/Oats Cutlet, Onion Pakoda, Onion Samosa/ Ullipaya Samosa, Pesara Punugulu(Green Moong Fritters), Poha Tikki, Punugulu/Dosa batter Bonda, Saggubiyyam(Sago) Bonda, Sabudana(Sago) Cutlets, Savory Semolina Bread, Stuffed Brinjal Pakora, Stuffed Mushrooms, Stuffed Okra Pakora, Tomato Bruschetta, Vegetable Chops | Stuffed Cutlets, Vegetable Puffs, , ----- Sundal Varieties -----, Alasandula gugillu /Lobia Sundal, Ammini Kozhukattai/Undrallu Guggillu, Butter Cup Corn, Chana Dal Sundal, Green Gram(Whole Moong) Sundal, Kabuli Chana Sundal, Kala Chana Sundal, Mixed Bean Sundal, Moong Dal Sundal, Peanut Sundal with raw mango, Rajma Sundal, Sweet Corn Sundal, , ----- Low-fat|Healthy Snacks -----, Chatpat Masala Kaju, Dhokla, Idli Fries-Oven roasted, Karam Borugulu, Low fat Masala Peanuts using MW, Moong Dal Corn Dhokla, Sago Chiwda, Spicy Oven roasted Chickpeas, Spicy Phool Makhana, , ----- Chakli/Murukku/Mixture -----, Avarekalu(Flat beans) Mixture, Baked Nippattu, Butter(Benne) Murukku, Chakli | Murukku, Chekkalu/Nippat/Thattai, Garlic Karasev/Lahsun Sev, Kaaram Gavvalu(spicy rice flour snack), Karasev(Spicy Sev), Mullu Murukku/Manugupoolu, Oma Podi/Plain Sev, Palakayalu(Rice flour Rolls), Poha Chiwda, Plain Easy Ribbon Murukku, Spicy Diamond Cuts(Shankarpali), Spicy Ribbon Pakoda, Sago Murukku, Spicy Palakayalu, Thenkuzhal|Thengolu, , ----- Mini Meal Snacks -----, Baked Beans Wrap, Bun Nippat Masala, Cabbage Muthia, Chilli Parotta, Dhokla, Eggless French Toast/Bread Besan Toast, Grilled Spinach and Corn Sandwich, Masala Cocktail Idlis, Masala Idli Fries With Idli Podi, Masala Pav(Mumbai style), Mooli Muthia/ Steamed Mooli Dumplings, Mumbai Vegetable Sandwich, Misal Pav, Nippat Masala, Sabudana(Sago) Cutlets, Stuffed Capsicum with Lentil filling, Tadka Bread snack, Tawa Idli, Tricolor Cocktail Idlis, , , -Breakfast | Tiffin -, , ----OUR COMMUNITY SPECIALS----, Atukula Dosa, Bilavalige(Riceflour Chapati)& Pitikipappu, Billa kudumulu/Rice rava tikkis, Ottu Shavige(Homemade Rice Sevai), Toordal-Ricerava Tikki, Kayi Biyyam Uppindi/Rice-Coconut Upma, Mosaru Kodubale/Curd Kodubale, Mysore Masala chapati, Uttha Rotti with Avarekaalu Usli, Vadappam(Riceflour Puri)&Chintaku Palya, , ----Side dish for IDLI/DOSA----, Onion-Tomato Gotsu with Moong dal, Vegetable Stew for Appam(Kerala style), , ----IDLI----, Kanchi Idli, Idli using Idli Rava, Idli Using Idli Rice(step by step), Instant Oats Idli, Khara Eerulli Idli/Onion Idli, Khotto(jackfruit leaves Idlis), Mallige Idli, Masala Idli Fries, Moong Dal Corn Dhokla, Rava Idli&Potato Saagu, Sago(Sabudana) Idli, Stuffed Idli with Potato stuffing, Tricolor Cocktail Idlis, Undrallu, Vegetable Idli, , ----DOSA----, Adai Dosa, Atukula Dosa, Appam without Yeast, Brown Rice Dosa, Bread Uthappam with Spring Onions, Chettinadu Cauliflower Masala Dosa, Davanagere Benne Dosa, Dibba Rotti/Dosa with Idli batter, Drumstick leaves Adai, Erra Kaaram Dosa, Five taste Uthappam, Green Moong Adai, Jini Dosa-Mumbai style, Kharada Eerulli Dosa, Masala Uthappam, Mixed sprouts Adai, MLA Pesarattu....Upma Pesarattu, Moong Dal Cheela, Multigrain Dosa, Mumbai style Mysore Masala Dosa, Mysore Masala Dosa, Oats Dosa-Instant version, Oats Uthappam, Paper dosa n Bombai chutney, Pav Bhaji Dosa, Plain Dosa, Rava Dosa, Schezwan Dosa(Mumbai style), Spring Dosa(Mumbai style), Toor dal Dosa, Tomato Dosa using Dosa Batter, Vegetable dosa, Wheatflour Dosa-Instant version, , ----Pancakes/Waffles----, Eggless Wholewheat Banana Pancakes, , ----UPMA----, Atukula \nupma/Poha-1, Avarekalu Akkitari upma, Batata Poha, Coconut Poha..Kobbari Atukulu/Poha-2, Gojju Avalakki/Poha-3, Kothimeera Atukulu/Poha-4, Godhuma Rava Upma, Idli Upma, Kayi Biyyam Uppindi/Rice-Coconut Upma, Khara Bath, Lapsi Rava Vegetable Masala Pulao, Little Millet(Samai) Upma, Multigrain Sprouts Upma, Murmur upma/Borugula Upma, Sooji Upma/Rawa Upma/Uppittu, Masala upma, Oats Kharabath, Pulusu Upma/Tamarind Upma, Ragi Rava Upma, Rava Pulihora, Rava Vangibath, Sabudana Khichdi, Sabudhana\nupma, Semiya Pulihora, Soya-Aval Biriyani, Vangi(Eggplant) Poha, Vermicelli/Semiya Upma, , ----ROTTI----, Akki Rotti, Bilavalige(Riceflour Chapati)& Pitikipappu, Kharada Bele Holige(Spicy Dal Poli), Pongal Rotti with left over pongal, Ragi Rotti, Masala Jolada/Jowar Rotti, Masala Sajja Rotti, Mysore Masala chapati, Pallem Obbattu/Spicy Alu Holige, Sabudana Thalipeeth, Sajja Rottelu/Bajra Rotis, Teepi Sajja Rottelu/Sweet Sajja Roti, Thalipeeth, Uttha(Plain)Rotti with Avarekaalu Usli, , ----SHALLOW|DEEP FRIED----, Atukula Gunta Ponganalu/Avalakki Paddu, Gunta Ponganalu/Appey/Paniyaram, Instant Oats Paniyaram(Paddu), Instant Sooji Appey/Rava Paniyaram, Masala Poori/Spicy Puri, Matar Kachori & Alu Sabzi, Methi Poori and Potato Masala, Medu Wada/Uddina Vade, Mosaru Kodubale/Curd Kodubale, Palak Puri, Poori with Veg Saagu, Vadapam(Riceflour Puri)&Chintaku Palya, , ----SHAVIGE/Sevai----, Coconut Shavige, Lemon Sevai/Khara Shavige, Ottu Shavige(Homemade Rice Sevai), Tangy Tamarind Shavige, Tomato Sevai/Tomato Idiyappam, , ----SANDWICHES----, Bhurji Pav, Bombay Masala Toast Sandwich, Cucumber Sandwich, Grilled Spinach and Corn Sandwich, Mumbai Vegetable Sandwich, , --SNACKcumBREAKFAST--, Bhurji Pav, Bombay Masala Toast Sandwich, Chilli Parotta, Grilled Spinach and Corn Sandwich, Idli Upma, Misal Pav, Savory Cornmeal Breakfast Muffins, Savory Semolina Bread, Tadka Bread snack, Upma Kozhukattai, Iyengar Bakery Vegetable Toast, , ----BATH|BHAT----, Bisi Bele Bath/Bisi Bele Huli Anna, , --- PONGAL|PORRIDGE ---, Breakfast Oats Porrdige, Mango Smoothie bowl, Mosaru Avalakki/Dahi Oats, Oats and fruits porridge, Khara Oats Pongal, Oats Bisibelebath, Rava Pongal with Pongal Gojju, Special Khara Pongal, Savory Oats Porridge, Vegetable Dalia, Ven Pongal, , , -Beverages -, Banana Milkshake, Bonda Juice, Butterfruit(Avocado) Milkshake, Sapota(Chikoo) Milkshake, Dates Milkshake, Gajar ki Kanji/Carrot Kanji, Mango Banana Smoothie, Mango Juice, Mango Lassi, Mango Lemonade, Mango Milkshake, Muskmelon Juice, Oats n fruits smoothie, Spiced Buttermilk/Chaas, Strawberry- Banana  Smoothie, Strawberry Lassi, Strawberry Milkshake, Sweet Lassi/Punjab Lassi, Water-melon Cooler, Watermelon Juice, , , -Chutneys | Pacchadis-, , ----Chutneys----, Bombai(Besan) Chutney, Capsicum(Green) Chutney, Carrot Chutney, Coconut Chutney, Fried gram(Putnala Pappu) Chutney, Green Chutney for Chaats, Hotel Style Coconut Chutney, Kothimeera(coriander) chutney, Mango Ginger(Maa Inji)Chutney, Mint-Coriander Chutney, Onion Chutney, Onion chutney with dry coconut, Peanut Chutney, Peanut-Coconut Chutney, Pongal Gojju/Tamarind \nChutney, Raw Onion Chutney/ Ulli Karam, Red Coconut Chutney, Tomato Chutney, Tomato Onion Chutney, Totapuri Mango Chutney, Tomato Cilantro Chutney, , ----Pacchadis----, Ridgegourd Peel pacchadi, Dosakaaya Pacchadi, Coconut Pacchadi for Rice, Dondakaya(Ivy Gourd) Pacchadi, Gongura Pacchadi with Green Chillies, Gongura Pacchadi with Red Chillies, Kalchina Vankaya Pacchadi, Magaya Perugu Pacchadi, Raw Mango-Coconut Pacchadi, Radish Greens(Mullangi Akula)Pacchadi, Noone Gongura, Tomato Kothimeera Pacchadi, , ----Raitas----, Anardana(Pomogrenate) Raita, Onion Tomato Raita, , , -Dips | Sauces | Spreads-, Basil Pesto..home made, Cashew Aioli Dip, Cucumber Mint Yogurt Dip, Guacamole, Hummus, Mango salsa, Meetha(Sweet) Chutney for Chats, Olives-Basil Dip, Schezwan Sauce, Strawberry Jam, Veg Thai Green Curry Paste, , , -Parathas|Roti|Indian Bread -, Aloo Paratha, Bilavalige(Rice flour Chapati), Cabbage Paratha, Chana Dal Paratha, Gobi(Cauliflower) Paratha, Hare Chane ka(Fresh Green Chickpeas) Paratha, Masala Poori/Spicy Puri, Methi Poori, Methi-Aloo ka Paratha, Methi Paratha, Methi Dal Paratha, Mooli paratha, Makki Di Roti/Corn meal Flatbread, Matar Kachori - Delhi style, Methi Thepla, Mysore Masala chapati, Naan...famous Indian flat Bread, Palak Puri, Pallem Obbattu/Spicy Alu Holige, Poori, Paneer-Bhurji paratha, Palak Aloo Paratha, Palak Paneer Paratha, Sajja Rottelu/Bajra Rotis, Tofu-Alu Paratha, , , -Rice | Pulav | Biriyani -, , ----RICE----, Aava Pettina Pulihora | Tamarind Rice, Bisi Bele Bath/Bisi Bele Huli Anna, Carrot Rice, Capsicum Rice/Capsicum Bath, Cranberry Puliyogre, Chintapandu Pulihora, Cilantro Lime Rice, Curd Rice|Mosaranna|Daddojanam, Dabbakaya Pulihora/Indian Grape Fruit Rice, Drumstick leaves(Murungai keerai) Rice, Garlic Rice, Gojju annam(Tamarind Ricee using Sambar Powder), Gongura Pulihora, Lemon Rice / Chitranna, Maavinkaay/Mango Chitranna, Palak Vegetable Khichdi, Raw Mango Rice/Mamidikayi Gojju annam, Masale Bhaat/Ivy Gourd Rice, Methi Peas Bath, Pacchi Chintakaya Pulihora/Raw Tamarind Rice, Pappu Biyyam/Pabbiyyam/Chana dal Rice, Pulagam Pacchadi, Pulihora/Puliyogre, Pulusu Annam/Tamarind Rice with Onions, Sabsige soppu(Dill leaves) Chitranna, Talimpu Annam, Tomato Bath, Usirikaya(Amla) Pulihora, Vangi bath/Eggplant Rice, Varan Bhaat, Ven Pongal, , ----PULAV----, Avarekalu Pulav, Babycorn Pulao, Bagara Rice, Broken Wheat Vegetable Masala Pulao, Capsicum-potato pulav, Chinese Vegetable Fried Rice, Kala Masoor Pulav, Plain Coconut Milk Rice(Pulao), Coconut Vegetable Pulao, Fresh Chickpeas Pulao, Jeera Rice..traditional way, Jeera Rice..with a twist, Methi Pulao, Mint Pulav/Pudina Rice, Mixed Vegetable Pulav, Palak(Spinach) rice, Paneer Pulao, Peas Pulav, Pulusu Biyyam/Roasted Tamarind Rice, Rajma Chawal, Saffron Rice, Sambar Sadam, Schezwan Veg Fried Rice, Soya Chunks Pulao, Spicy Corn Pulav, Spicy Thai Basil Fried Rice, Sprouts Fried Rice, Tawa Pulav..Mumbai style, Vegetable Fried Rice - Indian Style, , ----BIRIYANI----, Baby Potato Biriyani, Chole Dum Biryani, Kathal(Raw Jackfruit) Dum Biryani, Mushroom Biryani, Soya-Aval Biriyani, Soya Chunks Biryani, Veg Dum Biryani using ready paste, , ----MUDDE----, Ragi Mudde, , , -North Indian Side Dishes-, , ----DRY CURRIES----, Achari Baingan, Achari Gobi, Ajwaini Aloo Gobi with Mustard flavour, Aloo Baingan-dry version, Aloo Broccoli Sabzi, Aloo Gobi dry curry, Aloo Gobi Matar, Aloo Stuffed Chillies/Bharwa Mirch, Arbi ki Bhujia, Avarekaalu Benne Usli, Babycorn Bellpepper Dry curry, Baingan Bharta, Bharwa Karela/Stuffed Karela with Besan, Bhindi Sabzi/Okra Curry, Broccoli Stir Fry, Cauliflower curry, Gobi Kasoori, Gobi Mutter/Matar, Green Peas Usli...North Karnataka style, Jeera Aloo/Alu jeera, Kadai Paneer, Kaddu ki Sabzi/Pumpkin Curry, Lal Bhaji(Red amaranth)Saag, Methi Bhaji(Stir fry), Minty Potatoes/Pudina Aloo, Paneer Bhurji, Paneer Jalfrezi, Simple Paneer Sabzi, Stuffed Bell Peppers, Tofu Bhurji, Turai(Ridge gourd) sabzi, , ----GRAVIES----, Aloo Choliya/ Potato Chickpeas Gravy, Aloo Palak, Alu Mutter, Alu sabzi for Kachoris/Puris, Babycorn and Capsicum curry, Babycorn Kurma, Baby Potatoes in red coriander sauce, Bagara Baingan, Bharli Vangi(Stuffed Eggplants), Bombai(Besan) Chutney, Cauliflower Kurma in green gravy, Dum Aloo, Dum Aloo Chutney Wale, Grilled Corn Palak Paneer, Green Chickpeas Paneer Gravy, Gongura Soya Chunks Curry, Guava ki Sabzi/Peru Nu Shaak, Kashmiri Dahi Baingan, Kathal Dum Masala, Kele ki Kadhi/Kadhi with Raw Banana, Matar Paneer, Matar Mushroom Masala, Matki Usal/Mothbeans gravy, Methi Corn Malai, Methi Mutter Malai, Mirchi Ka Salan, Mixed Vegetable Kurma, Mixed Vegetable Saagu, Mushroom Chettinad, Palak Mushroom/Palak Khumbh, Palak Paneer, Paneer Butter Masala, Paneer Makhani, Potato/Alu Kurma ~ Andhra style, Potato Masala for Poori, Pudina Fresh Peas Gravy, Pumpkin Curry/Meeti Kaddu, Rajma Palak, Sarson Ka Saag, Shahi Paneer, Soya Chunks-Alu Curry, Stuffed Capsicum...in rich gravy, Subz Makhani/Mixed Veg Makhani, Sweet Pumpkin Curry/Sihi Kumbalakayi Gojju, Vegetable Stew(Kerala style, , ----DALS----, Chilka urad and Chana dal, Dal Fry, Dal Palak/Palak Moong dal, Dal Makhani, Kadai Chholay(Chole), Kala Chana Masala, Kala(Whole) Masoor Dal, Kala Vatana Usal/Black Peas Curry, Lobia/Black eyes Beans Curry, Lauki Chana dal, Palak Dal, Pindi Chole/Rawalpindi Chana, Rajma, Raw Banana Kofta Curry, Varan Recipe(Maharashtrian style Dal), Simple Moong dal, Whole Green Moong dal/Hara Moong dal, , , -South Indian Side Dishes-, , ----STIR FRY/PALYA----, Akakarakaya(kantola) fry, Akakarakaya(Kantola) Kura, Alu fry /Potato fry, Ajwaini Aloo Gobi with Mustard flavor, Aratikaya (Raw Plantain)ava pettina kura, Aratikaya Vepudu/Raw Banana Fry, Aloo Broccoli Sabzi, Aloo Gobi dry curry, Beans  & Carrot Stir - fry(palya), Beans Stir fry(Poriyal), Beetroot Stirfry, Beetroot Spicy Curry, Beetroot Stir fry(Grated version with garlic), Bhindi(Okra) Fry, Bendakaya(Okra) Kura, Bendakaya Tomato Kura, Broad beans Stir fry with Ghati masla, Brinjal-Soya Chunks Curry, Broccoli Stir Fry, Cabbage Carrot Stir fry, Cabbage Stir-fry, Cabbage moong dal dry Curry, Carrot Masala Curry, Cauliflower stir fry, Chamadumpa Roast/Arbi Roast, Choysum Stir fry, Cluster Beans Curry, Dill-Dal Stir fry(Sabsige Soppu Palya), Dill leaves stir fry(Shepuchi bhaji), Dondakaya/Tindora stir fry, Drumstick leaves curry using dal, Kaddu ki Sabzi/Pumpkin Curry, Kakarakaya(Bitter gourd)nuvvu pindi kura, Lal Bhaji(Red amaranth)Saag, Methi Bhaji, Potlakaya(Snake gourd) Kobbari kura, Raw Banana Pepper fry, Red Cabbage Stir fry, Sorakaya Palu Posina Kura(Bottlegourd Curry with Milk), Sorakaya Telagapindi Kura, Spicy Potato Roast, Talimpu Gongura, Thotakura-pesarapappu Podi kura, Thotakura stir fry, Vankaya Podi Kura, Yam(Kandagadda) fry, , ----CURRIES----, Avarekaalu Benne Usli, Avial/Mixed Veg Kerala Curry, Bitter gourd curry, Cauliflower curry, Chikkudukaaya(Broad beans)curry, Dondakay Ullipaya Karam, Drumstick Tomato Curry, Drumstick Masala, Gawar aur Aloo ki Sabzi, Gongura Pulusu Koora, Gongura Soya Chunks Curry, Kakarakaya Ullipaya Karam, Lauki Chana dal curry, Potato/Alu Kurma ~ Andhra style, Pumpkin(Mathanga) Erissery, Raw(Green)Tomato Curry, Stuffed karela(Bitter gourd),Type-1, Stuffed Mirch...Andhra style, Turai(Ridge gourd) sabzi, Vankaya Kobbari Karam | Stuffed Brinjals, Vankaya Kothimeera Karam, Vankaya Ullipaya karam, , ----DALS----, Chilka urad and Chana dal, Dal Fry, Kala(Whole) Masoor Dal, Kala Vatana Usal/Black Peas Curry, Matki Usal/Mothbeans gravy, Raw Mango Dal..Completely Andhra style, Mango-Brinjal Dal, Masoor Dal with garlic, Menthi Kura Pappu, Moong dal/ Pesara Kattu, Methi dal, Palak dal, Pithikipappu/Mochai Beans Dal, Ridgegourd Dal/Beerakaya Pappu, Tomato Pappu..Andhra style, Whole Green Moong dal/Pesalutho pappu, , ----Sambar/Stew----, Aratikaya Pacchi Pulusu/Raw Banana Stew, Avarakkai(Broadbeans) Sambar, Beans Sambar with Coconut, Brinjal(Vankaya)Sambar, Drumstick kootu, Kandiunta Majjiga Pulusu, Keerai Molagootal Palakkad style, Mukkala Pulusu/Dappalam, Mullangi/Radish Sambar..with fresh masala, Pumpkin Stew/Pulusu, Red Pumpkin Sambar, Thotakura Kadala(Amaranth stems)Pulusu, Udupi Sambar/Mixed Veg Sambar, , ----RASAM----, Brahmi Tambuli, Chickpeas Rasam/Senagala Kattu, Dill flavored Dal Rasam, Drumstick Rasam, Holige Saaru/Special Toor dal Rasam, Lemon Rasam, Mint Rasam, Pacchi Pulusu/Raw Onion Rasam, Pepper Rasam, Pineapple Rasam, Raw Mango(Maavinkay) Rasam, Togarikaalu(Fresh Pigeon Peas) Rasam, Tomato Rasam, Tomato Dal Rasam | Pappu Chaaru, , , -Powders | Masalas-, , ----Podis for Rice/Idli/Dosa----, Bittergourd Podi, Chintaku(Tamarind leaves) Podi, Flax Seeds Powder, Garlic Podi, Idli Podi/Milagai Podi, Idli podi with whole black lentils, Idli Karapodi, Kandi Podi(Andhra Gun Powder), Karivepaku(Curry leaves) Podi, Kobbari Kaaram, Nalla Karapodi/Andhra Nalla Karam, Pappula Podi/Putnala Podi, Peanut Podi/Palli Podi, , ----Masalas----, Bisi Bele Bath Masala Powder, Garlic Chili Powder, Garam Masala Powder, Kobbari Kaaram, Kurala Podi, Maharastrian Ghati Masala, Rasam powder, Sambar Powder(Andhra style), Sambar Powder(Karnataka style), Vangibath powder, , , -Pickles | Papads-, , ----Pickles----, Andhra Mukkala Pacchadi, Avakaya/Andhra Mango Pickle, Allam Avakaya, Aam Ka Achar-NorthIndian Style, Bellam Avakaya/Sweet Mango Pickle, Gongura Pickle, Lemon Pickle, Maagaya, Mango Pickle-Karnataka style, Mango Ginger Chutney, Mango Ginger Pickle, Mixed Veg Pickle-North Indian Style, Preserved Gooseberry Chutney, Spicy Mixed Veg Pickle, North Indian Green Chilli Achaar, No Oil Mango Pickle, Nuvvu Avakay, Palli Avakay, Pandu mirchi Pacchadi, Pesara Avakay, Pulihora Gongura Pickle, Sun-dried Tomato Pickle, Sweet & Spicy Mango Thokku, Tomato Pickle - Andhra style, Usiri(Amla) Avakaya, , ----Sundried items----, Candied Amla, Challa Mirapakayalu, Minapa Vadiyalu, , , -Soups | Salads -, , ----SOUPS----, Baby corn Capsicum Soup, Broccoli Soup, Creamy Cauliflower Soup, Pumpkin n Carrot Soup, Spinach and Orange Soup, Tomato Soup, , ----SALADS----, Arugula Salad, Chickpeas Salad, Cous Cous Salad, Fattoush..a Lebanese salad, Fruit Salad(Chaat), Kosambari, Moong Sprouts Salad, Pasta Salad, Red Pumpkin Yogurt Salad, Sprouts Salad....Chaat style, Steamed Baby Corn Mango Salad, Tabbouleh, Tomato and Lettuce Salad, Wheat and Jowargrains Salad, , , -Chaats | Indian Street Food  -, Green Chutney for Chaats, Meetha(Sweet) Chutney for Chats, Aloo Chana Chaat, Babycorn Masala, Bangarpet style Pani Puri, Bhel Puri, Bhel Poori..Sookha waala, Bun Nippat Masala, Canape Sev Puri, Corn(Bhutta) Bhel, Dahi Bhalla, Dahi Idli, Dahi Papdi Chaat, Dahi Puri, Fruit Salad(Chaat), Golgappa /Pani puri, Green Chutney for Chaats, Masala Pav(Mumbai style), Misal Pav, Nippat Masala, PavBhaji..Mumbai style, Ragda Pani Puri-Mumbai Style, Ragda Patties, Sev Puri, Tikki Puri, , , -Indian Sweets-, , ----Festival Sweets----, Bellam Kudumulu, Bobbatlu, Boorelu/Suzhiyan, Chakkara Rekulu/Crispy Sugar Poli, Fried Coconut Modak, Garugu Obattu/Hollige, Haalu Holige/Paala Puri, Hoornada Hollige / Pappu Obattu, Karida Bele Kadubu/Fried Modak, Kayi Holige/Coconut Poli, Kudumulu/Modak, Pesarapappu Boorelu, Puran Poli, Sajjappa/ Halwa Puri, Sogasu Poli(Obbattu), Til Poli/Nuvvula Bobbatlu, Undrallu Payasam/Paal Kozhukattai, , ----Kheer/Payasam/Kesari----, Aamras, Aval Payasam/Poha Kheer, Carrot Kheer, Hayagreeva(chanadal sweet), Korra biyyam Payasam, Mango Sheera(Sooji Halwa), Moong Dal Payasam, Moong Dal Kheer, Paal Payasam with Rice and Chana dal, Paal Payasam/Milk Pudding, Palada, Palathalikalu Payasam, Pappulo Undrallu, Pasta Payasam, Phool Makana Kheer, Pineapple Kesari / Pineapple sheera, Rasayana(Banana), Sabudhana Kheer, Semiya Kheer, Semiya Kesari, Sooji Ki Kheer, Thati Nungu(Tadgola) Kheer, Undrallu Payasam/Paal Kozhukattai, , ----Burfi/Ladoo/Peda----, 7 cups Burfi, Atta Ladoo/Wheat flour Ladoo, Aval Laddu(Poha Ladoo), Chocolate Modak Peda, Coconut Choco Truffles, Coconut Ladoo using Condensed Milk, Dry Fruit Burfi/Anjeer Burfi, Dry Fruit(Khajur) Modak, Kopra Pak /Coconut Burfi, Mawa Modak / Khoya Modak, Maida Burfi, Minapa Sunni Undalu/Urad Dal Laddu, Moongdal Ladoo/Pesara Sunnunda, Oats-Dry fruits Ladoo, Panasa Thonalu(Sampangi Poovulu), Paneer Modak Peda, Til ka Ladoo/Nuvvula Undalu, , ----Diwali(Traditional) sweets----, Ariselu/Adhirasam, Aval Laddu(Poha Ladoo), Chocolate Modak Peda, Karjikai/Karanji/Kadubu, Kobbari Boorelu(Vadalu), Kobbari Louz/Coconut Ladoo, Kopra Pak /Coconut Burfi, Maida Burfi, Madatha(Kakinada) Kaja, Mawa Modak / Khoya Modak, Panasa Thonalu(Sampangi Poovulu), Paneer Modak Peda, Rasgulla/Rosogulla, Rasmalai, Sweet Diamond Cuts/Maida Biscuits, Til ka Ladoo/Nuvvula Undalu, , ----Halwa/Puddings----, Aamras, Basundi, Carrot Beetroot Halwa, Carrot Phirni, Lauki ka Halwa, Mango Burfi/Mango Fudge, Mango Mastani, Mango Pannacotta(Layered version), Mango Phirni, Mango Sago Pudding, Mango Shrikand|Amrakhand, Milk Powder Gulab Jamun, Mixed Fruit Salad with Custard, Orange Basundi, Shahi Tukra, Sooji Halwa/Rava Sheera, , , -Diwali Sweets/Savouries-, , ----Diwali Sweets----, Ariselu/Adhirasam, Dry Fruit Burfi/Anjeer Burfi, Karjikai/Karanji/Kadubu, Kobbari Boorelu(Vadalu), Kobbari Louz/Coconut Ladoo, Kopra Pak /Coconut Burfi, Madatha(Kakinada) Kaja, Moongdal Ladoo/Pesara Sunnunda, 7 cups Burfi, Coconut Choco Truffles, Dry Fruit(Khajur) Ladoo, Maramarala(Puffed Rice) Ladoo, Minapa Sunni Undalu/Urad Dal Laddu, Oats-Dry fruits Ladoo, PaneerPeda, Rasgulla/Rosogulla, Rasmalai, Sweet Diamond Cuts/Maida Biscuits, , ----Diwali Savories----, Avarekalu(Flat beans) Mixture, Butter(Benne Muruku), Chakli | Murukku, Chekkalu/Nippat/Thattai, Corn flakes Mixture/Chiwda, Garlic Karasev/Lahsun Sev, Kaaram Gavvalu(spicy rice flour snack), Karasev(Spicy Sev), Kodubale(Spicy Riceflour Rings), Low fat Masala Peanuts using MW, Mathri, Mullu Murukku/Manugupoolu, Nippattu(Spicy Rice flour Discs), Oma Podi/Plain Sev, Palakayalu(Rice flour Rolls), Perugu Jantikalu/Pulla Murukku, Poha Chiwda, Plain Easy Ribbon Murukku, Ribbon Pakoda, Sago Murukku, Spicy Diamond Cuts(Shankarpali), Spicy Palakayalu, Thenkuzhal|Thengolu, , , -Puddings | Frozen Desserts-, , ----Desserts/Puddings----, Basundi, Eggless Biscuit Pudding, Eggless Chocolate Pudding(Custard), Fruit Trifle/ Trifle Pudding, Lychee Custard, Mango Falooda, Mango Fudge, Mango Mastani, Mango Pannacotta(Layered version), Mixed Fruit Salad with Custard, Orange Basundi, Orange Jelly using fresh Oranges, Rasgulla/Rosogulla, Rasmalai, Shahi Tukra, Shrikarani..a Mango delight, Tender Coconut Pudding, Thai Mango Pudding using Coconut Milk, Thati Nungu(Tadgola) Kheer, Vanilla Pannacotta, , ----Kulfi/Ice-Creams----, Gulkand Ice cream, Mango Ice cream, Mango Kulfi, No Churn Eggless Mango Ice cream, Strawberry Frozen Yogurt, Vanilla Icecream(Eggless), , , - Pasta | Pizza | Noodles  -, , ----PASTA----, Basil Pesto with Spiral Pasta, Macaroni with roasted veggies & white sauce, Masala Pasta-Indian Style, Roasted Bell Pepper Pasta, Spinach Pesto Penne Pasta, Sundried Tomato Pesto Pasta, , ----PIZZA----, Thin Crust Pesto Pizza, , ----NOODLES----, Chinese Veg Hakka Noodles, , , -Cakes | Muffins | COOKIES -, , ----CAKES/MUFFINS----, Banana Bread, Biscuit Cake (Parle-G Bicuit Cake), Classic Carrot Cake, Cocoa Brownies delights, Chocolate Brownies, Chocolate Cake with Ganache, Chocolate Cupcakes with frosting, Checkered Cake, Christmas Fruit Cake|Plum Cake, Cranberry Cupcakes(Muffins), Danish Apple Cake, Dorie's Vanilla Cake with Blueberry filling, Eggless Banana Bread, Eggless Chocolate Banana Bread, Eggless Apple Streusel Muffins, Eggless Chocolate Cake, Eggless Dates Cake, Eggless Marble Cake, Mango Semolina Cake-Eggless, Eggless Sponge Cake with Strawberry Icing, Eggless Orange Flavored Sponge Cake, Eggless Tutti Frutti Cake, Eggless Vanilla Sponge Cake, Eggless Whole Wheat Banana Muffins with oats and flax seeds, Eggless Wholewheat Banana Muffins, Eggless wholewheat Chocolate Cake, Eggless Cocoa Walnut Brownies, Eggless 2 mins Microwave Mug Brownie, Mango Pound Cake, Pineapple Upside Down Cake, Vanilla cupcakes with Butter-cream frosting, White Chocolate sponge Cake/cupcakes, Zebra Cake with Zebra Fondant Icing, , ----COOKIES/CRACKERS----, Chocolate Chip Cookies-Eggless, Coconut Cookies, Multigrain Crackers, Nutella Cookies, Peanut Butter Cookies-Eggless, Ragi Cookies-Eggless, Tutti Frutti Cookies-Eggless, Wholewheat Coconut Cookies- Eggless, , , - Bakes | Breads -, Chewy Granola Bars, Khara Bread with Dill flavor, Khara Buns/Savory Buns, Savory Cornmeal Breakfast Muffins, Savory Semolina Bread, Vegetable Puffs, Whole Wheat Garlic and Herb Rolls, , , - International Menu -, , ----Italian----, Veg Burmese Khow Suey, , ----Italian----, Arugula Salad, Basil Pesto..home made, Basil Pesto with Spiral Pasta, Canapes with Corn filling, Cashew Aioli Dip, Creamy Avocado PAsta, Cucumber Mint Yogurt Dip, Eggplant Pasta, Garlic Bread Exotica, Macaroni with roasted veggies & white sauce, Olives-Basil Dip, Pasta Salad, Spinach Pesto Penne Pasta, Sundried Tomato Pesto Pasta, Thin Crust Pesto Pizza, Tomato and Lettuce Salad, Vanilla Pannacotta, Zucchini Patties, , ----Indo-Chinese----, Chilli Paneer Dry, Chilli Tofu, Chinese Vegetable Fried Rice, Chinese Veg Hakka Noodles, Schezwan Sauce, Schezwan Veg Fried Rice, Schezwan Vegetable Noodles, Sprouts Fried Rice, , ----Mediterranean----, Cous Cous Salad, Fattoush..a Lebanese salad, Pita chips with Hummus, Tabbouleh, , ----Mexican----, Cilantro Lime Rice, Guacamole, Indo-mexican Lunch, Mango salsa, Stuffed Bell Peppers, , ----Thai----, Spicy Thai Basil Fried Rice, Thai Veg Green Curry, , , -Full Meals  -, UGADI Festival THALI, Indo-mexican Lunch, , , -Millet Recipes -, Korra biyyam Payasam, Little Millet(Samai) Upma, Ragi Rava Upma, , , -DIY - Basic Recipes -, Cumin Powder, Green Chili Paste, Garlic Chili Powder, Garam masala powder, Ginger Garlic Paste, Green Chutney for Chaats, Home made Rice flour, Moong Bean Sprouts, Paneer|Cottage Cheese, , , , , , , , , , , Recipe Categories, , , , , Appetizers|Starters, , (30), , , , Baking, , (37), , , , Breakfast, , (152), , , , Cakes|Brownies, , (26), , , , Chaats, , (24), , , , Chutneys|Pacchadis, , (40), , , , Curry|Sabzi, , (89), , , , Dals|Lentils, , (31), , , , Dessert Recipes, , (35), , , , Desserts|Puddings, , (21), , , , Dips and Sauces, , (9), , , , Eggless Cakes, , (13), , , , Eggless Puddings, , (12), , , , Ice-Cream and Froyos, , (6), , , , Idli|Dosa Varieties, , (50), , , , Indian Street Food, , (16), , , , Juices|Smoothies, , (20), , , , Kids Corner, , (55), , , , Left Over Wonders, , (18), , , , Muffins|Cupcakes, , (8), , , , Mumbai Street Food, , (25), , , , Oats Recipes-Indian, , (13), , , , Pacchadis|Thogayals, , (19), , , , Paneer Recipes, , (14), , , , Pasta|Noodles, , (13), , , , Pickles, , (27), , , , Podi|Masalas, , (24), , , , Rice|Pulav|Biriyanis, , (65), , , , Roti|Paratha|Naan, , (23), , , , Salad Recipes, , (11), , , , Sambar|Rasam, , (27), , , , Side Dish for Idli/Dosa, , (26), , , , Side dish for Rotis, , (102), , , , Soups|Salads, , (20), , , , Stir-fry|Palya, , (40), , , , Sweets Varieties, , (89), , , , Tea Time Snacks, , (121), , , , Upma Varieties, , (18), , , , , , , , , , , , , , , , , , , , , , , , , Blog Archive, , , , , , , , ►, , , 2018, , (7), , , , , ►, , , February, , (3), , , , , , , ►, , , January, , (4), , , , , , , , , ►, , , 2017, , (78), , , , , ►, , , December, , (4), , , , , , , ►, , , November, , (3), , , , , , , ►, , , October, , (4), , , , , , , ►, , , September, , (4), , , , , , , ►, , , August, , (7), , , , , , , ►, , , July, , (8), , , , , , , ►, , , June, , (8), , , , , , , ►, , , May, , (8), , , , , , , ►, , , April, , (5), , , , , , , ►, , , March, , (8), , , , , , , ►, , , February, , (8), , , , , , , ►, , , January, , (11), , , , , , , , , ►, , , 2016, , (63), , , , , ►, , , December, , (13), , , , , , , ►, , , November, , (13), , , , , , , ►, , , October, , (14), , , , , , , ►, , , September, , (11), , , , , , , ►, , , August, , (4), , , , , , , ►, , , April, , (1), , , , , , , ►, , , March, , (1), , , , , , , ►, , , February, , (3), , , , , , , ►, , , January, , (3), , , , , , , , , ►, , , 2015, , (52), , , , , ►, , , December, , (4), , , , , , , ►, , , November, , (10), , , , , , , ►, , , October, , (9), , , , , , , ►, , , September, , (6), , , , , , , ►, , , August, , (4), , , , , , , ►, , , July, , (3), , , , , , , ►, , , June, , (3), , , , , , , ►, , , March, , (6), , , , , , , ►, , , February, , (3), , , , , , , ►, , , January, , (4), , , , , , , , , ▼, , , 2014, , (54), , , , , ▼, , , December, , (5), , , Udupi Sambar | Mixed Vegetable Sambar | Karnataka ..., , Parle G Biscuit Cake in Microwave | Microwave Bisc..., , Bombay Chutney | Besan Chutney Recipe | Side dish ..., , Pappula Podi | Putnalu Podi | Pappindi | Fried Gra..., , Pulusu Upma | Tamarind Upma | Pulusu Pindi, , , , , , , , ►, , , November, , (3), , , , , , , ►, , , October, , (4), , , , , , , ►, , , September, , (8), , , , , , , ►, , , August, , (6), , , , , , , ►, , , July, , (4), , , , , , , ►, , , June, , (4), , , , , , , ►, , , May, , (4), , , , , , , ►, , , April, , (4), , , , , , , ►, , , March, , (5), , , , , , , ►, , , February, , (3), , , , , , , ►, , , January, , (4), , , , , , , , , ►, , , 2013, , (184), , , , , ►, , , December, , (5), , , , , , , ►, , , November, , (10), , , , , , , ►, , , October, , (22), , , , , , , ►, , , September, , (17), , , , , , , ►, , , August, , (22), , , , , , , ►, , , July, , (19), , , , , , , ►, , , June, , (18), , , , , , , ►, , , May, , (13), , , , , , , ►, , , April, , (13), , , , , , , ►, , , March, , (19), , , , , , , ►, , , February, , (14), , , , , , , ►, , , January, , (12), , , , , , , , , ►, , , 2012, , (152), , , , , ►, , , December, , (14), , , , , , , ►, , , November, , (16), , , , , , , ►, , , October, , (23), , , , , , , ►, , , September, , (14), , , , , , , ►, , , August, , (14), , , , , , , ►, , , July, , (12), , , , , , , ►, , , June, , (13), , , , , , , ►, , , May, , (13), , , , , , , ►, , , April, , (11), , , , , , , ►, , , March, , (9), , , , , , , ►, , , February, , (5), , , , , , , ►, , , January, , (8), , , , , , , , , ►, , , 2011, , (102), , , , , ►, , , December, , (9), , , , , , , ►, , , November, , (10), , , , , , , ►, , , October, , (9), , , , , , , ►, , , September, , (8), , , , , , , ►, , , August, , (8), , , , , , , ►, , , July, , (9), , , , , , , ►, , , June, , (8), , , , , , , ►, , , May, , (7), , , , , , , ►, , , April, , (8), , , , , , , ►, , , March, , (9), , , , , , , ►, , , February, , (8), , , , , , , ►, , , January, , (9), , , , , , , , , ►, , , 2010, , (56), , , , , ►, , , December, , (4), , , , , , , ►, , , November, , (7), , , , , , , ►, , , October, , (6), , , , , , , ►, , , September, , (2), , , , , , , ►, , , August, , (8), , , , , , , ►, , , July, , (5), , , , , , , ►, , , June, , (3), , , , , , , ►, , , April, , (1), , , , , , , ►, , , March, , (3), , , , , , , ►, , , February, , (7), , , , , , , ►, , , January, , (10), , , , , , , , , ►, , , 2009, , (120), , , , , ►, , , December, , (7), , , , , , , ►, , , November, , (6), , , , , , , ►, , , October, , (8), , , , , , , ►, , , September, , (5), , , , , , , ►, , , August, , (4), , , , , , , ►, , , July, , (8), , , , , , , ►, , , June, , (13), , , , , , , ►, , , May, , (14), , , , , , , ►, , , April, , (14), , , , , , , ►, , , March, , (27), , , , , , , ►, , , February, , (14), , , , , , , , , , , , , , , , , , , , , ALL IMAGES AND RECIPES COPYRIGHT © THE CHEF AND HER KITCHEN.PLEASE DO NOT COPY,ASK FIRST, , , , , , , , , , Minibox 3 Column Blogger Template, by, James William, at, 2600 Degrees, , , , , , , , ,",
        "Vermicelli Upma": "Ingredients: Semiya Payasam, (sweet vermicelli milk pudding), , Meethi Seviyan, (no milk vermicelli pudding) and, Sheer Khurma, (dates vermicelli dessert)., , How to choose Vermicelli, , You may be surprised to see the Asian grocery stores sell numerous kinds of vermicelli made with different grains. Indian stores usually have rice, wheat, ragi and other kinds of millet semiya. You will look for thick wheat vermicelli, preferably from an Indian brand., , Vermicelli from other Asian countries may not be suitable to make this dish. I use the Bambino or MTR vermicelli as the results are consistent with these brands. Indian wheat semiya is available in roasted and unroasted varieties., , The unroasted kind requires roasting them prior to cooking. To save roasting time you may buy roasted vermicelli and skip the roasting part mentioned in the recipe. However the flavor of pre-roasted semiya is nutty and is completely different., , It is very important to use the right amount of water to avoid a mushy semiya upma. Using the right amount of liquid makes it fluffy, non-sticky and beautiful., , For a quick 25 mins meal, make this dish without any veggies or use frozen veggies as chopping fresh vegetables takes some time. On occasions we have the vegetable semiya upma for a dinner with a spicy seasoned yogurt which I have shared below., , Vegetables like carrots, peas and young green beans go well in this. My mom would usually add a parboiled potato to this. But do not add the raw potato as it takes time to cook., , More breakfast recipes, Soft Idli, Crispy Dosa, Masala dosa, Puffed Poori, , , , , Photo Guide, , How to make Semiya Upma (Stepwise Photos), , Roasting vermicelli & peanuts, , 1. Skip this step if using roasted semiya. Dry roast 1 cup vermicelli (110 grams) on a low to medium flame stirring often until light & slightly golden. Do not brown the vermicelli as the flavor alters. Transfer this to a plate., , , , 2. Pour ½ tablespoon oil to a hot pan. Add 2 to 3 tablespoons peanuts. On a medium heat, roast them until golden and crunchy. Remove to a plate and set aside for garnishing., , , , Tempering, , 3. Pour 1 tablespoon oil to the hot pan or pot. Add, , , ½ teaspoon cumin seeds (jeera), , ¼ teaspoon mustard seeds, , 1 teaspoon chana dal (skinned bengal gram), , 1 teaspoon urad dal (skinned, split black dal), , , , , , , , 5. Then add 1 sprig curry leaves, 1 slit or chopped green chilies and 3 to 4 tbsps chopped onions. (1 small onion), , , , 6. Saute until the onions turn golden or transparent. The add a pinch of hing and 1 teaspoon fine chopped ginger. Saute for 30 to 60 seconds until the ginger turns aromatic., , , , 7. Pour 1½ cups water and add ½ teaspoon salt. Start with 1/3 teaspoon and add more if required. Stir very well and taste test the water after which you can adjust the salt and spice (green chili). The water has to be slightly salty., , Tip: If using thin vermicelli 1 ¼ cup water would be sufficient., , , , 8. Bring the water to a rapid boil on a high heat. Then add all of the vermicelli at one time. I have used store bought roasted vermicelli here., , , , 9. Mix very well. Cook uncovered on a medium heat until the water is completely absorbed and the semiya is cooked through., , , , 10. Cover and turn off the heat. Keep the pot covered for at least 5 to 6 minutes. This step is important and makes your semiya upma fluffy. Sprinkle some coriander leaves and fresh grated coconut if you want., , , , Troubleshooting, , I do not add any extra water. But if your semiya is undercooked, bring 1/4 cup water to a rolling boil in a small pan and sprinkle little by little water and cook. The quantity of water I have mentioned works well with both MTR and Bambino., , , , Garnish semiya upma with roasted peanuts. Squeeze some lemon juice if you like and serve with peanut podi., , , , , Photo Guide, , How To Make Vermicelli Upma With Vegetables, , 1. Roast the vermicelli if required. Set aside. For this recipe you will require 110 grams. Pour half tablespoon oil to a pan and roast the peanuts on a medium heat until golden and crunchy. Remove to a plate and set aside for garnish., , 3. To the same pan, pour 1 tablespoon oil and add –, , , ½ teaspoon cumin seeds, , ¼ teaspoon mustard seeds, , 1 teaspoon urad dal, , 1 teaspoon chana dal, , , , , 4. Fry until the dal turns lightly golden. Add –, , , 1 pinch hing, , 1 sprig curry leaves, , ½ teaspoon chopped ginger(optional), , 1 chopped green chili., , , , , 5. Add 1 small sliced onion and saute until transparent., Optional, – You can also skip the vegetables. Add ¾ cup mixed vegetables – carrots, peas and  french beans. Ensure the veggies are fine chopped otherwise they won’t cook fast. I sprinkle little salt so the veggies release moisture and cook easily., , , , 6. Cover and cook on a low flame till they turn tender and almost cooked. If they don’t cook well, then sprinkle little water and cook., , , , 7. Add salt and pour 1½ cups water. Stir and taste test the water. It has to be slightly salty. If using thin vermicelli 1 ¼ cup water would be sufficient., , , , 8. Bring it to a rolling boil on a high flame., , , , 9. Add the roasted vermicelli. Stir well to prevent lumps., , , , 10. Cook on a medium high flame till all the water is absorbed. By then the semiya should be cooked well. (Troubleshooting tip: If the semiya does not cook well then boil little hot water and pour it here. Read tips below.), , , , 11. Cover and cook on a low flame for 2 to 3 minutes. Turn off and rest for 5 minutes., , , , When the temperature comes down a bit, sprinkle lemon juice and add coriander leaves. Mix and garnish with roasted peanuts or cashews. Serve it hot with, peanut podi, ., , , , This is the semiya upma I made without veggies. It turns out good even without veggies., , Pro Tips, , 1. There are 2 kinds of semiya in the market – roasted & unroasted. If using preroasted vermicelli, you don’t need to roast them again. Otherwise you have to roast them following my step 1 otherwise the dish will turn mushy and sticky., , 2. The quantity of water to use differs for thick and thin variety vermicelli.  I use the thicker bambino semiya which takes 1½ cups water for every cup of semiya. If using thin semiya then it would only need 1¼ cups., , 3. Semiya upma is always made with wheat vermicelli and not with rice vermicelli. If using rice vermicelli, ▢, 1, , cup, , semiya, , (110 grams vermicelli), ▢, 1½, , cups, , water, , for thick semiya (1 cup for thin variety,1¼ cup for instant pot), ▢, ½, , teaspoon, , salt, , (adjust to taste), ▢, 1, , small, , onion, , (3 to 4 tbsps, thinly sliced or chopped), ▢, 1, , green chili, , slit or chopped, ▢, 1, , sprig, , curry leaves, ▢, ½, , teaspoon, , ginger, , chopped finely, ▢, 1½, , tablespoon, , oil, , or ghee, ▢, ¼, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , cumin seeds, ▢, 1, , teaspoon, , channa dal, , (split bengal gram) (optional), ▢, 1, , teaspoon, , urad dal, , (skinned black gram) (optional), ▢, 1, , pinch, , asafoetida, , (hing) (optional), ▢, 2 to 3, , tablespoon, , peanuts or cashews, , (or both), ▢, 1, , tablespoon, , lemon juice, , (to serve, optional), ▢, ¾, , cup, , mix vegetables, , carrot, peas, green beans – fine chopped, ▢, 2, , tablespoon, , coriander leaves, , chopped, ▢, 2, , tablespoon, , fresh grated coconut, , for garnish,  Instructions: , , Related Recipes, , Upma Recipe, , , Oats Upma Recipe, , , Masala Dosa Recip..., , , Poori Recipe, How..., , , Semiya Payasam Re..., , , Aval Upma (Poha U..., , , , , Recipe Card, , , , , , Semiya Upma Recipe (Vermicelli Upma), , , 5, from, 107, votes, , , , Semiya upma is a simple South Indian Breakfast made with wheat vermicelli, tempering spices, , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 8, minutes, , minutes, Cook Time, 17, minutes, , minutes, Total Time, 25, minutes, , minutes, , Servings, 2, , Author, Swasthi, , , , Preparation, ▢, If using roasted vermicelli, then skip this step. Dry roast semiya uniformly on a medium flame until lightly golden. Keep stirring and fry without browning them. They will turn light when done. Transfer to a plate., How to make Semiya Upma, ▢, Heat oil in a pan. Add peanuts or cashews. Fry them until golden and crunchy. Remove to a plate., ▢, To the same pan add mustard, cumin, chana dal & urad dal . Fry until the dal turn golden and roasted well., ▢, Next add hing, onions, ginger, green chilli and curry leaves.  Fry for about 2 to 3 minutes until the onions turn transparent or light golden., ▢, This step is optional. If using carrot, beans and peas add them now and saute for another 3 mins. Cook covered on a low flame till they turn slightly tender., ▢, Pour water and add salt. Stir and check by tasting the water. It has to be slightly salty. If needed add more salt., ▢, Bring it to a rapid boil on a high heat. Transfer roasted semiya to the pan & stir immediately., ▢, Cook uncovered on a medium flame till all the water is absorbed and the vermicelli is cooked through. Turn off and cover for another 5 to 6 minutes.(Troubleshooting – If you feel the semiya is undercooked then pour little boiling water. You may need about 2 tbsps more), ▢, When the temperature cools down a bit sprinkle some lemon juice & coriander leaves., ▢, Garnish semiya upma with grated coconut (optional), roasted peanuts or cashews. Serve with, peanut podi, or pickle., Instant pot semiya upma, ▢, Follow all the steps on a saute mode. Add semiya and mixed vegetables if using. Pour 1¼ cups water and deglaze., ▢, Secure the IP with the lid and position the steam release handle to sealing. Pressure cook for 1 minute. When the instant pot is done, wait for 2 mins and release the pressure manually., ▢, Remove the steel insert and fluff up with a fork. I keep it covered further for another 5 to 10 mins. Serve semiya upma hot., , , Notes, , Pre-roasted semiya is easily available in Indian grocery stores. I feel the home roasted semiya (from raw) and store bought pre-roasted have a different flavor., , Usually Bambino Semiya takes up to 1½ cups water for 1 cup semiya. MTR pre-roasted requires 1¾ cup water without vegetables. 2 cups if using fresh vegetables (not frozen). This is just an, approximation, and please adjust., , Always keep ¼ cup boiling water ready on the side, if you feel the upma is undercooked, pour that at the last stage., , , , Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Semiya Upma Recipe (Vermicelli Upma), , , Amount Per Serving, , , Calories, 295, , Calories from Fat 117, , , , , % Daily Value*, , , Fat, 13g, 20%, Saturated Fat 2g, 13%, Sodium, 708mg, 31%, Potassium, 391mg, 11%, Carbohydrates, 39g, 13%, Fiber 10g, 42%, Sugar 3g, 3%, Protein, 9g, 18%, , , Vitamin A, 3621IU, 72%, Vitamin C, 44mg, 53%, Calcium, 66mg, 7%, Iron, 3mg, 17%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 7.2K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 107 votes (, 86 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 63, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Rachel, , , , , , April 7, 2025 5:09 am, , , , , , Good semiya upma recipe. Turned out perfect, , , , , , Reply, , , , , , , , , , , MrsYee, , , , , , January 29, 2024 4:39 pm, , , , , , Curious what makes this the perfect “breakfast” dish?  I made it as a side for tandoori chicken. It was amazing!, , , , , , Reply, , , , , , , , , , , GregNoiz, , , , , , January 29, 2024 1:58 am, , , , , , Good guidance here, thank you!, , , , , , Reply, , , , , , , , , , , Sumesh P N, , , , , , October 29, 2023 5:53 am, , , , , , Excellent recipe. Really liked it., , , , , , Reply, , , , , , , , , , , Neetu, , , , , , October 5, 2023 4:58 am, , , , , , I tried it… Came out well.. Thank you 🙂, , , , , , Reply, , , , , , , , , , , Samuel Varghese, , , , , , July 31, 2023 10:22 am, , , , , , Food tastes better when we cook with your Recipes, Keep going, God Bless, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Samuel Varghese, , , , July 31, 2023 10:32 am, , , , , , Thank you so much for the wishes!, , , , , , Reply, , , , , , , , , , , Cynthia, , , , , , November 30, 2022 2:27 pm, , , , , , Excellent recipe., , , , , , Reply, , , , , , , , , , , Radha Ram, , , , , , October 19, 2022 9:50 pm, , , , , , I tried your recipe and it came out very good. If I use 2 cups of Bambino brand vermicelli, how much of water should I use? My husband likes upma with vegetables., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Radha Ram, , , , October 20, 2022 1:16 am, , , , , , Hi Radha,, Start with 3½ cups water. While you cook, if the semiya is still undercooked, pour another ¼ to ½ cup boiling water towards the end & cook further. Hope this helps, , , , , , Reply, , , , , , , , , , , Rose Maryann Peck, , , , , , July 5, 2022 4:56 am, , , , , , Your recipes are simple, easy and turn out delicious.  Always check your recipes before trying something  new. Cheers!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rose Maryann Peck, , , , July 12, 2022 4:29 pm, , , , , , Thank you Rose, , , , , , Reply, , , , , , , , , , , Suneeta, , , , , , December 5, 2021 1:49 am, , , , , , I like your way of making breakfast items. Thus, I always follow you., Thanks for your simplicity., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Suneeta, , , , December 11, 2021 3:28 am, , , , , , Glad to know Suneeta, , , , , , Reply, , , , , , , , , , , Tonya, , , , , , November 26, 2021 4:35 am, , , , , , Hi. I would love if you link down your pot used. Looks pretty., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Tonya, , , , November 27, 2021 5:04 am, , , , , , Hi Tonya, I don’t buy my cookware and tableware online. I buy them from stores in Singapore. So I don’t have the link., , , , , , Reply, , , , , , , , , , , Yvonne, , , , , , November 23, 2021 9:51 am, , , , , , Hi it will be so helpful to show pictures of thick vs thin semiya. Could you please if you see my comment? ❤️, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Yvonne, , , , November 27, 2021 7:53 am, , , , , , Hi,, I have used the thicker one here. Thinner one looks something like I have used in this post (but not the same), seviyan, , , , , , Reply, , , , , , , , , , , , , , Yvonne, , , , , , Reply to, swasthi, , , , November 29, 2021 7:49 am, , , , , , Thanks!!, , , , , , Reply, , , , , , , , , , , Ravi, , , , , , September 30, 2021 4:20 am, , , , , , Nice,good explanation, , , , , , Reply, , , , , , , , , , , Anand, , , , , , July 9, 2021 5:05 am, , , , , , would be great if you could mention measurement in grams for a serving, , , , , , Reply, , , , , , , , , , , shamanth, , , , , , July 7, 2021 6:01 am, , , , , , it remind me of my school days, my grandma used to cook this, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, shamanth, , , , July 8, 2021 3:35 am, , , , , , That’s Awesome!, Thank you, , , , , , Reply, , , , , , , , , , , Shruti, , , , , , May 5, 2021 4:57 pm, , , , , , I used to eat this semiya upma in my office canteen and liked it very much. Since then I was searching for this recipe., Finally I found this. Thanks a lot for this detailed step by step recipe. ?, , , , , , Reply, , , , , , , , , , , Rupal, , , , , , November 28, 2020 3:26 pm, , , , , , Recipe with tips is so useful. Perfect measurements for different type of vermicelli. My kids and mother in law absolutely love this dish. Must try for everyone. Combination of veggies makes it yummier and healthier! Thank you ?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rupal, , , , November 29, 2020 11:22 am, , , , , , Welcome Rupal, Glad to know! Thank you!, , , , , , Reply, , , , , , , , , , , Rajshree, , , , , , May 25, 2020 3:53 am, , , , , , Hi,, Water you have mentioned for thick sevai is too much.. Mine came out sticky., , Regards,, Rajshree, , , , , , Reply, , , , , , , , , , , , , , Winnie, , , , , , Reply to, Rajshree, , , , July 1, 2020 2:30 pm, , , , , , Tried the vegetable semiya upma today. Turned out just perfect. The details of water ratio provided for different types of vermicelli was informative., , , , , , Reply, , , , , , , , , , , Shanthi Sankaran, , , , , , April 21, 2020 7:34 am, , , , , , Very very tasty semiya upma. Thank you Swasti very much. For two and quarter glass of semiya I used two and half glass water. It was proper. Will your other recipes too., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shanthi Sankaran, , , , April 23, 2020 12:19 pm, , , , , , Hi Shanthi Sankaran, You are welcome!, Glad to know, , , , , , Reply, , , , , , , , , , , S, , , , , , April 6, 2020 1:03 pm, , , , , , You put a good amount of effort and research in your recipes. I liked the little details like different water ratios fir different vermicellis, different cooking techniques and also a separate step by step photo. Most bloggers/authors don’t do that., Kudos!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, S, , , , April 7, 2020 6:14 am, , , , , , Thank you so much!, , , , , , Reply, , , , , , , , , , , Adhidev, , , , , , March 31, 2020 4:14 am, , , , , , Amazing recipe for beginners, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Adhidev, , , , April 1, 2020 2:43 pm, , , , , , Thank you, , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Rava Pongal": "Ingredients:  Instructions: ",
        "Bread Upma": "Ingredients: mustard, , , , Related Recipes, , Upma Recipe, , , Spicy Bread Masal..., , , Paneer cheese toa..., , , Garlic Cheese Toa..., , , Bread Pakora Reci..., , , Bread Vada Recipe..., , , , , Recipe Card, , , , , , Bread Upma Recipe (Bread Poha), , , 4.99, from, 87, votes, , , , Bread upma is a South Indian upma variety made with bread, spices and herbs. This spicy bread upma is a quick way to use up your left over bread. It can be had for a breakfast or snack., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 5, minutes, , minutes, Cook Time, 10, minutes, , minutes, Total Time, 15, minutes, , minutes, , Servings, 1, , Author, Swasthi, , , , ▢, 2 to 3, , slices, , bread, , (any bread), ▢, 1, , tablespoon, , oil, ▢, ½, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , urad dal, , (skip if you don’t have), ▢, 1, , sprig, , curry leaves, ▢, ¾, , teaspoon, , ginger paste, , or grated or fine chopped, ▢, 1, , green chili, , slit or chopped, ▢, 8 to 10, , cashew nuts, , split or 2 tbsps peanuts, ▢, ¼, , cup, , onions, , chopped finely (1 medium), ▢, ½, , cup, , ripe tomatoes, , chopped finely (1 large) (adjust as needed), ▢, salt, , (use only as needed), ▢, ⅛, , teaspoon, , turmeric, , (haldi), ▢, ½, , teaspoon, , red chili powder, , (adjust to taste, less spicy variety), ▢, ½, , teaspoon, , sugar, , (skip if using milk bread), ▢, 3 to 4, , tablespoon, , water, ▢, 2, , tablespoon, , coriander leaves, , chopped finely, ▢, Lemon juice, , to serve (optional),  Instructions: Preparation, ▢, Heat a pan and toast the bread until crisp on both the sides. Cool completely. Cut them to small cubes and set aside., ▢, Pour oil to the same pan and on a medium heat fry cashews or peanuts until golden, crunchy and aromatic. Set these aside with bread., ▢, Add mustard seeds and urad dal (optional). Saute till urad dal turns lightly golden., ▢, Next add green chilies and curry leaves. Saute until the leaves turn crisp., ▢, Sprinkle hing. Add onions and saute until they turn golden. Saute the ginger paste as well for 30 seconds., ▢, Next add tomatoes, salt and turmeric. Note that your bread is salted so add only as required, start with ¼ teaspoon. Saute until tomatoes turn soft and mushy., ▢, Then add chili powder and sugar. Saute for 1 to 2 mins until the raw smell goes off., ▢, Pour 3 to 4 tablespoons water and mix., How to Make Bread Upma, ▢, Cook until the mixture turns thick. Taste test and adjust salt if required., ▢, Add bread cubes and cashews. Mix gently to coat the bread with the onion tomato masala., ▢, Sprinkle coriander leaves., ▢, Serve bread upma hot. Sprinkle some lemon juice., , , Notes, , Bread: Use any bread of your choice. Whole grain, white bread or just any goes well., , Do not alter the quantities of onions, tomatoes and bread in this recipe. Tomatoes provide some moisture and help to blend the spices well with the bread., , Do not skip adding water after the tempering, this helps to blend the spices well with the bread., , If you do not have curry leaves, you may skip them and add more coriander leaves., , You may add some boiled potatoes or fine chopped carrots, bell peppers, peas and sweet corn to the tempering. Saute them well on a low heat until tender and then add the tomatoes., , , , Video, Watch Bread Upma Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Bread Upma Recipe (Bread Poha), , , Amount Per Serving, , , Calories, 433, , Calories from Fat 153, , , , , % Daily Value*, , , Fat, 17g, 26%, Saturated Fat 1g, 6%, Sodium, 651mg, 28%, Potassium, 599mg, 17%, Carbohydrates, 58g, 19%, Fiber 8g, 33%, Sugar 12g, 13%, Protein, 11g, 22%, , , Vitamin A, 1305IU, 26%, Vitamin C, 79mg, 96%, Calcium, 161mg, 16%, Iron, 5.9mg, 33%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , This bread upma recipe is from the Archives. First published in May 2017. Republished in August 2021. Updated in June 2022., , , , , 7.6K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 4.99 from 87 votes (, 65 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 44, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Lisa, , , , , , November 17, 2024 7:51 pm, , , , , , Tasty and quick to prepare., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Lisa, , , , November 18, 2024 5:29 am, , , , , , Thanks Lisa, , , , , , Reply, , , , , , , , , , , Shruti, , , , , , October 19, 2024 7:03 am, , , , , , Delicious recipe!! Toasting bread is a good option., , , , , , Reply, , , , , , , , , , , Nina, , , , , , August 21, 2024 12:02 pm, , , , , , Excellent explanation and tips, kudos to you., , , , , , Reply, , , , , , , , , , , ranjini Prabhakar, , , , , , June 10, 2024 4:56 pm, , , , , , Very good recipe. I follow it often to make quick snacks. Thanks for sharing !, , , , , , Reply, , , , , , , , , , , ranjini Prabhakar, , , , , , June 10, 2024 4:55 pm, , , , , , Swathi this is a great recipe for a quick meal, , , , , , Reply, , , , , , , , , , , Deepika Gupta, , , , , , December 26, 2023 7:10 am, , , , , , Lovely recipe Madam… Tried for the first time… But really ultimate it is… Thank you., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Deepika Gupta, , , , December 26, 2023 7:55 am, , , , , , Deepika, Glad you like it!, , , , , , Reply, , , , , , , , , , , Lisa, , , , , , October 9, 2023 10:16 pm, , , , , , Delicious! The only “mistake” I made was not thinking to add more tomato when adding additional vegetables. Also recipe mentions hing but not how much?, , , , , , Reply, , , , , , , , , , , Jean, , , , , , April 10, 2023 7:12 am, , , , , , The best way to use the collection of leftover bread. Thanks for the lovely recipe. I tried and it was delicious. My family enjoyed., , , , , , Reply, , , , , , , , , , , , , , Deepika Gupta, , , , , , Reply to, Jean, , , , December 26, 2023 7:11 am, , , , , , Completely agree… With you., , , , , , Reply, , , , , , , , , , , Shyamala, , , , , , October 18, 2021 1:17 pm, , , , , , Excellent tip,that one should toast whole wheat or multigrain bread before use, to avoid sogginess ??, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shyamala, , , , October 18, 2021 4:54 pm, , , , , , Glad you like it Shyamala, , , , , , Reply, , , , , , , , , , , Manju, , , , , , August 25, 2021 4:20 pm, , , , , , Mam thank you! This is a fantastic recipe for students. We r a group of friends trying to cook from your site. So far all good and tasty. Thank you from all of us., , , , , , Reply, , , , , , , , , , , Ganesh, , , , , , August 23, 2021 9:42 am, , , , , , Thanks for sharing, , , , , , Reply, , , , , , , , , , , SONU S, , , , , , June 28, 2021 3:49 pm, , , , , , Loved it, everyone in family enjoyed ❤, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, SONU S, , , , July 1, 2021 2:02 am, , , , , , Thanks Sonu, , , , , , Reply, , , , , , , , , , , Shuba, , , , , , August 27, 2020 9:49 pm, , , , , , Tasted great! Love the addition of roasted cashews. Tip to toast the bread was definitely worth the effort! Thanks for the recepie., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shuba, , , , August 28, 2020 2:45 pm, , , , , , Welcome Shuba, Glad it tasted good. Thank you!, , , , , , Reply, , , , , , , , , , , Sampoorna Gonella, , , , , , June 20, 2020 3:02 am, , , , , , Hi! I really enjoyed your recipe and I doubled it with 2 large onions and 2 tomatoes. Unfortunately I was not able to get the fine paste that you got because a lot of my onions remained as individual pieces. Can you give me some tips to get the paste that you obtained?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sampoorna Gonella, , , , June 21, 2020 9:52 am, , , , , , Hi Sampoorna, I think the onions and tomatoes needed more water to soften and turn mushy. Next time, keep adding more water as needed and cook until you get that smooth and mushy mixture.Hope this helps, , , , , , Reply, , , , , , , , , , , Manjula, , , , , , May 26, 2020 3:49 am, , , , , , Very simple and tasty recipes, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Manjula, , , , May 26, 2020 1:57 pm, , , , , , Thank you!, , , , , , Reply, , , , , , , , , , , Winnie, , , , , , May 22, 2020 3:33 pm, , , , , , Tried this recipe today with a few slices of leftover bread. Toasted the slices using little butter. It was so very tasty. Perfect evening snack with tea., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Winnie, , , , May 26, 2020 11:36 am, , , , , , Thanks Winnie, Glad to know!, 🙂, , , , , , Reply, , , , , , , , , , , Min, , , , , , May 16, 2020 1:10 pm, , , , , , Hello, Can you try and keep the option, send recipe to google home? It would be really helpful., Thanks, Min, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Min, , , , May 16, 2020 5:27 pm, , , , , , Hi Min, are you using google nest hub?, , , , , , Reply, , , , , , , , , , , Snehalatha Kulkarni, , , , , , April 29, 2020 3:18 pm, , , , , , Recipe is good. Poha tastes good and easy to prepare., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Snehalatha Kulkarni, , , , April 29, 2020 3:25 pm, , , , , , Thank you, , , , , , Reply, , , , , , , , , , , Snehalatha Kulkarni, , , , , , April 29, 2020 3:17 pm, , , , , , Nice recipe. Easy to prepare and tastes good., , , , , , Reply, , , , , , , , , , , Iti, , , , , , April 21, 2020 12:35 pm, , , , , , I was searching for a good bread poha recipe since 7 years(yes u read it right 7 years). My husband is a big fan of bread poha which he used to have outside his hostel in college days…… And when I made poha using your recipe he was so happy and he is said this is better than Ramu Da’s Poha ?? Thanks a lot, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Iti, , , , April 21, 2020 12:42 pm, , , , , , Hi Iti, Glad to know your husband liked it! You are welcome.Thank you so much for the comment, 🙂, , , , , , Reply, , , , , , , , , , , Priyanka Pritee, , , , , , January 7, 2020 1:03 pm, , , , , , Hi Ma’m, I like all yr  recipes nd i tryed also many more…, I love cooking nd everyday I’m trying something new nd yr recipes r really help me a lot …Pls help us to post many more ??????, Thanks ??, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Priyanka Pritee, , , , January 28, 2020 9:08 am, , , , , , Hi Priyanka,, You are welcome! Thank you so much. Glad you like them. Yes sure will post more recipes., , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Idli Upma": "Ingredients: , , ▢, 5 to 6, , Idli, , crumbled, ▢, 1, , tablespoon, , oil, ▢, ½, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , cumin seeds, ▢, ½, , teaspoon, , urad dal, , (split husked black gram), ▢, 5 to 6, , curry leaves, , – chopped or kept whole, ▢, ½, , teaspoon, , ginger, , – finely chopped, ▢, 1, , green chili, , – chopped or ½ to 1 teaspoon, chopped, ▢, 1, , dry red chili, , – seeds removed, use red chilies which are not hot, ▢, 1, , pinch, , asafoetida, , (hing), optional, ▢, ¼, , cup, , onions, , – chopped or 1 small onion chopped, ▢, salt, , as required, ▢, 1 to 2, , tablespoons, , coriander leaves, , – chopped, , Cook Mode, Prevent your screen from going dark while making the recipe,  Instructions: , Crumble 5 to 6 idlis and keep aside., Heat 1 tablespoon oil in a pan. Add ½ teaspoon mustard seeds and let them crackle on low heat., When they start crackling, add ½ teaspoon urad dal and ½ teaspoon cumin seeds., Saute till the urad dal turns golden stirring often on low heat., Then add 5 to 6 curry leaves (chopped or kept whole), ½ teaspoon finely chopped ginger, 1 dry red chili (seeds removed) and 1 green chili (chopped). You can also add a pinch of asafoetida at this step., Stir and then add ¼ cup chopped onion. Saute till the onions turn translucent stirring often on low heat., Then add the crumbled idli. Also add a bit of salt as per taste. Mix very well and saute for a minute or two., Then switch off the heat. Lastly add 1 to 2 tablespoons of chopped coriander leaves. At this step, you can also add some grated coconut., Mix again and serve idli upma hot with some coconut chutney or lemon pickle. While serving you can drizzle some lemon juice., , , Notes, , The recipe can be easily doubled or tripled., , If you are using leftover idlis that have been refrigerated then first bring them to room temperature before using them in the dish., , If you are using freshly prepared idli then use them once they become warm., , You can use any neutral-flavored oil., , You can vary the amount of spices as per your taste., , Idli podi can also be added., , To make it more nutritious you can opt to add some grated veggies, boiled peas, nuts like cashews and some roasted peanuts., , , , Nutrition Info (Approximate Values), , Nutrition Facts, , Idli Upma, , , Amount Per Serving, , , Calories, 427, , Calories from Fat 72, , , , , % Daily Value*, , , Fat, 8g, 12%, Saturated Fat 1g, 6%, Polyunsaturated Fat 1g, Monounsaturated Fat 6g, Sodium, 373mg, 16%, Potassium, 161mg, 5%, Carbohydrates, 79g, 26%, Fiber 3g, 13%, Sugar 2g, 2%, Protein, 8g, 16%, , , Vitamin A, 183IU, 4%, Vitamin B1 (Thiamine), 0.1mg, 7%, Vitamin B2 (Riboflavin), 0.1mg, 6%, Vitamin B3 (Niacin), 30mg, 150%, Vitamin B6, 0.2mg, 10%, Vitamin C, 55mg, 67%, Vitamin E, 3mg, 20%, Vitamin K, 2µg, 2%, Calcium, 52mg, 5%, Vitamin B9 (Folate), 307µg, 77%, Iron, 1mg, 6%, Magnesium, 31mg, 8%, Phosphorus, 123mg, 12%, Zinc, 1mg, 7%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , This Idli Upma post from the blog archives first published in August 2016 has been updated and republished on December 2022., , Share This Recipe:, WhatsApp, Facebook, Pin, Tweet, Email, Shares, 201, Meet Dassana, Welcome to Dassana's Veg Recipes. I share vegetarian recipes from India & around the World. Having been cooking for decades and with a professional background in cooking & baking, I help you to make your cooking journey easier with my tried and tested recipes showcased with step by step photos & plenty of tips & suggestions., , Learn More about Dassana, Get My Secrets to Great Indian Food, Sign up for my FREE Beginners Guide to Delicious Indian Cooking, Please enable JavaScript in your browser to complete this form., First Name, *, Email, *, Phone, SIGN UP, , More Vegetarian Recipes You'll Love, , Breakfast Recipes, Idli Recipe (+ Foolproof Idli Batter Recipe), Breakfast Recipes, Masala Dosa Recipe (Potato Stuffed Crepes), Breakfast Recipes, Upma Recipe, North Indian Food Recipes, Aloo Paratha Recipe (Indian Potato Flatbread), , , , Leave a Comment, Cancel reply, Your email address will not be published. We moderate comments and it takes 24 to 48 hours for the comments to appear. We thank you for your understanding and patience. If you have made the recipe, then you can also give a star rating., , Your Recipe Rating, , , , Your Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Your Name, *, , , Your Email, *, , , , , , Δ, , , 8 Comments, , , , , , , Doc, , says:, , , , Jan 28, 2019 at 5:51 am, , , , , I am just re-discovering how to make idli so I have extra from repeated trials and this looks like a good way to use the leftovers., In Step 6, where the curry leaf is called for, I don’t see it in the photo.  So was it left out on purpose, or perhaps they went in and came out quickly so that they were no longer then when the camera shutter opened? I imagine that if you are going to chop curry leaf and leave it in the dish, then it would need to be very young and tender, but perhaps you still take it out even if you chop it up.  Your clarification is appreciated., , , Reply, , , , , , , , dassana, , says:, , , , Jan 28, 2019 at 6:00 pm, , , , , curry leaves are visible in step 6. i have chopped them and added. they are placed next to the green chillies. its always better to chop curry leaves and then add. this way one can eat them. tender curry leaves can also be added whole. but if the curry leaves are large and thick, then better to chop them and add. we generally have curry leaves with the food and do not take it out. curry leaves have a lot of medicinal properties and its good to consume them. mostly i chop or tear the leaves and then add., , , Reply, , , , , , , , , , kalpna, , says:, , , , Aug 11, 2016 at 10:33 pm, , , , , Hi…mam I love your recipes.often tried them.&     Tomorrow early in the I will make yummy idli upma for tiffin.hope that it’s be good, , , Reply, , , , , , , , dassana amit, , says:, , , , Aug 12, 2016 at 11:10 am, , , , , pleased to know this thank you kalpna 🙂 for your positive views. surely try and let us know how the idli upma was?, , , Reply, , , , , , , , , , mary, , says:, , , , Aug 09, 2016 at 1:09 pm, , , , , wow! yummy, , , Reply, , , , , , , , dassana amit, , says:, , , , Aug 09, 2016 at 9:31 pm, , , , , thank you mary., , , Reply, , , , , , , , , , Deep, , says:, , , , Aug 05, 2016 at 10:46 pm, , , , , My mother and my badi maa used to make this and still make this. Instead of corriander leaves they used curry leaves. One of my favourite things to eat turns into another. Thanks for sharing it. I am gonna try too., , , Reply, , , , , , , , dassana amit, , says:, , , , Aug 06, 2016 at 11:42 am, , , , , welcome deep and thank you for your kind words and positive views 🙂, , , Reply, , , , , , , , Meet Dassana, Hi, I am Dassana. Running the kitchen for decades, I share tried and tested Vegetarian recipes on my food blog since 2009, with a step-by-step photo guide & plenty of tips so that your cooking journey is easier. I also have a professional background in cooking & baking., , Learn More about Dassana, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, , Popular, Paneer Recipes, Malai Kofta Recipe (Restaurant Style Paneer Kofta), Breakfast Recipes, Upma Recipe, Dal (Lentils) & Legumes, Dal Makhani Recipe (Authentic Punjabi Style), Paneer Recipes, Paneer Butter Masala Recipe, , Snacks Recipes, Samosa Recipe (With Potato & Green Peas), Dal (Lentils) & Legumes, Rajma Recipe | Rajma Masala (Restaurant Style), Punjabi Food, Chole Recipe (Street Style Chole Masala), Paneer Recipes, Palak Paneer Recipe (Indian Cheese & Spinach), As Seen In:, Dassana's Veg Recipes, Recipe Glossary, , Press & Media, , Privacy Policy, , Terms & Conditions, , Accessibility Statement, , Follow Us, Facebook, , YouTube, , Pinterest, , Twitter, , Instagram, © Dassana’s Veg Recipes 2009-2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , ,",
        "Maharashtrian Pitla": "Ingredients: , , , , , , , , The base of the, Maharashtrian pitla, is made with besan. The first step is combining besan with enough water to get it started. Further, for the tempering take oil in a non stick pan, add garlic which gives a luscious taste to our, Maharashtrian pitla, . Next, add cumin seeds and curry leaves followed by green chillies and onions. Chillies can be adjusted according to the preference of spice and onions give a mouthful to the recipe, it basically adds crunch. Once onions are cooked, add the besan water mixture, with turmeric and coriander leaves for freshness. Further all you need to do is keep stirring it and make sure the besan doesn’t stick to the bottom of the pan. And also make sure you do not leave, besan pitla, unattended as it might burn., Some places in Maharashtra also serve, pitla, as a street food. As, pitla, is super easy to make, I remember as a child when my mother was a working women she would make it for dinner as it doesn’t consume time and also she would cook it when we would run out of vegetables., Pitla, goes really well with, chawal bhakri, , , jowar roti, and some, green chilli thecha, and, red chill thecha, ., Enjoy, pitla recipe, |, Maharashtrian pitla, |, besan pitla, |, Maharashtrian pitla with chawal bhakri, | with detailed step by step photos and video below., Maharashtrian Pitla, Pitla Recipe, Besan Pitla Recipe recipe - How to make Maharashtrian Pitla, Pitla Recipe, Besan Pitla Recipe, , , , , , , , Tags, , , , , Non-stick Pan, , Indian Comfort Foods, , Indian Dinner, , Dinner Sabzi, , Sabzis, Curries, , Quick Sabzis recipes, , Indian Veg Recipes, , Maharashtrian recipes, , Maharashtrian Bhaji, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 5 Mins, , , , , , , Total Time, , 20 Mins, , , , , , , Makes, , 2 servings, , , , , , , , , , , , , , , For Maharashtrian Pitla, , , 1 cup, besan (Bengal gram flour), , , 2 tbsp, oil, , , 1 tbsp, crushed garlic (lehsun), , , 1/2 tsp, cumin seeds (jeera), , , 1 tbsp roughly, chopped green chillies, , , 4, curry leaves (kadi patta), , , 1/2 cup finely, chopped onion, , , 1/4 tsp, turmeric powder (haldi), , , 2 tbsp finely, chopped coriander (dhania), , , , salt, to taste, , , , , , , , , , , Further, add cumin seeds and curry leaves., , , , , , Add green chillies., Pitla, is usually very spicy but you can add more or less as per your preference., , , , , , Add the onions., , , , , , Sauté on a medium flame for 1 minute or until they are soft., , , , , , Add the prepared besan-water mixture., , , , , , Add turmeric powder. These spices can also be added to the besan-water mixture., , , , , , Add coriander leaves. Coriander leaves would give it freshness., , , , , , Add salt., , , , , , Mix well and cook, pitla recipe | Maharashtrian pitla | besan pitla |, on a medium flame for 2 minutes, while stirring continuously. It will thicken as you cook so, switch off the flame when you have achieved a desired consistency of your choice. We would suggest if you are intending to serve it with rice, keep it liquid and solid if eating with Bhakri or Chapati. Make sure you do not leave, besan pitla, unattended and keep stirring continuously or you might burn it and it may also stick to bottom of the pan., , , , , , Serve, pitla | Maharashtrian pitla | besan pitla |, immediately with jowar roti, garlic chutney and onions. You can also enjoy pithla hot with Bajrichi Bhakri or Tandulchi Bhakri. If the Pithla goes cold, it will solidify. Just add some warm water, mix well and reheat for 2-3 minutes before serving., , , , , , , , , , , , , , , , , , , , what is green garlic pitla made of?, , , , , , , , , , green galic pitla recipe, 2 tbsp oil, 2 tsp mustard seeds, 5 to 6 curry leaves, 1½ tsp finely chopped green chillies, ½ cup finely chopped onions, 5 tbsp finely chopped green garlic, ½ tsp turmeric powder, 1 tbsp finely chopped coriander and salt to taste., , , , , , , , , , , , , , , , , , , , , for making green garlic pitla, , , , , , , , , Follow same steps given above to make pitla, In a deep bowl, add besan, turmeric powder and 2 cups of water. Whisk well till lump free., 2. In a deep pan, heat oil, add mustard seeds, curry leaves and green chillies. Sauté for few seconds., 3. Add onions and saute on medium flame for 2 to 3 minutes., 4. Now add green garlic and cook for a minute. At this stage add green garlic and follow rest of the procedure same for making green garlic pitla., 5. Add the besan mixture and salt to taste. Cook on medium flame for 4 to 5 minutes, while stirring continuously., 6. Garnish with little coriander and serve, green garlic pitla, hot with jowar bhakri, mirchi cha thecha and onion., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 458 cal, Protein, 17.6 g, Carbohydrates, 52.9 g, Fiber, 12.9 g, Fat, 19.6 g, Cholesterol, 0 mg, Sodium, 63.1 mg, , , , , , , Click here to view, Calories for Maharashtrian Pitla, Pitla Recipe, Besan Pitla Recipe, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Krutik, , March 13, 2025, midnight, , Can you mention in all recipes how much is one serving size(in grams), otherwise the information on calories is too confusing., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Satya, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Lisa, , March 13, 2025, midnight, , This is a delicious recipe and very easy to follow. Thank you for sharing it!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , namrata biswas, , March 13, 2025, midnight, , amazing recipe. perfectly done. taste is awesome!! thanks, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Delighted to hear Namrata. Do try more recipes and share your feedback. Happy Cooking!!!, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , besan and green peas chilla | matar besan cheela | healthy besan green peas chilla |, , , 98 Calories, , , , , , , , , , , , , , , , , besan paratha | masala besan paratha | zero oil besan paratha |Â, , , 272 Calories, , , , , , , , , , , , , , , , , gujarati kadhi | traditional gujarati kadhi | how to make gujarati kadhi |, , , 241 Calories, , , , , , , , , , , , , , , , , besan sheera recipe |Â Indian gram flour sheera | besan ka sheera with milk |, , , 448 Calories, , , , , , , , , , , , , , , , , cauliflower greens pitla recipe | pitla using cauliflower leaves | healthy cauliflower greens pitla |, , , 53 Calories, , , , , , , , , , , , , , , , , methi pitla recipe | Maharashtrian methi che pitla | methi zunka |, , , 226 Calories, , , , , , , , , , , , , , , , , jowar bajra thalipeeth recipe | healthy jowar thalipeeth | Maharashtrian multigrain thalipeeth |, , , 92 Calories, , , , , , , , , , , , , , , , , Kairi Chi Kadhi recipe, , , 126 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like Maharashtrian pitla, , , , , , , , , How to make Maharashtrian pitla, , , , , , , , , What is green garlic pitla made of?, , , , , , , , , For making green garlic pitla, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , pitla recipe, |, Maharashtrian pitla, |, besan pitla, |, Maharashtrian pitla with chawal bhakri, | with amazing 15 pictures, Pitla, is a very famous, Maharashtrian food, , falls under the category of their, comfort food, . Not only Maharashtrians but many Indian households have, pitla, in their weekly menu., Pitla, , , , For maharashtrian pitla, , To make, maharashtrian pitla, , combine the besan and 1½ cups of water in a deep bowl and whisk well. Keep aside., Heat the oil in a deep non-stick pan, add the garlic and sauté on a medium flame for 30 seconds., Add the cumin seeds and curry leaves and sauté on a medium flame for 30 seconds., Add the green chillies and onions and sauté on a medium flame for 1 minute., Add the besan-water mixture, turmeric powder, coriander and salt, mix well and cook on a medium flame for 2 minutes ,while stirring continuously., Cover with a lid and cook on a medium flame for 1 minute., Serve the, maharashtrian pitla, immediately., , , , , , , , , , , , , , pitla recipe | Maharashtrian pitla | besan pitla |  Maharashtrian pitla with chawal bhakri | Video by Tarla Dalal, , , , , ×, , , , , , Maharashtrian Pitla, Pitla Recipe, Besan Pitla Recipe recipe with step by step photos, , , , , , , , , , , , , , , , , , , Like Maharashtrian pitla, , , , , , , , , If you like, pitla recipe | Maharashtrian pitla | besan pitla |, given below are the links to similar, Maharashtrain snack recipes, :, , , Healthy methi pitla, , , Cauliflower green pitla, , , Methi pitla, , , , , Maharashtrian Pitla is rich in below macronutrients, vitamins and minerals given in descending order (highest to lowest)., , , Folic Acid, , (Vitamin B9):, , Folic acid, is an essential vitamin required throughout pregnancy. Folic acid rich Indian foods (, kabuli chana, , chana dal, , yellow moong dal, , , urad dal, , , toor dal, , , sesame seeds, ). 62% of RDA., , Fiber, :, Dietary fiber, reduces the risk of heart disease, prevents the spike in blood sugar levels and hence super for diabetics., Consume more fruits, vegetables (, green peas, , , carrot, , , bitter gourd, ), , dals (, chana dal, , , urad dal, , , toovar dal, ), moong, , , oats, , , matki, , whole grains ., 52, % of RDA., , Vitamin B1 (Thiamine), :, Vitamin B1, protects nerves, helps in carbohydrate metabolism, prevents heart diseases and helps produce red blood cells. Indian Foods rich in B1 are, Flax seeds, (alsi),, Sunflower seeds, ,, sesame seeds, ,, Garden cress seeds, (halim), , capsicum, , , whole wheat flour, , , chana dal, , , moong, , , walnuts, , , masoor dal, , , brown rice, ,, jowar, , , bajra, . 40% of RDA., , Protein, :, Protein, is required for managing the wear and tear of all cells of the body., Have, protein rich Indian foods, like, curds, , , paneer, , , Greek yoghurt, , , tofu, , , almonds, , sprouts, chana, , rajma, , , chick peas, , , quinoa, , , buckwheat, ). 32% of RDA., , Iron, :, Iron, is essential in the chemical reactions that produce energy from foods. Eat more greens and, garden cress seeds, to prevent you from being, anaemic, . Here are the top, 7 sources of iron rich foods, .  22% of RDA., , , , , , , , , , , , , , , , , , How to make Maharashtrian pitla, , , , , , , , , To prepare, Maharashtrian Pithle, , in a deep bowl, take besan. Many people even roast besan till it changes colour & turns aromatic before using., , , , , , Add 1½ cups of water., , , , , , Whisk well to form a lump-free mixture. Keep aside., , , , , , For, pitla | Maharashtrian pitla | besan pitla |, heat the oil in a deep non-stick kadhai., , , , , , Once the oil is hot, add crushed garlic",
        "Seviyan Pulao": "Ingredients: , , , , , , , , , , For Seviyan Pulao, , , 1 cup, vermicelli (semiya), , , 1 tsp, oil, , , 1 1/2 tsp, ghee, , , 1/2 tsp, cumin seeds (jeera), , , 1, clove (laung / lavang), , , 1 small stick, cinnamon (dalchini), , , 1, cardamom (elaichi), , , 1/4 cup, green peas, , , 1/4 cup, grated carrot, , , 1/2 tsp, chilli powder, , , 1/4 tsp, turmeric powder (haldi), , , 1/2 tsp, garam masala, , , , salt, to taste, , 1 tsp, lemon juice, , , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , For seviyan pulao, , , , , , , , , How to pack seviyan pulao, , , , , , , , , Tips for seviyan pulao, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , seviyan pulao recipe, |, semiya pulao, |, vermicelli pulao for breakfast and lunch box treat, |, sevai pulao, |, shavige pulav, | with 14 amazing images., seviyan pulao recipe, |, semiya pulao, |, vermicelli pulao for breakfast and lunch box treat, |, sevai pulao, |, shavige pulav, | is a quick fare ready in 25 minutes. Learn how to make, semiya pulao, ., To make, seviyan pulao, , heat the oil in a deep non-stick kadhai, add the vermicelli and sauté on a medium flame for 5 minutes or till brown in colour. Remove and keep aside. Heat the ghee in the same non-stick kadhai, add the cumin seeds, clove, cinnamon and cardamom and sauté on a medium flame for a few seconds. Add the green peas and carrot and sauté on a medium flame for another 2 minutes. Add the chilli powder, turmeric powder, garam masala and salt and sauté on a medium flame for 30 more seconds. Add 1 cup of water, mix well and cook on a medium flame for 3 minutes, while stirring occasionally. Add the vermicelli and mix well. Cover it with a lid and cook on a medium flame for 5 to 6 minutes, while stirring occasionally. Add the lemon juice and mix well. Discard the cinnamon, clove and cardamom from the, seviyan pulao, . Allow the, seviyan pulao, to cool completely, and pack in an air-tight tiffin box., The exciting noodle-like appearance of vermicelli really works in favour of the, sevai pulao, , making it a hot favourite with kids. They love to play around with the long, slippery strands of the semolina vermicelli, while moms are content that a lot of veggies are also going in with it., Assorted veggies, apt spices and garam masala too make the, semiya pulao, not only visually appealing but a real treat to the taste buds too!, Vermicelli pulao for breakfast and lunch box treat, is easy and quick to make on busy mornings, and stays fresh in the, tiffin box, for at least 5 hours, If you like, seviyan pulao, then try, Palak Chana Pulao, , , Spicy Sprouts Pulao, , , Bulgur Wheat Pulao, and other 200+, pulao recipes, from our collection., Tips for, seviyan pulao, . 1. Dry roast the vermicelli on a slow to medium flame only. Also remember to stir it continuously as it tends to burn quickly. 2. You can also use other popular vegetables that we generally add in pulao recipes like onion, French beans, cauliflower, capsicum etc. 3.This pulao is moderately spiced. You can even add garlic paste, and ginger-green chilli paste to make it more tongue-tickling. 4. Do not cook after adding lemon juice. It might lend a bitter taste to the pulao. 5. Discard the cinnamon, clove and cardamom before serving. 6. Remember to cool pulao completely before packing., Enjoy, seviyan pulao recipe, |, semiya pulao, |, vermicelli pulao for breakfast and lunch box treat, |, sevai pulao, |, shavige pulav, | with step by step photos., , Seviyan Pulao, Semiya Pulao, Vermicelli Pulao recipe - How to make Seviyan Pulao, Semiya Pulao, Vermicelli Pulao, , , , , , , , Tags, , , , , Non Stick Kadai Veg, , Indian Lunch, , Indian Kids Lunch Box, , Indian Travel Food, , Indian Travel Food Rice, Biryani, Pulao, , Main Course Recipes, , Indian Tiffin Box, Lunch box, Dabba, , One Dish Vegetarian Meals, , One Meal Dinner, , , , , , , , , , , , , , , , , , , , Preparation Time, , 10 Mins, , , , , , , Cooking Time, , 17 Mins, , , , , , , Total Time, , 27 Mins, , , , , , , Makes, , 2 servings, , , , , , , , , , , , , , , , For seviyan pulao, , To make, seviyan pulao recipe, , heat the oil and ghee in a deep non-stick kadhai, add the cumin seeds, mustard seeds, curry leaves, clove, cinnamon and cardamom and sauté on a medium flame for a few seconds., Add the onions and saute on a medium flame for 2 minutes., Add carrot, french beans and green peas, sauté on a medium flame for another 2 to 3 minutes., Add turmeric powder, chilli powder, garam masala and salt and sauté on a medium flame for 30 more seconds., Add the vermicelli, 1 cup of water, mix well and cook on a medium flame for 2 minutes, while stirring occasionally., Cover it with a lid and cook on a medium flame for 5 to 6 minutes, while stirring occasionally., Add the lemon juice and mix well., Serve, seviyan pulao, hot., , , , , , , , , , , , , , seviyan pulao recipe | semiya pulao | vermicelli pulao for breakfast and lunch box treat | sevai pulao | shavige pulav | Video by Tarla Dalal, , , , , ×, , , , , , Seviyan Pulao, Semiya Pulao, Vermicelli Pulao recipe with step by step photos, , , , , , , , , , , , , , , , , , , For seviyan pulao, , , , , , , , , , Sevaiyan or Seviyan, is nothing but semiyan (semiya), , semolina vermicelli, that have a noodle-like appearance. They are also known as shavige, semiyan and sevalu. They are a popular instant food that hardly takes any time to cook. It is widely used to make Indian recipes like, Vermicelli Nut Idli, , , Sevaiyan ki Kheer, , , Sevaiyan Upma in a Microwave, ., , To make the, seviyan pulao recipe | semiya pulao | vermicelli pulao for breakfast and lunch box treat | sevai pulao | shavige pulav,, heat the oil in a deep non-stick kadhai, add the vermicelli/sevai. You can even use ghee if you want., , , , , , Saut? on a medium flame for 5 minutes or till brown in colour., , , , , , Remove the semiyan and keep aside., , , , , , Heat the ghee in the same non-stick kadhai, add the cumin seeds., , , , , , Now add the clove, cinnamon and cardamom and saut? on a medium flame for a few seconds till they are fragrant., , , , , , Add the green peas., , , , , , Add the carrot and saut? on a medium flame for another 2 minutes. Other popular vegetables that we generally add in pulao recipes like onion, French beans, cauliflower, capsicum can also be added., , , , , , Add the chilli powder, turmeric powder, garam masala and salt and saut? on a medium flame for 30 more seconds. Since we are making this for kids it is moderately spiced. You can even add ginger, garlic, green chillies paste to make it more tongue-tickling., , , , , , Add 1 cup of water, mix well and cook on a medium flame for 3 minutes, while stirring occasionally., , , , , , Add the vermicelli and mix well to make, seviyan pulao recipe | semiya pulao | vermicelli pulao for breakfast and lunch box treat | sevai pulao | shavige pulav., , , , , , , Cover it with a lid and cook on a medium flame for 5 to 6 minutes, while stirring occasionally., , , , , , Add the lemon juice and mix well., , , , , , Discard the cinnamon, clove and cardamom before serving. Your, seviyan pulao recipe | semiya pulao | vermicelli pulao for breakfast and lunch box treat | sevai pulao | shavige pulav., is ready! Serve hot with raita and shorba., , , , , , , , , , , , , , , , , , , , How to pack seviyan pulao, , , , , , , , , To pack the, sevaiyan pulao, or, seviyan pulao  for kid’s, lunch-box allow it to cool completely, and pack in an air-tight tiffin box. It stays fresh in the lunch box for at least 5 hours., , , , , , , , , , , , , , , , Tips for seviyan pulao, , , , , , , , , Dry roast the vermicelli on a slow to medium flame only. Also remember to stir it continuously as it tends to burn quickly., , , , , , You can also use other popular vegetables that we generally add in pulao recipes like onion, French beans, cauliflower, capsicum etc., , , , , , This pulao is moderately spiced. You can even add garlic paste, and, ginger-green chilli paste, to make it more tongue-tickling., , , , , , Do not cook after adding lemon juice. It might lend a bitter taste to the pulao., , , , , , Discard the cinnamon, clove and cardamom before serving., , , , , , Remember to cool pulao completely before packing., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 114 cal, Protein, 2.9 g, Carbohydrates, 18.3 g, Fiber, 2.4 g, Fat, 3.3 g, Cholesterol, 0 mg, Sodium, 10.9 mg, , , , , , , Click here to view, Calories for Seviyan Pulao, Semiya Pulao, Vermicelli Pulao, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Pradeep panicker, , March 13, 2025, midnight, , nice taste ., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Archana M, , March 13, 2025, midnight, , Bored with the regular pulao, this is something really very different and equally tasty. sevaiyan pulao best in  tiffin for the kids as it is  so easy to make and quick in the morning to prepare, this pulao stays without sticking to each other for atleast 4 to 5 hours. I am very happy with this recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Krishnendu quila, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Beetroot Rice recipe, Beetroot Pulao, Kids Tiffin recipe, , , 215 Calories, , , , , , , , , , , , , , , , , Bournbon biscuit milkshake | bournbon milkshake with ice cream | bournbon milkshake for kids tiffin |, , , 296 Calories, , , , , , , , , , , , , , , , , bread pakora recipe| stuffed paneer bread pakora for tiffins |, , , 295 Calories, , , , , , , , , , , , , , , , , broccoli paratha recipe | broccoli paratha for kids | healthy | tiffin |, , , 84 Calories, , , , , , , , , , , , , , , , , Chatpata Pomegranate ( Tiffin Treats) recipe, , , 94 Calories, , , , , , , , , , , , , , , , , Chatpata Popcorn ( Tiffin Treats) recipe, , , 163 Calories, , , , , , , , , , , , , , , , , Cheesy Thepla Potato Wrap  ( Tiffin Treats) recipe, , , 213 Calories, , , , , , , , , , , , , , , , , Chocolate Chip and Mango Muffin  ( Tiffin Recipe), , , 208 Calories, , , , , , , , , , , , , , , , , Chocolate Sticks ( Tiffin Treats) recipe, , , 70 Calories, , , , , , , , , , , , , , , , , Coleslaw with Khakhra ( Tiffin Treats) recipe, , , 361 Calories, , , , , , , , , , , , , , , , , Crispy Pasta Snack ( Tiffin Treats) recipe, , , 758 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Semiya Upma": "Ingredients: Semiya Payasam, (sweet vermicelli milk pudding), , Meethi Seviyan, (no milk vermicelli pudding) and, Sheer Khurma, (dates vermicelli dessert)., , How to choose Vermicelli, , You may be surprised to see the Asian grocery stores sell numerous kinds of vermicelli made with different grains. Indian stores usually have rice, wheat, ragi and other kinds of millet semiya. You will look for thick wheat vermicelli, preferably from an Indian brand., , Vermicelli from other Asian countries may not be suitable to make this dish. I use the Bambino or MTR vermicelli as the results are consistent with these brands. Indian wheat semiya is available in roasted and unroasted varieties., , The unroasted kind requires roasting them prior to cooking. To save roasting time you may buy roasted vermicelli and skip the roasting part mentioned in the recipe. However the flavor of pre-roasted semiya is nutty and is completely different., , It is very important to use the right amount of water to avoid a mushy semiya upma. Using the right amount of liquid makes it fluffy, non-sticky and beautiful., , For a quick 25 mins meal, make this dish without any veggies or use frozen veggies as chopping fresh vegetables takes some time. On occasions we have the vegetable semiya upma for a dinner with a spicy seasoned yogurt which I have shared below., , Vegetables like carrots, peas and young green beans go well in this. My mom would usually add a parboiled potato to this. But do not add the raw potato as it takes time to cook., , More breakfast recipes, Soft Idli, Crispy Dosa, Masala dosa, Puffed Poori, , , , , Photo Guide, , How to make Semiya Upma (Stepwise Photos), , Roasting vermicelli & peanuts, , 1. Skip this step if using roasted semiya. Dry roast 1 cup vermicelli (110 grams) on a low to medium flame stirring often until light & slightly golden. Do not brown the vermicelli as the flavor alters. Transfer this to a plate., , , , 2. Pour ½ tablespoon oil to a hot pan. Add 2 to 3 tablespoons peanuts. On a medium heat, roast them until golden and crunchy. Remove to a plate and set aside for garnishing., , , , Tempering, , 3. Pour 1 tablespoon oil to the hot pan or pot. Add, , , ½ teaspoon cumin seeds (jeera), , ¼ teaspoon mustard seeds, , 1 teaspoon chana dal (skinned bengal gram), , 1 teaspoon urad dal (skinned, split black dal), , , , , , , , 5. Then add 1 sprig curry leaves, 1 slit or chopped green chilies and 3 to 4 tbsps chopped onions. (1 small onion), , , , 6. Saute until the onions turn golden or transparent. The add a pinch of hing and 1 teaspoon fine chopped ginger. Saute for 30 to 60 seconds until the ginger turns aromatic., , , , 7. Pour 1½ cups water and add ½ teaspoon salt. Start with 1/3 teaspoon and add more if required. Stir very well and taste test the water after which you can adjust the salt and spice (green chili). The water has to be slightly salty., , Tip: If using thin vermicelli 1 ¼ cup water would be sufficient., , , , 8. Bring the water to a rapid boil on a high heat. Then add all of the vermicelli at one time. I have used store bought roasted vermicelli here., , , , 9. Mix very well. Cook uncovered on a medium heat until the water is completely absorbed and the semiya is cooked through., , , , 10. Cover and turn off the heat. Keep the pot covered for at least 5 to 6 minutes. This step is important and makes your semiya upma fluffy. Sprinkle some coriander leaves and fresh grated coconut if you want., , , , Troubleshooting, , I do not add any extra water. But if your semiya is undercooked, bring 1/4 cup water to a rolling boil in a small pan and sprinkle little by little water and cook. The quantity of water I have mentioned works well with both MTR and Bambino., , , , Garnish semiya upma with roasted peanuts. Squeeze some lemon juice if you like and serve with peanut podi., , , , , Photo Guide, , How To Make Vermicelli Upma With Vegetables, , 1. Roast the vermicelli if required. Set aside. For this recipe you will require 110 grams. Pour half tablespoon oil to a pan and roast the peanuts on a medium heat until golden and crunchy. Remove to a plate and set aside for garnish., , 3. To the same pan, pour 1 tablespoon oil and add –, , , ½ teaspoon cumin seeds, , ¼ teaspoon mustard seeds, , 1 teaspoon urad dal, , 1 teaspoon chana dal, , , , , 4. Fry until the dal turns lightly golden. Add –, , , 1 pinch hing, , 1 sprig curry leaves, , ½ teaspoon chopped ginger(optional), , 1 chopped green chili., , , , , 5. Add 1 small sliced onion and saute until transparent., Optional, – You can also skip the vegetables. Add ¾ cup mixed vegetables – carrots, peas and  french beans. Ensure the veggies are fine chopped otherwise they won’t cook fast. I sprinkle little salt so the veggies release moisture and cook easily., , , , 6. Cover and cook on a low flame till they turn tender and almost cooked. If they don’t cook well, then sprinkle little water and cook., , , , 7. Add salt and pour 1½ cups water. Stir and taste test the water. It has to be slightly salty. If using thin vermicelli 1 ¼ cup water would be sufficient., , , , 8. Bring it to a rolling boil on a high flame., , , , 9. Add the roasted vermicelli. Stir well to prevent lumps., , , , 10. Cook on a medium high flame till all the water is absorbed. By then the semiya should be cooked well. (Troubleshooting tip: If the semiya does not cook well then boil little hot water and pour it here. Read tips below.), , , , 11. Cover and cook on a low flame for 2 to 3 minutes. Turn off and rest for 5 minutes., , , , When the temperature comes down a bit, sprinkle lemon juice and add coriander leaves. Mix and garnish with roasted peanuts or cashews. Serve it hot with, peanut podi, ., , , , This is the semiya upma I made without veggies. It turns out good even without veggies., , Pro Tips, , 1. There are 2 kinds of semiya in the market – roasted & unroasted. If using preroasted vermicelli, you don’t need to roast them again. Otherwise you have to roast them following my step 1 otherwise the dish will turn mushy and sticky., , 2. The quantity of water to use differs for thick and thin variety vermicelli.  I use the thicker bambino semiya which takes 1½ cups water for every cup of semiya. If using thin semiya then it would only need 1¼ cups., , 3. Semiya upma is always made with wheat vermicelli and not with rice vermicelli. If using rice vermicelli, ▢, 1, , cup, , semiya, , (110 grams vermicelli), ▢, 1½, , cups, , water, , for thick semiya (1 cup for thin variety,1¼ cup for instant pot), ▢, ½, , teaspoon, , salt, , (adjust to taste), ▢, 1, , small, , onion, , (3 to 4 tbsps, thinly sliced or chopped), ▢, 1, , green chili, , slit or chopped, ▢, 1, , sprig, , curry leaves, ▢, ½, , teaspoon, , ginger, , chopped finely, ▢, 1½, , tablespoon, , oil, , or ghee, ▢, ¼, , teaspoon, , mustard seeds, ▢, ½, , teaspoon, , cumin seeds, ▢, 1, , teaspoon, , channa dal, , (split bengal gram) (optional), ▢, 1, , teaspoon, , urad dal, , (skinned black gram) (optional), ▢, 1, , pinch, , asafoetida, , (hing) (optional), ▢, 2 to 3, , tablespoon, , peanuts or cashews, , (or both), ▢, 1, , tablespoon, , lemon juice, , (to serve, optional), ▢, ¾, , cup, , mix vegetables, , carrot, peas, green beans – fine chopped, ▢, 2, , tablespoon, , coriander leaves, , chopped, ▢, 2, , tablespoon, , fresh grated coconut, , for garnish,  Instructions: , , Related Recipes, , Upma Recipe, , , Oats Upma Recipe, , , Masala Dosa Recip..., , , Poori Recipe, How..., , , Semiya Payasam Re..., , , Aval Upma (Poha U..., , , , , Recipe Card, , , , , , Semiya Upma Recipe (Vermicelli Upma), , , 5, from, 107, votes, , , , Semiya upma is a simple South Indian Breakfast made with wheat vermicelli, tempering spices, , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 8, minutes, , minutes, Cook Time, 17, minutes, , minutes, Total Time, 25, minutes, , minutes, , Servings, 2, , Author, Swasthi, , , , Preparation, ▢, If using roasted vermicelli, then skip this step. Dry roast semiya uniformly on a medium flame until lightly golden. Keep stirring and fry without browning them. They will turn light when done. Transfer to a plate., How to make Semiya Upma, ▢, Heat oil in a pan. Add peanuts or cashews. Fry them until golden and crunchy. Remove to a plate., ▢, To the same pan add mustard, cumin, chana dal & urad dal . Fry until the dal turn golden and roasted well., ▢, Next add hing, onions, ginger, green chilli and curry leaves.  Fry for about 2 to 3 minutes until the onions turn transparent or light golden., ▢, This step is optional. If using carrot, beans and peas add them now and saute for another 3 mins. Cook covered on a low flame till they turn slightly tender., ▢, Pour water and add salt. Stir and check by tasting the water. It has to be slightly salty. If needed add more salt., ▢, Bring it to a rapid boil on a high heat. Transfer roasted semiya to the pan & stir immediately., ▢, Cook uncovered on a medium flame till all the water is absorbed and the vermicelli is cooked through. Turn off and cover for another 5 to 6 minutes.(Troubleshooting – If you feel the semiya is undercooked then pour little boiling water. You may need about 2 tbsps more), ▢, When the temperature cools down a bit sprinkle some lemon juice & coriander leaves., ▢, Garnish semiya upma with grated coconut (optional), roasted peanuts or cashews. Serve with, peanut podi, or pickle., Instant pot semiya upma, ▢, Follow all the steps on a saute mode. Add semiya and mixed vegetables if using. Pour 1¼ cups water and deglaze., ▢, Secure the IP with the lid and position the steam release handle to sealing. Pressure cook for 1 minute. When the instant pot is done, wait for 2 mins and release the pressure manually., ▢, Remove the steel insert and fluff up with a fork. I keep it covered further for another 5 to 10 mins. Serve semiya upma hot., , , Notes, , Pre-roasted semiya is easily available in Indian grocery stores. I feel the home roasted semiya (from raw) and store bought pre-roasted have a different flavor., , Usually Bambino Semiya takes up to 1½ cups water for 1 cup semiya. MTR pre-roasted requires 1¾ cup water without vegetables. 2 cups if using fresh vegetables (not frozen). This is just an, approximation, and please adjust., , Always keep ¼ cup boiling water ready on the side, if you feel the upma is undercooked, pour that at the last stage., , , , Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Semiya Upma Recipe (Vermicelli Upma), , , Amount Per Serving, , , Calories, 295, , Calories from Fat 117, , , , , % Daily Value*, , , Fat, 13g, 20%, Saturated Fat 2g, 13%, Sodium, 708mg, 31%, Potassium, 391mg, 11%, Carbohydrates, 39g, 13%, Fiber 10g, 42%, Sugar 3g, 3%, Protein, 9g, 18%, , , Vitamin A, 3621IU, 72%, Vitamin C, 44mg, 53%, Calcium, 66mg, 7%, Iron, 3mg, 17%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 7.2K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 107 votes (, 86 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 63, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Rachel, , , , , , April 7, 2025 5:09 am, , , , , , Good semiya upma recipe. Turned out perfect, , , , , , Reply, , , , , , , , , , , MrsYee, , , , , , January 29, 2024 4:39 pm, , , , , , Curious what makes this the perfect “breakfast” dish?  I made it as a side for tandoori chicken. It was amazing!, , , , , , Reply, , , , , , , , , , , GregNoiz, , , , , , January 29, 2024 1:58 am, , , , , , Good guidance here, thank you!, , , , , , Reply, , , , , , , , , , , Sumesh P N, , , , , , October 29, 2023 5:53 am, , , , , , Excellent recipe. Really liked it., , , , , , Reply, , , , , , , , , , , Neetu, , , , , , October 5, 2023 4:58 am, , , , , , I tried it… Came out well.. Thank you 🙂, , , , , , Reply, , , , , , , , , , , Samuel Varghese, , , , , , July 31, 2023 10:22 am, , , , , , Food tastes better when we cook with your Recipes, Keep going, God Bless, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Samuel Varghese, , , , July 31, 2023 10:32 am, , , , , , Thank you so much for the wishes!, , , , , , Reply, , , , , , , , , , , Cynthia, , , , , , November 30, 2022 2:27 pm, , , , , , Excellent recipe., , , , , , Reply, , , , , , , , , , , Radha Ram, , , , , , October 19, 2022 9:50 pm, , , , , , I tried your recipe and it came out very good. If I use 2 cups of Bambino brand vermicelli, how much of water should I use? My husband likes upma with vegetables., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Radha Ram, , , , October 20, 2022 1:16 am, , , , , , Hi Radha,, Start with 3½ cups water. While you cook, if the semiya is still undercooked, pour another ¼ to ½ cup boiling water towards the end & cook further. Hope this helps, , , , , , Reply, , , , , , , , , , , Rose Maryann Peck, , , , , , July 5, 2022 4:56 am, , , , , , Your recipes are simple, easy and turn out delicious.  Always check your recipes before trying something  new. Cheers!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rose Maryann Peck, , , , July 12, 2022 4:29 pm, , , , , , Thank you Rose, , , , , , Reply, , , , , , , , , , , Suneeta, , , , , , December 5, 2021 1:49 am, , , , , , I like your way of making breakfast items. Thus, I always follow you., Thanks for your simplicity., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Suneeta, , , , December 11, 2021 3:28 am, , , , , , Glad to know Suneeta, , , , , , Reply, , , , , , , , , , , Tonya, , , , , , November 26, 2021 4:35 am, , , , , , Hi. I would love if you link down your pot used. Looks pretty., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Tonya, , , , November 27, 2021 5:04 am, , , , , , Hi Tonya, I don’t buy my cookware and tableware online. I buy them from stores in Singapore. So I don’t have the link., , , , , , Reply, , , , , , , , , , , Yvonne, , , , , , November 23, 2021 9:51 am, , , , , , Hi it will be so helpful to show pictures of thick vs thin semiya. Could you please if you see my comment? ❤️, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Yvonne, , , , November 27, 2021 7:53 am, , , , , , Hi,, I have used the thicker one here. Thinner one looks something like I have used in this post (but not the same), seviyan, , , , , , Reply, , , , , , , , , , , , , , Yvonne, , , , , , Reply to, swasthi, , , , November 29, 2021 7:49 am, , , , , , Thanks!!, , , , , , Reply, , , , , , , , , , , Ravi, , , , , , September 30, 2021 4:20 am, , , , , , Nice,good explanation, , , , , , Reply, , , , , , , , , , , Anand, , , , , , July 9, 2021 5:05 am, , , , , , would be great if you could mention measurement in grams for a serving, , , , , , Reply, , , , , , , , , , , shamanth, , , , , , July 7, 2021 6:01 am, , , , , , it remind me of my school days, my grandma used to cook this, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, shamanth, , , , July 8, 2021 3:35 am, , , , , , That’s Awesome!, Thank you, , , , , , Reply, , , , , , , , , , , Shruti, , , , , , May 5, 2021 4:57 pm, , , , , , I used to eat this semiya upma in my office canteen and liked it very much. Since then I was searching for this recipe., Finally I found this. Thanks a lot for this detailed step by step recipe. ?, , , , , , Reply, , , , , , , , , , , Rupal, , , , , , November 28, 2020 3:26 pm, , , , , , Recipe with tips is so useful. Perfect measurements for different type of vermicelli. My kids and mother in law absolutely love this dish. Must try for everyone. Combination of veggies makes it yummier and healthier! Thank you ?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rupal, , , , November 29, 2020 11:22 am, , , , , , Welcome Rupal, Glad to know! Thank you!, , , , , , Reply, , , , , , , , , , , Rajshree, , , , , , May 25, 2020 3:53 am, , , , , , Hi,, Water you have mentioned for thick sevai is too much.. Mine came out sticky., , Regards,, Rajshree, , , , , , Reply, , , , , , , , , , , , , , Winnie, , , , , , Reply to, Rajshree, , , , July 1, 2020 2:30 pm, , , , , , Tried the vegetable semiya upma today. Turned out just perfect. The details of water ratio provided for different types of vermicelli was informative., , , , , , Reply, , , , , , , , , , , Shanthi Sankaran, , , , , , April 21, 2020 7:34 am, , , , , , Very very tasty semiya upma. Thank you Swasti very much. For two and quarter glass of semiya I used two and half glass water. It was proper. Will your other recipes too., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Shanthi Sankaran, , , , April 23, 2020 12:19 pm, , , , , , Hi Shanthi Sankaran, You are welcome!, Glad to know, , , , , , Reply, , , , , , , , , , , S, , , , , , April 6, 2020 1:03 pm, , , , , , You put a good amount of effort and research in your recipes. I liked the little details like different water ratios fir different vermicellis, different cooking techniques and also a separate step by step photo. Most bloggers/authors don’t do that., Kudos!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, S, , , , April 7, 2020 6:14 am, , , , , , Thank you so much!, , , , , , Reply, , , , , , , , , , , Adhidev, , , , , , March 31, 2020 4:14 am, , , , , , Amazing recipe for beginners, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Adhidev, , , , April 1, 2020 2:43 pm, , , , , , Thank you, , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Haryali Dalia": "Ingredients: , , , , , , , , , , , , 1 cup, broken wheat (dalia), , washed and drained, , 1/2 cup finely, chopped mint leaves (phudina), , , 1/2 cup finely, chopped coriander (dhania), , , 1/2 cup finely, chopped dill leaves, (shepu / suva bhaji), , 1 1/2 tbsp, oil, , , 1 tsp, mustard seeds ( rai / sarson), , , 1 tbsp finely, chopped green chillies, , , , salt, to taste, , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Nutrient values, , , , , , , , , , , , , , Start your day with a burst of green! pressure cook a bunch of mint, coriander and dil leaves with broken wheat to create a truly wholesome breakfast in a jiffy. Drink a glass of juice or milkshake and you are good to go!, , , , , , , Tags, , , , , Pressure Cooker, , Indian Pressure Cooker, , Indian Breakfast Recipes, , Breakfast Upma, Poha, , Jain Breakfast, , Healthy Indian Breakfast, , Healthy quick Indian breakfast, , , , , , , , , , , , , , , , , , , , Preparation Time, , 10 Mins, , , , , , , Cooking Time, , 15 Mins, , , , , , , Total Time, , 25 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , , Heat the oil in a pressure cooker and add the mustard seeds., When the seeds crackle, add green chillies and sauté on a medium flame for a few seconds., Add the broken wheat and sauté on a medium flame for 2 to 3 minutes, while stirring continuously., Add 3 cups of hot water, mint leaves, coriander, dill leaves and salt, mix well and pressure cook for 3 whistles., Allow the steam to escape before opening the lid., Serve immediately., , , , , , , , , , , , , , , , Hariyali Dalia recipe with step by step photos, , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 185 cal, Protein, 3.4 g, Carbohydrates, 29.1 g, Fiber, 1 g, Fat, 6.1 g, Cholesterol, 0 mg, Sodium, 3.4 mg, , , , , , , Click here to view, Calories for Hariyali Dalia, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Mruga D, , March 13, 2025, midnight, , I made this dalia...thinking it will be different frm that regular dalia upma and to my surprise...it was delcious...and filling too!! Refreshing flavour of mint and coriander...., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #490462, , March 13, 2025, midnight, , It is very testy & easy to make. Healthy & delicious., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , whole wheat vegetable khichdi recipe | whole wheat dal khichdi | healthy Indian khichdi |, , , 173 Calories, , , , , , , , , , , , , , , , , couscous salad recipe |  Mediterranean couscous salad | healthy Indian style couscous salad |, , , 383 Calories, , , , , , , , , , , , , , , , , whole wheat vegetable bread tart recipe | Indian style vegetable bread tart | savoury whole wheat tart |, , , 16 Calories, , , , , , , , , , , , , , , , , bulgur wheat matki pulao recipe | bulgur wheat vegetable Indian rice | healthy dalia vegetable pulao |, , , 124 Calories, , , , , , , , , , , , , , , , , buckwheat moong and vegetable khichdi recipe | buckwheat vegetable khichdi | healthy kuttu vegetable khichdi |, , , 190 Calories, , , , , , , , , , , , , , , , , bulgur wheat porridge recipe for babies | dalia porridge | broken wheat porridge |, , , 233 Calories, , , , , , , , , , , , , , , , , minty couscous recipe | healthy minty couscous salad | Indian style couscous |, , , 134 Calories, , , , , , , , , , , , , , , , , Buckwheat Dhokla recipe | high fibre buckwheat dhokla | healthy, , , 136 Calories, , , , , , , , , , , , , , , , , Fada Ni Khichadi ( Microwave) recipe, Fada Khichadi Microwave Recipes, , , 232 Calories, , , , , , , , , , , , , , , , , bulgur wheat kheer recipe | dalia payasam | low calorie Indian dessert |, , , 297 Calories, , , , , , , , , , , , , , , , , Bulgur Wheat and Vegetable Khichdi  ( Baby and Toddler) recipe, Baby Recipes | Toddler Recipes, , , 173 Calories, , , , , , , , , , , , , , , , , Stuffed Bulgur and Brinjal Bake recipe, Baked Dishes Recipes, , , 214 Calories, , , , , , , , , , , , , , , , , bulgur wheat pancakes recipe  | dalia chilla | healthy Indian cracked wheat pancakes |, , , 46 Calories, , , , , , , , , , , , , , , , , Bulgur Wheat and Paneer Pulao recipe, Indian Home Remedies Recipes, , , 121 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Bajra Khichu with Masala Dahi": "❌ Error scraping https://www.tarladalal.com/bajra-khichu-with-masala-dahi-41294r: 522 Server Error:  for url: https://www.tarladalal.com/bajra-khichu-with-masala-dahi-41294r"
    }
}