{
    "ingredients": {
        "Baked Medu Wada": "black urad dal,onions",
        "Barnyard Millet Wada": "barnyard millet,potato,green chili,ginger,coconut,cilantro"
    },
    "recipe_url": {
        "Baked Medu Wada": "https://www.onegreenplanet.org/vegan-recipe/baked-vada/",
        "Barnyard Millet Wada": "https://ruchirasoi.weebly.com/barnyard-millet--bhagar-medu-vada.html?fbclid=IwAR3GlWTJTbr5jfcA3y8455Ljh9CPphKVL-oDzy-vTi4NJsVRhkXnnV9eark"
    },
    "Recipe": {
        "Baked Medu Wada": "Ingredients: , , , , , , , , , 10 Government Subsidies and Their Impact on Our Food Choices, the Environment, and Public Health, , , , , , Life, , , , , , , , , , This Beautiful Video Proves a Bad Day Doesn’t Exist When You Adopt a Dog, , , , , , , , , , Who Knew Cows Were This Smart? We Did. (VIDEO), , , , , , , , , , 8 Upcycled Dog Toys to Get Your Dog Thinking, , , , , , , , , , 5 Surprising Products That Are Tested On Animals, , , , , , , , , , 6 Healthy Plant-Based Additions to Enhance Your Pup’s Diet!, , , , , , , , , , 5 Hilariously Silly Videos of Cats Talking to Birds, , , , , , Health, , , , , , , , Must-Have Plant-Based Cookbooks, , , , , , , , , , Nature’s Medicine Cabinet: 5 Healing Pantry Essentials You Need for Instant Relief!, , , , , , , , , , Simple Habits for Your Brain That Help Protect the Planet, , , , , , , , , , Transform Your Gut Health: How an Anti-Inflammatory Plant-Based Diet Can Supercharge Your Microbiome!, , , , , , , , , , These Daily Prebiotics Could Boost Memory According to New Twin Study, , , , , , , , , , 5 Shocking Healthy Foods That Could Be Hurting Your Digestion, , , , , , People, , , , , , , , , , 10 Reasons to Ditch Bottled Water: Health, Environmental, and Economic Concerns, , , , , , , , , , 10 Board Games That Teach Kids Kindness and Empathy, , , , , , , , , , 10 Government Subsidies and Their Impact on Our Food Choices, the Environment, and Public Health, , , , , , , , , , 10 Ways International Trade Agreements Shape Local Food Systems and How You Can Advocate for Change, , , , , , , , , , 8 Ways Air Pollution Contributes to Cancer Development, , , , , , , , , , The Alarming Impact of Pesticides on Bees and Crop Yields, , , , , , Animals, , , , , , , , , , 10 Disturbing Ways Snakes are Exploited and Mistreated by Humans, , , , , , , , , , Research Shows Birds Nesting with 30 Years of Plastic Waste in Amsterdam, , , , , , , , , , Monkeys in Crime: 7 Disturbing Real-Life Cases of Primates Used for Criminal Activities!, , , , , , , , , , The Impact of Climate Change on 13 Insect Pollinators and How That Risks Food Security, , , , , , , , , , 15 Restaurants Caught Serving Endangered Animal Meat, , , , , , , , , , 10 Heartwarming Stories of Rescued Chimpanzees Finding Freedom and Rehabilitation!, , , , , , Video, , , , , , , , , , What This Man Did to Rescue a Finch Whose Feet Were Frozen to a Metal Fence Will Warm Your Heart [Video], , , , , , , , , , Sick Cow Tied to Wall, Standing in His Filth Gets Rescued and Becomes So Playful! [Video], , , , , , , , , , This Abandoned Dog Spent Her Days Running From Cars – Now Look at Her! [Video], , , , , , , , , , See How These Rescued Bears and Elephants Celebrated Christmas! [Video], , , , , , , , , , Dachshund Gives Winter Gardening Help [Video], , , , , , , , , , Bus Driver Reunites Lost Dogs With Family Just in Time for the Holidays! [Video], , , , , , About, , , , Support Us, , , Merchandise, , Contact Us, , Team, , , , , Election T-shirts, , , , Climate T-shirts, , , , Animal T-shirts, , , , Mental Health T-shirts, , , , , , Cookbooks, , , , , , OneGreenPlanet Cookbooks, , , , , , , , , , , , BETTER BURGERS: Make Delicious Nutrient-Rich Burgers Without The Meat, , , , , , , , , SUMMER:  Stunning Plant-Based Recipes to Enjoy All Season When the Sun's Out, , , , , , , , , ALIVE: Nourishing Plant-Based Meals to Fuel Your Body, , , , , , , , , Vegan Recipe App, , , , Adopt-a-Pet, , , , Shop, , , , Product Features, , , , , , , , Petitions, , , , Newsletter, , , , , , OneGreenPlanet Newsletter, , , , , , , , , , , Subscribe, , , , , , , , Get your favorite articles delivered right to your inbox!, , Sign up, for daily news from OneGreenPlanet, , , , , , , , Ad-Free Browsing, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , No products in the cart., , , , , , , , , , , , , , , , , , , , , , , , Toggle navigation, , , , , , , , , OneGreenPlanet, , , , Recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , OneGreenPlanet, , , , , , , [searchandfilter id=\"1481369634\"], , , , Trending, , , , , How to Make All Kinds of Vegan Meatballs, , , , , , Savory Seitan Steak in Beurre Blanc Sauce [Vegan], , , , , , How to Make a Yeast-Free Pizza Crust, , , , , , Tempeh ‘Fish’ N’ Chips with Zesty Tartar Sauce [Vegan], , , , , , Savory Spinach Tofu Gnudi Balls [Vegan], , , , , , Raw Ginger Energy Bites [Vegan], , , , , , , Products, , , , , , Election T-shirts, , , , Ad-Free Browsing, , , , WildWatchers: Adopt-a-Pet, , , , Food Monster: Vegan Recipe App, , , , Petitions: Take Action, , , , Plant-Based Cookbooks, , , , , , , , , Tiny Rescue, , , , , , , Election T-shirts, , , , Climate T-shirts, , , , Animal T-shirts, , , , Mental Health T-shirts, , , , , , , , , , , , Content Categories, , , , , Home, , Recipes, , Food, , News, , Earth, , Life, , Health, , People, , Animals, , Petitions, , Video, , Products Features, , , , , , , Newsletter, , , , , , , , , , , , , , , Support Us, , , , About, , , , , Merchandise, , Contact Us, , Team, , , , , , , , , , , , , , , , , , , , , , , , , , Trending, , , , , , , , , , How to Make All Kinds of Vegan Meatballs, , , , , , Savory Seitan Steak in Beurre Blanc Sauce [Vegan], , , , , , How to Make a Yeast-Free Pizza Crust, , , , , , Tempeh ‘Fish’ N’ Chips with Zesty Tartar Sauce [Vegan], , , , , , Savory Spinach Tofu Gnudi Balls [Vegan], , , , , , Raw Ginger Energy Bites [Vegan], , , , , , 20 Recipes So Good No One Will Have to Tell You to Eat Your Spinach, , , , , , Chocolate Banana Coconut Cheesecake with a Crunchy Graham Cracker Crust [Vegan], , , , , , 5 Foods to Eat to Prevent and Treat Dry Skin, , , , , , , , , , , , ×, , [searchandfilter id=\"1481369634\"], , , , , , , Vegan Recipe App, , T-Shirts for Activists, , Newsletter, , Ad-Free Browsing, , Cookbooks, , Petitions, , Product Features, , , Adopt-a-Pet, , , , , , Get thousands of vegan, allergy-friendly recipes in the palm of your hands today!, , X, , , , , , , , , , , , Get your favorite articles delivered right to your inbox!, , X, , , , , , , , , , , , , , , , , , , , , , , Indian Fritters: Baked Vada, [Vegan, Gluten-Free], , , 12.7K Views, , 4 weeks ago, , , , By Tina Dawson, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Image Credit :, Tina Dawson, , , , http://Tina Dawson, , , , , , , , , Indian Fritters: Baked Vada [Vegan, Gluten-Free], , 12.7K Views, , 4 weeks ago, , , , , , , , , , , , , , , , Add-Free Browsing, , , , , , , , , , Subscribe to Newsletter, , , , , , , , , , FoodMonster App, , , , , , , , , , Support Us, , , , , , , , , , Buy our Cookbooks, , , , , , , , , , Sign Our Petitions, , , , , , , , , , , , , , , , , , , , , , , , , Help keep One Green Planet free and independent! Together we can ensure our platform remains a hub for empowering ideas committed to fighting for a sustainable, healthy, and compassionate world. Please support us in keeping our mission strong., , , , , Pay, , , , , , , Pay $49.99/Year + Go Ad-Free!, , , , , , , , , There is no South Indian celebration that doesn’t feature vada and now you can enjoy them baked, not fried, for a lighter option. These baked vada are crispy, crunchy, and delicious. Plus, backing your vada makes the clean up much easier and the dish much healthier., , Indian Fritters: Baked Vada [Vegan, Gluten-Free], , , , , Dairy Free, , Gluten-free Recipes, , High Carb Vegan, , Vegan, , Wheat Free, , , , , , , , , Gluten-Free], , , , , 1 cup black lentils or urad dal, , Water, to soak the dal, , 1-inch piece of ginger, , 4 green chilis, , 5 -7 large ice cubes, , Salt, to taste, , 3/4 cup onions, chopped, , A handful of fresh coriander, chopped, , 1 sprig of curry leaves, , 1/2 teaspoon baking powder, , 1/2 teaspoon baking soda, , Oil, for brushing, , , , , , How to Prepare Indian Fritters: Baked Vada [Vegan, Gluten-Free], , , How to Make the Dough, , , Completely submerge the dal in water and soak them for 30 minutes., , Drain most of the water but leave about 1/8 cup in the pot with the dal., , Add ginger, green chilis, and salt to the dal., , Grind the mixture into a smooth paste while adding a few ice cubes at a time. Do this until you get a thick batter with no lumps., , Add the chopped onion, coriander, baking soda and baking powder., , Salt the dish to your liking., , , How to Bake the Vada:, , , Preheat oven to 450°F., , Brush the oil generously into the doughnut tray. It's ok if it puddles at the base., , Spoon the batter into the doughnut pan., , Dribble more oil on the top and smooth down the batter. Make sure the entire top surface is coated in oil.\r\nBake at 450°F for 12 minutes., , Remove from oven, flip the vadas in the pan and continue baking for 10 more minutes., , After you're finished, transfer the vadas to a wire rack immediately and let cool slightly before serving with a side of coconut chutney and sambar., , , , , , Notes, , , You will need a doughnut tray.\r\n\r\nTo reheat your vadas, bake them at 450°F for 5-8 minutes or until crispy again., , , , , , , Report Recipe Issue, , Please report any concerns about this recipe below!, , , , , Report an issue :, , , , , , , , , , , , , , , , Is there an issue with this recipe?, , Report an Issue, , , , , , Black / Beluga Lentil, , Lentil, , , Nutritional Information, , Total Calories: 785 | Total Carbs: 145 g | Total Fat: 2 g | Total Protein: 56 g | Total Sodium: 2574 g | Total Sugar: 9 g\r\n\r\nCalculation not including salt to taste or oil for brushing., , , , , , , , , , , , , , , , About The Author, , , Tina Dawson, , , , , , , , , , , , See My Recipes, , , Exotic and everyday foods with an Indian twist., , Tina Dawson is a food blogger, food stylist, and food photographer from India who loves adding an Indian twist to recipes from around the world. She loves to bake and spends every waking minute scouring the world for interesting and delicious things to eat. Her blog, Love Is In My Tummy, is a catalog of recipes featuring both exotic and everyday foods and culinary travel stories, , , , , , , , Comments, , , , , , , , , , Pearl Braganza, , says:, , , , December 4, 2016 at 9:32 am, , , , , Mandy Kaur, , , , , , , , , , Cory Sly, , says:, , , , December 4, 2016 at 1:41 am, , , , , Lathia Adams, , , , , , , , , , Stephanie Loa, , says:, , , , December 3, 2016 at 11:54 pm, , , , , Prabvi GuaLoa, , , , , , Load More..., , , , Comments are closed., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , One Green Planet, , , , , , , , , , , , , , , , , , , , , , , , Instructions: ",
        "Barnyard Millet Wada": "Ingredients: 3/4 cup Barnyard Millet / Bhagar / Moraiyo, 2 -3 medium size Potato boiled and peeled, Salt as per taste, 1/2 tsp jeera/cumin seeds, 2-3 green chilly finely chopped ( can increase the green chilly if you like spicy ), 1/2 inch ginger crushed, 1 tbsp dessictaed / grated coconut ( optional ), 1 tbsp finely chopped Cilantro leaves ( can also use spinach or mint leaves as per taste preference ), Avacado oil spray or 1 tbsp of any other cooking oil Instructions: Wash and cook the bhagar/millet on low flame in a pan covered with a lid. Add 2 cups water to the bhagar/millet, add salt as per taste and then cover with a lid, cook on low flame until done. Takes about 7-8 minutes. Stir once in between and also check, it can stick to the base and burn, so be extra careful., Alternatively can cook in Instant pot high pressure 4 minutes, no pressure release. Or in a pressure cooker for 1 whistle and natural pressure release., Boil the potatoes, peel and mash them nicely. Boil in a pressure cooker for 2 whistles, or in an instant pot high pressure 6-7 minutes., In a mixing bowl add in the mashed potatoes, cooked bhagar, green chilly, coconut, ginger and cilantro leaves, jeera and salt as per taste if needed, do a taste test then add, as needed. Mix all this nicely, it should form a tight dough ( not too soft, if its soft the Vadas will break and loose the shape )., Grease palms with oil, then scoop out a big spoonful of the mix and shape like a donut or a medu vada ( Roll between palms, then flatten it and make a hole in the center ), make all similarly and keep ready. If you want can just make round shaped koftas and also airfry and enjoy., Preheat the Airfryer for 5 minutes, then line the airfryer basket with a perforated parchment paper and then place the prepared Vadas on it, nicely spaced from one another for even and uniform cooking/airfrying. Spray the Vadas with avacado oil spray, but if using oil with a brush for applying then let the Vadas cook halfway then apply oil and flip. Airfry at 375 F for 10 minutes, then increase the temperature to 400 F and set the time to 16 minutes. Flip halfway, and be very careful when flipping, if its coming off easily that means its properly cooked and hence can be flipped easily. But in case its still soggy and not taken a hold shape then don't force pick, it will dislodge the shape, in that case wait for another 2-3 minutes before flipping., Once done, look for the crispy light brownish tinged Vadas. The cook time may be plus or minus 2-3 minutes as it depends on various factors the size and thickness of the vada, total count and also type of the airfryer., Enjoy these with Coconut chutney ( As I made for Navratri fasting so I just used 3 tbsp coconut, 5 green chilly, 1/2 inch ginger, 1 tbsp cilantro leaves and 2 tbsp peanuts, salt as per taste and 1/2 tsp of jeera seeds, blend this till smooth )., If making on a regular day, no fasting day, then enjoy with your favorite chutney and sambhar., Alternatively you can also bake in a regular oven, at 425 F for about 30-35 minutes, flip halfway., And if want to deep fry, then can be deep fried too., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Powered by, , , Create your own unique website with customizable templates., , , Get Started, , , , , , , , , , , , , , , , , Home, , , , Festival Specials, , , , Breakfast, , , , Flat Breads, , , , Indian Curries, , , , Rice Recipes, , , , Regional Dishes, , , , No Onion Garlic Recipes, , , , Soups and Salads, , , , Fusion Recipes, , , , Fasting Recipes, , , , Instant Pot Recipes, , , , Air Fryer Recipes, , , , Snacks/Appetizers, , , , Chutney/Sauce/Dips, , , , Dessert, , , , Refreshing Drinks, , , , Contact, , , , , , , , , , , , , , ,"
    }
}