{
    "ingredients": {
        "Chinese brocolli with garlic sauce": "chinese broccoli, garlic cloves, coconut aminos, toasted sesames",
        "Chinese eggplant with schechuan sauce": "japanese eggplant, cornstarch, peanut oil, garlic, ginger, dried red chillies, szechuan peppercorns, soy sauce, garlic chilli paste, rice vinegar, mirin, sugar, five spice",
        "Vegan general Tso Tofu": "tofu, garlic, soy sauce, vinegar, ginger powder, sugar, white vinegar, cornstarch, rice, steamed veggies",
        "Vegan Tofu Katsu Curry": "sesame oil, onion,garlic,ginger,red chilli,tomato paste,carrots,sweet potato,coconut milk,curry paste,bay leaves,mirin,soy sauce,breadcrumbs,onion powder,flour, firm tofu",
        "Vegan Butter Lentils and Potatoes": "vegan butter,potatoes,brown lentils,garlic,ginger,tomato sauce,shallots,tomato sauce,veg broth,coconut milk,garam masala,cinnamon,cloves,cardamom",
        "Vegan Panang Curry Tofu": "onion,garlic,carrots,zucchini,red bell pepper,curry powder,tomato paste,veg broth,coconut milk,maple syrup,peanut butter,firm tofu",
        "Peanut Tofu with coconut rice": "firm tofu,soy sauce,corn starch,coconut milk,white rice,peanut butter,maple syrup,ginger,garlic,lime juice"
    },
    "recipe_url": {
        "Chinese brocolli with garlic sauce": "https://iheartumami.com/easy-chinese-broccoli-stir-fry/",
        "Chinese eggplant with schechuan sauce": "https://www.feastingathome.com/chinese-eggplant/",
        "Vegan general Tso Tofu": "https://instantveg.com/vegan-general-tso-tofu-recipe/",
        "Vegan Tofu Katsu Curry": "https://www.pinterest.co.uk/pin/496592296425526936/",
        "Vegan Butter Lentils and Potatoes": "https://www.rabbitandwolves.com/vegan-butter-lentils-potatoes/#recipe",
        "Vegan Panang Curry Tofu": "https://runningonrealfood.com/vegan-panang-curry-tofu/#tasty-recipes-16383",
        "Peanut Tofu with coconut rice": "https://www.noracooks.com/peanut-buddha-bowl/#wprm-recipe-container-2431"
    },
    "Recipe": {
        "Chinese brocolli with garlic sauce": "Ingredients: , Save This Recipe, Enter your email and get it sent to your inbox (+ new recipes, too)!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Save Recipe, , , What Is Chinese Broccoli, , Also known as Gai Lan or Kai Lan,, Chinese broccoli is a member of, Brassica oleracea plant, , hence it’s rich in antioxidants and vitamin K, which provides many health benefits against chronic and Alzheimer disease. (, source, )., , It’s a leafy vegetable with thick and round shape stems and flat, wide, and deep emerald green leaves., , If there are flower bulbs, the colors are in white-yellow blossoms. Typically you will want to, avoid selecting Chinese broccoli with flower blossoms, as it indicates the vegetables are more mature and less tender., , The flavor tastes similar to broccolini but slightly more bitter, . It’s often cooked 2 ways in Chinese cooking – hot water blanch or a quick stir-fry. Learn more about a wide variety of, Chinese Vegetables, here., , How to choose and prepare kai lan, , To select, , Look at the vegetable. There should be, no bruises and mushy spots, and the color should be in, deep emerald green color, ., Look at the bottom of the stems. They should feel, firm and crisp, . If the bottom looks dry, it’s okay to trim them away. Occasionally, you’ll see super fresh ones that look, tender and crispy, , and they don’t require trimming., , To trim and prepare, , If the stems require trimming, slice away 1/2 to 1-inch from the bottom. Make another cut to separate the stems from the leaves. This is because the stems take longer time to cook then leafy parts., , To cook, , Hot water blanch or Quick saute, , You can hot water blanch and drizzle with, vegetarian oyster sauce, like my, Chinese broccoli in oyster sauce recipe, or stir-fry with a light garlic soy sauce., , Is Chinese broccoli the same as broccolini?, , No they are not the same. However, they are from the same vegetable family – Brassica oleracea., Broccolini is a hybrid between broccoli and gai lan so it’s a great substitute if you can’t find kai lan, ., , What part of Chinese broccoli do you eat?, , All parts of Chinese broccoli are edible. Before cooking, trim off the bottom end roughly half to one-inch. For thicker stems, you can dice them or slice on diagonal. The stems require longer cook time than the leafy parts so saute the stems first., , Can you eat gai lan raw?, , You can but it’s rare to see people eat them raw in Asia. This vegetable tastes more tender and the color turns into deep glossy green after cooked., , Can you eat gai lan flower bulbs?, , Yes you can. Gai lan with flower bulbs often indicates that the vegetable is more mature and tastes less tender and crisp however it doesn’t mean that the vegetable is un-edible. It simply means you will want to consume it soon., , Is Bok Choy Chinese broccoli?, , No. Bok Choy is different from Chinese broccoli. Although both vegetables are considered Chinese vegetables, they have different texture and taste.  Bok choy can be served raw and chopped in salads whereas Gai Lan is often serve cooked., , Also check out my, Bok choy dim sum, , , Blanched Bok choy salad, , , Chopped bok choy salad, with gluten-free chow mein noodles., , More ways to use Chinese Broccoli and Asian vegetables in recipes, , Chinese broccoli in oyster sauce, (vegetarian oyster sauce), Beef with Chinese Broccoli Gai Lan, Thai chicken fried rice with gai lan, Chinese mustard greens, in ginger sauce, Snow pea leaves stir-fry, in garlic sauce, Daikon radish stew recipe, with chicken, Daikon dumplings, , On a mobile? Check out my, recipe web stories, on how to make this dish!, , Recipes to pair with Chinese Broccoli, , Check out my, Crispy lemon thyme chicken thighs, , , Chinese Zucchini and Olive Stir-Fry, , , Paleo Sweet and Sour Chicken, , , Paleo Beef With Broccoli, , , Instant Pot Taiwanese Meat Sauce with crispy shallots, , , Whole30 Mongolian Beef, , , Chicken and Broccoli, , Shrimp and Broccoli,, , Chinese broccoli with oyster sauce, , , Vietnamese garlic shrimp, , , Chinese shrimp tomato stir-fry,, and, Thai Basil Beef Steak Stir Fry, ., , Recipe Card, , , , Chinese Broccoli Stir-Fry Recipe with Garlic Sauce (炒芥籣, gluten-free), , 5, from, 38, votes, , By, ChihYu Smith, , Prep:, 10, minutes, , mins, Cook:, 10, minutes, , mins, Total:, 20, minutes, , mins, Servings:, 6, , people, , Chinese Broccoli (gai lan) stir-fry recipe with garlicky sauce is gluten-free, vegan, low carb. Learn how to make stir-fried Chinese broccoli easy and great tasting!, , , , , , Pin, , , , , , , Print, , , , , Rate, , , , , , Video, , Save This Recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save, , , 1x, 2x, 3x, ▢, 3 to 4, , lbs, , Chinese broccoli, , about 6-8 tightly packed cups (alt. Broccolini, see notes), ▢, 2, , tbsp, , avocado oil, ▢, 2, , tsp, , grated garlic cloves, ▢, 1/2, , tsp, , coarse sea salt, , divided, ▢, 1-2, , tsp, , toasted sesame oil, , garnish, ▢, 1, , tbsp, , coconut aminos, , garnish, , Cook Mode, Prevent your screen from going dark,  Instructions: , , Air Fryer, , Grilling, , Instant Pot, , Meal Prep, , Oven, , Slow Cooker, , Stir Fry, , Stove Top, , , , By Diet, , , AIP, , Gluten-Free, , Keto, , Net Carbs, , No Added Sugar, , Paleo, , Pescatarian, , Vegan, , Vegetarian, , Whole30, , , , By Holiday, , , Chinese New Year, , Spring, , Summer, , Easter, , Christmas, , Thanksgiving, , , , How To & Guides, , , , About, , Cookbook, , Shop, , Members, , Search, , , Home, , ›, , Recipe Index, , ›, , Course, , ›, , Side Dishes, Chinese Broccoli Stir Fry with Garlic Sauce (炒芥籣), By, ChihYu, 5, from, 38, votes, on  Sep 19, 2018, Updated Oct 04, 2022, Jump to Recipe, Jump to Video, This post may contain affiliate links. Please read our, disclosure policy, ., , , Chinese Broccoli stir fry (gai lan or kai lan) with garlicky sauce, tastes light, fresh, and garlicky delicious! And you know it’s super healthy for you because it’s dark leafy greens. My simple stir-fried Chinese broccoli recipe is, vegan, , , gluten-free, , , paleo, , and, low carb, ! You can substitute broccolini for Chinese kai lan, using the same recipe! I’ve simplified the traditional kai lan stir-fry recipe so let me show you how to make it at home easily!, , Looking for more ways to enjoy this delicious Chinese vegetable? my, Chinese broccoli in oyster sauce, is another fantastic choice!, , Delicious Chinese broccoli stir-fry with a simple “soy-flavored” garlic sauce., , Table of Contents, Easy Chinese Broccoli Stir Fry Recipe, What Is Chinese Broccoli, How to choose and prepare kai lan, To select, To trim and prepare, To cook, How to stir fry Chinese Broccoli, Simple garlicky sauce – 2 ways (gluten-free), Gluten-free, Easy, No MSG, Common Questions About Gai Lan, What is broccoli in Chinese called?, Where to find or buy Chinese Broccoli?, Is Chinese broccoli the same as broccolini?, What part of Chinese broccoli do you eat?, Can you eat gai lan raw?, Can you eat gai lan flower bulbs?, Is Bok Choy Chinese broccoli?, More ways to use Chinese Broccoli and Asian vegetables in recipes, Recipes to pair with Chinese Broccoli, Chinese Broccoli Stir-Fry Recipe with Garlic Sauce (炒芥籣, gluten-free), , Easy Chinese Broccoli Stir Fry Recipe, , Gai Lan (or Kai Lan) 芥蘭 is probably one of my favorite vegetables out of many Asian greens. Growing up in a Chinese/Taiwanese household, whenever mom prepares gai lan, it is always the first dish that everyone fights to have the first bite and it always gone in minutes!, , This dish tastes, garlicky, light, fresh, and savory, and it pairs well with any, savory main dishes, ., If you are sensitive to gluten, wheat, or soy, this recipe is particularly written for you!, If, however, you are okay with regular soy sauce and a bit of sugar, I’ve included notes in my recipe so everyone can enjoy this delicious vegetable., , New to gai lan and not quite sure what to do?, In this post, I’ll share my simple and easy tips to help you prepare this vegetable fast and that tastes amazingly tender. So let’s get started!, , ., , How to stir fry Chinese Broccoli, , , 1. Hot water blanch and shock in cold water, or, , 2. Sauté directly without blanching, , The, (before stir-frying) helps remove bitter taste. Sauté directly without blanching, is faster but if this is your first time trying gai lan and not used to the bitter flavor, I recommend blanching the vegetable first., , , Simple garlicky sauce – 2 ways (gluten-free), , Asian greens, . How amazing, right?, , , Thin slice the garlic cloves and sauté them with oil to make a fragrant garlicky oil first then add the vegetable., , , If using crushed or grated garlic cloves, you will add the garlic after sauteing the broccoli stems and before adding the leafy parts., , , , Gluten-free, Easy, No MSG, , To people who are sensitive to gluten, wheat, or soy, you’ll notice that my recipes are tailored to your needs. I use coconut aminos to replace soy sauce. Coconut aminos, (Product link in my recipe card), is made with sea salt and coconut blossom. It tastes salty, naturally sweet, and umami-rich. It’s a wonderful bottle of seasoning if you love Asian food as much as I do and want to cut back on added sugar in your diet. Please note that, Coconut aminos is different from Bragg’s Liquid Aminos, . Although the names sound similar, the ingredient components are very different. They also taste different. Check out, my Youtube video to learn more about coconut aminos, . And my, Asian-Inspired Paleo Pantry Guide, , , Want more of my simple and super delicious Asian-inspired Paleo, Whole30 and Keto recipes? Be sure to, subscribe to my blog to, make 10 healthy meals in under 10 minutes each, ., , Common Questions About Gai Lan, , What is broccoli in Chinese called?, , Broccoli in Chinese is called Gai Lan or Kai Lan. The traditional Mandarin character is, 芥蘭, [Jiè lán]., , Where to find or buy Chinese Broccoli?, , You can find them in most local Asian grocery stores. H-mart, a Korean chain grocery stores, Japanese or Chinese grocery stores. If you live in NYC, NJ, or Long Island, , Asian Veggies, , an online wholesale vegetable shop, can deliver Asian vegetables, seasonings, Cut off the bottom of Chinese broccoli bottom stems (about 1-inch) and discard. Make another cut to separate stems from leafy parts.  Slice the stems on diagonal to roughly 2 to 2-½ inch length. Cut the leafy parts in half. Wash and rinse the stems and leafy parts separately. Set them aside to drain in separate bowls., In a well heated large skillet (or wok), add 2 tbsp cooking oil. Statue the stems over medium-high heat until they turn bright green color (about 2 minutes). Season with ¼ tsp coarse salt. Add grated garlic and use a wooden spoon to break and coat the garlic over the vegetables., Add leafy parts. Quickly toss and scoop the stems and garlic over the leaves. Cover with a lid. Lower the heat to medium. Cook for about 3 minutes until the leaves turn dark green color. Season with ¼ tsp coarse salt. Give a quick toss. Off heat, transfer to a large plate., Season with toasted sesame oil and coconut aminos. Serve hot or cold., , Notes, What’s a good substitute for Chinese Broccoli:, , , You can substitute broccolini for Chinese broccoli., , , How to remove the bitter taste from Chinese Broccoli:, , , after dice and rinse the vegetable, quickly blanch the stems in hot boiling water for 1 minute and leafy parts for 10-15 seconds then shock the vegetable in cold water to stop cooking. Drain well before sauteing., , , Using soy sauce or Tamari?, , , Coconut aminos tastes naturally sweeter and less salty than tamari and soy sauce so it’s a great way to not having to use added sugar. If, however, you use soy sauce (or Tamari), start with 1/2 tbsp soy sauce + 1/4 tsp sugar. Combine well and drizzle it on top of the vegetable., , , What about rice wine?, , , You can add a small splash of rice wine (michu) or Chinese Shaoxing wine when stir-frying, if you are okay with a bit alcohol. The dish will taste even more authentic., , , The nutritional label is for 1 serving, calculated out of 3 lbs vegetable total and divided by 6., , Nutrition, Serving:, 1, serving, , , Calories:, 86, kcal, , , Carbohydrates:, 4, g, , , Protein:, 1, g, , , Fat:, 7, g, , , Polyunsaturated Fat:, 1, g, , , Monounsaturated Fat:, 1, g, , , Sodium:, 148, mg, , , Potassium:, 236, mg, , , Fiber:, 2, g, , , Vitamin A:, 1450, IU, , , Vitamin C:, 34.3, mg, , , Calcium:, 71, mg, , , Iron:, 0.5, mg, Nutrition information is automatically calculated, so should only be used as an approximation., , , , Like this recipe? Leave a comment below!, , , , You may also like, , Side Dishes, Taiwanese Pickled Daikon, Appetizers, Soy sauce eggs, Main Course, Braised tofu (Hong Shao Dou Fu), Side Dishes, Bean sprouts stir fry, , , , , Delicious healthy Chinese food you can brag about, , 10 Meals In 10 Minutes, Learn how to make low carb gluten-free dishes without prep and last minute trips to the grocery store., Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Get my top secret formula », , , , , , 5 from 38 votes (, 3 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 51 Comments, , , , , , Brooke Ashley, , says:, , , , May 6, 2024 at 1:20 PM, , , , , Yum!, , , , , , , , , , Gina Little, , says:, , , , August 20, 2023 at 5:25 PM, , , , , This is DELICIOUS and am soaking the mushrooms now to make your oyster-free oyster sauce. Husband gets gout flares and oysters are high in purines so we need to avoid those (in animal proteins, anyway) but he LOVES all Asian food, so we are navigating this challenge by finding recipes that are Asian but avoid the stuff he can’t have (fish sauce shrimp paste). It’s definitely a challenge but we’re committed to the task! Thank you for this and other recipes., , , , , , , , , , ChihYu, , says:, , , , August 22, 2023 at 11:49 AM, , , , , You are welcome! Please feel free to browse., , , , , , , , , , , , Mau, , says:, , , , May 23, 2023 at 9:17 PM, , , , , Thank you! This recipe is simple and delicious!, , , , , , , , , , Mau, , says:, , , , May 23, 2023 at 9:20 PM, , , , , Thank you! This recipe is simple and delicious!, , , , , , , , , , ChihYu, , says:, , , , May 26, 2023 at 8:46 AM, , , , , Thanks so much!, , , , , , , , , , , , joan, , says:, , , , January 17, 2023 at 2:12 AM, , , , , , , , , , Comment navigation, Older Comments, , , Hi, I'm ChihYu Smith, , Welcome to, I Heart Umami!, I’m ChihYu—a concert pianist turned best-selling cookbook author. Here, you’ll find easy, flavor-packed Asian dinners that are healthy and gluten-free. Get ready for vibrant flavors and satisfying meals in the kitchen!, , , More About Me, , , , , , , , Follow me on social:, , , , , , , , , Readers Favorites, , Main Course, Chicken Cabbage Stir Fry, Main Course, Frozen Salmon In Air Fryer, Appetizers, Rice Paper Dumplings Recipe (pan sear or air fry), Soup, Easy Bok Choy Soup Recipe (Vegetarian, Vegan), , , , , Get healthy, bold-flavored recipes for, free, weekly, , Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Send them to me, , , , , Seasonal Favorites, , Appetizers, Rice paper egg rolls, Soup, Chinese Hot and Sour Chicken Soup (酸辣湯), Main Course, Chinese Lion’s Head Meatballs With Cabbage Stew (Shi Zi Tou, 獅子頭), Side Dishes, Roasted Bok Choy, As Seen In:, Back to top, I Heart Umami®, , , , , ©2025 I Heart Umami®. All rights reserved., , Privacy Policy, •, Terms and Conditions, •, Accessibility Statement, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Chinese eggplant with schechuan sauce": "Ingredients: , , , How to make Chinese Eggplant:, , STEP ONE, –, It starts with cutting the eggplant into bite-sized pieces., Cut at a diagonal so each piece is like a triangle, about an inch thick at its thickest end. Try to get get them roughly the same size for even cooking. Cut a wedge then turn the eggplant, cut again and turn., , , , , , Tip:, This works best with Japanese eggplant ( long and skinny) versus globe eggplant., , , , , , STEP TWO, – Once all the eggplant are cut ( 4 x 10-inch eggplants), place in a bowl of salted water for 20 minutes. Cover with a plate so the eggplant is submerged. Let sit 20-30 mins., , TIP:, , Salting the eggplant helps the eggplant soak up less oil when stir-frying., , , STEP THREE- Mise en place ( get things prepped and ready), . While the eggplant soaks, prep the garlic, ginger and Szechuan sauce and place them by the stove., , , , , , STEP FOUR, – Drain the eggplant, rinse, then pat dry with a, kitchen towel, . Then coat in cornstarch. This helps the eggplant get crispy., , , , , , STEP FIVE, – Sear the eggplant over medium high heat in an, extra-large flat skillet,, versus a round wok. The eggplant need a little time to cook through and get each side brown. It is much easier to do this in a flat skillet., , Sear each side of the eggplant pieces. Fry in two batches, and this is where you will need a little patience. Each batch will take about 10 minutes, and require to turn the eggplant over one by one to get each side golden. When the eggplant pieces are deeply golden, even slightly charred, set them aside., , , , , , STEP SIX, – Stir fry the ginger and garlic for a quick minute then add the chilies. Make sure to have your fan on! (Keep in mind, , you never eat these chilies, – they just give the oil a little spicy heat, permeating the whole dish.), , Pour in the prepped Szechuan sauce. Cook it for 20 seconds then add the Eggplant back into the skillet, gently coating. This will smell and taste amazing!, , What To Serve With Chinese Eggplant, Peanut Chili Crunch (Seroendeng), How to Make Perfect Jasmine Rice, Forbidden Black Rice: Incredible Benefits & Easy Recipes, How to Make Cauliflower Rice!, , TO SERVE-, Place the fragrant eggplant in a, serving dish, , or divide among bowls over, Jasmine rice, , brown rice, , black rice, or quinoa and top with green onions or chives and roasted peanuts., , , , Chinese Eggplant FAQS, , Can you eat the skin of eggplant?, , Yes the skin is completely edible and has a lot of nutrients., , , What is the difference between Chinese eggplant and regular eggplant?, , Chinese eggplant is thin and long with fewer seeds which makes it less bitter and some say it is slightly sweet. The plants tend to be prolific producers., The most common eggplant is globe eggplant it is bigger and fleshier., , , What is Szechuan in Chinese cooking?, , Coming from the Sichuan Provence in Southwestern China, Szechuan peppercorns, ginger, scallions, garlic, soy sauce, 5-spice, sesame oil, Shaoxing wine, to name a few., , , What is Chinese Eggplant Called?, , Chinese Eggplant is called, Oriental Charm or Pingtung Long, . Long and skinny with with fewer seeds they are less bitter and will hold its shape when cooked in stir fries., , , , , , Make this Chinese Eggplant soon, while eggplants are still available at your farmer’s market! Enjoy!, , xoxo, Sylvia, , More Recipes You May Enjoy, Szechuan Tofu (Kung Pao Tofu), Szechuan Salmon with Scallion Green Beans, Sheet-Pan Szechuan Chicken, Authentic Szechuan Sauce, , , Szechuan Asparagus with Garlic, Ginger and Chilies, , Kung Pao Noodles!, , Chinese Five Spice, , Moo Shu Tofu, , , Love this recipe, ? Please let us know in the comments and leave a 5-star ⭐️⭐️⭐️⭐️⭐️ rating below the recipe card., , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram, icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , , Szechuan Eggplant, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 4.9, from, 175, reviews, , , , , , , Author:, , Sylvia Fountaine, , , Prep Time:, , 20, , , Cook Time:, , 25, , , Total Time:, , 45 minutes, , , Yield:, , 4, , , Category:, , Main, vegan, , , , , Copy to clipboard, , Copy to clipboard, , , , , , , , Units, , US, M, , , , , , , 1 1/2, , lbs, Japanese Eggplant  (about 4 x 10 inch eggplants), , 2 teaspoons, salt, , bowl of water, , —-, , 2 tablespoons, cornstarch, , 2, –, 4, tablespoons peanut oil ( or wok oil), , —, , 4, cloves garlic, rough chopped, , 2 teaspoons, ginger, finely minced, , 5, –, 10, dried red chilies, , , Szechuan Sauce, :, , , 1 teaspoon, , Szechuan peppercorns, ( or sub regular peppercorns), , 1/4, , cup, soy sauce or low sodium soy sauce, , 1 tablespoon, garlic chili paste ( or sub, 1 teaspoon, chili flakes), , 1 tablespoon, sesame oil, , 1 tablespoon, rice vinegar, , 1 tablespoon, , Chinese cooking wine, (or, mirin, ), , 3 tablespoons, sugar, brown sugar, coconut sugar, maple syrup  or alternative, , 1/2 teaspoon, , five spice, , , Garnish with scallions and roasted peanuts or, Peanut Chili crunch, , , , , , , , , , chili paste, sesame oil, rice vinegar, Chinese cooking wine, sugar, and, five spice, ) in a small bowl and whisk. Set by the stove., , Drain and rinse the eggplant and pat dry with a towel. Toss with the corn starch., , Working in 2 batches,, heat 1 -2 tablespoons oil in an extra-large skillet over medium heat. Add half the eggplant spreading them out. You want to get both sides nice and golden, and the insides cooked through -so take your time here and dont rush this step. Let one side brown then turn them over using tongs. This will take about 10 minutes for each batch.  ( If in a hurry sometimes I’ll use 2 pans.) Set the eggplant aside., , Add 1 more tablespoon oil to the skillet, and over medium heat, add the garlic and ginger, stirring for 2 minutes. Turn the fan on, add the dried chilis and stir one minute., , Pour the Szechuan sauce into the pan and bring to a simmer for, 20 seconds., Add the eggplant back into the skillet, tossing gently for about 30 seconds., Don’t over-reduce, or it will get salty., If it seems dry, add a tablespoon of water to loosen., , Place in a, serving dish, and top with scallions and optional peanuts., , Serve with rice, , cauliflower rice, , , black rice, or rice noodles., , , , , , , Notes, , , Be patient browning each side of the eggplant. This will take a little time but reward you greatly., , I’ve found that the flat surface of a skillet, verses using a wok is much easier to use to get those sides golden., , Feel free to sub cashews for the peanuts, of leave off completely., , , , , Nutrition, , , Serving Size:, , , Calories:, , 323, , Sugar:, , 17.8 g, , Sodium:, , 1110.4 mg, , Fat:, , 21.8 g, , Saturated Fat:, , 3.5 g, , Carbohydrates:, , 29.6 g, , Fiber:, , 7.4 g, , Protein:, , 5.9 g, , Cholesterol:, , 0 mg, , , , , , , , Remember to Rate the recipe! ⭐️⭐️⭐️⭐️⭐️, , Support the blog, by simply rating the recipe. Share your comments, recipe adaptions, suggestions, and questions below, our readers love it, and we’ll personally respond within 24 hours., , , , , , , , Share this with the world!, Facebook, Pin, Email, , Subscribe, to get recipes via email, Please enable JavaScript in your browser to complete this form., First Name, *, Email Address, *, Sign Up, , , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, , , Email, , , , Notify me of follow-up comments by email., , , , Δ, , , Comments, , , , , , , Lisa, , says:, , , , August 13, 2024 at 6:34 pm, , , , , This recipe was amazing!! We had “fairy tale” eggplants in the garden, which are the variety I used.  I added asparagus, because they looked lonely in the fridge.  The sauce was so good!  We were in eggplant heaven!!, , , , Reply, , , , , , , , Tonia | Feasting at Home, , says:, , , , August 13, 2024 at 8:20 pm, , , , , Yay for garden fresh eggplant! Glad you enjoyed. 🙂, , , Reply, , , , , , , , , , Richard, , says:, , , , August 10, 2024 at 1:57 am, , , , , To make a healthier version I tossed the Aubergine chunks in Olive Oil & oven roasted them at 220C the toss then cornflour before adding to the sauce., I also halved the amount of sugar using Muscovado., Oven roasting the Aubergine makes this an incredibly easy dish to make & it is the tastiest recipe for Szechuan Aubergine that I have found., , , Reply, , , , , , , , Tonia | Feasting at Home, , says:, , , , August 11, 2024 at 9:36 am, , , , , Sounds really good Richard!, , , Reply, , , , , , , , , , Anonymous, , says:, , , , April 3, 2024 at 6:08 pm, , , , , This is a really good recipe for eggplant.  I did use a large wok and did that in one sitting.   I followed the advise of using tongs to turn over each piece.  That was really good advise and our end product was so good.   We had a couple of vegetarian egg rolls as an appetizer by the way.  Great recipe!, , , Reply, , , , , , , , Tonia | Feasting at Home, , says:, , , , April 4, 2024 at 4:35 pm, , , , , So glad you enjoyed!, , , Reply, , , , , , , , , , Ann, , says:, , , , March 17, 2024 at 5:42 pm, , , , , Super!, , , , Reply, , , , , , , , Anne, , says:, , , , March 5, 2024 at 9:54 am, , , , , This turned out  great!, , , , Reply, , , , , , , , Monica, , says:, , , , March 1, 2024 at 6:41 pm, , , , , , , , Reply, , , , , , , , Tonia | Feasting at Home, , says:, , , , March 1, 2024 at 7:43 pm, , , ,  Instructions: , stovetop, stir-fry, , , Cuisine:, , Chinese, , , Diet:, , Vegan, , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , , , , , Description, , , Chinese Eggplant with, Szechuan Sauce, with chilies and peanuts– a tasty, easy vegan dinner recipe! Serve with Rice, , black rice, , , cauliflower rice, , quinoa or rice noodles., , , , , , , , , , , , Cut eggplant into 1/2 inch thick half-moons or into bite-sized pieces ( see photos). Place in a big bowl, covered with water, and stir in 2 teaspoons salt. Cover with a plate and let stand 20-30 minutes., , In the meantime, chop the garlic and ginger and make the, Szechuan Sauce, ., , , , Reply, , , , , , , , , , María, , says:, , , , July 25, 2023 at 6:45 am, , , , , Amazing, if you like Szechuan peppercorns you will cook this on repeat and if you haven’t tried Szechuan please do because you may fall in love with them and be forever grateful to this recipe! . I cooked then  with egg noodles and ate  a 4 person portion between 2! Couldn’t stop eating!! I added less sugar only 1.5 teaspoon and was perfect for me, used normal aubergines but looking forward to get some chinese ones from the market. Thanks again Sylvia for  a quick, super yummy and healthy recipe., , , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , July 26, 2023 at 9:56 am, , , , , Thanks Maria! Glad you enjoyed this!, , , Reply, , , , , , , , , , Gail, , says:, , , , July 19, 2023 at 5:14 am, , , , , Flavors were spot on delicious., , Thing is… even with drying the eggplant completely, it seemed to take up way too much oil.  Wondering why?  Tried two different pans., , Next time will air fry, , Delicious., , Looking forward to my next crop of eggplant so I can try it again., , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , July 19, 2023 at 6:51 am, , , , , Thanks Gail. Eggplant is a sponge! Airfryer sounds like a great idea!, , , Reply, , , , , , , , , , Ann, , says:, , , , June 11, 2023 at 8:44 pm, , , , , Tasted great but a bit too oily. Thinking of baking the eggplant and then finishing it off in the pan. I also added tofu. Deinitely a keeper., , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , June 12, 2023 at 9:33 am, , , , , The eggplant does tend to soak up the oil. Roasting is a great option- or even air-frying?, , , Reply, , , , , , , , , , Santina, , says:, , , , January 13, 2023 at 8:56 am, , , , , Love this recipe. We make this all the time. We top with toasted sesame seeds. Also, for protein, we bake an entire block of soft tofu and then crumble it into the finished dish. YUM, , , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , January 13, 2023 at 6:18 pm, , , , , Sounds yummy!, , , Reply, , , , , , , , , , Morgan Volk, , says:, , , , January 4, 2023 at 7:15 pm, , , , , This recipe is way too salty! I couldn’t even finish my serving, so unfortunate. Would recommend using less low sodium soy sauce., , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , January 6, 2023 at 8:19 am, , , , , Hi Morgan, sorry about that. Some soy sauces are saltier than others…, , , Reply, , , , , , , , Samantha, , says:, , , , January 26, 2024 at 1:35 pm, , , , , I love all these flavours but mine was so salty I had to throw the whole dish out. My partner also couldn’t eat it. Could this be because I soaked the aubergine in either too much salt or for too long? I did rinse the aubergines but perhaps they retained the salt? I have low sodium soy so don’t think it was that. Any tips as I want to make this again. Thanks, , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , January 29, 2024 at 3:10 pm, , , , , Hi Samantha- shoot, sorry about that. The only thing I can think of, especially since you used low sodium soy sauce, is that you may have over-reduced the sauce? That would make it salty. To mitigate this, add a splash of water., , , Reply, , , , , , , , , , , , , , Jack Schofield, , says:, , , , December 30, 2022 at 5:02 pm, , , , , I grow my japanese eggplant and was looking for something different. I tered the recipe as my spouse does not like eat so no chilis. I akso wanted a protein so added shrimp, , This is a very good recipe the crispy then creamy bite of the eggplant was a dream bite. I actually felt that I did not need the protein. I did add some red peppers which gave a little added taste. Overall i suggest you make the recipes as written because the bite of the eggplant was a real mouth explosion., , , Reply, , , , , , , , Sylvia Fountaine | Feasting at Home, , says:, , , , December 31, 2022 at 7:53 am, , , , , Thanks so much Jack!, , , Reply, , , , , , , , , , Bhavesh, , says:, , , , December 9, 2022 at 5:40 pm, , , , , I didn’t like the flavor of the Szechuan peppercorn.  It was too overpowering.  It actually made our tongue tingle and our water taste sour.  If there’s a better substitute, I suggest use that., , , , Reply, , , , , , , , Sylvia Fountaine, , says:, , , , December 10, 2022 at 8:27 am, , , , , Yes Szechuan Peppercorn has a very distinct taste and sensation- and the first time I tried it, I too had a similar reaction. It is an acquired taste, and now I actually love it. But to keep this authentic, I felt it should be included. 🙂 You can always substitute black peppercorn., , , Reply, , , , , , , Comment navigation, Previous, , , Originally Posted, October 9, 2019, Last Updated, July 24, 2023, Categories, Asian Recipes, Dinner Ideas, Easy Weeknight Dinners, Fall Recipes, Fresh and Healthy, Stir-Fry Recipes, Vegan Recipes (or vegan-adaptable), Vegetable Recipes, Vegetarian & Vegan Mains, Vegetarian Recipes, Video Recipes, World Cuisine, Year Round, , Our Latest Recipes, Strawberry and Spinach Salad, Gluten-Free Bread, Lemon Pasta, Baked Feta Pasta, Chinese Chicken Salad, Lemon Butter Sauce, See all the latest 👉, , Hi! I’m Sylvia Fountaine., , Professional chef, former, restaurant owner, , and wedding caterer—here is where healthy meets delicious! Enjoy hundreds of seasonal whole-food recipes with helpful tips, easy steps, and videos., , , Learn More, , , Follow me, , Facebook, , , Instagram, , , Pinterest, , , Community Picks, Beginner’s Guide to Homemade Sourdough Bread, Feel Better Chicken Soup, Best Focaccia Bread Recipe, Fast & Easy Seared Tuna (Ahi or Yellowfin Tuna), Easy Ceviche Recipe, Asian Cucumber Salad, + search all recipes, , Subscribe, , All Recipes, , Shop, , About, , Recipe Box, , Plant-Based, , , Facebook, , , Instagram, , , Pinterest, © 2025 Feasting At Home, Privacy Policy, , Accessibility Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Vegan general Tso Tofu": "❌ Error scraping https://instantveg.com/vegan-general-tso-tofu-recipe/: 500 Server Error: Internal Server Error for url: https://instantveg.com/vegan-general-tso-tofu-recipe/",
        "Vegan Tofu Katsu Curry": "Ingredients:  Instructions: ",
        "Vegan Butter Lentils and Potatoes": "Ingredients: 1/4, , Cup + 1 Tablespoon, , Vegan butter, I used Earth Balance (divided), 2, , Cups, , Potatoes, diced ( I used baby potatoes), 1, , Cup, , Cooked brown lentils, 6, , Cloves, , Garlic, chopped, 2, , Teaspoons, , Fresh ginger, grated, 2, , Shallots, diced, 1, , Can(15oz.), , Tomato sauce, 1/2, , Cup, , Vegetable broth, 1/2, , Cup, , Coconut milk, Juice, , of 1, , Lemon, 2, , Teaspoon, , Garam Masala, 1/2, , Teaspoon, , Cinnamon, 1/4, , Teaspoon, , Cloves, 1/4, , Teaspoon, , Cardamom, 1/2, , Teaspoon, , Paprika, 1/4, , Teaspoon, , Turmeric, 1/4, , Teaspoon, , Red pepper flakes, 1, , Tablespoon, , Agave syrup, Salt and Pepper to taste, , , , Reply, , , , , , , , Marina, , , February 20, 2019 at 10:13 pm, , , , Thanks for that clarification., , , Reply, , , , , , , , , , , , Liz K., , , January 8, 2019 at 10:21 pm, , , , Do you mean coconut milk that you would drink or canned coconut milk?, , , Reply, , , , , , , , Lauren Hartmann, , , January 8, 2019 at 11:51 pm, , , , The canned kind of coconut milk. I will make a note of that so it isn’t confusing!, , , Reply, , , , , , , , , , Luisa B, , , January 14, 2019 at 4:50 am, , , , Perfection. This is the third recipe of yours I’ve tried and all 3 have been amazing.thank you!, , For this recipe, I added diced sweet potatoes and carrots to the mix. Next time I’ll add chickpeas  too. The sauce was too thick for my taste, so I added more veg. Broth at the end. It was really great and still thick. I cooked in a tagine and Served with brown rice. I can guarantee that I’ll make this over and over…and over!, , , Reply, , , , , , , , Lindsay Nelson, , , January 18, 2019 at 8:31 pm, , , , This is one my favorite things I’ve ever eaten. I’ve never had flavors like this before, so I was hesitant when I was preparing it, but omg! The flavors mend so well. This will definitely be put into the monthly rotation! Thank you 🙂, , , Reply, , , , , , , , Tesia, , , January 21, 2019 at 12:26 am, , , , Looks amazing!! Do you think I could pull it off without the coconut milk (allergic)?, , , Reply, , , , , , , , Lauren Hartmann, , , January 21, 2019 at 7:27 pm, , , , I think it need some creaminess. Do you use any other non dairy milks? You can use an alternative., , , Reply, , , , , , , , Kit, , , November 12, 2020 at 1:59 am, , , , Hi Tesia.  I don’t know if you’ll see this, but just in case you do, or if someone else is looking for the same answer, you can blend 2 to 2 1/2 cup of water (depending on how thick you want your “cream” to be) with 2/3 cup of oats and a pinch of salt.  Add some imitation coconut baking extract, if you still want that flavor.  Depending on whether, or not, you have a high speed blender, you may want to strain your oat cream to remove any remaining bits.  Good luck!, , , Reply, , , , , , , , , , Rachel S., , , February 5, 2019 at 2:44 pm, , , , This looks amazing! I plan on making it for dinner tonight! Just to be sure, should the lentils be cooked on their own beforehand? Or do they cook in the broth and coconut milk while the dish simmers?, , , Reply, , , , , , , , Lauren Hartmann, , , February 6, 2019 at 2:56 pm, , , , I cook them beforehand and then add them. I like to cook a bunch of lentils and keep them on hand in the fridge to throw into recipes!, , , Reply, , , , , , , , Cassie S, , , May 15, 2019 at 1:54 am, , , , I am super lazy, , , Reply, , , , , , , , Tania Benatar, , , March 23, 2023 at 2:03 pm, , ,  Instructions: In a large pot or skillet, heat 1 tablespoon of vegan butter on medium high. Then add the diced potatoes. Season with a pinch of salt and pepper., Saute the potatoes, reducing heat as needed until they are starting to brown and have softened a bit. About 5-7 minutes., Next, add the remaining 1/4 cup of vegan butter, the lentils, garlic, ginger and shallots. Saute for another minute or so until the shallots are translucent., Now, add the tomato sauce, vegetable broth, coconut milk, lemon juice, all the spices and the agave. Stir to combine., Reduce heat to medium low and simmer for about 20-30 minutes, stirring occasionally until the potatoes are soft and cooked through. The sauce will get nice and thick., Taste the sauce and adjust seasonings. Serve immediately over basmati rice. I topped mine with chutney and parsley., , Cook Mode, Prevent your screen from going dark, , , , , , Other popular recipes:, The Best Vegan Gnocchi with Creamy Pesto and Crispy Tofu, by Lauren Hartmann, 0, Incredible Vegan French Onion Garlic Bread, by Lauren Hartmann, 0, Vegan Banana Split Cookies, by Lauren Hartmann, 0, Filed Under:, Entrees, , , Gluten-Free, , Reader Interactions, Comments, , , , , , Liz, , , January 3, 2019 at 8:25 pm, , , , This looks amazing! My husband and I are looking forward to trying it tonight., , , Reply, , , , , , , , Marina, , , January 7, 2019 at 6:26 am, , , , This looks wonderful, but I just have one question / clarification.  When you refer to tomato sauce, do you mean a passata (pasta) type tomato sauce, or the type of sauce that is used as a condiment, i.e. here in Australia we would use it with fried foods, to dip French fries into, etc.?, , Thanks, , , Reply, , , , , , , , Lauren Hartmann, , , January 7, 2019 at 7:59 pm, , , , , , Reply, , , , , , , , , , , , , , Gemma Edwin, , , March 2, 2019 at 9:47 am, , , , This is a pretty good dish. One I will refer to again and again. The only minus is the amount of Garam Masala. I replaced this with hot curry powder the third time I made this and it came out even better. Thank you., , , Reply, , , , , , , , Nicole, , , March 6, 2019 at 6:38 pm, , , , This was DELICIOUS, thank you! I served it over basmati rice cooked with coconut milk and fresh ginger – so good., I love the one pot recipes where you can clean everything up while the food is simmering on the stove – timing worked out perfectly too!, , , Reply, , , , , , , , Madison Wheeler, , , March 24, 2019 at 5:14 am, , , , Awesome recipe. I’ve made it twice now, the first time I used too many lentils, and they weren’t cooked long enough. This time I used canned navy beans and it honestly was a fine substitution. With no hard preparation. I also only have jasmine rice at the house and that always goes well with it. Probably not the “perfect” version but everyone loved it! No leftovers! Thanks for the great recipe!, , , Reply, , , , , , , , Suzanne, , , May 13, 2019 at 7:14 pm, , , , Omg….this was SPECTACULAR!!!, , , Reply, , , , , , , , Leighla, , , May 25, 2019 at 2:49 am, , , , I haven’t tried this yet, but it looks delicious! I was wondering, I’m usually in a time crunch, could I avoid the butter and microwave the potatoes for a short time and let them finish on the skillet?, Can’t wait to try it, thanks!, , , Reply, , , , , , , , Lauren Hartmann, , , May 26, 2019 at 10:53 am, , , , Yes, I think that is a great idea!, , , Reply, , , , , , , , , , jeanette A O'Donnell, , , November 24, 2019 at 4:16 am, , , , I have made it 4 times now and love it.I do leave out the cardamon and chilli though So do our friends.I serve it with cuscus or rice.Delicious, , , Reply, , , , , , , , Teresa, , , February 6, 2020 at 8:13 pm, , , , We love this!!! It has quickly become a regular in our dinner rotation.  Thank You!!!, , , Reply, , , , , , , , Adrienne, , , August 24, 2020 at 10:56 pm, , , , I have made this dish maybe 10 times. It is literally one of my all-time favorite meals EVER. EVERY SINGLE PERSON who eats it raves about it. Thank you, thank you for coming up with this!!, , , Reply, , , , , , , , Leah G, , , January 11, 2021 at 2:07 am, , , , Just made this and its great, but I just realised there is no nutritional info on it I’m on a calorie control diet ATM. Do you have this info?, , , Reply, , , , , , , , Jeanette, , , March 15, 2021 at 3:48 am, , , , Amazing,I have made it numerous times now and its delicious, , , Reply, , , , , , , , jeanette, , , March 26, 2021 at 11:01 pm, , , , i have made this so many times now and never get tired of it. love it, , , Reply, , , , , , , , Rochelle, , , April 3, 2021 at 4:25 pm, , , , Hi can you use red lentils instead for this recipe?, , Thanks, , , Reply, , , , , , , , Lauren Hartmann, , , April 7, 2021 at 3:31 pm, , , , Sure! They should work well too!, , , Reply, , , , , , , , , , Mary, , , April 6, 2021 at 4:10 pm, , , , This dish was absolutely amazing!!  It was so good! I had everything on hand, except tomato sauce, so I used one can of Fire Roasted Crushed Tomatoes.  It was delicious and very tasty.  I will make this again.  Thank you so much!, , , Reply, , , , , , , , katie, , , May 7, 2021 at 12:00 pm, , , , Made this last night, realized I didn’t have cardamom or cloves, so I used a 3rd tsp. of Garam Marsala. It came out so delicious! Next time I might add celery or green peas, just to get something green in there, but really lovely recipe overall., , , Reply, , , , , , , , Elizabeth O Wise, , , July 10, 2021 at 8:51 pm, , , , A total knockout!  I will never again miss Indian dishes with chicken., , , Reply, , , , , , , , DIANNE THOMPSON, , , January 11, 2022 at 3:01 am, , , , This was delicious! I doubled the recipe due to the sizes of my cans of tomato sauce and coconut milk and used about 1.5# of potatoes and we’re so glad there will be enough for tomorrow’s dinner, too. I will likely add some quartered crimini mushrooms this time, but your recipe needs no adjusting to be a huge hit in our house! Thanks for a great and easy recipe!, , , Reply, , , , , , , , Stephanie, , , March 30, 2022 at 12:57 pm, , , , what kind of chutney did you put on top?, , , Reply, , , , Trackbacks, , , , , , The Best Vegan One Pot Dinners - Rabbit and Wolves, , says:, , , , November 5, 2021 at 2:30 pm, , , , , […] great one that is a departure from soup and pasta, is this Vegan Butter Lentils and Potatoes. My take on the Indian Butter Chicken dish. This dinner is […], , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , , , Δ, , , Primary Sidebar, , , , Hi, I'm Lauren!, Welcome to the magical land of delightful vegan comfort food. I'm the Creatrix of Rabbit & Wolves and I'm thrilled to have you here., , More about me →, , , SUBSCRIBE TO OUR NEWSLETTER, , , Popular Recipes, , Vegan Banana Split Cookies, Incredible Vegan French Onion Garlic Bread, The Best Vegan Gnocchi with Creamy Pesto and Crispy Tofu, The Best Vegan Lasagna Primavera, , , see more, freebies, →, , , © Lauren Hartmann and Rabbit and Wolves, 2021. Unauthorized use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Lauren Hartmann and Rabbit and Wolves with appropriate and specific direction to the original content., , , , Footer, Search, , Footer, , ↑ back to top, , , , About, , Privacy Policy, , , , Newsletter, , Sign Up!, for emails and updates, , , , FAQ, , FAQ, , , , As an Amazon Associate I earn from qualifying purchases., , , Copyright © 2025 Rabbit and Wolves on the, Foodie Pro Theme, , , , , ,",
        "Vegan Panang Curry Tofu": "Ingredients: , , Table of Contents, About the Recipe, , , , , Quick and Easy, , Vegan, gluten-free, oil-free, refined sugar-free., , 5-star reviewed, : Cook this recipe with confidence!, , , Tofu is always great in vegetarian curries for a source of protein and texture. You can also try it in this, Easy Vegetable Curry with Tofu, , , Thai Red Curry Vegetables with Tofu, or, Curried Tofu, ,, , , , , , Coconut Milk:, You can use light or full-fat coconut milk, I tend to lean towards light coconut milk because I find full-fat to be a bit too heavy…plus this recipe already had added fats from the peanut butter, , Broth:, Use homemade or store-bought, carton broth or bouillon cubes., , Peanut Butter:, Be sure to use a good quality, , Veggies:, Carrot can be omitted or subbed with sweet potato or squash. Broccoli works well in addition to or in place or peppers and zucchini., , , creamy, full of flavour and amazing served over a bed of basmati rice ready to soak up all the goodness., , Prep:, 10, minutes, , mins, Cook:, 20, minutes, , mins, Total:, 30, minutes, , mins, Servings:, 6, , , , , , Save Recipe, Saved Recipe, , Pin Recipe, , Rate Recipe, , Print Recipe, , , , , , Save Recipe, Enter your email & get the recipe!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , 1x, 2x, 3x, ▢, 1, , white onion, , , diced (2 cups, approx. 300g), ▢, 5, , cloves, , garlic, , , minced, ▢, 2, , cups, , chopped carrots, , , approx. 300 g, ▢, 1, , small zucchini, , , sliced (approx. 1 heaping cup), ▢, 1, , red pepper, , , thinly sliced, ▢, 1, , tbsp, , curry powder, ▢, 1, , tsp, , turmeric, ▢, 1, , tsp, , sea salt, ▢, 1/4, , cup, , tomato paste, , , 60 g, ▢, 1 1/2, , cups, , vegetable broth, ▢, 14, , oz, , can light coconut milk, ▢, 1, , tbsp, , pure maple syrup, , , substitute coconut sugar or other natural sweetener of choice, ▢, 1/3, , cup, , natural peanut butter, , , 100 g, ▢, 350, , g, , packaged firm tofu, , , cubed, ▢, 1, , cup, , chopped cilantro, ▢, cooked white or brown rice, , , for serving, , Cook Mode, Prevent your screen from going dark, , tasty, and filling., , , Reply, , , , Comment navigation, Older Comments, , , , Hi, I'm Deryn!, , Welcome to Running on Real Food!, Here you'll find simple, delicious and healthy, plant-based recipes and everything you need to eat, live and thrive., , , Read more about me, , , , , , Winter Recipes, , Soups, Vegan 3 Bean Chili, Soups, Lentil Potato Soup, Soups, Vegan Enchilada Soup, Soups, Chickpea Lentil Soup, Soups, Tomato Orzo Soup, Bowls, Cauliflower Chickpea Potato Bowls, More Summer Recipes, , , Most Popular, , Hand-Held, Chickpea Veggie Burgers, Cookies, Flourless Peanut Butter Banana Oatmeal Cookies, Pancakes, 4-Ingredient Fluffy Vegan Protein Pancakes, Pancakes, Fluffy Vegan Whole Wheat Pancakes, Snacks, Healthy Pumpkin Oat Cookies, Pancakes, Vegan Chickpea Flour Pancakes, all recipes, As Seen In, , , Back to top, Running on Real Food, , , , Recipe Index, , About, , Contact, , eBooks, , ©2025 Running on Real Food. All rights reserved., , Accessibility, •, Cookie Policy, •, Disclosure, •, Privacy Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: More Vegan Curry, Vegan Panang Curry Tofu Recipe, , , , , About the Recipe, , Panang curry, also spelled phanaeng or panaeng, is a thick Thai curry with a sweet, salty and nutty peanut flavour., , Traditionally, Thai panang curry is made with chili peppers, lemongrass, galangal, kaffir lime, , coriander, seeds, , cumin, seeds, garlic, shallot, shrimp paste, salt and peanuts., , This recipe is my version of Thai panang curry. I use light coconut milk, curry powder, , , Before You Start:, If you plan to serve over rice, which is recommended), start preparing that now so it can cook while you make the curry., , , , , Step 1., Cook the onion, garlic and carrot in a skillet over medium heat until they start to soften. This should take 6-7 minutes., , , , , Step 2, : Add the zucchini and bell pepper and stir to combine then add the tomato paste, curry powder, turmeric and salt. Stir and cook for a few more minutes., , , , , , , Step 3., Add the broth and coconut milk and simmer until the carrots are tender and the curry is thick and creamy., , , , , Step 4:, Add the maple syrup, cilantro, peanut butter and tofu, mix it all up and cook for a few minutes until the tofu is heated through., , , , , Serve the finished curry over a bowl of your favourite rice, noodles or any other whole grain., , , , More Vegan Curry, , , Coconut Red Lentil Dahl, , Easy Vegan Butter Chicken, , Vegetable Korma, , Kabocha Squash Curry, , Cauliflower Chickpea Curry, , , , , , You Might Also Like, , Curries, Easy Vegetable Curry with Tofu, Curries, Vegan Coconut Red Lentil Dahl, Curries, Thai Red Curry Vegetables with Tofu, Curries, Vegan Vegetable Korma, , , , 4.95, from, 60, votes, , Vegan Panang Curry Tofu, , By:, Deryn Macey, , Add 2 tbsp of oil, water or broth to a large skillet with the diced onion, garlic and carrot. Cook for 6-7 minutes over medium heat, stirring often, until starting to soften and become fragrant., Add the zucchini and red pepper and stir to combine. Add the tomato paste, curry powder, turmeric and salt and cook for a few more minutes, stirring to combine., Add the vegetable broth and coconut milk and simmer lightly until the carrots are tender and it's thick and creamy, about 20 minutes. Stir occasionally as it cooks., Stir in the maple syrup, peanut butter, cilantro and cubed tofu and cook for a few more minutes until the peanut butter is combined and the tofu is heated through. Season with salt and pepper, as needed., Serve over basmati, brown rice or quinoa., , Video, , , , , , , , , , Notes, Store leftovers in an airtight container in the fridge for up to 4 days. Reheat in the microwave or a pot until heated through., , Nutrition, Serving:, 1, /6th of recipe, , , Calories:, 244, kcal, , , Carbohydrates:, 18, g, , , Protein:, 11, g, , , Fat:, 16, g, , , Fiber:, 4, g, , , Sugar:, 10, g, , , , , , , , Like this recipe? Rate and comment below!, , Update Note: Originally published on May 3, 2018., , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 128 Comments, , , , , , Clark, , says:, , , , January 5, 2025 at 5:10 pm, , , , , Tasted great! It took me about an hour to complete., , , Reply, , , , , , , , Maud, , says:, , , , November 18, 2024 at 8:20 am, , , , , Too much vegetable broth but perfect otherwise., , , Reply, , , , , , , , Isa, , says:, , , , October 16, 2024 at 10:50 am, , , , , I love love love this recipe – thank you so much!! I cook it every now and then when I need some delicious warm comfort food. I use a Garam Masala mix instead of the Curry powder because I love Garam Masala and it brings a very nice flavour to it 🙂, , , Reply, , , , , , , , Deryn Macey, , says:, , , , October 16, 2024 at 12:28 pm, , , , , Thank you so much! Glad you love it., , , Reply, , , , , , , , , , Karen, , says:, , , , March 28, 2024 at 6:49 am, , , , , What makes this recipe panang?I thought panang was a particular type of curry.  When I go to the Asian market store they sell different curry pastes in cans and there are a few different kinds like red, green, yellow and panang., , , Reply, , , , , , , , Deryn Macey, , says:, , , , March 28, 2024 at 9:04 am, , , , , Hi, as noted in the post, this is not a traditional panang curry but my version or twist on an authentic panang. To me the flavour is reminiscent of panang curry without using a curry paste base. Thanks, hope you enjoy., , , Reply, , , , , , , , , , Cher, , says:, , , , February 23, 2024 at 8:41 am, , , , , I used almond butter instead of peanut butter. This was by far one of the tastiest recipes I’ve made in all my years as a vegan!, , , Reply, , , , , , , , Denise Eayrs, , says:, , , , February 18, 2024 at 3:43 pm, , , , , , , Reply, , , , , , , , Rae, , says:, , , , August 13, 2023 at 8:12 pm, , , , , Panang curry is my favorite Thai takeout order, but I couldn’t find a recipe I could make at home. Not only is Deryn’s recipe delicious",
        "Peanut Tofu with coconut rice": "Ingredients: , Its, swoon-worthy flavors, are irresistible to both kids and adults., , All you need is, 30 minutes, to put it all together!, , , There are two tasty elements in this dish: (1) peanut butter tofu and (2) creamy and fluffy coconut rice. The baked tofu pieces are tossed in a homemade peanut sauce, then served over a bed of rice to leave you with a takeout-inspired dinner. It’s absolutely delicious as-is or can be served with blanched vegetables for a healthy twist., , Why you’ll love this easy vegan peanut tofu recipe, , , Anything but boring, – This peanut tofu recipe will convince any skeptics that tofu is amazing and delicious! It’s baked until crispy, tossed in a rich and creamy peanut sauce, and served with coconut rice to give you an unforgettable meal., , Better than takeout, – Close your wallet and put the takeout menu down—this tastes so much better!, , A quick and easy weeknight staple, – You can’t go wrong making this dish on a weekly basis. It only takes 30 minutes to make and everyone at the table (yes, even your kids!) can’t get enough., , , How to make peanut tofu, , Find the complete recipe with measurements in the recipe card below., , Press the brick of tofu in a tofu press or wrap it in a clean kitchen towel and place heavy books on top. Set aside to drain for 30 minutes or up to 1 hour., , Slice the pressed tofu into bite-sized pieces and place them in a large bowl. Drizzle the soy sauce over top and gently toss to coat. Add the cornstarch and toss again., , Arrange the coated tofu pieces in an even layer on a lined baking sheet and bake until they’re crispy and lightly golden brown., , , Meanwhile, make the coconut rice by combining the rice, coconut milk, water, and salt in a medium pot., , Heat to a boil, then reduce the heat and simmer until the rice is cooked. Take the pot off the heat and fluff the rice with a fork., , , To make the peanut sauce, , Add the baked tofu to the pan with the sauce and gently stir until the pieces are well coated. Serve the peanut butter tofu over the coconut rice in bowls, garnish with peanuts and cilantro, and enjoy!, , , , , , , , , , Frequently asked questions, , What should I serve with peanut tofu?, , Serve the peanut tofu with a generous scoop of coconut rice for a quick, simple, and flavor-packed dinner. It’s quite filling on its own, or you can pair it with a side of steamed kale or broccoli or stir-fried vegetables, like red bell peppers, cauliflower, and edamame., , , Can this recipe be made gluten-free?, , Yes! For a gluten-free option, replace the soy sauce with tamari or gluten-free soy sauce., , , What can I use instead of peanut butter?, , Almond butter or cashew butter will work just as well as peanut butter here, although the flavor of the sauce will be different. You can also use sunflower seed butter or tahini if you need a nut-free option but, again, the flavor of the sauce will change., , , I’m allergic to coconut. What can I use instead?, , You could try substituting unsweetened cashew, almond, soy milk or another rich dairy free cream (I like Ripple’s half and half) for the coconut milk in the rice and peanut sauce. The dish will be lighter and won’t have the sweet and tropical coconut flavor but it will still be tasty!, , , Can I fry the tofu instead of baking it?, , Sure! Make this recipe with my, Air Fryer Tofu, or, Pan Fried Tofu, instead., , , How do I make coconut rice with brown rice?, , Brown rice takes a little longer to cook but will still pair well with the peanut tofu stir fry. Combine 1 cup of brown rice, 1/2 cup of coconut milk, and 1 1/2 cups of water in a medium pot, then simmer for about 40 minutes or until the rice is tender and all of the liquid is absorbed., , , , , , , 4.90, stars (, 86, ratings), , Peanut Tofu with Coconut Rice, , Make this 30-minute Peanut Tofu with Coconut Rice for an outstanding takeout-inspired dinner! Every piece of peanut sauce-covered baked tofu and fluffy coconut rice is rich, flavorful, and satisfying., , Prep:, 5, minutes, , mins, Cook:, 25, minutes, , mins, Tofu Pressing:, 30, minutes, , mins, Total:, 30, minutes, , mins, Servings:, 6, , servings, , , , Print, , Pin, , Comment, , Save, Saved, , , US Customary, Metric, , 1x, 2x, 3x, Crispy Baked Tofu, ▢, (2), , 14-ounce, , blocks extra-firm tofu, pressed, ▢, 3, , tablespoons, , low sodium soy sauce, , (tamari for gluten free), ▢, 2, , tablespoons, , cornstarch, ▢, spray oil, Coconut Rice, ▢, 1, , cup, , uncooked white rice, ▢, 1/2, , cup, , full fat coconut milk, ▢, 1 1/4, , cups, , water, ▢, pinch of salt, Peanut Sauce, ▢, 1/2, , cup, , creamy peanut butter, ▢, 1, , cup, , full fat coconut milk, ▢, 2, , tablespoons, , low sodium soy sauce, , (tamari for gluten free), ▢, 2, , tablespoons, , maple syrup, ▢, 2, , teaspoons, , fresh grated ginger, ▢, 2, , garlic cloves, minced, ▢, 2, , tablespoons, , fresh lime juice (about 1 lime), Optional for serving, ▢, chopped cilantro, peanuts, ▢, steamed kale or broccoli, , until smooth and creamy, about 5-10 minutes., When the tofu is done baking, carefully add it to the pan with the sauce, and stir to coat the tofu pieces. Serve immediately over the coconut rice, sprinkling peanuts and cilantro on top, if desired., , , Notes, , May substitute unsweetened cashew, almond, soy milk or another dairy free cream for the full fat coconut milk, if desired. It won’t be as delicious and creamy, but it will still taste good., , The recipe makes enough sauce to coat the tofu, but if you want extra, double the peanut sauce., , For gluten free, make sure to use gluten free tamari instead of soy sauce., , To avoid needing to press your tofu, buy the tofu NOT in water, but the super firm tofu in vacuum sealed packs., , , Nutrition, Serving:, 1, serving, |, Calories:, 462, kcal, |, Carbohydrates:, 42, g, |, Protein:, 19, g, |, Fat:, 26, g, |, Saturated Fat:, 13, g, |, Sodium:, 639, mg, |, Potassium:, 542, mg, |, Fiber:, 2, g, |, Sugar:, 8, g, |, Vitamin C:, 2, mg, |, Calcium:, 78, mg, |, Iron:, 4, mg, , Course:, Main Course, Cuisine:, Thai, Author:, Nora Taylor, , , , , Did you make this recipe?, Mention, @nora_cooks_vegan_, or tag, #noracooks, !, , , , , , , About Nora, , , Read more about Nora, , , , , , , , , , , Posted In:, , 30 Minute Recipes, , , Asian-Inspired, , , Cuisine, , , Dinner, , , High Protein, , , Main Dish, , , Meal Type, , , , , , Like this? Share with your friends!, , Pin, Facebook, Tweet, Yummly, Email, , , , , , you may also like:, , , , , , , , Main Dish, , Beet Poke Bowls, , , , , , , Main Dish, , Marry Me Tofu, , , , , , , Main Dish, , Whole Roasted Cauliflower with Harissa Glaze and White Bean Puree, , , , , , , Main Dish, , Roasted Veggie Enchiladas with Black Bean Sauce, , , , , , , , Comments, , , , , , , Kim, , says:, , , , January 26, 2025 at 8:48 am, , , , , , , , Delicious, and so quick to make!, Thank you Nora x, , , Reply, , , , , , , , Jo, , says:, , , , December 6, 2024 at 2:39 pm, , , , , , , , Really good but way too much sauce for the rice contrast, , , Reply, , , , , , , , Kimberly McCafferty, , says:, , , , November 24, 2024 at 2:33 pm, , , , , , , , One of the best tofu recipes I have ever made., , , Reply, , , , , , , , Alice, , says:, , , , November 18, 2024 at 5:53 pm, , , , , 30g uncooked rice per serving seems very little? One serving is often around 50-80g, , , Reply, , , , , , , , Karen ML, , says:, , , , September 4, 2024 at 4:07 pm, , , , , , , , , , Read More About Me, , , , , , , , , , , , , , Most Popular, , , , , , , , Cake, , The Best Vegan Chocolate Cake, , , , , , , Bars and Brownies, , Best Ever Vegan Brownies Recipe, , , , , , , Side Dishes, , The Best Vegan Cornbread, , , , , , , Main Dish, , The Best Vegan Lasagna, , , , , , , as featured in…, , , , , , , , , , , , , , , , , , , , Back to top, Nora Cooks, , , Recipe Index, , About, , Contact, , Privacy / Disclosure, , Cookie Policy, , ©, 2025 Nora Cooks., Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , Instructions: Press the tofu by wrapping in paper towels. Place a plate or pan on top of the wrapped tofu, and put a couple of heavy books on top of that. Let the tofu press for at least 30 minutes if possible and up to an hour., (Skip this step by purchasing firm tofu in a vacuum pack.), Preheat the oven to 400 degrees F and line a large baking sheet with parchment paper. Slice the tofu into 2 inch squares or rectangles and place in a large bowl. Drizzle on the soy sauce and toss gently to combine. Sprinkle on the cornstarch and toss to combine, gently (, I always use my hands., ), Spray the parchment paper with oil. Arrange the tofu pieces evenly on the pan, spray the tops lightly with oil and bake for 25 minutes until crispy and lightly golden brown., Once the tofu is baking, make the coconut rice:, Rinse the rice, then add it to a medium pot, along with the coconut milk, water and a pinch of salt. Bring to a boil, then let simmer for 18 minutes. Turn off the heat, and fluff with a fork., You will use the rest of the coconut milk for the peanut sauce., Once the rice is cooking, make the peanut sauce:, In a large pan, , , Special Dietary Needs, , , Tofu, , , came out perfect 👍 Thanks Nora!!, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , September 5, 2024 at 10:03 pm, , , , , You bet, Karen!  I’m so glad you loved the recipe!  Thanks for your wonderful review!, , , Reply, , , , , , , , , , Alyssa, , says:, , , , May 14, 2024 at 6:03 pm, , , , , , , , This was delicious! Flavorful and filling, , , Reply, , , , , , , , Mel, , says:, , , , May 5, 2024 at 6:38 pm, , , , , , , , , , Reply, , , , , , , , Erin Harvey, , says:, , , , April 21, 2024 at 5:19 pm, , , , , How would I make the coconut rice with brown rice?, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , April 21, 2024 at 5:48 pm, , , , , Hi Erin.  The brown rice will take longer to cook, of course, and I would use a little more water. So 1 cup brown rice, 1/2 cup coconut milk and 1 1/2 cups water. Simmer for about 40 minutes. Hope that helps!, , , Reply, , , , , , , , , , Jennifer, , says:, , , , November 19, 2023 at 1:07 pm, , , , , , , , Make this all the time and I love it!  Was wondering, do you think powdered peanut butter would work in the sauce instead of regular peanut butter?, , , Reply, , , , , , , , Nora, , says:, , , , November 20, 2023 at 1:19 pm, , , , , I’m honestly not sure, I’ve never used powdered peanut butter. Maybe someone else will be able to answer that!, , , Reply, , , , , , , , Sabrina, , says:, , , , December 11, 2023 at 6:42 pm, , , , , Haven’t tried it but from my previous experience with peanut powder It may work if you reconstitute it in water first. It will likely be a lot less creamy though!, , , Reply, , , , , , , , , , Shannon, , says:, , , , November 8, 2023 at 8:31 am, , , , , , , , I have the tofu pressing right now  to make this delicious meal!! I am also going to make your peanut butter cake also! You absolutely ROCK Nora!!!, , , Reply, , , , , , , , Support @ Nora Cooks, , says:, , , , November 8, 2023 at 11:17 am, , , , , I can’t wait for you to try it!! 🙂, , , Reply, , , , , , , Comment navigation, Older Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , , , , Hello, I’m Nora!, , I create vegan recipes that are easy to cook"
    }
}