{
    "ingredients": {
        "Thai Basil Fried Rice": "jasmine rice, sesame oil, garlic cloves, ginger, cashews, yellow onion, red bell pepper, soy sauce, green chillies, veg oyster sauce, sriracha, thai basil",
        "Thai Fried Rice": "capsicum,coconut,coconut milk,coriander,corn,garlic,ginger,milk,onion,rice,spring onion,"
    },
    "recipe_url": {
        "Thai Basil Fried Rice": "https://www.cookwithmanali.com/instant-pot-thai-basil-fried-rice/",
        "Thai Fried Rice": "https://www.tarladalal.com/thai-fried-rice-461r"
    },
    "Recipe": {
        "Thai Basil Fried Rice": "Ingredients: , Vegetarian Oyster Sauce, , Soy Sauce, , Jasmine Rice, , Toasted Sesame Oil, , If you’ve tried this Instant Pot Thai Basil Fried Rice Recipe then don’t forget to rate the recipe! You can also follow me on, Facebook, and, Instagram, to see what’s latest in my kitchen!, , , , Instant Pot Thai Basil Fried Rice, , 5, from, 27, votes, , By, Manali Singh, , Prep:, 10, minutes, , mins, Cook:, 25, minutes, , mins, , Servings:, 3, , , , , , Save, Saved, , Pin, , Print, , , , Vegan Thai Basil Fried Rice with onion, peppers and cashews and made in the Instant Pot! This fried rice pairs well with any curry or is great on its own too!, , , , 1x, 2x, 3x, ▢, 1.25, , cups, , jasmine rice, , 260 grams, ▢, 1.25, , cups, , water, , 300 ml, ▢, 1.5, , tablespoon, , toasted sesame oil, ▢, 3-4, , large, , garlic cloves, , chopped, ▢, 1/2, , inch, , ginger, , chopped, ▢, 1/3, , cup, , cashews, , whole & raw, ▢, 1, , medium, , yellow onion, , chopped, ▢, 1, , medium, , red bell pepper, , sliced, ▢, 1-2, , green chilies, , sliced, ▢, 2-2.5, , tablespoons, , soy sauce, ▢, 1/2, , tablespoon, , vegetarian oyster sauce, ▢, 1, , teaspoon, , sriracha, , or to taste, ▢, 1/4, , teaspoon, , black pepper, ▢, 1/4, , teaspoon, , salt, , or to taste, ▢, 3/4, , cup, , thai basil, , 1/2 cup chopped and 1/4 cup whole, ▢, 1/4, , cup, , cilantro, , chopped, , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Save, , , , , Meet Manali, , , , , , , , , Related Recipes, , , , , , , , Salads, , High-Protein Lentil Salad (Masoor Dal Salad), , , , , , , Instant Pot, , Instant Pot Dal Recipe, , , , , , , Instant Pot, , Saag Paneer Recipe (Instant Pot & Stovetop), , , , , , , Indian Breakfast, , Quinoa Upma (Instant Pot & Stovetop), , , , , , , , , , 5 from 27 votes (, 8 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me if there is a reply to my comment, , , , , Δ, , , 56 Comments, , , , , , Tressa, , says:, , , , July 6, 2024 at 11:45 am, , , , , So easy good!, , , Reply, , , , , , , , Jessie, , says:, , , , February 5, 2024 at 4:30 pm, , , , , Absolutely delicious!  I added shitake mushroom slices to give it a little “meat.”  Will make again and again!, , , Reply, , , , , , , , Manali Singh, , says:, , , , February 7, 2024 at 2:24 pm, , , , , thanks for trying Jessie!, , , Reply, , , , , , , , , , Ash, , says:, , , , March 7, 2023 at 11:12 pm, , , , , It was absolutely delicious!!! I added chicken, so yummy! Thank you!, , , Reply, , , , , , , , Mary, , says:, , , , June 7, 2022 at 5:50 pm, , , , , I didn’t have oyster sauce, so I added more soy sauce.  I was also out of cilantro.  It was still great.  I cooked it in a wok. Very flavorful, will make again., , , Reply, , , , , , , , Manali, , says:, , , , June 10, 2022 at 11:33 pm, , , , , glad you liked it, thanks for trying! 🙂, , , Reply, , , , , , , , , , Julie, , says:, , , , January 20, 2022 at 5:49 pm, , , , , My husband and I will be making this meal for the third time tonight — we absolutely love it. It’s so flavorful and satisfying, and we no longer need to order overly oily takeout when we get a craving for Thai fried rice. We add tofu during the sautéing stage for added protein. Thanks so much for sharing your recipe., , , Reply, , , , , , , , Manali, , says:, , , , January 26, 2022 at 12:55 am, , , , , thanks for the wonderful feedback Julie!, , , Reply, , , , , , , , , , Rasha, , says:, , , , September 22, 2021 at 3:21 pm, , , , , How would you adjust the cook time for the rice if I were to use brown rice instead of white rice? I have not had success cooking brown rice in the instant pot yet but that’s all I use…, , , Reply, , , , , , , , Manali, , says:, , , , September 25, 2021 at 10:07 pm, , , , , here’s how to cook brown rice:, https://www.cookwithmanali.com/instant-pot-brown-rice/, , , Reply, , , , , , , , , , Laura C., , says:, , , , September 20, 2021 at 4:09 pm, , , , , This was DELICIOUS!! I will definitely be making it again!, , , Reply, , , , , , , , Manali, , says:, , , , September 20, 2021 at 7:50 pm, , , , , awesome!, , , Reply, , , , , , , , , , V., , says:, , , , July 24, 2021 at 9:19 pm, , , , , My brother made this for me today. It looked good and tasted great!, I will be telling my mother about it also. Thank you for giving us this recipe., , , Reply, , , , , , , , Bonnie, , says:, , , , June 23, 2021 at 6:30 pm, , , , , This was really good.  Unfortunately, while I was making it I ate 1/3 of the bag of cashews.  That wasn’t good but besides that everyone (a miracle in my house) seemed to like it.  My only complaint is it didn’t make anywhere near enough.  I increased the rice because we have a family of 5 but it still wasn’t enough.  I’ll have to double it next time.  I used fresh basil from the garden.  Thank you for such a delicious recipe., , , Reply, , , , , , , , Manali, , says:, , , , June 25, 2021 at 11:54 am, , , , , haha I eat way too many cashews while cooking too, glad you liked it!, , , Reply, , , , , , , , , , Mical, , says:, , , , May 1, 2021 at 1:18 pm, , , , , I never comment on blogs, but this was too delicious not to. My husband and I lived in Thailand for two years and have tried to recreate Thai fried rice a few times, but haven’t come close. This made our hearts happy! My only question is, can this recipe be doubled in the instantpot? We need more leftovers., , , Reply, , , , , , , , Manali, , says:, , , , May 2, 2021 at 12:57 pm, , , , , glad you liked it, yes it can be doubled 🙂, , , Reply, , , , , , , , , , Guiselle, , says:, , , , December 24, 2020 at 1:41 pm, , , , , Thank you for sharing this delicious recipe! I’ve made it so many times. It’s a hit! Entire family loves it, they can’t get enough., , , Reply, , , , , , , , Manali, , says:, , , , December 25, 2020 at 11:46 am, , , , , I am glad to know!, , , Reply, , , , , , , , , , Rakhshindah Qureshi, , says:, , , , December 7, 2020 at 4:53 pm, , , , , Hi Manali ,, I have a dumb question . When adding soaked jasmine rice to IP how much water has to be added ?, Thanks., , , Reply, , , , , , , , Manali, , says:, , , , December 10, 2020 at 12:56 am, , , , , do 1:1 ratio, , , Reply, , , , , , , , Deepti Tandon yadav, , says:, , , , December 22, 2020 at 5:25 pm, , , , , Thank you ☺️, even I had the same question ☺️, , , , , , , , , , , , , Anita, , says:, , , , December 2, 2020 at 4:31 pm, , , , , I love this. Love all your recipes- that goes without saying. However I do not have ip and have to do in the stovetop. Bu jasmine rice gets very mushy when I do that. what can i do so the rice don’t turn mushy ?, , , Reply, , , , , , , , Manali, , says:, , , , December 3, 2020 at 11:26 am, , , , , do you suggest more/less/same time in instant pot? Thanks 🙂, , , Reply, , , , , , , , Manali, , says:, , , , June 25, 2020 at 10:08 am, , , , , , , , , , , , , , , Chelsea Saunders, , says:, , , , August 16, 2020 at 8:22 pm, , , , , If you really like Thai Basil but have a hard time buying it, I’ve found it to be pretty easy to grow, even in a sunny window if you don’t have a yard!  Doesn’t help you out now, but if it’s something you find yourself wishing for often, totally worth it in my opinion! 😀 Lots of different seed companies sell it! 🙂, , , Reply, , , , , , , , , , Reshma, , says:, , , , May 2, 2020 at 1:00 pm, , , , , Amazing Recipe – absolutely loved the flavours, , , Reply, , , , , , , , Manali, , says:, , , , May 2, 2020 at 7:54 pm, , , , , awesome!, , , Reply, , , , , , , , Sri, , says:, , , , September 10, 2020 at 10:55 pm, , , , , Hi! How much quantity rice should I cook if I’m using sona-masoori rice?, , , , , , , , , Manali, , says:, , , , September 11, 2020 at 10:13 am, , , , , same, , , , , , , , , , , , , Cindy, , says:, , , , April 21, 2020 at 3:26 am, , , , , Made this twice and love the flavors!  So good want to double the recipe-can I leave rice cooking time the same?  Tried several recipes and Cooking with Manali never disappoints!, , , Reply, , , , , , , , Manali, , says:, , , , April 21, 2020 at 10:15 am, , , , , Thanks! yes cooking time will remain same., , , Reply, , , , , , , , , , Frenchie, , says:, , , , January 29, 2020 at 7:31 pm, , , , , I added cubed grilled chicken and fried some eggs along with the mix, and it smells and tastes great! really authentic tasting (yum), , , Reply, , , , , , , , Kathleen, , says:, , , , January 27, 2020 at 9:32 pm, , , , , This was delicious!  I used brown rice, , , Meet Manali, , , , , , , , , Popular, , , , , , , , Indian Main Course, , Kadai Paneer, , , , , , , Indian Main Course, , Chole Recipe (Punjabi Chole Masala), , , , , , , Indian Main Course, , Aloo Gobi – Potatoes & Cauliflower, , , , , , , Instant Pot, , Instant Pot Brown Rice, , , , , , , , , , Easy Air Fryer Recipes, , , , , , , , Air Fryer, , Air Fryer Sweet Potatoes (10-Minutes!), , , , , , , Air Fryer, , Crispy Air Fryer Tofu, , , , , , , Air Fryer, , Air Fryer Aloo Gobi, , , , , , , Air Fryer, , Air Fryer Onion Pakoda, , , , , , , As Seen In, , , , , , , , , , , , , , Back to top, Cook With Manali, Home, , Recipes, , Web Stories, , About, , Contact, , , , , , , ©2025 Cook With Manali. All rights reserved., , Privacy Policy, •, Disclosure Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , ›, , Vegetarian Instant Pot Recipes, Instant Pot Thai Basil Fried Rice (Vegan), By, Manali Singh, Published  Sep 26, 2019, Updated Jun 08, 2020, 56 Comments, 5, from, 27, votes, Vegan Thai Basil Fried Rice with onion, peppers and cashews and made in the Instant Pot! This fried rice pairs well with any curry or is great on its own too!, , Jump to Recipe, V, Vegan, EF, Egg Free, DF, Dairy Free, This post may contain affiliate links. Please read our, disclosure policy, ., , Vegan Thai Basil Fried Rice made in the Instant Pot!, , This quick and easy fried rice is super flavorful with the aroma of basil, soy sauce and crunchiness from the cashews., , Pairs well with, vegan panang curry, or can eat be eaten as such!, , If you love all the Instant Pot vegetarian/vegan recipes that I share on the blog, please join me on this Facebook Group –, Instant Pot Vegetarian Recipes, . The group would feature vegetarian instant pot recipes from all around the web!, , , Disclosure: This post contains affiliate links. For more information on my Affiliate and Advertising Policy, please click, here, ., , It looks like I am currently in the “Thai Basil” phase. No, seriously look at the amount of recipes using Thai Basil I have shared in the last few weeks., , This, Thai Basil Tofu Stir-Fry, , , Vegan Panang Curry, and many more!, , Well, I can’t help! It’s just so aromatic and I really want to add it to everything., , So, the other day when I bought a big box of Thai Basil from the Asian store, I ended up using some to make this Thai Basil Fried Rice., , The inspiration for this recipe comes from a fried rice that we ate at a local Thai restaurant., , That one had some curry powder too and it was amazing., , I made my own version using lots of Thai Basil and also added lots of cashews for the crunch., , Sarvesh loves cashews in Asian dishes and I think they go so well with Thai flavors. Isn’t it?, , , , This Thai Basil Fried Rice, , ✓ is made in the instant pot!, , ✓ flavored with soy sauce and vegetarian oyster sauce, , ✓ packed with Thai Basil and cilantro, , ✓ has a nice crunch from the cashews, , ✓ is vegan and can be made gluten-free, , ✓ pairs well with any Thai curry and is even great as it is!, , , This Thai Basil Fried Rice recipe is quite similar to the, Pineapple Fried Rice, recipe that I shared couple of years back., , I have only flavored this one a little differently., , This fried rice is flavored with soy sauce, hot sauce and vegetarian oyster sauce., , If you can’t find the vegetarian oyster sauce, it’s okay you can skip it. Just add a bit more soy sauce., , But, I have to say the main flavor of this dish comes from the Thai Basil. Well hence the name of the dish right?, , I have use tons of basil here! Like really a LOT!, , If you don’t like so much basil flavor, feel free to cut down on it. You can only use 1/4 cup chopped basil in place of 1/2 cup., , Also do not replace Thai Basil with Sweet Basil. It just won’t be the same!, , Can This Rice be Gluten-free?, , Yes, absolutely!, , Use tamari in place of soy sauce., , And skip the oyster sauce since the one that I used is not gluten-free., , , , , 1- Rinse rice until water turns clear and then add rice to the Instant pot along with water., , 2- Close the lid and press the manual or pressure cook button. Cook on high pressure for 3 minutes, with the pressure valve in the sealing position., , Let the pressure release naturally for 10 minutes and then do a quick pressure release., , 3- Open the lid and fluff the rice with a fork., , 4- Then transfer the rice to another bowl and set aside., , , 5- Now, press saute the button. There’s no need to clean the pot, some rice will stick around and that’s fine., , Once the pot displays hot, add the oil and then add the garlic and ginger., , 6- Cook for 2 to 3 minutes until garlic, ginger starts changing color. Add cashews and cook for 1 minute., , Then add onion, red pepper and green chili. Cook for 2 minutes., , 7- Then push veggies to side and add soy sauce, vegetarian oyster sauce and sriracha., , 8- Mix to combine everything together., , , 9- Add the cooked rice back into the pot., , 10- Mix well and add black pepper and salt and toss to combine., , 11- Plug off the Instant Pot, add 1/2 cup chopped basil and chopped cilantro. Mix well until the leaves wilt., , 12- Finally add in 1/4 cup whole Thai basil leaves (not chopped)., , , Stir and serve Thai Basil Fried Rice as such or with any curry of choice!, , , Rinse rice until water turns clear and then add rice to the Instant pot along with water., Close the lid and press the manual or pressure cook button. Cook on high pressure for 3 minutes, with the pressure valve in the sealing position., Let the pressure release naturally for 10 minutes and then do a quick pressure release., Open the lid and fluff the rice with a fork. Then transfer the rice to another bowl and set aside., Now, press saute the button. There's no need to clean the pot, some rice will stick around and that's fine., Once the pot displays hot, add the oil and then add the garlic and ginger., Cook for 2 to 3 minutes until garlic, ginger starts changing color. Add cashews and cook for 1 minute., Then add onion, red pepper and green chili. Cook for 2 minutes., Then push veggies to side and add soy sauce, vegetarian oyster sauce and sriracha. Mix to combine everything together., Add the cooked rice back into the pot., Mix well and add black pepper and salt and toss to combine., Plug off the Instant Pot, add 1/2 cup chopped basil and chopped cilantro. Mix well until the leaves wilt., Finally add in 1/4 cup whole Thai basil leaves (not chopped)., Cook the rice: Rinse the rice until water turns clear. Bring 1.5 cups water to a boil in a saucepan. Add the rice, stir and then lower the heat. Simmer for 10-15 minutes until all water is absorbed., Follow rest of the steps as it is in a wok/pan., , Video, , , , , , , , , , Notes, , This fried rice has a strong Thai basil flavor as I have used tons of it. If you don't want so much basil flavor in the rice, just skip adding the 1/4 cup whole basil leaves in the end., , If you are making this in a 8qt, you might need to add extra 1/4 cup water while pressure cooking the rice., , , , Nutrition, Calories:, 470, kcal, , , Carbohydrates:, 75, g, , , Protein:, 11, g, , , Fat:, 14, g, , , Saturated Fat:, 2, g, , , Sodium:, 1047, mg, , , Potassium:, 376, mg, , , Fiber:, 4, g, , , Sugar:, 5, g, , , Vitamin A:, 1650, IU, , , Vitamin C:, 58.6, mg, , , Calcium:, 51, mg, , , Iron:, 2.3, mg, , Nutrition information is automatically calculated, so should only be used as an approximation., , , , Additional Info, , Course:, Sides, Cuisine:, Thai, , , , , Your feedback is valuable!, Please share your comments, ratings, and any suggestions or adaptations below to help us improve and make our recipes more successful., , , Like this recipe? Share it with friends!, , Pin, Facebook, Tweet, Yummly, Email, , , , , Categorized as:, , Dairy Free, , , Egg Free, , , Rice, , , Vegan, , , Vegetarian Asian, , , Vegetarian Instant Pot Recipes, , , , , , , , , Hi, I’m Manali!, , Bringing you easy, delicious vegetarian & vegan recipes! Eating veggies can be fun, please check that and then follow rest of the steps as it is., , , Reply, , , , , , , , , , Erin, , says:, , , , November 20, 2020 at 7:24 am, , , , , If I wanted to add crunchy veggies to this like broccoli, when should I add? Thank you!, , , Reply, , , , , , , , Manali, , says:, , , , November 20, 2020 at 4:31 pm, , , , , add along with the bell pepper after rice is pressure cooked., , , Reply, , , , , , , , , , BHARATHI G, , says:, , , , November 6, 2020 at 6:17 pm, , , , , Can I use sambal instead of sri racha? Would the taste be the same?, , , Reply, , , , , , , , Manali, , says:, , , , November 7, 2020 at 7:14 pm, , , , , yes!, , , Reply, , , , , , , , , , Sheryl, , says:, , , , November 4, 2020 at 9:27 pm, , , , , Family loved this, thank you for the recipe!, , , Reply, , , , , , , , Julie Metalia, , says:, , , , October 19, 2020 at 7:27 pm, , , , , What can I substitute oyster sauce with?, , , Reply, , , , , , , , Manali, , says:, , , , October 19, 2020 at 9:40 pm, , , , , i would just add more soy sauce maybe, or try hoisin sauce maybe, , , Reply, , , , , , , , , , Ling, , says:, , , , September 27, 2020 at 4:47 am, , , , , Cooked this several times and it always works so well. I tried adding an egg towards the end before adding basil and the taste was heavenly. Cashews with capsicum and basil just goes so well. Thank you for the wonderful recipe., , , Reply, , , , , , , , Manali, , says:, , , , September 27, 2020 at 3:58 pm, , , , , glad to know, , , Reply, , , , , , , , , , Chelsea, , says:, , , , August 16, 2020 at 8:20 pm, , , , , I don’t think I can even begin to pick a favorite recipe from Manali!  You are such a talented chef!!!  My neighborhood doesn’t have a lot of great restaurants (in my opinion) and your recipes have perfectly satiated SO many cravings!!!  Thank you!  Also, my fake vegan “fish sauce” hack is that I simmer some nori in tamari and water on low until the nori is mostly dissolved!  Easy peasy and tastes good (can’t say if it’s authentic, as I went vegan long before I tried any foods with actual fish sauce, but it tastes good to me!), , , Reply, , , , , , , , Manali, , says:, , , , August 17, 2020 at 10:52 am, , , , , Thank you Chelsea, glad you enjoyed this recipe!, , , Reply, , , , , , , , , , Gillian, , says:, , , , July 13, 2020 at 1:43 pm, , , , , Hi there! A friend of mine brought this to a bbq we had and it was so delicious i got her to send me the recipe so i could make it. The only issue is i have not been able to find Thai basil anywhere right now. I know you specifically say not to use sweet basil but if it’s all i have and i add some tarragon or fennel for some of that spicy taste do you think it would be ok??, , , Reply, , , , , , , , Manali, , says:, , , , July 13, 2020 at 2:14 pm, , , , , Hello! so glad you liked the recipe 🙂 So you can try using Italian basil + cilantro or mint. I have heard some people use it and they were happy with it!, , , Reply, , , , , , , , , , Magicbuds, , says:, , , , May 28, 2020 at 9:57 pm, , , , , Manali, I never comment on blogs, but this rice came out so good that I was compelled to…Was just perfectly cooked and perfect taste! I made stove top, doubled the recipe and used just 1 green chili to adjust to our taste., , , Reply, , , , , , , , Manali, , says:, , , , May 29, 2020 at 10:24 am, , , , , glad to know!, , , Reply, , , , , , , , Holly, , says:, , , , June 25, 2020 at 9:34 am, , , , , , , Reply, , , , , , , , Sneha Kamath, , says:, , , , March 9, 2021 at 4:46 pm, , , , , Made this for the second time today, this time with pineapple and zucchini along with the veggies and basil as in the recipe. Everyone at home loved it. Thanks for the recipe ! Used basmati rice since that’s what I had in hand this time and worked just fine., , , Reply, , , , , , , , , , Cynthia, , says:, , , , October 5, 2019 at 3:56 pm, , , , , This looks amazing and I’m sure it tastes just the same. Could the rice be substituted for quinoa?, , , Reply, , , , , , , , Manali, , says:, , , , October 7, 2019 at 9:50 am, , , , , yes should work…, , , Reply, , , , , , , , , , Shantala, , says:, , , , September 26, 2019 at 1:28 pm, , , , , I haven’t tried this, but this looks so yum! Gotta try!, , , Reply, , , , , , , , Madhavi, , says:, , , , September 26, 2019 at 9:22 am, , , , , Lovely fragrant recipe!!! Surely will try, , However, how different is this recipe to a stove top version? I believe this can be made on stove top of you have some leftover rice., , , Reply, , , , , , , , Manali, , says:, , , , September 26, 2019 at 10:16 am, , , , , same steps, please check the recipe card at the bottom. And yes you can make this with leftover rice too, probably around 3-4 cups of leftover rice., , , Reply, , , , , , , , , , , , Hi, I’m Manali!, , Bringing you easy, delicious vegetarian & vegan recipes! Eating veggies can be fun",
        "Thai Fried Rice": "Ingredients: , , , , , , , , , , For The Green Curry Paste (makes Approx. 1 Cup), , , 2 tbsp finely, chopped lemon grass (hare chai ki patti), stem, , 1 cup, chopped coriander (dhania), , , 1/4 cup roughly, chopped onion, , , 1 tbsp roughly, chopped garlic (lehsun), , , 10, green chilli, , roughly chopped, , 1 tbsp, coriander (dhania) powder, , , 2 tbsp, cumin seeds (jeera) powder, , , 1/2 tsp, freshly ground black pepper (kalimirch), , , 25 mm (1?) piece, ginger (adrak), , , , salt, to taste, , 1/2 tsp, lemon juice, , , 1/4 tsp, lemon rind, , , , For The Rice, , , , red curry paste, , , 1 tbsp, oil, , , 1/4 cup finely, chopped spring onions whites, , , 1/2 cup thinly, sliced and blanched baby corn, , , 1/2 cup thinly, sliced capsicum, , , 2 tbsp finely, chopped spring onion greens, , , 1 1/2 tsp finely, chopped green chillies, , , , salt, and to taste, , 1 tsp, soy sauce, , , , For The Coconut Sauce, , , 1/2 cup, coconut milk (nariyal ka doodh), , , 2 tbsp, oil, , , 1/2 tsp, cumin seeds (jeera), , , 1/4 cup finely, chopped spring onions whites, , , 2, slit green chilli, , , 1 tbsp finely, chopped spring onion greens, , , 1 tsp, lemon juice, , , , For The Garnish, , , 1 tbsp finely, chopped spring onion greens, , , , , , , using enough water (approx. ½ cup). Keep aside., For the rice, , Heat the oil in a wok or a kadhai, add the spring onion whites and sauté on a medium flame for 1 to 2 minutes., Add the baby corn and sauté on a medium flame for 1 minute., Add the capsicum, spring onion greens and sauté on a medium flame for 1 minute., Add the green chillies and 2 tbsp of the prepared green curry paste, mix well and cook on a medium flame for 1 minute., Add the rice, salt and pepper, mix well and cook on a medium flame for 1 minute., Add the soya sauce, mix well and cook on a medium flame for 1 to 2 minutes. Keep aside., For the coconut sauce, , Heat the oil in a broad non-stick pan and add the cumin seeds., When the seeds crackle, add the spring onion whites and sauté on a medium flame for 1 minute., Add the green chillies, spring onion greens and sauté on a medium flame for 1 minute., Add the coconut milk, lemon juice, salt and ¼ cup of water and ½ tsp of the prepared green curry paste, mix well and cook on a medium flame for 2 minutes, while stirring continuously. Keep aside., How to proceed, , Put the rice into a 7? ring mould and spread it evenly., Invert the ring over a serving plate and tap sharply to unmould the rice., Pour the coconut sauce in the centre and serve immediately garnished with spring onion greens., , , , , , , , , , , , , , , Thai Fried Rice recipe, Thai Recipes Video by Tarla Dalal, , , , , ×, , , , , , Thai Fried Rice recipe with step by step photos, , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, null, , , , , , Click here to view, Calories for Thai Fried Rice, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Foodie #690575, , March 13, 2025, midnight, , I tried without onions and garlic .. Awesome taste.. I used American corn replace of baby corn.. With Thai green curry, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , n_katira, , March 13, 2025, midnight, , The curry paste definitely lends a Thai touch to this rice but the coconut sauce for serving is the USP of this recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Green Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Massaman Curried Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Chatuchak Fried Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Babycorn and Mushroom Curry Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Thai Layered Rice (  Thai Cooking) recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Nutrient values, , , , , , , , , , , , , , , A vibrantly flavoured green curry paste is at the heart of the Thai Fried Rice. The paste, which is used to flavour both the rice and the coconut sauce, is a blend of myriad flavours derived from tangy lemon, ginger, onions, garlic, coriander and some spices too. Rice cooked with crunchy vegetables, soy sauce and green curry paste is shaped into a ring, which is filled with the flavoured coconut sauce, making this a sumptuous meal that turns out to be an unforgettable experience for the taste buds., , Thai Fried Rice recipe - How to make Thai Fried Rice, , , , , , , , Tags, , , , , Mixer, , Non Stick Kadai Veg, , Indian Rice, , International rice recipes, , Thai Vegetarian, , Thai Rice, , Occasion, , Valentines Day Indian recipes, , Party, , , , , , , , , , , , , , , , , , , , Preparation Time, , 20 Mins, , , , , , , Cooking Time, , 10 Mins, , , , , , , Total Time, , 30 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , , For the green curry paste, "
    }
}