{
    "ingredients": {
        "Vegetable Fried Millet": "eggs,millet,onion,green peas,tamari sauce,broccoli",
        "Mushroom Fried Rice": "rice, mushroom, onion, green bell pepper, green onion, ginger, garlic, white vinegar, soy sauce",
        "Instant Pot Egg Fried Rice": "rice, soy sauce, fish sauce, sesame oil, garlic powder, eggs, scallions, carrots and peas",
        "Quinoa fried rice": "onion,carrot,green beans,colored bell pepper,broccoli,quinoa,spring onion",
        "Chinese egg fried rice": "beans,cabbage,capsicum,carrot,eggs,garlic,ginger,onion,rice,spring onion,",
        "Millet Veg Fried Rice": "rice, carrot, cabbage, baby corn, bell pepper, beans, spring onion, black peppercorns, sugar, soy sauce, rice vinegar, veg oyster sauce",
        "Egg millet fried rice": "eggs,carrot,onion,millet,baby corn",
        "Schezuan Fried Rice": "beans,capsicum,carrot,garlic,ginger,onion,rice,schezwan,spring onion,",
        "Sesame Ginger Fried Rice": "soy sauce, hoisin sauce, chili garlic sauce, sesame oil, mushrooms, garlic, ginger, green onions, bok choy, rice,sesame seeds",
        "Chinese Fried Rice": "beans,brown rice,capsicum,carrot,onion,rice,spring onion,sprouts,",
        "Indo Chinese rice": "rice,spring onion,garlic,carrot,beans,green bell pepper,cabbage,",
        "Vegan Sesame Ginger Fried Rice": "soy sauce, hoisin sauce, sesame oil, chili garlic sauce, mushrooms, garlic, ginger, green onions, bok choy, cooked rice, cilantro,sesame seeds"
    },
    "recipe_url": {
        "Vegetable Fried Millet": "https://www.beautybites.org/vegetable-fried-millet/",
        "Mushroom Fried Rice": "https://myspicetrunk.com/2020/10/22/mushroom-fried-rice-restaurant-style-mushroom-fried-rice-easy-to-prepare-mushroom-fried-rice/?fbclid=IwAR3x5abthAQakMdhv3J05kbwo-sU4IF5BHKltsUjEbDH1o3H4XhWgIJY1K8",
        "Instant Pot Egg Fried Rice": "https://www.busycooks.net/instant-pot-egg-fried-rice/",
        "Quinoa fried rice": "https://www.indianveggiedelight.com/quinoa-fried-rice-recipe/",
        "Chinese egg fried rice": "https://www.tarladalal.com/chinese-egg--fried-rice-2618r",
        "Millet Veg Fried Rice": "https://www.cookclickndevour.com/easy-veg-fried-rice-recipe-indian-style/?fbclid=IwAR2r7L2HSIDQNDsJv87zaOYfYVVoybARD8xWWiLcMPL-mF54eRtvisRdmWY",
        "Egg millet fried rice": "https://somethewiser.com/2014/08/millet-fried-rice.html",
        "Schezuan Fried Rice": "https://www.tarladalal.com/schezuan-fried-rice-schezwan-fried-rice-4166r",
        "Sesame Ginger Fried Rice": "https://www.thissavoryvegan.com/vegan-sesame-ginger-fried-rice/",
        "Chinese Fried Rice": "https://www.tarladalal.com/chinese-fried-rice-diabetic-friendly-recipe-3467r",
        "Indo Chinese rice": "https://www.facebook.com/ambikashettyskitchen/videos/2-indo-chinese-recipes-for-lunch-time-/1238167749916102/",
        "Vegan Sesame Ginger Fried Rice": "https://www.thissavoryvegan.com/vegan-sesame-ginger-fried-rice/"
    },
    "Recipe": {
        "Vegetable Fried Millet": "Ingredients: 3 eggs, 2 cups cooked millet, 1-2 carrots, chopped, 1 onion, chopped, 3 garlic cloves, minced, ½ cup frozen peas, 3 tbsp olive oil, 3 tbsp tamari sauce, ½ cup chopped bok choy / you can also add cabbage or broccoli instead, Optional: other vegetables, Asian chili sauce Instructions: turning off after 5-7 minutes, while still keeping the cooking pot on the stove with closed lid for around 5-10 min., That’s just fiy if you decide you do need some help with cooking millet., Also make sure to not use too much water, usually I cook millet in proportion 2:3 (millet:water, although, might be a little more water than that)., Chopping, Then you start multitasking until your IQ drops to 10. Why? Because while you’re cooking your millet, you can do some chopping as well. You need a knife, a, chopping board, and lots of vegetables. Now I know you have lots of leftover vegetables., Don’t pretend to me!, “I don’t have any vegetable leftovers, I eat all my veggies as soon as I see them”. AAaaaaeeerrr. Lies!!!., We all have leftover vegetables., Right now there are some carrots in my fridge that need some serious CPR. They’re one step away from becoming mold. What do we do with such vegetables?, We don’t throw them away or feed them to our enemies, we use them in this beautiful and nutritious, vegetable fried millet, . That’s what this dish was, made, for., I make it every single week – it’s the most delicious way you can eat any leftover vegetables. Did I mention leftover vegetables? Leftover vegetables., Cooking, So okay you’ve cooked your millet and it looks fluffy, not mushy. You’ve found some old vegetables and decided to chop them for this., Now it’s time to take a, large non-stick pan, with a lid to cover. Put it on a stove, crack some eggs and scramble them in there. I used olive oil for this – coconut oil will work as well., Then add onions, garlic, cabbage if you have any and then millet. After that you stir like crazy and in the end add your leftovers., When you’re done you start eating and thanking mother nature for your taste buds., THIS VEGETABLE FRIED MILLET IS GOOD FOR YOUR SKIN, I’ve already  talked a little about my admiration for millet in this, recipe post, ., it has, more iron, than most foods, is, gluten-free, alkaline, Maybe it’s also worth to mention that this recipe is high-protein, high-fiber and loaded with antioxidants, thanks to all the vegetables you can use., Even though they’re leftovers, they still have some talents to share. I’ve said it many times, but I’ll repeat: all of these things (antioxidants, fiber, healthy fats, iron) are important for healthy, young, firm and radiant skin., You won’t find them in your regular fried rice., , , Yield: 3, VEGETABLE FRIED MILLET (VEGETARIAN, GLUTEN-FREE), , , , Print, Delicious vegetable fried millet recipe - the perfect gluten and dairy free dinner idea! This vegetarian millet recipe is ready in about 20 minutes and will become a favorite!, , Prep Time, , 10 minutes, , , Cook Time, , 10 minutes, , , Total Time, , 20 minutes, , If you don’t have cooked millet, not mushy., While cooking the millet/ before starting chop all vegetables – start in this order: onion, garlic, if you have – broccoli or cabbage, carrot, bok choy, pepper - because you’ll be putting these vegetables in this order, you need to have them ready., Once millet is cooked you can start with the fun part: In a large non-stick skillet with a lid, scramble the eggs at medium-high heat with some olive oil., When eggs are ready, add onion and garlic and stir well together., Add peas and millet, stir again., Add 1 tbps olive oil and 2 tbsp soy sauce. Also if you have cabbage – now’s the time to toss it. Stir well and taste. Do you need salt? If the answer is yes, add 1 more Tbsp. soy sauce in the next step., Add broccoli, carrot, bock choy and stir everything well, turn off heat and stir for a few more minutes., Then you’re ready! Taste and add salt or pepper if you need. Serve with some Asian chilli sauce, if you’d want something spicier., Nutrition Information, , Yield, 3, , Serving Size, 1, , Amount Per Serving, , Calories, 422, Total Fat, 20g, Saturated Fat, 4g, Trans Fat, 0g, Unsaturated Fat, 15g, Cholesterol, 186mg, Sodium, 1045mg, Carbohydrates, 46g, Fiber, 7g, Sugar, 6g, Protein, 16g, © Beauty Bites, , , Cuisine:, Gluten free, , /, , Category:, Dinner, , Hope you like this recipe, let me know if you make it and use your leftovers!, Share:, 10 Comments, « Healthy Tzatziki With Vegan Dairy-Free Version, Cold Yogurt Soup with Cucumbers and Dill », Comments, , Meg, , says, 30th August 2017 at 11:00 pm, This was delicious!  I doubled it for our family of 6 and it was so tasty.  Wouldn’t change a thing!, Reply, , Stella, , says, 1st September 2017 at 6:13 pm, Thank you :), I’m happy you and your family enjoyed it!, Reply, , Terry K., , says, 30th January 2021 at 8:34 pm, I absolutely love millet. You can do so much with it. This is a wonderful recipe & all the people i cook for love it too., Reply, , Stella, , says, 31st January 2021 at 5:41 pm, I agree, it’s so versatile! Thank you, Terry!, Reply, , Stephanie, , says, 30th March 2018 at 3:08 am, My kiddo likes his carrots cooked so I steamed my chopped carrots a bit before adding. So good!!!, Also I added the garlic and onion to the egg and scrambled it with it, so they could cook a tad longer. Put salt and pepper in while scrambling, and a tiny bit (1TB) of nutritional yeast seasoning., And used Bragg liquid aminos in place of soy sauce — so so so delicious!!, My leftover veggies were: celery and carrots. That’s it! With the peas, onion, and garlic, this millet dish is AMAZING. THANK YOU!, Reply, , Stella, , says, 31st March 2018 at 2:40 pm, So happy you enjoyed the recipe – love your suggestions!, Reply, , Theresa Galuba, , says, 21st December 2018 at 4:05 pm, Made it last night for dinner….it was really good…I used organic coconut aminos from trader Joe’s in place of soy sauce.I made it for 2 dinners so today we will have a repeat…can’t wait.I used carrots,onions and peas…..nothing needs to be changed in this recipe….THANK YOU., Reply, , Stella, , says, 27th December 2018 at 10:31 pm, Thank you Theresa, glad you enjoyed the recipe!, Reply, , Nicole, , says, 16th January 2022 at 5:57 pm, This is one of my go to recipes. Easy, nutritious, and delicious. Thank you!, Reply, , Stella, , says, 21st January 2022 at 8:25 am, glad you enjoyed it!, Reply, Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, Name, *, , Email, *, , Website, , , , Welcome to Beauty Bites!, Here you’ll find delicious clean eating recipes, healthy meal plans, Mediterranean diet recipes, anti-inflammatory recipes, daily habits for a healthy lifestyle, weight loss tips and so much more! You can read more about me, here, ., Search, Get The Clean Eating Recipe Binder, , Mediterranean Diet, Inflammation, Clean Eating Meal Plans, Mediterranean Diet Plan For Beginners, , 40+ Mediterranean Diet Recipes (30 Minutes Or Less), , 30+ Meal Prep Mediterranean Diet Recipes, , 5-Minute Mediterranean Bowl, , Mediterranean Salmon Bowl, How To Eat To Reduce Inflammation In The Body, , 7-Day Anti-Inflammatory Diet Meal Plan, , How To Make An Anti-Inflammatory Smoothie, , 5 Inflammatory Foods You Should Never Eat, , The 5 Best Anti-Inflammatory Diet Foods, 14-Day Clean Eating Meal Plan For Beginners, , 7-Day No Sugar Challenge and Meal Plan (Gluten Free), , 3-Day Detox Meal Plan To Rejuvenate You, , 7-Day Dairy Free Gluten Free Meal Plan, , Anti-Inflammatory Meal Plan (Weekend Edition), Health & Fitness, Gut Health, , How to Lose 10 Pounds In A Month, , Intermittent Fasting For Beginners: What To Eat & Do, , 7 Healthy Habits For Your Mental And Physical Health, , 7-Day Pilates & Barre Workout Plan, , How To Wake Up Early: 5 Tips That Actually Work, , Clean Eating For Beginners: 6 Steps To Start A Healthy Diet, Gut Health Food List: Improve Your Gut Microbiome, , Inflammation and Gut Health – How Are They Connected, , How To Heal Your Gut For Weight Loss, Clear Skin And Happier Brain, , 7 Activities You Didn’t Know Are Beneficial For Your Digestive System, Disclaimer, All content found on the Beautybites.org, including: text and images or other formats were created for informational purposes only. The content is not intended to be a substitute for professional medical advice, diagnosis, or treatment., Here you can find our, Privacy Policy., Copyright © 2025 · Beauty Bites. All rights reserved., Skip to Recipe, , , , , , , ,",
        "Mushroom Fried Rice": "❌ Error scraping https://myspicetrunk.com/2020/10/22/mushroom-fried-rice-restaurant-style-mushroom-fried-rice-easy-to-prepare-mushroom-fried-rice/?fbclid=IwAR3x5abthAQakMdhv3J05kbwo-sU4IF5BHKltsUjEbDH1o3H4XhWgIJY1K8: 404 Client Error: Not Found for url: https://myspicetrunk.com/2020/10/22/mushroom-fried-rice-restaurant-style-mushroom-fried-rice-easy-to-prepare-mushroom-fried-rice/?fbclid=IwAR3x5abthAQakMdhv3J05kbwo-sU4IF5BHKltsUjEbDH1o3H4XhWgIJY1K8",
        "Instant Pot Egg Fried Rice": "Ingredients: Fried Rice Recipe Instant Pot Variations, Can I add meat in it?, What kind of rice is best for this fried rice?, How to make Instant Pot Egg Fried Rice, How long to cook the rice in a pressure cooker?, How to avoid mushy fried rice?, How to serve Instant Pot Fried Rice, Fried Rice in Instant Pot Storage, More Favorite Instant Pot Recipes, More Favorites from Busy Cooks, Instant Pot Fried Rice, , Seriously, the Best Instant Pot Fried Rice, , you can also make this recipe your own by adding in your own vegetable and protein options too., , , , , Rice, – I recommend using white jasmine rice, or long grain basmati rice would also work., Fish sauce, – While it smells funky, it adds a nice boost of flavor and you won’t taste anything funky!!!, Toasted sesame oil, – Adds amazing flavor that can’t be substituted., Frozen carrots and peas, – A convenient way to add some color and nutrition. You can always use fresh carrots if desired., , Fried Rice Recipe Instant Pot Variations, , You can add any kind of meat for variety! Leftover chicken, beef, shrimp all work perfectly!, You can also use diced sweet potatoes, zucchini, edamame to switch things up too., , , Can I add meat in it?, , Absolutely! Any kind of protein, shrimp, chicken, beef, or pork will work well in this recipe!, , Simply cook the meat in the skillet before scrambling the egg. If using rotisserie chicken, add it to the rice along with vegetables and egg mixture and not before scrambling the egg as the meat is already cooked., , , , What kind of rice is best for this fried rice?, , The goal for a good fried rice recipe is to have rice that is cooked perfectly without being overdone. The rice should hold its shape well and not stick together when mixing the dish. It shouldn’t be mushy either., , I have found that medium to long grain rice works well, I used white jasmine rice which always comes out perfectly. Jasmine rice comes out fluffy, fully cooked through and still maintains its structure., , Steer clear of short-grain rice like risotto or sushi rice as they are sticky when cooked and won’t make good fried rice. You’ll end up with a mushy ball of rice and vegetables that is not appetizing at all., , , , , , How to make Instant Pot Egg Fried Rice, , Cook the rice in the Instant Pot: Place rinsed and drained rice into the inner pot of Instant Pot., In a 2-cup measuring cup, mix water, soy sauce, fish sauce, sesame oil and garlic powder. Add it into the rice., Close the lid and make sure the valve is set to “sealing”., Set the Instant Pot to Pressure Cook/Manual for 5 minutes on high. (NOTE: It took about 6 minutes for IP to come to pressure.), To cook the eggs and veggies: Heat a skillet over medium high heat. Add oil., When the oil is hot, crack the eggs and scramble around, 1-2 minutes., Add white part of scallions and frozen vegetables and cook for 2-3 minutes, until the vegetables are thawed and heated through., Finishing touches: Once the IP time is up, let the pressure release naturally for 5 minutes (This means just leave the pot alone. You can unplug the pot, if desired) and then do quick release by turning the valve to “venting”. And carefully open the lid., Using a wooden spoon, fluff the rice and then add the sautéed vegetables and eggs mixture into the rice along with green part of scallions. Gently mix everything together and serve!, , , , How long to cook the rice in a pressure cooker?, , I’ve tested different cooking times, and found 5 minutes were just enough time for fluffy and tender rice. 4 minutes yielded slightly chewy undercooked rice., , Note that we’re not using “Rice” setting. Just manually set the time by selecting Manual or Pressure Cook button., , See more details on cooking perfect rice with an Instant Pot on the Instant Pot website, here, ., , , , How to avoid mushy fried rice?, , Having overcooked, mushy rice completely defeats the purpose of a fried rice recipe. Here are some simple tips for getting well cooked, fluffy rice every time., , Rinse., Rice is covered with excess starch from the packaging process. Rinse off the excess starch by running cold water over the rice until the water runs clear. If you skip this step, the excess starch will cause the rice to stick together and become mushy when cooking., Amount of liquid., Having too much water or sauce added to the rice while cooking also makes it mushy. This recipe doesn’t add sauce to the rice after it’s cooked but rather cooks the rice in a flavorful mixture of water, soy sauce, fish sauce, sesame oil, and garlic powder., Don’t overcook it., The last tip for getting fluffy rice is to open your Instant Pot only after 5 minutes of natural release and fluff the rice after cooking. This allows a lot of steam to be released and rids the rice of excess moisture, making the likelihood of mushy rice much lower., , , How to serve Instant Pot Fried Rice, , I like to serve this fried rice as is with some fresh scallions for garnish., , Fried Rice in Instant Pot Storage, , Can I freeze fried rice?, , Yes, you can freeze the fried rice in an airtight container for up to 1 month., , , , What is the secret to great fried rice?, , Fish sauce is the secret to well-seasoned, flavorful fried rice! And toasted sesame oil is another delicious addition., , , Do you add egg before or after in fried rice?, , I like to cook the eggs separately and combine it with fried rice., , , Do you boil fried rice before you fry it?, , Yes, you need to use cooked rice to make a fried rice., , , Does rice cook well in Instant Pot?, , It’s magical how well Instant Pot cooks rice. It comes out perfect every time!!, , , , More Favorite Instant Pot Recipes, , Instant Pot Beefaroni, Instant Pot Swedish Meatballs, Instant Pot Risotto, Instant Pot Ribs, , More Favorites from Busy Cooks, , , , Basmati Rice with Saffron, Leftover Mashed Potato Patties, Broccoli Potato Soup Instant Pot, , , , Perfect Stovetop Rice, Cooking Steelhead Trout, , , , , , , , Instant Pot Fried Rice, , , , 5, (, 19, ratings), , Created by, Shinee D., , , , Servings, 6, , servings, Prep:, 5, minutes, , mins, Cook:, 5, minutes, , mins, Total:, 25, minutes, , mins, , , Let's make amazing Instant Pot fried rice comes together in less than 25 minutes! And no leftover rice is required. Learn my tips from my recipe testing!, , , , , Print Recipe, , Pin Recipe, , Rate Recipe, , , , , , , , , , Cook Mode, Prevent your screen from going dark, , , 1x, 2x, 3x, ▢, 1 ½, , cups, , white jasmine rice, ▢, 1 ½, , cups, , water, ▢, 3, , tablespoons, , soy sauce, ▢, 2, , teaspoons, , fish sauce, ▢, 2, , teaspoons, , toasted sesame oil, ▢, ½, , teaspoon, , garlic powder, ▢, 1, , tablespoon, , olive oil, ▢, 4, , eggs, ▢, 2, , scallions, , thinly sliced, ▢, 1 ½, , cups, , frozen carrots and peas,  Instructions: the rice was so perfect and flavorful, but most importantly, fluffy and dry rice, perfect for fried rice! Then I decided to test it without sautéing rice with eggs. And guess what? It was still tasty and perfect. No mushy soft and sticky rice, instead rice grains were fluffy and separate., A total game-changer!, , This is a great, , Rinse the rice in a mesh sieve under running cold water until the water runs clear. (, TIP:, Removing as much starch as possible by rinsing produces fluffier rice!) Drain well and put the rice into the inner pot of Instant Pot., In a 2-cup measuring cup, mix water, soy sauce, fish sauce, sesame oil and garlic powder. Add it into the rice., Close the lid and make sure the valve is set to “sealing”., Set the Instant Pot to Pressure Cook/Manual for 5 minutes on high. (, NOTE:, It took about 6 minutes for IP to come to pressure.), Meanwhile, , heat a skillet over medium high heat. Add oil., When the oil is hot, crack the eggs and scramble around, 1-2 minutes., Add white part of scallions and frozen vegetables and cook for 2-3 minutes, until the vegetables are thawed and heated through., Once the IP time is up, let the pressure release naturally for 5 minutes (, This means just leave the pot alone. You can unplug the pot, if desired, ) and then do quick release by turning the valve to “venting”. And carefully open the lid., Using a wooden spoon, fluff the rice and then add the sautéed vegetables and eggs mixture into the rice along with green part of scallions. Gently mix everything together and serve!, , Video, , Notes, This recipe has been tested in my favorite, Instant Pot DUO 6qt, ., , Nutrition, Serving:, 1, serving, Calories:, 270, kcal, Carbohydrates:, 42, g, Protein:, 9, g, Fat:, 7, g, Saturated Fat:, 2, g, Cholesterol:, 109, mg, Sodium:, 735, mg, Potassium:, 192, mg, Fiber:, 2, g, Sugar:, 1, g, Vitamin A:, 3522, IU, Vitamin C:, 5, mg, Calcium:, 45, mg, Iron:, 2, mg, , , , * Disclaimer: All nutrition information are estimates only., Read full nutrition disclosure., , , , , , , , , , Tried this recipe?, , Make sure to follow on, Instagram, and, Pinterest, for more recipes!, , , , , Sharing of this recipe is encouraged and appreciated. Copying of full recipe to any social media is prohibited., , , Stay connected and join Busy Cooks community:, FACEBOOK, |, PINTEREST, |, INSTAGRAM, , Previous, Salmon Cakes with Roasted Red Pepper, Next, Instant Pot Pot Roast with Potatoes and Barley, Reader Interactions, , , , 5 from 19 votes (, 10 ratings without comment, ), , , , Comments, + Reviews, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Notify me of follow-up comments via e-mail. You can also subscribe without commenting., , , , Δ, , , , Reader's, Reviews, , , , , , Shari, , says, , , January 13, 2024, , , , Would you fry the eggs in the instapot then add the rice and flavored water and pressure cook?, , , Reply, , , , , , , , Shinee, , says, , , January 17, 2024, , , , No, I don’t recommend cooking the eggs in the pressure cooker., , , Reply, , , , , , , , , , Michael, , says, , , July 18, 2023, , , , This came out so great! And it could hardly be easier. Used whatever veggies I had (onion, frozen peas, broccoli, arbol chilis) and added fresh basil at the very end for a bit of that thai flavor and it was really such a good, wholesome dish. Plus any chance I get to use my instant pot is also a victory so thank you so much for this recipe! I’ll definitely be using it again 🙂, , , Reply, , , , , , , , Shinee, , says, , , August 13, 2023, , , , Yay, so happy you tried and loved the recipe, Michael!!! Thank you for sharing your feedback., , , Reply, , , , , , , , , , Alison, , says, , , March 22, 2023, , , , Is there a way to use brown rice?, , , Reply, , , , , , , , Shinee, , says, , , March 26, 2023, , , , Hi, Alison. I’ve never tried this with brown rice, but you could adapt the cooking time and liquid ratio according to, how to cook brown rice in Instant Pot, . Hope this helps, and let us know if you give it a try., , , Reply, , , , , , , , , , Melissa, , says, , , February 2, 2023, , , , All the family loved this!  So easy and so yummy!  Even the picky one cleaned his plate!!!!!, , , Reply, , , , , , , , Shinee, , says, , , February 21, 2023, , , , Yay, that’s what we call a “dinner win”!! Thank you so much for your feedback, Melissa!!, , , Reply, , , , , , , , , , Bonedawgie, , says, , , January 21, 2023, , , , Easy peazy recipe. We used to dry over couple days cooked rice. No more! Recipe allows you to be inventive with your major protein.  I actually experimented with adding to dollops of my home made salsa brownie. All in all most excellent, easy dish to make., , , Reply, , , , , , , , Shinee, , says, , , February 21, 2023, , , , So happy you tried and loved the recipe!! Thank you for your feedback!, , , Reply, , , , , , , , , , Pam barrett, , says, , , October 22, 2022, , , , I have frozen peas but fresh carrots? Does that change the cooking time?, , , Reply, , , , , , , , Shinee, , says, , , October 23, 2022, , , , Hi, Pam. Yes, fresh carrots need more time cooking. I’ve stir fry the chopped carrots before cooking the eggs., , , Reply, , , , , , , , , , Kim, , says, , , September 18, 2022, , , , I was skeptical but really happy I tried this recipe. I made some changes and still had great results. I didn’t have fish sauce, I added an additional tsp of soy sauce (I used liquid aminos)., I didn’t have scallions, I used a small yellow onion. I didn’t have frozen peas & carrots, just peas. I used 2 carrots, chopped by me. Instead of scrambling eggs first I cooked my veggies until onions were clear, then I added in eggs lightly scrambled already., After the final mix in to the cooked rice, it was as good as I could hope for. Thanks for a new option making fried rice with an insta pot., , , Reply, , , , , , , , Shinee, , says, , , September 23, 2022, , , , Hi, Kim. Thank you so much for your feedback. So glad you tried and loved it., , , Reply, , , , , , , , , , Annmary Charles, , says, , , May 5, 2022, , , , We just loved this fried rice!  It was fast, easy, and delicious.  This will be my go-to recipe for instant pot fried rice!  Thank you for sharing and demonstrating., , , Reply, , , , , , , , Shinee, , says, , , May 9, 2022, , , , Yay, so glad you tried and loved my recipe. Thanks for your feedback, Annmary!, , , Reply, , , , , , , , , , julie Vibert, , says, , , March 18, 2022, , , , What an I use instead of sesame oil, , , Reply, , , , , , , , Shinee, , says, , , March 19, 2022, , , , You can skip it, if you don’t have it. But I really love the flavor it adds. There is no substitute for sesame oil., , , Reply, , , , , , , , , , Yana Tzan, , says, , , October 25, 2021, , , , Wow it was amazing and super easy and fast, thank you so much for sharing!!!, , , Reply, , , , , , , , Shinee, , says, , , October 26, 2021, , , , Yay, so happy you tried and loved the recipe, Yana! Thank you for your feedback!, , , Reply, , , , , , , , , , Frank, , says, , , December 2, 2020, , , , Never made an egg fried rice before, but with your easy instruction, I couldn’t believe how delicious it was. Thank you so much!, , , Reply, , , , , , , , Shinee, , says, , , December 2, 2020, , , , So happy you tried and loved the recipe. Thank you for your feedback, Frank!, , , Reply, , , , , , , , , , Kris, , says, , , September 21, 2020, , , , This turned out great! Rice is so fluffy 😊 Thanks for the recipe and video., , , Reply, , , , , , , , Shinee, , says, , , September 21, 2020, , , , Yay, so happy you tried and loved this recipe, Kris. Thank you for sharing your feedback., , , Reply, , , , , , , , , , Jamie, , says, , , September 14, 2020, , , , This is as good as take out! It will be a keeper in my kitchen ., , , Reply, , , , , , , , Shinee, , says, , , September 15, 2020, , , , Awesome. So happy you tried and loved the recipe, Jamie. Thank you for your feedback!, , , Reply, , , , , , , , , , Lacy, , says, , , June 5, 2020, , , , Do you think I could double this recipe and use my 8qt IP? Would it come out okay? Thank you!, , , Reply, , , , , , , , Shinee, , says, , , June 5, 2020, , , , Hi, Lacy. While I didn’t try this recipe doubled, I don’t see why it wouldn’t work., , , Reply, , , , , , , , Matt, , says, , , December 7, 2020, , , , The first time I made this I doubled the recipe still using a 6 qt IP and it worked great.  I followed the time 5/5 and the rice was just done, so I would probably do 5/7 next time.  Fantastic flavor.  Perfect amount of soy sauce for me and allows others to add a bit more if they wish.  This will become a standard in our house., , , Reply, , , , , , , , Shinee, , says, , , December 7, 2020, , , , Hi, Matt! Thank you so much for sharing your helpful feedback!! Glad doubling the recipe works and so happy you and your family loves it!!!, , , Reply, , , , , , , , , , , , Maddie, , says, , , February 27, 2020, , , , If I add boneless chicken breast and I cook it in the sauté pan as stated, do I cook it thoroughly or does it finish cooking in the instant pot?, , , Reply, , , , , , , , Shinee, , says, , , February 27, 2020, , , , Hi, Maddie. You’ll need to cook it through in the pan, because we’ll just combine the rice and veggies/chicken once the rice is cooked., , , Reply, , , , , , , , , , Emma, , says, , , November 30, 2019, , , , Made this recipe the other day, and it turned out great! I’m a new cook, other than that I followed the recipe exactly. The liquid to rice ratio was perfect and rice came out fluffy and flavorful!, Thank you!, , , Reply, , , , , , , , Shinee, , says, , , December 1, 2019, , , , Yay, so glad you liked the recipe, Emma. Thank you for your feedback!, , , Reply, , , , , , Primary Sidebar, , , Free Guide, To Weeknight Dinner Success, , Join Busy Cooks Newsletter for dinner inspirations and speedy cooking tips. Plus, get a FREE guide to weeknight dinner success., , , Yes, I want it!, Built with ConvertKit, , , , , , Hi, I'm Shinee!, , Welcome to Busy Cooks Community. We believe you can eat home-cooked dinner every single day despite your busy schedule! Busy Cooks is your one-stop solution to your nightly dilemma: what to make for dinner., , More About Us, , , , , , , Search for, , , , search, , , , , Featured Recipes, , , , , , , , Oven Baked Bacon (Big Batch), , , , , , , , , Easy Philly Cheesesteak Sandwiches, , , , , , , , , Spiced Shrimp Fried Rice, , , , , , , , , How to Cook Ribeye Steak on the Stove, , , , , , , Popular Recipes, , , , , , , , Easy Chinese Stir Fry Sauce, , , , , , , , , Mom’s Buttermilk Chicken Finger Recipe, , , , , , , , , 20-Minute Sausage and Potatoes Skillet, , , , , , , , , Stuffed Shells with Meat, , , , , , , , , Instant Pot Cheesy Bacon Ranch Potatoes, , , , , , , , , Creamy Coconut Shrimp, , , , , , , , , What's, For Dinner, , , , , Honey Mustard Roasted Salmon, , , , , How to Cook Steak on the Stovetop, , , , , How to Cook Chicken Thighs on Stove, , , , , Garlic Butter Rice, , , , , , , , , Free Guide, To Weeknight Dinner Success, , Yes, I want It!, , , , , , , , , , We’re so happy to have you here!, , Busy Cooks is your one-stop solution to your nightly dilemma: what to make for dinner., , , , , , , , , , Browse Recipes, , Recipe Index, , By Course, , By Cuisine, , By Diet, , By Ingredient, , , By Occasion, , By Theme, , , , , , , ©2018 - 2025 Busy Cooks®., About, , Privacy Policy, , Contact, , , Design by, Pixel Me Designs, , , , , , , ×, , , Free Guide, To Weeknight Dinner Success, , Join Busy Cooks Newsletter for dinner inspirations and speedy cooking tips. Plus, get a FREE guide to weeknight dinner success., , , Yes, I want it!, Built with ConvertKit, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Quinoa fried rice": "Ingredients: How to Make Quinoa Fried Rice, What to Serve with Quinoa Fried Rice?, Storing Suggestions, Variations, More Fried Rice Recipes, Quinoa Fried Rice Recipe, Variations for Making Quinoa Fried Rice, , , , , White Quinoa:, Make sure to rinse it under cold water to remove the natural coating, called saponin, to avoid any bitterness before adding it to the Lemon Quinoa recipe., , Vegetables:, I used veggies like garlic, onions, spring onions, carrots, beans, broccoli, and colored bell peppers in this recipe, but feel free to add other veggies of your choice, like mushrooms and sweet corn., , Soy sauce:, I used light Soy sauce. If gluten-free, you can use Tamari or coconut aminos., , Vinegar:, I used white vinegar, as it adds a slight tang to the rice and elevates the flavors. You may substitute it with rice vinegar or apple cider vinegar., , Sesame oil:, Toasted Sesame oil adds a great nutty flavor to the dish. You may also use olive oil or any cooking oil of your choice., , Seasonings:, Salt and freshly crushed black pepper., , , , How to Make Quinoa Fried Rice, , How to Cook Quinoa:, , On Stovetop Pot, : Cook the ½ cup of rinsed quinoa with 1 cup of water on medium-low heat until cooked, and let it cool., , Stovetop, , Pressure Cooker, : Pressure cook the ½ cup of rinsed quinoa with 1 cup of water for, two whistles on medium-low heat, . Let the pressure release naturally., , In Instant Pot (Electric Pressure Cooker), : Pressure cook the ½ cup of rinsed quinoa with ¾ cup of water on MANUAL/PRESSURE COOK mode for 1 minute. Let the pressure release naturally. Check the detailed recipe of, How to cook quinoa in instant pot, ., , Stir Fry:, , Heat 1 tablespoon of the sesame (or olive oil) in a skillet or wok over medium-high heat. Add 3 garlic cloves (minced) and saute for 30 seconds or until aromatic., , Then add ¼ cup of onions (finely chopped) and 2 green chilies and cook for about 2 minutes till the onions turn soft., , , Add ¼ cup carrots (diced), ½ cup of colored bell peppers (diced), ¼ cup broccoli florets, and ¼ cup green beans (diced), and stir fry on high flame till the vegetables are cooked and tender., , Then add 2 teaspoons soy sauce, 1 teaspoon white vinegar, and saute on high flame, stirring regularly without getting burnt., , , Add 1.5-2 cups of cooked quinoa, salt, ground black pepper and gently mix it evenly. Cook on low flame for 2-3 minutes., , , Final Garnishing:, , Sprinkle sliced spring onions on Indian Style, vegetable fried rice with quinoa, recipe just before serving., , , , What to Serve with Quinoa Fried Rice?, , Serve, quinoa, veggie, , fried rice, with sriracha sauce, , gobi manchurian, , and, veg clear soup, on the side. If you don't prefer sides, it can be eaten as it is., , , Storing Suggestions, , Quinoa fried rice can be stored in an airtight container for about, 2-3 days, in the refrigerator. Then, reheat it in the microwave or wok until warm before serving it again., , Variations, , , Protein:, Add ½ cup of crumbled paneer (cottage cheese), tofu, or scrambled eggs., , Vegetables:, Add vegetables of your choice. You can also add mushrooms., , Greens:, Stir in some spinach leaves or kale towards the end of the cooking time., , Spicy:, Add either crushed red pepper flakes or a few teaspoons of sriracha or schezwan sauce., , Oil, : You can also use coconut oil. But to get a classic fried rice taste, use sesame oil., , Keto:, Replace quinoa with, cauliflower rice, . You can also add edamame to the keto diet., , , More Fried Rice Recipes, , Mushroom Fried Rice (Indian Chinese Style), Vegetable Fried Rice (Stovetop & Instant Pot), Paneer Fried Rice, Burnt Garlic Fried Rice, , Tried this recipe?, Don’t forget to give a ★ rating below, , , , , , Quinoa Fried Rice Recipe, , , Bhavana Patil, , , Quinoa Fried Rice recipe is a quick, easy and delicious Indian Chinese style stir fried dish that can be prepared with leftover quinoa in just 20 minutes., , , 4.75, from, 4, votes, , , , Print Recipe, , Pin Recipe, , , , , , , , , Servings:, 2, , , Calories :, 247, , , Course:, Main Course, , Cuisine:, Indian, Indian-Chinese, , Diet:, Gluten-Free, Vegan, Vegetarian, , , 1x, 2x, 3x, 1, , tablespoon, , sesame, , Or olive oil, 3, , cloves, , garlic, , minced, 2, , green chilies, , slit lengthwise, ¼, , cup, , onions, , finely chopped, ¼, , cup, , carrot, , diced, ¼, , cup, , green beans, , diced, ½, , cup, , colored bell pepper, , (red, green), ¼, , cup, , broccoli, 2, , teaspoon, , soy sauce, , (adjust to suit your taste), 1, , teaspoon, , white vinegar, , or apple cider (optional), 1.5-2, , cups, , cooked quinoa, black pepper, , to taste, salt, , to taste, few, , spring onions, , for garnish,  Instructions: Stovetop, , , , , , , Prep Time :, 10, minutes, , minutes, , Cook Time :, 10, minutes, , minutes, , Total Time :, 20, minutes, , minutes, , , , , How to Cook Quinoa, On Stovetop Pot, : Cook the ½ cup of rinsed quinoa with 1 cup of water on medium-low heat until cooked, and let it cool., Stovetop, , Pressure Cooker, : Pressure cook the ½ cup of rinsed quinoa with 1 cup of water for two whistles on medium-low heat. Let the pressure release naturally., In Instant Pot (Electric Pressure Cooker), : Pressure cook the ½ cup of rinsed quinoa with ¾ cup of water on MANUAL/PRESSURE COOK mode for 1 minute. Let the pressure release naturally. Check the detailed, recipe, ., Stir Fry:, Heat 1 tablespoon of the sesame or olive oil in a skillet or wok over medium-high heat. Add the minced garlic and saute for 30 secs or until aromatic., Then add onions and green chili and cook for about 2 minutes till onions turn soft., , Add carrots, colored bell peppers (capsicum), broccoli, green beans, and stir fry on high flame till the vegetables are cooked and tender., Then add soy sauce, vinegar, and saute on high flame, stirring regularly without getting burnt., , Add the cooked quinoa, salt, ground black pepper to this and gently mix it evenly. Cook on low flame for 2-3 minutes., , Final Garnishing:, Sprinkle sliced spring onions just before serving., , , , Notes, Variations for Making Quinoa Fried Rice, , , Protein:, Add ½ cup of crumbled paneer (cottage cheese), scrambled tofu, or eggs., , Vegetables:, Add vegetables of your choice. You can also add mushrooms., , Greens:, Stir in some spinach leaves or kale towards the end of the cooking time., , Spicy:, Add either crushed red pepper flakes or a few teaspoons of sriracha or schezwan sauce., , Oil, : You can also use coconut oil. But to get a classic fried rice taste use sesame oil., , Keto:, Replace quinoa with cauliflower rice. You can also add edamame to the keto diet., , , , , Note: Nutrition values are my best estimates. If you rely on them for your diet, use your preferred nutrition calculator., , Nutrition, Calories:, 247, kcal, Carbohydrates:, 43, g, Protein:, 9, g, Fat:, 5, g, Saturated Fat:, 1, g, Sodium:, 514, mg, Potassium:, 512, mg, Fiber:, 8, g, Sugar:, 7, g, Vitamin A:, 4013, IU, Vitamin C:, 69, mg, Calcium:, 95, mg, Iron:, 3, mg, , , , , Keyword, quinoa fried rice, , , , , , Tried this recipe?, Share your photo and tag, @indianveggiedelight, or, #indianveggiedelight, , ★ Like this recipe? FOLLOW ME on, Facebook, ,, Instagram, ,, Pinterest, , and, Youtube, for more quick & easy recipes., , More Healthy Quinoa Recipes, Quinoa Khichdi - Instant Pot & Stovetop, Quinoa Biryani - Instant Pot, Quinoa Upma (Instant Pot & Stovetop), Indian Quinoa Recipes | Quinoa Recipes, , , , 212, , shares, , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , , 4.75 from 4 votes (, 4 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, , , Email, , , , , , , , , , , , Nily, , , November 16, 2022 at 10:34 am, , , , Loved this recipe! Packed for my kid's lunchbox. Only thing is to have cooked and cooled quinoa on hand., , , Reply, , , , , , , , Bhavana Patil, , , November 16, 2022 at 11:21 am, , , , Hi Nily, thats so good to know.. Yeah pre-cooked quinoa helps with meal planning, however, if you have Instant pot, you can make the quinoa fried rice in one-pot itself, will update the post shortly., , , Reply, , , , , , Primary Sidebar, , , , , Hey, I'm Bhavana, , Here, you'll find easy recipes for your Instant Pot, Air-fryer, Kids Lunch Box, and Keto/LowCarb, plus more wholesome, easy Vegetarian/Vegan Indian recipes that your family will love., , , Learn more about me->, , , , , Popular Recipes, , Healthy Indian Kids Lunch Box Recipes, 40+ Best Vegetarian Indian Dinner Recipes (Easy Dinner Ideas), 25+ Best Indian Breakfast Recipes, The Best Avocado Pasta, 18+ Best Indian Salad Recipes, 20+ Easy Air Fryer Indian Recipes, , , , , Footer, , , , as featured in:, , , , , , , , , , , , , , , , , , , , , , ↑ back to top, , , , , , , Recipes, , , COOKING 101, , INSTANT POT 101, , INSTANT POT RECIPES, , AIR FRYER RECIPES, , KIDS LUNCH BOX, , , , , About, , , ABOUT BHAVANA, , CONTACT, , PRIVACY POLICY, , SHOP, , SUBSCRIBE, , , , , , , As an Amazon Associate, I earn from qualifying purchases., , Copyright © 2025, Indian Veggie Delight, , , , , , , , 212, , shares, , , , , , , , , , , , , , , 212, , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Chinese egg fried rice": "Ingredients: , , , , , , , , egg fried rice restaurant style, ., Rice and egg lovers who are pressed for time; this simple, egg fried rice at home, is for you! This delicious, one-dish meal, is ready in about 30 minutes. You can even use leftover rice to reduce your cooking time. The veggies further enhance its eye appeal with its colourful hue, while also adding in some, fibre, and, antioxidants, to boost overall health., To make, Chinese egg fried rice, , boil the rice. Each grain of the cooked rice should be separate. Keep aside. Break the eggs into a deep bowl, add salt and pepper and whisk well. Keep aside. Heat the oil in a deep pan or wok/ kadhai, add the garlic and ginger and sauté on a high flame for 1 minute. Add all the vegetables and sauté on a high flame for 2 to 3 minutes. Move the vegetables on one side of the pan and pour the eggs. Mix well and cook on a medium flame for 2 minutes, while scraping the sides of the pan continuously. Add the rice, soy sauce, salt and pepper, mix well and cook on a high flame for 2 to 3 minutes, while stirring occasionally. Serve the chinese egg- fried rice immediately. Unlike some hurried versions in which the eggs are placed in one chunk above the fried rice, here they are cooked along with the vegetables to make, scrambled egg rice, ., If you wish, you can even first cook the eggs like an omelette and then cut into small pieces and mix with the rice, veggies and soy sauce, to make a lip-smacking meal-in-a-bowl fried rice., Egg fried rice restaurant style, is also easy to serve as the egg pieces are uniformly distributed., Tips for, Chinese egg fried rice, . 1. Cook the rice and allow it to cool for a while before making egg fried rice. This will ensure that each grain of rice is separate. 2. Chop the veggies finely and cook them on a high flame so they maintain their crunch. 3. You can also use brown rice or cooked quinoa to make a healthy variant of the egg fried rice., To make this a complete meal, serve the Chinese egg fried rice with, Stir Fried Chinese Greens, . A bowl of piping hot, Talumein-Soup, and deep-fried, Spring-Rolls, makes egg fried rice sumptuous., Enjoy, Chinese egg fried rice recipe, |, egg fried rice, |, How to make simple egg fried rice at home, |, egg fried rice restaurant style, | with step by step photos., , Chinese Egg- Fried Rice recipe - How to make Chinese Egg- Fried Rice, , , , , , , , Tags, , , , , Deep Pan, , Kadai Veg, , Indian Dinner, , Indian style Chinese dinner, , Main Course Recipes, , Indian Rice, , International rice recipes, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 20 Mins, , , , , , , Total Time, , 35 Mins, , , , , , , Makes, , 5 servings, , , , , , , , , , , , , , , For Chinese Egg- Fried Rice, , , 2, egg, , , 1 cup, long grain rice (basmati chawal), , , , salt, and to taste, , 4 tbsp, oil, , , 1 tsp finely, chopped garlic (lehsun), , , 1 tsp finely, chopped ginger (adrak), , , 1/2 cup, finely chopped spring onions whites and greens, , , 1/4 cup finely, chopped celery (ajmoda), , , 1/2 cup, diagonally cut french beans, , , 1/2 cup finely, chopped carrot, , , 1/2 cup finely, chopped capsicum, , , 1/2 cup, shredded cabbage, , , 1/2 tbsp, soy sauce, , , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , For cooking rice for egg fried rice, , , , , , , , , For the egg fried rice, , , , , , , , , Tips to make perfect chinese egg fried rice, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , Chinese egg fried rice recipe, |, egg fried rice, |, How to make simple egg fried rice at home, |, egg fried rice restaurant style, | with 31 amazing images., Chinese egg fried rice recipe, , , , For chinese egg- fried rice, , To make, chinese egg- fried rice, , boil the rice. Each grain of the cooked rice should be separate. Keep aside., Break the eggs into a deep bowl, add salt and pepper and whisk well. Keep aside., Heat the oil in a deep pan or wok/ kadhai, add the garlic and ginger and sauté on a high flame for 1 minute., Add all the vegetables and sauté on a high flame for 2 to 3 minutes., Move the vegetables on one side of the pan and pour the eggs., Mix well and cook on a medium flame for 2 minutes, while scrapping the sides of the pan continuously., Add the rice, soy sauce, salt and pepper, mix well and cook on a high flame for 2 to 3 minutes, while stirring occasionally., Serve the, chinese egg- fried rice, immediately., , , , , , , , , , , , , , , , Chinese Egg- Fried Rice recipe with step by step photos, , , , , , , , , , , , , , , , , , For cooking rice for egg fried rice, , , , , , , , , For cooking rice for the, Chinese egg fried rice recipe, , wash 1 cup of rice thoroughly under running water until you get clear water. The removal of starch from rice helps in getting separate grains after cooking., , , , , , Transfer in a deep bowl and soak in enough water for 30 minutes., , , , , , Drain with the help of a strainer and keep aside., , , , , , Boil 4 cups of water in a deep non-stick pan., , , , , , , Add salt., , , , , , , Furthermore, add 1 tbsp of oil and mix well., , , , , , Add the rice to the boiling water and mix well., , , , , , Cook on a medium flame for 8 to 10 minutes or till the rice is 85% cooked, while stirring occasionally., , , , , , Strain it using a strainer and let the water drain out. This will give you around 3 cups after cooking. Do not overcook the rice or else they will turn soft and mushy., , , , , , Pour some cold water on the rice to stop further cooking. Let all the water from the rice drain out ensuring that the rice does not contain any moisture., , , , , , Add the remaining 1 tbsp of oil. This helps in preventing the rice from sticking together., , , , , , Toss the rice in it. Ensure each grain is coated well with oil., , , , , , Spread the cooked rice on a flat surface or a big plate and allow it to cool for 1 to 2 hours., , , , , , , , , , , , , , , , , , , , For the egg fried rice, , , , , , , , , In a deep bowl, break two eggs. If you want, you can increase the quantity of eggs to upto 4 to make this more eggy., , , , , , Add salt and pepper to taste., , , , , , Whisk together everything well. You can beat the egg if you like fluffy eggs., , , , , , Heat the oil in a deep pan. Once the oil is hot, add finely chopped garlic and ginger, sauté on a high flame for one minute. To make it more zingy, you can add finely chopped green chillies., , , , , , Add the chopped spring onion whites and greens., , , , , , Add the chopped celery., , , , , , Add the French beans., , , , , , Add the carrots. French beans and carrots are hard vegetables, if you do not prefer that bite in the vegetables then par boil and then add to the egg fried rice., , , , , , Add the chopped capsicum., , , , , , Also, add the shredded cabbage., , , , , , Sauté on a high flame for 2 to 3 minutes., , , , , , Move the vegetables to the side of the pan., , , , , , Pour the whisked eggs in the pan., , , , , , Cook until eggs are scrambled while scrapping the sides of the pan continuously. This should take around 2-3 minutes on a medium flame., , , , , , Mix together the eggs and vegetables., , , , , , Add the rice., , , , , , Add the soya sauce and salt, mix the, Chinese Egg Fried Rice, well and cook on a high flame for 2 minutes, while stirring occasionally., , , , , , Serve, Chinese Egg Fried Rice, immediately with chillies in vinegar and chilli sauce., , , , , , , , , , , , , , , , , , , , Tips to make perfect chinese egg fried rice, , , , , , , , , Avoid freshly cooked rice because it is still moist and steamy, which may yield, Chinese Egg Fried Rice, with a mushy texture., , Another way of making the, Chinese Egg Fried Rice, is to mix together the eggs, 2 tbsp of water, salt and pepper and whisk well. Grease a non-stick pan and pour the egg batter over it and cook on a medium flame for 2 to 3 minutes or till both the sides are lightly browned. Allow the omelet to cool slightly and cut into bite-sized pieces and keep aside. Along with the rice, toss in the omelet pieces and cook., , , You can also use brown rice or cooked quinoa to make healthy variant of the, egg fried rice, ., , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 181 cal, Protein, 4.8 g, Carbohydrates, 23.8 g, Fiber, 1.2 g, Fat, 7.4 g, Cholesterol, 0 mg, Sodium, 184.9 mg, , , , , , , Click here to view, Calories for Chinese Egg- Fried Rice, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Prerti, , March 13, 2025, midnight, , Loved this recipe. It can be quickly prepared  and is always a hit with my family. Thanks., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! keep reviewing recipes and articles you loved., , , , , , , , , , , , , Foodie #626534, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 4, , , , , , , , , , , , , Aussie Girl, , March 13, 2025, midnight, , Excellent recipe! So easy to prepare and unlike the greasy version served in restaurants! Thank you!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Deepu singh, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Malaika, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Minna, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , 5 spice mushroom rice recipe | five spice mushroom rice | Chinese, , , 289 Calories, , , , , , , , , , , , , , , , , 5 spice fried rice recipe | Chinese vegÂ 5 spice fried rice |Â 5 spice fried rice with paneer and bean sprouts |Â, , , 499 Calories, , , , , , , , , , , , , , , , , 5 Spice Tofu and Bean Sprouts Rice recipe, Chinese Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Vegetable Fried Rice (Jain) recipe, How to make Jain fried rice, Jain food, , , 0 Calories, , , , , , , , , , , , , , , , , Baked Layered Coconut Rice with Curry recipe, Saatvik Recipes, , , 539 Calories, , , , , , , , , , , , , , , , , Baked Mexican Rice with Cheese Patties recipe, , , 528 Calories, , , , , , , , , , , , , , , , , Bean and Spinach Rice recipe, Lebanese Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , baked beans with buttered rice recipe | bean vegetable rice | canned baked beans and rice |, , , 273 Calories, , , , , , , , , , , , , , , , , Brinjal Rice (  Zero Oil Recipe ), , , 236 Calories, , , , , , , , , , , , , , , , , how to cook brown rice on an open flame | deep non stick pan | open flame |, , , 211 Calories, , , , , , , , , , , , , , , , , Layered Spicy Vegetable Pulao recipe, Burmese Rice  Vegetarian Recipes, , , 205 Calories, , , , , , , , , , , , , , , , , Cabbage Rice recipe, Indian Recipes, , , 171 Calories, , , , , , , , , , , , , , , , , Carrot Rice recipe, Punjabi Recipes, , , 256 Calories, , , , , , , , , , , , , , , , , Cheesy Pepper Rice, Mexican Cheesy Pepper Rice recipe, Mexican Recipes, , , 323 Calories, , , , , , , , , , , , , , , , , chick pea and mint rice recipe | healthy chana pulao | pudina chana pulao |, , , 0 Calories, , , , , , , , , , , , , , , , , chilli coriander fried rice | veg chilli coriander rice | Chinese chilli coriander fried rice |, , , 287 Calories, , , , , , , , , , , , , , , , , Chinese Egg Fried Rice recipe, Egg Fried Rice (Easy, Restaurant style), , , 181 Calories, , , , , , , , , , , , , , , , , healthy fried rice recipe | Indo Chinese veg fried rice | diabetics friendly |, , , 147 Calories, , , , , , , , , , , , , , , , , How to cook perfect basmati rice in a pan or pot Indian style, , , 274 Calories, , , , , , , , , , , , , , , , , Chitrana Rice recipe made in South Indian festivals, Tarla Dalal, , , 488 Calories, , , , , , , , , , , , , , , , , Coconut Curry with Fried Rice recipe, Mexican Recipes, , , 723 Calories, , , , , , , , , , , , , , , , , coconut rice recipe | South Indian coconut rice | nariyal chawal | easy coconut rice Indian recipe |, , , 290 Calories, , , , , , , , , , , , , , , , , how to make basmati rice for biryani recipe | simple Indian basmati rice for biryani |, , , 203 Calories, , , , , , , , , , , , , , , , , how to cook rice perfectly recipe | cooked rice without pressure cooker | how to cook rice on stove, , , 206 Calories, , , , , , , , , , , , , , , , , Curd Rice recipe for Babies and Toddler, Tarla Dalal, , , 358 Calories, , , , , , , , , , , , , , , , , Layered Corn and Spinach Rice with Tomato Sauce recipe, , , 320 Calories, , , , , , , , , , , , , , , , , Crispy Rice, Deep Fried Chinese Crispy Rice recipe, Chinese Recipes, , , 702 Calories, , , , , , , , , , , , , , , , , Cucumber Curd Rice ( Pregnancy Recipe), , , 254 Calories, , , , , , , , , , , , , , , , , curd rice recipe | South Indian curd rice | dahi chawal | thayir sadam |, , , 376 Calories, , , , , , , , , , , , , , , , , Cabbage Moong Dal Khichdi for Babies and Toddlers | Vegetable Moong Dal Khichdi for Kids |, , , 211 Calories, , , , , , , , , , , , , , , , , Dhansak Rice Recipe, Veg Dhansak, Vegetarian Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Fried Rice, Chinese Veg Fried Rice recipe, Step by Step recipes for Kids, , , 208 Calories, , , , , , , , , , , , , , , , , Ghee Rice Recipe, How To Make Ghee Rice, Chawal Recipes | Pullav Recipes, , , 225 Calories, , , , , , , , , , , , , , , , , Phudina, Coriander and Coconut Milk Rice recipe, Dinner Recipes, , , 406 Calories, , , , , , , , , , , , , , , , , Babycorn and Mushroom Curry Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Hakka Rice Noodles recipe, Healthy Snacks for Kids Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Herb Rice with Creamy Mushroom and Asparagus Sauce recipe, Iron Rich Recipes, , , 225 Calories, , , , , , , , , , , , , , , , , creamy mushrooms with lemon coriander rice recipe | herbed rice with creamy mushroom | butter garlic rice with mushroom sauce |, , , 535 Calories, , , , , , , , , , , , , , , , , jeera rice | quick jeera rice | jeera pulao | cumin rice |, , , 246 Calories, , , , , , , , , , , , , , , , , Healthy Lemon Rice recipe, South Indian Lemon Rice made from Brown rice, , , 127 Calories, , , , , , , , , , , , , , , , , Lilva Rice ( Gujarati Recipe), Gujrati Recipes, , , 194 Calories, , , , , , , , , , , , , , , , , Mashkool Rice recipe, Lebanese Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Mexican Fried Rice recipe | Quick Vegetarian Mexican fried rice, , , 408 Calories, , , , , , , , , , , , , , , , , Quick Tava Rice ( Growing Kids Recipe), , , 0 Calories, , , , , , , , , , , , , , , , , rice with mixed vegetables recipe | mixed veg rice | Indian stir fry rice with vegetables in coconut paste |Â, , , 387 Calories, , , , , , , , , , , , , , , , , Schezwan Fried Rice recipe | Veg Schezwan Fried Rice | Indian style |, , , 327 Calories, , , , , , , , , , , , , , , , , vegetable cheese rice recipe | Indian style cheesy vegetable rice | garlic vegetable cheese rice |, , , 278 Calories, , , , , , , , , , , , , , , , , Spinach and Carrot  Rice recipe, Healthy Recipes, , , 256 Calories, , , , , , , , , , , , , , , , , Rice, Cooked Rice recipe, How to Steam Rice, How to cook Basmati Rice, , , 171 Calories, , , , , , , , , , , , , , , , , Stir- Fried Rice ( Wraps and Rolls) recipe, , , 0 Calories, , , , , , , , , , , , , , , , , Sundal Rice recipe, , , 0 Calories, , , , , , , , , , , , , , , , , Tava Rice ( Microwave Recipe), , , 223 Calories, , , , , , , , , , , , , , , , , Thai Layered Rice (  Thai Cooking) recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Thai Pineapple Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , tomato rice recipe | South Indian style tomato rice | thakkali sadam |, , , 232 Calories, , , , , , , , , , , , , , , , , Coconut Vegetable Curry with Coconut Rice recipe, Vegetarian Recipes, , , 697 Calories, , , , , , , , , , , , , , , , , Chinese vegetable fried rice recipe | veg Chinese fried rice |, , , 202 Calories, , , , , , , , , , , , , , , , , Vermicelli Rice, Lebanese Rice with Vermicelli recipe, Lebanese Recipes, , , 0 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Millet Veg Fried Rice": "Ingredients: How To Make Fried Rice Recipe, Tips For Making Best Fried Rice, Variations With This Easy Fried Rice, Frequently Asked Questions, More Asian Recipes, Recipe Card, Best Easy Fried Rice Recipe, , , , , , About This Recipe, , What Is Fried Rice?, , Fried rice is a broad term for Chinese style preparation of rice., You will find this in the menus at Chinese restaurants and Asian take outs., , stir fry in high heat and a total time of 20 minutes, if you include the the time for chopping vegetables the total time is 30 minutes, pretty decent for a, weeknight meal, right?, , , There is indeed some magic about perfectly stir fried rice with just the right amount of sauces :), do try out and enjoy this homemade veg fried rice recipe which is, , Quick, easy and simple, , absolutely delicious & addictive, , ready in total time of 30 minutes, , Flavorful, full of umami, smoky, , Vegan and can be easily made gluten free, ., , , , My biggest tip with any Chinese recipe is you make sure you do the prep work before beginning the actual cooking., , As we are cooking in super high heat for short time, , shall we?, , Rice, – cooked cold rice is what we need for this recipe. If you have leftover rice or a day old rice, it would be ideal for this rice., , You can use any variety of rice here really. Long grain rice, short grain rice, basmati rice, jasmine rice, white rice, brown rice anything goes. The only key for perfect fried rice is the cooked rice should be cold, non sticky and grains separate., , Vegetables, – Mixed vegetables are the main attraction of this restaurant style veg fried rice. As we are not adding any eggs or meat here, be generous with vegetables and add two or more of the following veggies, , carrots, baby corns, cabbage, bell peppers, peas, beans, broccoli, pok choy, , Sauces, – This is a very versatile recipe and you can easily use any of your preferred sauces. I generally add a good soy sauce, a bit of red chili sauce or hot sauce like sriracha and some vinegar., , I also occasionally use green chili sauce, vegetarian oyster sauce, mushroom sauce or even kimchi to make kimchi fried rice. See my instruction for the same as you read., , I always use naturally brewed low sodium soy sauce in my recipes so the quantity is a bit more. Halve if you are using regular soy sauce., , , Ginger-garlic, – I prefer to use generous quantity of freshly minced ginger garlic for making fried rice. It adds such a deep flavor and taste here., , Salt and pepper, – Season the rice with required quantity of salt and pepper before serving. You can add kosher salt too. For a milder flavor you can add powdered white pepper too., , Sesame oil, – Use very good quality sesame oil to stir fry the rice of possible. Sesame oil lends such a deep flavor and taste that is so authentic. Also while serving I like to add a wee bit of toasted sesame oil for intense flavor. A small drizzle goes a long way here., , If sesame oil is unavailable use canola oil or vegetable oil. You can also butter for that glossy finish., , How To Make Fried Rice Recipe, , Making veg fried rice can be divided into three parts., , Preparing rice & vegetables., Sautéing vegetables with sauces., fry the rice with vegetables, , Cooking Rice, , For this recipe we need cooked and cooled basmati rice, grains full and separate for this recipe. A day old rice or at least rice that has been cooked few hours before works for this veggies fried rice., , Pick and rinse raw basmati rice gently once or twice., , , Soak the rice in plenty of water for 30 minutes., , Drain the rice and spread it on a plate for few minutes., , , Next bring two cups of water to a rolling boil in a heavy pan. Add few drops of oil to the water., , , Next add the rice and mix gently once., , , Cook until all the water is absorbed, it takes around 8-12 minutes., , , Cool the rice completely before using in vegetable fried rice., , , Spread the cooked rice on a plate and add few drops of oil. Cool thoroughly before stir frying. Set aside until use., , If you wish to cook rice for fried rice in instant pot then add 2.25 cups water for 1 cup raw rice, set the timer to 4 minutes in manual or pressure cooker mode. Let the pressure settle down for 5 minutes., , Preparing Vegetables, , While the rice is getting ready, we will prepare the vegetables. This time I added a small bunch of fresh greens in this recipe and it is optional., , To make this veg rice you will the following vegetables, , 1/3 cup finely chopped carrots, , 1/3 cup frozen peas or fresh peas, , 1/4 cup finely chopped beans, , 1/3 cup shredded cabbage, , 1/3 cup bell peppers or capsicum, , 1/2 cup finely chopped spring onions bulbs and stems, , 1/2 cup spring onion greens or green onions, , Adding mushrooms lend a very earthy umami flavor this dish. Instead of fresh mushrooms I have added some mushroom sauce., , If you want you can add 3/4 cup chopped mushrooms. Set aside the vegetables., , Also finely chop two tablespoons celery, , mince 3 cloves garlic and 1 inch ginger together. Set aside ., , , Stir Fry Vegetables With Sauces, , Heat 3 tablespoons sesame oil in a Chinese wok or large saute pan. You can also use a good cast iron skillet. Heat the oil until it begins to smoke., , Add 1 teaspoon red chili flakes, 1/2 inch ginger minced, 3 cloves garlic minced and saute for a minute. Add celery, 1/2 cup spring onions or yellow onions and fry for a minute., , , Here I have added 1/2 cup fenugreek leaves which is optional. You can skip this if you don’t have. You can also add baby spinach or bok choy greens. Saute for a minute., , , Add the prepared vegetables like carrots peas and others. Saute in high flame for 2 minutes continuously., , , Now add the sauces-3 tablespoons low sodium soy sauce, 2 teaspoons red chili sauce or green chili sauce, 1 tablespoon vegetarian oyster sauce or mushroom sauce, 1/2 teaspoon brown sugar., , , Mix well, saute and fry the vegetables in high flame for 6-7 minutes or until the veggies turn a bit soft yet crunchy., , , Now maintain high flame, move the veggies to one side of the pan and splash 2 tablespoons water on the pan. Close the pan with a lid immediately to trap the steam. Cook in high flame for one more minute with lid on. This step will impart such a wonderful smoky flavor to your fried rice. The same technique we do in, pot stickers, , Stir fry the rice and make fried rice, , Open the lid of the pan and add the cooked and cooled rice., , , Toss, saute and fry the rice in high heat for a minute., , Season with salt and pepper. The sauces already have salt in them, so add discreetly., , , Toss again in highest heat and fry the rice well for another 2 minutes. You can add a teaspoon sesame oil now to add some glossy finish to the rice. Finally throw in 1/2 cup chopped spring onion greens or green onions., , , Toss and mix well., , , Serve fried rice immediately for best taste. One of the best weeknight meals for us 🙂, , Tips For Making Best Fried Rice, , Making this recipe for more than a decade, I have learnt some tips and pointers that helps in making absolutely best homemade fried rice just like Chinese restaurants and takeout’s. I am sharing those here, please follow and tell me how it turned out for you., , Cooking rice, – A good fried rice begins with perfectly cooked rice. You want the rice to cooked al dente, that means done with a bite., , If I get to plan ahead, I always cook the rice at least 3 hours before making veg fried rice. This way the rice has a chance to cool thoroughly and become non sticky., , If your rice is freshly cooked, give it at least 30 minutes to cool down, Spread on a plate and refrigerate., , If you try to fry rice that is fresh and hot, what you will end up with is a sticky mass, been there done that 🙂, , Chopping vegetables, – Make sure you chop all the vegetables in uniform size. This is very important as the vegetables are getting cooked in high flame for a short time, if they are uneven few will remain uncooked while few may burn or turn mushy., , Wok or skillet, – If you see in makeshift shops where the cooking area is visible, you will find that Chinese recipes are cooked in a large, broad and deep pan what is known as Chinese wok. They withstand heat wonderfully, broad enough to toss the rice and vegetables and cook them without sticking to each other and imparts a wonderful smoky flavor., , At home try to use a very good quality sturdy cast iron pan or saute pan for best results. Also preheating the skillet with some oil helps while making fried rice in high flame., , Sauces, – While the sauces used impart a nice flavor and taste, this recipe is not all about the sauces. Trust me I make fried rice only with salt, pepper and dash of vinegar occasionally and it tastes just brilliant. So if you want to eliminate sauces, just skip them., , Having said that when using sauces, make sure they are of highest quality., , To get that typical restaurant flavor use mushroom or vegetarian oyster sauce., , Toss in High flame, – This is one most important tip for this recipe. Prep, preheat the skillet and maintain high flame throughout the recipe., , I would like to think sesame oil, celery, please try once and tell me 🙂, , Variations With This Easy Fried Rice, , Checkout these interesting fried rice recipes and enjoy –, thai fried rice, , , tofu fried rice, , , broccoli fried rice, , , Singapore fried rice, . Here are few more ideas, , Pineapple fried rice, – Just chop some fresh pineapple and saute along with vegetables for that wonderful tropical flavor in your rice., , Kimchi fried rice, – I tried this at a hole in the wall restaurant and it was good. I have made it few times with store bought kimchi and it was excellent., , Jus add 3/4 to 1 cup of kimchi instead of vegetables and saute with sauces. You can also add the kimchi juice for more flavor. This is one thing you do not want to miss if you like kimchi., , With brown rice, – Just swap white rice with cooked brown rice and enjoy. You can use brown basmati rice too., , With cauliflower rice, – Instead of regular rice, just add 2.5 cups riced cauliflower but fry just for a minute or two., , With quinoa, – Same recipe, swap rice with cooked quinoa or any millet too., , Frequently Asked Questions, , What is the secret to Chinese fried rice?, , thoroughly cooled cooked rice, high heat, suitable skillet or pan, not over cooking., , Yes just follow these and you will be amazed with your rice., , How To Make Gluten Free Fried Rice, , The recipe as such is gluten free except for soy sauce. Instead of soy sauce you could use, , gluten free tamari or, , liquid aminos, , How Do I sneak In Some Protein In This Rice?, , I often add some pressed tofu or chickpeas in this recipe to get some protein. You can also add paneer if not keen on making vegan fried rice., , Which rice is best for fried rice?, , Honestly any of your favorite rice can be used here. Just know the age of your rice and how much water to add, cook and cool the rice thoroughly., , I have made this rice with basmati rice, jasmine rice and brown rice many times., , Which oil is best for fried rice?, , I highly recommend sesame oil for the authentic taste and flavor. You could however use any oil with high smoking point like canola oil, any vegetable oil or even peanut oil., , Olive oil can be used but use light olive oil., , Why is my fried rice sticky and mushy., , This vegetable fried rice might turn when the rice is not cooked perfectly. If the rice is hot, , , More Asian Recipes, , Veg Spring Rolls, , , Spring Rolls, , , Crispy homemade spring rolls with homemade wrappers and flavorful veggie filling., , , Check out this recipe, , , , Schezwan sauce, , , Schezwan Sauce, , , Homemade schezwan sauce to up your Indo chinese recipes. Spicy, pungent and absolutely flavorful sauce in flat 20 minutes, vegan & gluten free., , , Check out this recipe, , , , Hakka noodles, , , Veg Hakka Noodles, , , Veg hakka noodles is one of the most popular Indo chinese recipes. Street style al dente noodles tossed with stir fry vegetables and sauces. Comforting weeknight dinner in 25 minutes., , , Check out this recipe, , , , Sesame noodles, , , Sesame Noodles (Vegan), , , Sesame noodles with vegetables is an easy weeknight dinner that you can whip up in flat 30 minutes. Made with soba noodles, this is a vegan, healthier and so satiating bowl of noodles with that unmistakable sesame crunch. Great as a meal on its own or as side dish in smaller portions for your Asian meals. No sesame paste required 🙂, , , Check out this recipe, , , , I hope you will try this vegetable cutlet recipe and enjoy as much as we did. Please give a star rating ★ in the recipe card below if you have tried this recipe. Follow us on, Pinterest, ,, Instagram, ,, Facebook, for more recipes and ideas., , Recipe Card, , , , , Best Easy Fried Rice Recipe, , , Cook Mode, Prevent your screen from going dark, , Harini, , , This fried rice recipe is just like what you get in your favorite Chinese restaurants, quick and easy to make, totally versatile and delicious side dish in any Asian spread. Vegan recipe. In this classic recipe, perfectly cooked long grain rice tossed with delicious sauces and mixed vegetables. Easy, perfect and delicious entrée or side dish in any Asian inspired or oriental meal., , , 4.50, from, 6, votes, , , Print Recipe, , Pin Recipe, , , Prep Time, 15, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 30, minutes, , mins, , , , , , , Course, Main dish, Cuisine, Chinese, Indo chinese, , , , , , Servings, 3, Calories, 395, , kcal, , , , Equipment, Chinese Wok or Heavy skillet, , , 1 CUP = 250 ml, , , US Customary, Metric, , 1x, 2x, 3x, ▢, 1, , cup, , Basmati rice, , 2.5 cups cooked and cooled rice, ▢, 1/3, , cup, , carrot, , Finely chopped, ▢, 1/3, , cup, , cabbage, , Finely chopped, ▢, 1/4, , cup, , baby corn, , finely chopped, ▢, 1/3, , cup, , bell pepper, , Finely chopped, ▢, 1/4, , cup, , beans, , Finely chopped, ▢, 1/2, , cup, , spring onion whites, , finely chopped, ▢, 1/2, , tablespoons, , spring onion greens, ▢, 1, , teaspoon, , freshly cracked black or white peppercorns, , add to taste, ▢, 1/2, , teaspoon, , sugar, ▢, 2, , tablespoons, , soy sauce, , preferably organic, ▢, 1, , tablespoon, , rice vinegar, ▢, 2, , teaspoons, , vegetarian oyster sauce, ▢, 3, , tablespoons, , sesame oil, ▢, Salt,  Instructions: meat or vegetables in a deep broad skillet known as Chinese wok., , Here this, veg fried rice, is a combination of cooked and cooled white rice, finely chopped mixed vegetables like carrot, beans, cabbage and few simple sauces like soy sauce, chili sauce and vinegar. The whole frying is done with sesame oil for that authentic flavor in this vegetable fried rice., , Frying rice in high heat is one of oldest Asian cooking technique. It is indeed a skill to fry the rice perfect and there is a knack to get it right., , Veg fried rice is a wonderful addition to any Asian meal as entrée or side dish. We love this as a filling brunch or dinner with Asian specialties like, Gobi manchurian, , , veg manchurian, , , chilli paneer, etc., , Why This Recipe Works?, , If you like fried rice with clean, crisp flavors then this recipe for you. My recipe does not use ridiculous amount of sauces or any rare ingredient that we may not have in the pantry., , This is an extremely versatile best fried rice recipe in which you can easily vary the sauces and use what you might have handy., , The same goes with the choice of vegetables for fried rice using this recipe. I have mentioned all the possibilities so that you can choose two or more vegetables as you like., , , Cooking Rice For Chinese Fried Rice, Pick and rinse raw basmati rice gently., , Soak the rice in water for 30 minutes. Drain and spread on a plate for few minutes., , Bring two cups of water to a rolling boil in a heavy pan. Add few drops of oil. Add the rice and mix gently once., , Cook until all the water is absorbed, takes around 8-12 minutes. Cool the rice thoroughly before using in vegetable fried rice recipe., , How To Make Veg Fried Rice, As first step prepare the veggies. Rinse, peel and chop the veggies very finely. Keep the veggies ready., , Heat 3 tablespoons sesame oil in a Chinese wok or large saute pan. You can also use a good cast iron skillet. Heat the oil until it begins to smoke. Add 1 teaspoon red chili flakes, 1/2 inch ginger minced, 3 cloves garlic minced and saute for a minute. Add celery, 1/2 cup spring onions or yellow onions and fry for a minute., , Add the prepared vegetables like carrots peas and others. Saute in high flame for 2 minutes continuously., , Now add the sauces-3 tablespoons low sodium soy sauce, 2 teaspoons red chili sauce or green chili sauce, 1 tablespoon vegetarian oyster sauce or mushroom sauce, 1/2 teaspoon brown sugar., , Mix well, saute and fry the vegetables in high flame for 6-7 minutes or until the veggies turn a bot soft yet crunchy. Now maintain high flame, move the veggies to one side of the pan and splash 2 tablespoons water on the pan. Close the pan with a lid immediately to trap the steam. Cook in high flame for one more minute with lid on. This step will impart such a wonderful smoky flavor to your fried rice., , Open the lid of the pan and add the cooked and cooled rice. Toss, saute and fry the rice in high heat for a minute., , Season with salt and pepper. The sauces already have salt in them, so add discreetly. Toss again in highest heat and fry the rice well for another 2 minutes. You can add a teaspoon sesame oil now to add some glossy finish to the rice., , Finally throw in 1/2 cup chopped spring onion greens or green onions. Toss and mix well., , Serve fried rice immediately for best taste., , , Video, , Notes, , Chop all the veggies and keep them ready before you start making this recipe., , After adding  rice, saute in highest flame for smoky effect., , Use gluten free soy sauce or tamari to make this veg fried rice gluten free., , use a Chinese wok if possible for this recipe for best results. If that is not available use a heavy pan or a dutch oven or a cast iron skillet, , You can vary the quantity of sauces as per taste., , The recipe can be doubled or halved, , , Nutrition, Serving:, 3, servings, Sodium:, 686, mg, Calcium:, 22, mg, Vitamin C:, 27, mg, Vitamin A:, 2949, IU, Sugar:, 4, g, Fiber:, 2, g, Potassium:, 248, mg, Calories:, 395, kcal, Saturated Fat:, 2, g, Fat:, 15, g, Protein:, 7, g, Carbohydrates:, 58, g, Iron:, 1, mg, , , , , Keyword, fried rice, veg fried rice, , , , , , Tried this recipe? Snap a pic and share 🙂, Mention cookclickndevou or tag cookclickndevour, , , , , , 828, , shares, , , , , , , , Share, 31, , , , , , , Pin, 793, , , , , , , Yummly, , , , , , , Flipboard, , , , , , , Twitter, , , Shared by, Harini, , About, Harini, I am Harini. The recipe developer, food photographer and chef behind cook click n devour. My aim behind this blog is to provide easy, tried and tested recipes that beginners can cook with confidence. I took keen interest in cooking and took courses on cooking, baking during teens purely out of passion. With a decade of cooking experience I am glad to share my recipes and culinary knowledge with you all here. Stay tuned and happy cooking!, Harini :), , Comments, , , , , , Parimala, , says, , , March 4, 2017 at 10:46 am, , , , Wonderful harini. Such a perfect veg fried recipe, following ur recipes, they are exactly the way i want …healthy. Thank you so much.?, , , , , , , Leave a Reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., , Hello, I am Harini, , , , , , The chef, author and photograper of cook click n devour. Here you'll find tried & tested vegetarian recipes with step by step photos and videos to make cooking a pleasure and fulfilling experience. Happy cooking!, , , Read More, , , , , Popular Recipes, , , , As Seen In, , , About, Contact, Privacy, Copyright ©2025, Cook Click N Devour!!!. All Rights Reserved., , , , , , , , , , , , , ,",
        "Egg millet fried rice": "Ingredients: , , 3 tablespoons butter, divided, , 2 eggs, lightly beaten, , 2 large carrots, diced, , 1 teaspoon minced garlic, , 1 ½ teaspoons fresh minced ginger, , ½ cup frozen peas, , 3 green onions, diced, , 3 ½ cups cooked, chilled millet, , 1 (15 oz) can cut baby corn, , 2 to 3 tablespoons Tamari, or soy sauce (or to taste), , 1 teaspoon sesame oil, , salt and pepper to taste, , , , ,  Instructions: ., , , , , , , Yield: 4, , Millet Fried Rice, , , , , , , , Print, , , , , A healthy, whole grain version of everyone's favorite Chinese Takeout!, , , , , , Prep Time, , 5 minutes, , , , , Cook Time, , 10 minutes, , , , , Total Time, , 15 minutes, , , , , , , , In a large skillet, melt 1 tablespoon of butter over high heat. Add the lightly beaten eggs and scramble them. When the eggs are cooked through, remove them from the pan and set aside., Melt 1 more tablespoon of butter. Add the garlic, ginger, carrots, peas, and green onions and cook, stirring continuously, for 1 minute., Add 1 more tablespoon of butter. As it melts, slightly reduce heat and begin adding the cooked millet, ½ cup at a time. Stirring continuously, fry the millet for about 2 minutes. Stir in the Tamari and fry for an additional minute., Remove from heat and stir in the scrambled eggs and sesame oil. Season to taste with salt and pepper. Garnish with fresh green onion., , , , Notes, , , As with fried rice, using millet that has been cooked and refrigerated overnight, or at least for a few hours, will work best. Add it to the pan straight from the fridge for best results., You can certainly add cooked chicken, pork, or shrimp if you'd like, but this rice can definitely stand on its own too! Recipe adapted from Mark Bittman, , , , , , , © Some the Wiser, , , , , , , , More Main Dishes, Soba Noodle Bowl with Rainbow Veggies, Stuffed Peppers with Chipotle Sauce, Crunchy Asian Salad with Shredded Brussels Sprouts, Butternut Squash Galette with Prosciutto, , , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , Amber | Bluebonnets & Brownies, , says, , , August 12, 2014 at 11:03 am, , , , I love this idea! I'm not on the quinoa train - ever since I was pregnant, bitter is ten times more bitter for me. But millet I love. Can't wait to try this. 🙂, , , Reply, , , , , , , , somethewiser@gmail.com, , says, , , August 12, 2014 at 9:49 pm, , , , I like quinoa, but I think I like millet more - it's just so fluffy! Hope you enjoy this as much as we do!, , , Reply, , , , , , , , , , Lisa @ This Pilgrim Life, , says, , , August 12, 2014 at 1:32 pm, , , , We love to make fried rice whenever we have leftover rice in the fridge. I love how simple and quick it is. Millet, though, I have only cooked maybe once before. I'm excited to give it a try and glad I found it just as I'm sitting down to meal plan. Your recipe looks delicious, thanks for sharing!, , Oh, and I'm sorry about your poor daughter! What a way to start the school year. My husband broke his arm at the beginning of kindergarten. And then broke his other arm halfway through. He figures he probably would have been left handed if it wasn't for breaking it just as he was learning to write 😉, , , Reply, , , , , , , , somethewiser@gmail.com, , says, , , August 12, 2014 at 9:54 pm, , , , Thanks Lisa! Millet is a lot like rice, but I like it more than rice. I think the key to incorporating more of the lesser used grains, like millet, is finding recipes for them . . . so, I hope you enjoy this., , I told my daughter what happened to your husband and she felt so bad for him. She kept lamenting, \"Poor guy, poor poor guy.\" Her biggest fear today was that everyone would think she was weird, which didn't happen of course. Turns out, everyone in the first grade just thought a broken arm was cool!, , , Reply, , , , , , , , , , Nicole ~ Cooking for Keeps, , says, , , August 13, 2014 at 10:36 am, , , , Yummmm! I big into quinoa fried rice, so I'm stoked to see another healthier version. Must try this next!, , , Reply, , , , , , , , somethewiser@gmail.com, , says, , , August 13, 2014 at 10:40 pm, , , , Thanks Nicole. I haven't tried quinoa fried rice - sounds good!, , , Reply, , , , , , , , , , Robin, , says, , , August 13, 2014 at 9:38 pm, , , , Oh, Eila,, I am so sorry that your summer was book-ended with broken bones and casts. Love the new colors you chose for your cast. I can work on making a cast for your Eila-long-leg-doll to match:0), We are looking forward to seeing you soon! Until then, wrap yourself in bubble wrap.....ok., love, , , Reply, , , , , , , , somethewiser@gmail.com, , says, , , August 13, 2014 at 10:41 pm, , , , I know! I want to keep her in bubble wrap forever and ever and ever now. Looking forward to your return, xx, , , Reply, , , , , , , , , , Olivia - Primavera Kitchen, , says, , , August 14, 2014 at 1:53 pm, , , , I love to make fried rice, but I've never tried with millet. I have it in my pantry  so I’m excited to give it a try! Thanks for sharing!, , , Reply, , , , , , , , somethewiser@gmail.com, , says, , , August 14, 2014 at 9:39 pm, , , , Thanks Olivia. We like this version so much we hardly ever use rice for Fried Rice now - hope you like it!, , , Reply, , , , , , , , , , Gwen @simplyhealthyfamily, , says, , , August 25, 2014 at 11:15 am, , , , What a wonderful recipe! I'll make a big batch of this so we can have some for lunch the next day. oxox, , , Reply, , , , , , , , somethewiser@gmail.com, , says, , , August 25, 2014 at 10:19 pm, , , , Thanks Gwen! I hope you like it!, , , Reply, , , , , , Trackbacks, , , , , , Oatmeal Apple Blender Pancakes (Gluten Free) - Some the Wiser, , says:, , , , January 1, 2015 at 5:46 pm, , , , , […] You can enjoy millet in bread and muffin recipes or even use it to thicken soups. Try it in these Banana Mango Millet Muffins or for an easy twist on an old favorite, try it in Millet Fried Rice. […], , , Reply, , , , , , , , 10 Healthy Carrot Recipes For Toddlers, , says:, , , , April 30, 2015 at 2:15 am, , , , , […] Via Source […], , , Reply, , , , Primary Sidebar, , , , Hi, I'm Allison, ! A lifelong bookworm, mom to four kids/teens, and an enthusiastic supporter of literacy and education. I'm here to make reading fun for the whole family!, , More about me →, , , , , , , Secondary Sidebar, , , , Footer, , , ↑ back to top, , , , About, , , Privacy Policy, , Disclaimer, , Terms & Conditions, , Accessibility Policy, , , , , Newsletter, , , Sign Up!, for emails and updates, , , , , Contact, , , Contact, , Services, , Media Kit, , FAQ, , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2023, Brunch Pro, on the, Feast Plugin, , Copyright© 2025 ·, Brunch Pro Theme, by, Shay Bocks, Skip to Recipe, , , , , , , , , , , , , , ,",
        "Schezuan Fried Rice": "Ingredients: , , , , , , , , Although the original, Schezwan fried rice recipe, uses special Sichuan peppers that have a lemony taste, in India Schezuan sauce is prepared using red chillies, vinegar and garlic, and it tastes quite authentic., For those who love the lip-smacking fieriness of Schezuan cuisine, here is a quick and easy, Schezwan fried rice, made with long-grained rice, Schezuan sauce, Notes on, Schezwan fried rice recipe, . 1. To cook the Chinese long-grained rice for the, Schezwan Fried Rice, , wash 1 cup of long-grained rice thoroughly under running water until you get clear water. The removal of starch from rice helps in getting separate grains after cooking. 2. Cook on a medium flame for 8 to 10 minutes or till the rice is 85% cooked, while stirring occasionally. It is very important to not fully cook the rice, it should be firm to bite. 3. Refresh the rice with cold water so the rice stops cooking further. Let all the water from the rice drain out ensuring that the rice does not contain any moisture. 4. Add the remaining 1 tbsp of oil. This helps in preventing the rice from sticking to each other. 5. Add the carrot and French beans. Make sure they are chopped really finely as we are not boiling or cooking them we are just sautéing them so when they are chopped finely so they not taste raw., To make a heartier meal serve, Schezwan fried rice, with, Kung Pao Vegetables, , , Corn Rolls, and, Stir Fry Noodles in Black Sauce, ., Explore our collection of, recipes for Chinese Rice Dishes, and serve them with stir-fried vegetables, deep-fried starters and sumptuous soup to make a wholesome, Chinese meal, ., Enjoy how to make, Schezwan fried rice recipe, |, Indian style Schezwan fried rice, |, Veg Schezuan fried rice, | with detailed step by step photos and video below., Schezuan Fried Rice, Schezwan Fried Rice recipe - How to make Schezuan Fried Rice, Schezwan Fried Rice, , , , , , , , Tags, , , , , Indian Comfort Foods, , Comfort Foods Rice, Khichdi, , Chinese Vegetarian, , Chinese Rice Dishes, , Party, , Chinese Party, , Quick Vegetarian Rice, khichdi Recipes, , , , , , , , , , , , , , , , , , , , Preparation Time, , 30 Mins, , , , , , , Cooking Time, , 8 Mins, , , , , , , Total Time, , 38 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , For Schezuan Fried Rice, , , 6 tbsp, Schezwan Sauce, , , , 1 cup chinese white sauce, , , 1 1/2 tbsp, oil, , , 2 tsp finely, chopped garlic (lehsun), , , 1 tsp finely, chopped ginger (adrak), , , 1/4 cup finely, chopped spring onions, , , 1/4 cup finely, chopped capsicum, , , 1/4 cup finely, chopped carrot, , , 1/4 cup finely, chopped french beans, , , 2 tbsp finely, chopped celery (ajmoda), , , 1 tsp, soy sauce, , , 1 tsp, vinegar, , , , salt, to taste, , , For The Garnish, , , 2 tbsp finely, chopped spring onion greens, , , , , , , , , , , , Add the spring onions. We have used both whites and greens as they give a very nice taste. They are a must in Chinese cuisine., , , , , , Add finely chopped capsicum., , , , , , Add the carrot and French beans. Make sure they are chopped really finely as we are not boiling or cooking them we are just sautéing them so when they are chopped finely so they not taste raw., , , , , , Sauté on a high flame for 2 to 3 minutes. You can add lots of other vegetables in, Schezwan Fried Rice, like broccoli, cabbage and paneer., , , , , , Add the celery. Though celery added here is less in quantity, it is important to add since it gives a very nice flavour., , , , , , Add the Schezuan sauce, learn, how to make Schezuan sauce at home, .You can keep home made Schezwan sauce in an air-tight container in the refrigerator for a couple of months.To make spicier, Schezuan Rice, , increase the quantity of Schezwan sauce. Similarly, to make less spicy rice, reduce the quantity of Schezwan sauce., , , , , , Add the soya sauce., , , , , , Add the vinegar and 2 tbsp of water., , , , , , Mix well and cook on a medium flame for 1 to 2 minutes, stir it in between., , , , , , Add the cooked Chinese rice., , , , , , Add the salt and mix gently. It is very important to toss rice lightly or else the grains will break and become clumpy., , , , , , Cook the, Schezwan fried rice | Indian style Schezwan fried rice | Veg Schezuan fried rice |, on a medium flame for 2 minutes, stir it in between., , , , , , Serve, Schezwan fried rice | Indian style Schezwan fried rice | Veg Schezuan fried rice |, immediately garnished with spring onion greens., , , , , , You can even serve the, Veg, , Schezwan Fried Rice, with Chinese gravies like, Vegetable manchurian, , , Corn manchurian, , , cabbage manchurian, ,, paneer in manchurian sauce, ., , , , , , , , , , , , , , , , , , , , Tips for schezwan fried rice, , , , , , , , , To cook the Chinese long-grained rice for the Schezwan Fried Rice, wash 1 cup of long-grained rice thoroughly under running water until you get clear water. The removal of starch from rice helps in getting separate grains after cooking., , , , , , Cook on a medium flame for 8 to 10 minutes or till the rice is 85% cooked, while stirring occasionally. It is very important to not fully cook the rice, it should be firm to bite., , , , , , Refresh the rice with cold water so the rice stops cooking further. Let all the water from the rice drain out ensuring that the rice does not contain any moisture., , , , , , Add the remaining 1 tbsp of oil. This helps in preventing the rice from sticking to each other., , , , , , Add the carrot and French beans. Make sure they are chopped really finely as we are not boiling or cooking them we are just sautéing them so when they are chopped finely so they not taste raw., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 327 cal, Protein, 3.8 g, Carbohydrates, 37.4 g, Fiber, 2.6 g, Fat, 18 g, Cholesterol, 0 mg, Sodium, 689.2 mg, , , , , , , Click here to view, Calories for Schezuan Fried Rice, Schezwan Fried Rice, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Ankita, , March 13, 2025, midnight, , Thank u tarla for the reciepes i have been trying good foodiesss as per ur reciepe which makes my family happy with all the new dishes, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Ankita. We are delighted you loved the Schezuan Fried Rice  recipe. Please keep posting your thoughts and feedback., , , , , , , , , , , , , Modi Sheetal, , March 13, 2025, midnight, , Awesome _x0001F44C__x0001F44D_, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Renu, , March 13, 2025, midnight, , 1.What is the property of Vinegar in this recipe...?\n2.Can we skip vinegar?, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Vinegar is used to balance the spice level with its sourness. If you wish, you can avoid it., , , , , , , , , , , , , pooja, , March 13, 2025, midnight, , ma''am if we don''t  have vinegar,what alternative can be used, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , jamila, , March 13, 2025, midnight, , madam how to make schezwan sauce at home??, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , vaishali Mehta, , March 13, 2025, midnight, , Excellent recipe. My family just loved it !!!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , mits, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , himanshu Mishra, , March 13, 2025, midnight, , Madam if celery is not available,what alternative can be used?, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , vijay.laxmi, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 2, , , , , , , , , , , , , Foodie #670389, , March 13, 2025, midnight, , Wow this is so delicious, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Aussie Girl, , March 13, 2025, midnight, , This was a superb recipe! Thank you!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback. Happy cooking., , , , , , , , , , , , , Kamalika Saha Roy, , March 13, 2025, midnight, , Hello mam,\nYour recipes works wonder on my dinning table. I have tried many of your recipes n it is just fab. Thanks mam once again.\nRegards., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi Kamalika, We are very happy to know you loved the recipe. Do try more and more recipes and let us know how they turned out. Happy Cooking !!, , , , , , , , , , , , , Shailaja  G, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Kavita jain, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , mahamad ravat, , March 13, 2025, midnight, , Nice repedetion, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , We are delighted you loved the Schezuan Fried Rice recipe. Please keep posting your thoughts and feedback., , , , , , , , , , , , , Mahamadali, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Mahamadali. We are delighted you loved the Schezuan Fried Rice recipe. Please keep posting your thoughts and feedback., , , , , , , , , , , , , Indu, , March 13, 2025, midnight, , Excellent recipes, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Indu. We are delighted you loved the Schezuan Fried Rice recipe. Please keep posting your thoughts and feedback., , , , , , , , , , , , , S.Dang, , March 13, 2025, midnight, , Excellent  recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #642829, , March 13, 2025, midnight, , Love this recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Swastika Goenka, , March 13, 2025, midnight, , Easy to cook.., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Chef Deep, , March 13, 2025, midnight, , This deliciously spicy recipe has become a hit with my family and a frequent request for dinners. It is quick to make yet an interesting change to the regular vegetable fried rice or pulao! Thanks Tarla Maam for sharing this!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , dhanashri bhanawat, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Dhanashri. We are delighted you loved the recipe. Please keep posting your thoughts and feedback., , , , , , , , , , , , , Rakesh, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , Foodie #497248, , March 13, 2025, midnight, , perfect recipe, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , 5 spice mushroom rice recipe | five spice mushroom rice | Chinese, , , 289 Calories, , , , , , , , , , , , , , , , , Celery and Black Pepper Rice recipe, Chinese Recipes, , , 290 Calories, , , , , , , , , , , , , , , , , Schezwan Fried Rice recipe | Veg Schezwan Fried Rice | Indian style |, , , 327 Calories, , , , , , , , , , , , , , , , , Thai Fried Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , chilli coriander fried rice | veg chilli coriander rice | Chinese chilli coriander fried rice |, , , 287 Calories, , , , , , , , , , , , , , , , , Chinese Egg Fried Rice recipe, Egg Fried Rice (Easy, Restaurant style), , , 181 Calories, , , , , , , , , , , , , , , , , Coconut Curry with Fried Rice recipe, Mexican Recipes, , , 723 Calories, , , , , , , , , , , , , , , , , Fried Rice, Chinese Veg Fried Rice recipe, Step by Step recipes for Kids, , , 208 Calories, , , , , , , , , , , , , , , , , Mexican Fried Rice recipe | Quick Vegetarian Mexican fried rice, , , 408 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , To cook the long grained rice perfectly, , , , , , , , , To make schezwan rice, , , , , , , , , Tips for schezwan fried rice, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , Schezwan fried rice recipe, |, Indian style Schezwan fried rice, |, Veg Schezuan fried rice, | with amazing images., Schezwan fried rice recipe, , originating from the Sichuan province of China, Schezuan cuisine is characterised by bold flavours, , , , For schezuan fried rice, , To make, schezuan fried rice, , heat the oil in a deep non-stick pan or a wok, add the garlic and ginger and sauté on a medium flame for a few seconds., Add the spring onions, capsicum, carrot and french beans and sauté on a high flame for 2 to 3 minutes., Add the celery, schezuan sauce, soya sauce, vinegar and 2 tbsp of water, mix well and cook on a medium flame for 1 to 2 minutes, while stirring occasionally., Add the chinese rice and salt, mix well and cook on a medium flame for 2 minutes, while stirring occasionally., Serve, schezuan fried rice, immediately garnished with spring onion greens., , , , , , , , , , , , , , Schezwan Fried Rice recipe | Veg Schezwan Fried Rice | Indian style | Video by Tarla Dalal, , , , , ×, , , , , , Schezuan Fried Rice, Schezwan Fried Rice recipe with step by step photos, , , , , , , , , , , , , , , , , , , To cook the long grained rice perfectly, , , , , , , , , To cook the Chinese long-grained rice for the, Schezwan Fried Rice, , wash 1 cup of long-grained rice thoroughly under running water until you get clear water. The removal of starch from rice helps in getting separate grains after cooking., , , , , , Transfer in a deep bowl and soak in enough water for 30 minutes., , , , , , Drain with the help of a strainer and keep aside., , , , , , Boil 4 cups of water in a deep non-stick pan., , , , , , Add salt., , , , , , Furthermore, add 1 tbsp of oil and mix well., , , , , , Add the rice to the boiling water and mix well., , , , , , Cook on a medium flame for 8 to 10 minutes or till the rice is 85% cooked, while stirring occasionally. It is very important to not fully cook the rice, it should be firm to bite., , , , , , Strain it using a strainer and let the water drain out. This will give you around 3 cups after cooking. Do not overcook the rice or else they will turn mushy., , , , , , Refresh the rice with cold water so the rice stops cooking further. Let all the water from the rice drain out ensuring that the rice does not contain any moisture., , , , , , Add the remaining 1 tbsp of oil. This helps in preventing the rice from sticking to eachother., , , , , , Toss the rice in it. Ensure each grain is coated well with oil., , , , , , Spread the cooked Chinese Rice for, Schezwan Fried Rice, on a flat surface or a big plate and allow it to cool for 1 to 2 hours. Do cover it with a plate while they are cooling down so, they do not dry out on the top., , , , , , , , , , , , , , , , , , , , To make schezwan rice, , , , , , , , , For the, Schezwan fried rice recipe | Indian style Schezwan fried rice | Veg Schezuan fried rice |, in a deep non-stick pan or a wok heat the oil. Try and use a wok. Since the wok has more surface area, it makes it easier for cooking Chinese recipe. Also, it requires less oil and distributes heat evenly. If you do not have the wok use a broad non-stick pan., , , , , , Add the garlic, using finely chopped garlic always gives a better flavour so avoid the garlic paste and finely chop those garlic cloves., , , , , , Add the ginger. Sauté on a medium flame for a few seconds. One thing that you must remember is that prepare everything and keep near your work space",
        "Sesame Ginger Fried Rice": "Ingredients: ▢, 1/4, , cup, , low sodium soy sauce, , or tamari, ▢, 2, , tbsp, , hoisin sauce, ▢, 2, , tbsp, , sesame oil, ▢, 1-2, , tbsp, , chili garlic sauce, ▢, 2, , tbsp, , olive oil, ▢, 1.5, , cups, , mushrooms, , roughly chopped, ▢, salt & pepper, , to taste, ▢, 3, , cloves, , garlic, , diced, ▢, 1, , inch, , fresh ginger, , diced, ▢, 3, , green onions, , diced, whites & greens separated, ▢, 4, , baby bok choy bundles, , cut in bite-sized pieces, ▢, 2, , cups, , leftover cooked rice*, ▢, cilantro, , chopped, optional, ▢, sesame seeds, , optional,  Instructions: , Combine the soy sauce, hoisin sauce, sesame oil and chili garlic sauce in a bowl and whisk to combine. Set aside., Heat the olive oil in a pan over medium heat. Add the mushrooms and a pinch of salt & pepper and toss to combine. Cook the mushrooms for 5 minutes, or until they start to brown on the edges., Add the garlic, ginger, whites of the green onions, bok choy and 1/2 of the sauce to the pan and stir to combine. Cook for 2-3 minutes, or until the bok choy starts to wilt. Add the rice and remaining sauce and stir until heated through., Right before serving, add cilantro, the remaining green onions and sesame seeds., , Video, , Notes, *If you don’t have leftover rice, cook 1 cup of dry rice from scratch then spread out on a baking sheet and place in the freezer for 10 minutes to cool., , Calories:, 288, kcal, , , Carbohydrates:, 33, g, , , Protein:, 6, g, , , Fat:, 15, g, , , Cuisine:, asian, Course:, Side Dish, , , , , , , Did you make this recipe?, Leave a review below or take a photo and share it on Instagram, @thissavoryvegan, with, #thissavoryvegan, ., , This post may contain affiliate links. If you click on one and make a purchase I will receive a small percentage of the sale. Please know I would never link a product unless I have personally used it and loved it!, , If you make any of these recipes be sure to snap a photo + post it + and tag, #thissavoryvegan, and, @thissavoryvegan, !, , , , , , Asian Inspired, , One Pot Meals, , Recipes, , Snacks + Side Dishes, , , , published on, Mar 10, 2021, , , 10 comments, , , Leave a comment », , , , , , , , , « Previous Post, , Slow Cooker Black Bean Soup, , Next Post », , Vegan Pesto & Egg Breakfast Sandwiches, , , , , , , 4.38 from 8 votes (, 2 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , 10 comments on “Vegan Sesame Ginger Fried Rice”, , , , , , , Mary M., —, March 26, 2021 @ 4:22 pm, , Reply, , , , , , I also used Trader Joe’s frozen rice, and used two bags which was the perfect amount for the sauce. It was probably closer to 4 cups of rice. I subbed asparagus for the mushrooms and it was really good!, , , , , , , , Sophie, —, March 26, 2021 @ 2:01 pm, , Reply, , , , , , Super easy and came out great! I used a bag of frozen brown rice from Trader Joe’s and it was too much sauce for the amount of rice so next time I’ll halve the amount of sauce. Thanks for the great recipe!, , , , , , , , Lauren D, —, March 16, 2021 @ 5:12 pm, , Reply, , , , , , so easy and delicious! I ended up using only half of the sauce and I thought it was enough., , , , , , , , Rene, —, March 21, 2021 @ 9:55 am, , Reply, , , Great! So glad you liked it!, , , , , , , , Tatjana, —, September 15, 2021 @ 5:17 pm, , Reply, , , , , , I added snow peas, water chestnuts and Sriracha. I also added some chicken for protein. It cooked super fast and was loaded with flavor!, , , , , , , , Rene, —, September 17, 2021 @ 8:07 am, , Reply, , , Hi Tatjana – so glad you were able to add lots of extras to make it your own!, , , , , , , , , , , , , , jacquie, —, March 11, 2021 @ 6:40 pm, , Reply, , , looks delicious.   could cauliflower rice be used?, , , , , , , , Rene, —, March 16, 2021 @ 8:11 am, , Reply, , , I haven’t tried it with cauliflower rice, but yes, it should definitely work!, , , , , , , , Naomi, —, July 31, 2021 @ 8:13 pm, , Reply, , , , , , There was too much sauce compared to rice. It came out super salty and just didn’t have enough rice. It would turn out wonderful if I just added more rice., , , , , , , , , , Simone, —, November 5, 2021 @ 2:42 am, , Reply, , , , , , I was super stocked to try this recipe because it looked super easy. I substituted coconut amino for the low sodium soy sauce and added bean sprouts.I agree with others too much sauce for the rice and the flavor profiles were just meh! Not what I expected tastes like it’s missing something! Also cilantro topper on this dish is not a good garish, flavors are all wrong., , , , , , , Leave a comment », , , , , , , , , , , , Nice to Meet You!, , I’m Rene! So-cal native, dog mom and lover of all things spicy., Learn more., , , More About Me, , , , , Follow Me:, , , , , , , , , , , , Cozy & Comforting Vegan Cookbook, , Shop my newest ebook!, , , Get Yours Today, , , , , , , , , , , , ^ Back to Top, , Home, , About me, , Contact Me, , Recipe Index, , Privacy Policy, , , , , , , , , ©2025 This Savory Vegan, . All Rights Reserved., , Design by, Purr, ., , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Chinese Fried Rice": "Ingredients: , , , , , , , , , , For Chinese Fried Rice, , , 2 cups cooked, brown rice, , , 1 1/2 tsp, oil, , , 1 1/2 tsp finely, chopped green chillies, , , 1/4 cup thinly sliced, capsicum, , , 1/4 cup finely, chopped spring onions whites, , , 3/4 cup parboiled, french beans, , cut diagonally, , 3/4 cup thinly sliced parboiled, carrot, , , 1/2 cup, bean sprouts, , , 1 tbsp finely chopped, celery (ajmoda), , , 1/2 tsp, soy sauce, , , 2 tbsp finely, chopped spring onion greens, , , , salt, to taste, , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like healthy Chinese fried rice, , , , , , , , , What is healthy Chinese fried rice made of?, , , , , , , , , Making brown rice, , , , , , , , , Making healthy fried rice, , , , , , , , , Tips for  healthy Chinese fried rice, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , healthy fried rice recipe, |, Indo Chinese veg fried rice, |, easy and healthy fried rice, | with step by step photos., healthy fried brown rice with vegetables, is an occasional treat which diabetics can indulge into. Learn how to make, healthy fried brown rice with vegetables, ., Rice is the cereal that, diabetics, are advised to avoid. Here's a simple and guilt free way to include, healthy fried rice, in your diet. All you have to do is add plenty of vegetables to the rice dish and use fibre rich brown rice and minimal oil. And that’s your, healthy Chinese fried rice, ., To make, healthy fried rice, , heat the oil in a broad non-stick pan, add the green chillies, capsicum and spring onion whites and sauté on a high flame for 1 to 2 minutes. Add the french beans, carrot, bean sprouts and celery, mix well and sauté on a high flame for 1 to 2 minutes. Add the cooked brown rice, soy sauce, spring onion greens and salt, mix well and cook on a medium flame for 1 to 2 minutes. Serve, Indo Chinese veg fried rice hot, ., Adding vegetables to, easy and healthy fried rice, not only enhances its vitamin value but also contributes plenty of fibre that prevents a rapid rise in blood sugar levels after a meal., Remember to count on the carbs from this, healthy fried brown rice with vegetables, in your daily intake to manage your sugar levels., Tips for, healthy fried rice, . 1. Use a broad non-stick pan, so sauteing rice and veggies is easy. 2. Veggies can be of your choice. You can also add broccoli and cabbage. 3. Feel free to reduce the quantity of brown rice further if you wish to., Enjoy, healthy fried rice recipe, |, Indo Chinese veg fried rice, |, easy and healthy fried rice, | with step by step photos and video below., , Chinese Fried Rice, Diabetic Friendly Recipe recipe - How to make Chinese Fried Rice, Diabetic Friendly Recipe, , , , , , , , Tags, , , , , Non-stick Pan, , Indian Dinner, , Indian style Chinese dinner, , Indian Lunch, , Indian Rice, , International rice recipes, , Pulaos, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 6 Mins, , , , , , , Total Time, , 21 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , , Heat the oil in a broad non-stick pan, add the green chillies, capsicum and spring onion whites and sauté on a high flame for 1 to 2 minutes., Add the french beans, carrot, bean sprouts and celery, mix well and sauté on a high flame for 1 to 2 minutes., Add the cooked brown rice, soy sauce, spring onion greens and salt, mix well and cook on a medium flame for 1 to 2 minute., Serve hot., Disclaimer:, , It is highly recommended that this recipe be relished by diabetics only occasionally and in small quantities. This is just a mere ‘treat’ and does not qualify for a regular diabetic menu., , , , , , , , , , , , , , healthy fried rice recipe | Indo Chinese veg fried rice | diabetics friendly | Video by Tarla Dalal, , , , , ×, , , , , , Chinese Fried Rice, Diabetic Friendly Recipe recipe with step by step photos, , , , , , , , , , , , , , , , , , , like healthy Chinese fried rice, , , , , , , , , like, healthy Chinese fried rice |, Indo Chinese veg fried rice | easy and healthy fried rice |, then see our collection of, Chinese veg rice recipes, and some recipes we love., , veg fried rice, | vegetable fried rice | Chinese fried rice | Indian style Chinese fried rice | with 30 amazing images., , Schezwan fried rice recipe, | Indian style Schezwan fried rice | Veg Schezuan fried rice | with 25 amazing images., , Chinese egg fried rice recipe, | egg fried rice | How to make simple egg fried rice at home | egg fried rice restaurant style | with 31 amazing images., , , , , , , , , , , , , , , , , , what is healthy Chinese fried rice made of?, , , , , , , , , , what is healthy Chinese fried rice made off?, , Indo Chinese veg fried rice, is made from, 2 cups cooked, brown rice, , 1 1/2 tsp oil, 1 1/2 tsp finely chopped green chillies, 1/4 cup thinly sliced capsicum, 1/4 cup finely chopped spring onions whites, 3/4 cup parboiled french beans, cut diagonally, 3/4 cup thinly sliced parboiled carrot, 1/2 cup bean sprouts, 1 tbsp finely chopped celery (ajmoda), 1/2 tsp soy sauce, 2 tbsp finely chopped spring onion greens and salt to taste., , , , , , , , , , , , , , , , making brown rice, , , , , , , , , To make the, Brown Rice, , wash the rice thoroughly under water. This removes the impurities and the excess starch which prevents the rice from being sticky. Transfer the rice to a deep bowl and cover it with enough water to it. Keep it aside for about 2 hours. Soaking helps in cooking the rice faster. See, how to cook brown rice Indian style, ., , , , , , , Take a deep non-stick pan and fill it up with enough water in a deep nonstick pan.  Bring it to a boil., , , , , , Add the salt to taste. (1 tsp approx.), , , , , , Add the, Brown Rice, to this water and mix well., , , , , , Cook the, Brown Rice, for about  20 to 25 minutes  or till it’s tender but the grains are separate. It should not be mushy., , , , , , Drain the rice using a sieve. You can rinse the brown rice under cold water so that it cools down quicky and there is no carry-over cooking., , , , , , Transfer the, Brown Rice, to a plate, spread it out. Use as required., , , , , , , , , , , , , , , , , , , , making healthy fried rice, , , , , , , , , Heat, 1 1/2 tsp, oil, in a broad non-stick pan., , , , , , Add, 1 1/2 tsp finely, chopped green chillies, ., , , , , , Add, 1/4 cup thinly sliced, capsicum, ., , , , , , Add, 1/4 cup finely, chopped spring onions whites, ., , , , , , Sauté on a high flame for 1 to 2 minutes., , , , , , Add, 3/4 cup parboiled, french beans, , cut diagonally., , , , , , Add, 3/4 cup thinly sliced parboiled, carrot, ., , , , , , Add, 1/2 cup, bean sprouts, ., , , , , , Add, 1 tbsp finely chopped, celery (ajmoda), ., , , , , , Mix well., , , , , , Sauté on a high flame for 1 to 2 minutes., , , , , , Add, 2 cups cooked, brown rice, ., , , , , , Add, 1/2 tsp, soy sauce, ., , , , , , Add, 2 tbsp finely, chopped spring onion greens, ., , , , , , Add salt to taste. We used 1 tsp salt., , , , , , Mix, healthy Chinese fried rice |, Indo Chinese veg fried rice | easy and healthy fried rice |, well., , , , , , Cook on a medium flame for 1 to 2 minute., , , , , , Serve, healthy Chinese fried rice |, Indo Chinese veg fried rice | easy and healthy fried rice |, hot., , , , , , , , , , , , , , , , , , , , tips for  healthy Chinese fried rice, , , , , , , , , , Use a broad non-stick pan, so sauteing rice and veggies is easy., , , , , , Veggies can be of your choice. You can also add cabbage and broccoli., , , , , , Feel free to reduce the quantity of brown rice further if you wish to., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 147 cal, Protein, 3.3 g, Carbohydrates, 27 g, Fiber, 2.9 g, Fat, 2.9 g, Cholesterol, 0 mg, Sodium, 48.2 mg, , , , , , , Click here to view, Calories for Chinese Fried Rice, Diabetic Friendly Recipe, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Thomas, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thomas thanks for the feedback !!! keep reviewing recipes, articles you loved., , , , , , , , , , , , , Priyanka Shah, , March 13, 2025, midnight, , Since i like making healthy dishes, i tried this Chinese veg fried rice recipe and it worked out great. A good combo of brown rice and vegetables. My husband who has slightly high sugar loved it too. He keeps asking me to make this rice. Thanks., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks so much for trying our recipe, it means a lot to us. Keep trying more recipes and sharing your feedback with us., , , , , , , , , , , , , Foodie#464767, , March 13, 2025, midnight, , Good to eat, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodsie, , March 13, 2025, midnight, , An excellent recipe for diabetics who are generally forbidden from eating rice and its by products. however this recipe will leave them with a great sense of satisfaction as there is no compromise on the taste and a guilt free recipe made with brown rice to add to the total experience..., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Hakka Noodles, Diabetic Friendly Recipe, Indian Diabetic Recipes, , , 84 Calories, , , , , , , , , , , , , , , , , Dalia Vegetable Risotto recipe, Indian Diabetic Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , 5 spice mushroom rice recipe | five spice mushroom rice | Chinese, , , 289 Calories, , , , , , , , , , , , , , , , , 5 Spice Tofu and Bean Sprouts Rice recipe, Chinese Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Vegetable Fried Rice (Jain) recipe, How to make Jain fried rice, Jain food, , , 0 Calories, , , , , , , , , , , , , , , , , Baked Layered Coconut Rice with Curry recipe, Saatvik Recipes, , , 539 Calories, , , , , , , , , , , , , , , , , Baked Mexican Rice with Cheese Patties recipe, , , 528 Calories, , , , , , , , , , , , , , , , , Bean and Spinach Rice recipe, Lebanese Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , baked beans with buttered rice recipe | bean vegetable rice | canned baked beans and rice |, , , 273 Calories, , , , , , , , , , , , , , , , , Brinjal Rice (  Zero Oil Recipe ), , , 236 Calories, , , , , , , , , , , , , , , , , Layered Spicy Vegetable Pulao recipe, Burmese Rice  Vegetarian Recipes, , , 205 Calories, , , , , , , , , , , , , , , , , Cabbage Rice recipe, Indian Recipes, , , 171 Calories, , , , , , , , , , , , , , , , , Carrot Rice recipe, Punjabi Recipes, , , 256 Calories, , , , , , , , , , , , , , , , , Cheesy Pepper Rice, Mexican Cheesy Pepper Rice recipe, Mexican Recipes, , , 323 Calories, , , , , , , , , , , , , , , , , chick pea and mint rice recipe | healthy chana pulao | pudina chana pulao |, , , 0 Calories, , , , , , , , , , , , , , , , , healthy fried rice recipe | Indo Chinese veg fried rice | diabetics friendly |, , , 147 Calories, , , , , , , , , , , , , , , , , Chitrana Rice recipe made in South Indian festivals, Tarla Dalal, , , 488 Calories, , , , , , , , , , , , , , , , , coconut rice recipe | South Indian coconut rice | nariyal chawal | easy coconut rice Indian recipe |, , , 290 Calories, , , , , , , , , , , , , , , , , how to make basmati rice for biryani recipe | simple Indian basmati rice for biryani |, , , 203 Calories, , , , , , , , , , , , , , , , , Curd Rice recipe for Babies and Toddler, Tarla Dalal, , , 358 Calories, , , , , , , , , , , , , , , , , Layered Corn and Spinach Rice with Tomato Sauce recipe, , , 320 Calories, , , , , , , , , , , , , , , , , Crispy Rice, Deep Fried Chinese Crispy Rice recipe, Chinese Recipes, , , 702 Calories, , , , , , , , , , , , , , , , , Cucumber Curd Rice ( Pregnancy Recipe), , , 254 Calories, , , , , , , , , , , , , , , , , Cabbage Moong Dal Khichdi for Babies and Toddlers | Vegetable Moong Dal Khichdi for Kids |, , , 211 Calories, , , , , , , , , , , , , , , , , Dhansak Rice Recipe, Veg Dhansak, Vegetarian Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Fried Rice, Chinese Veg Fried Rice recipe, Step by Step recipes for Kids, , , 208 Calories, , , , , , , , , , , , , , , , , Ghee Rice Recipe, How To Make Ghee Rice, Chawal Recipes | Pullav Recipes, , , 225 Calories, , , , , , , , , , , , , , , , , Phudina, Coriander and Coconut Milk Rice recipe, Dinner Recipes, , , 406 Calories, , , , , , , , , , , , , , , , , Babycorn and Mushroom Curry Rice recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Herb Rice with Creamy Mushroom and Asparagus Sauce recipe, Iron Rich Recipes, , , 225 Calories, , , , , , , , , , , , , , , , , jeera rice | quick jeera rice | jeera pulao | cumin rice |, , , 246 Calories, , , , , , , , , , , , , , , , , Healthy Lemon Rice recipe, South Indian Lemon Rice made from Brown rice, , , 127 Calories, , , , , , , , , , , , , , , , , Lilva Rice ( Gujarati Recipe), Gujrati Recipes, , , 194 Calories, , , , , , , , , , , , , , , , , Mashkool Rice recipe, Lebanese Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Quick Tava Rice ( Growing Kids Recipe), , , 0 Calories, , , , , , , , , , , , , , , , , Schezwan Fried Rice recipe | Veg Schezwan Fried Rice | Indian style |, , , 327 Calories, , , , , , , , , , , , , , , , , vegetable cheese rice recipe | Indian style cheesy vegetable rice | garlic vegetable cheese rice |, , , 278 Calories, , , , , , , , , , , , , , , , , Spinach and Carrot  Rice recipe, Healthy Recipes, , , 256 Calories, , , , , , , , , , , , , , , , , Rice, Cooked Rice recipe, How to Steam Rice, How to cook Basmati Rice, , , 171 Calories, , , , , , , , , , , , , , , , , Stir- Fried Rice ( Wraps and Rolls) recipe, , , 0 Calories, , , , , , , , , , , , , , , , , Tava Rice ( Microwave Recipe), , , 223 Calories, , , , , , , , , , , , , , , , , Thai Layered Rice (  Thai Cooking) recipe, Thai Recipes, , , 0 Calories, , , , , , , , , , , , , , , , , Chinese vegetable fried rice recipe | veg Chinese fried rice |, , , 202 Calories, , , , , , , , , , , , , , , , , Vermicelli Rice, Lebanese Rice with Vermicelli recipe, Lebanese Recipes, , , 0 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Indo Chinese rice": "Ingredients:  Instructions: ",
        "Vegan Sesame Ginger Fried Rice": "Ingredients: ▢, 1/4, , cup, , low sodium soy sauce, , or tamari, ▢, 2, , tbsp, , hoisin sauce, ▢, 2, , tbsp, , sesame oil, ▢, 1-2, , tbsp, , chili garlic sauce, ▢, 2, , tbsp, , olive oil, ▢, 1.5, , cups, , mushrooms, , roughly chopped, ▢, salt & pepper, , to taste, ▢, 3, , cloves, , garlic, , diced, ▢, 1, , inch, , fresh ginger, , diced, ▢, 3, , green onions, , diced, whites & greens separated, ▢, 4, , baby bok choy bundles, , cut in bite-sized pieces, ▢, 2, , cups, , leftover cooked rice*, ▢, cilantro, , chopped, optional, ▢, sesame seeds, , optional,  Instructions: , Combine the soy sauce, hoisin sauce, sesame oil and chili garlic sauce in a bowl and whisk to combine. Set aside., Heat the olive oil in a pan over medium heat. Add the mushrooms and a pinch of salt & pepper and toss to combine. Cook the mushrooms for 5 minutes, or until they start to brown on the edges., Add the garlic, ginger, whites of the green onions, bok choy and 1/2 of the sauce to the pan and stir to combine. Cook for 2-3 minutes, or until the bok choy starts to wilt. Add the rice and remaining sauce and stir until heated through., Right before serving, add cilantro, the remaining green onions and sesame seeds., , Video, , Notes, *If you don’t have leftover rice, cook 1 cup of dry rice from scratch then spread out on a baking sheet and place in the freezer for 10 minutes to cool., , Calories:, 288, kcal, , , Carbohydrates:, 33, g, , , Protein:, 6, g, , , Fat:, 15, g, , , Cuisine:, asian, Course:, Side Dish, , , , , , , Did you make this recipe?, Leave a review below or take a photo and share it on Instagram, @thissavoryvegan, with, #thissavoryvegan, ., , This post may contain affiliate links. If you click on one and make a purchase I will receive a small percentage of the sale. Please know I would never link a product unless I have personally used it and loved it!, , If you make any of these recipes be sure to snap a photo + post it + and tag, #thissavoryvegan, and, @thissavoryvegan, !, , , , , , Asian Inspired, , One Pot Meals, , Recipes, , Snacks + Side Dishes, , , , published on, Mar 10, 2021, , , 10 comments, , , Leave a comment », , , , , , , , , « Previous Post, , Slow Cooker Black Bean Soup, , Next Post », , Vegan Pesto & Egg Breakfast Sandwiches, , , , , , , 4.38 from 8 votes (, 2 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , 10 comments on “Vegan Sesame Ginger Fried Rice”, , , , , , , Mary M., —, March 26, 2021 @ 4:22 pm, , Reply, , , , , , I also used Trader Joe’s frozen rice, and used two bags which was the perfect amount for the sauce. It was probably closer to 4 cups of rice. I subbed asparagus for the mushrooms and it was really good!, , , , , , , , Sophie, —, March 26, 2021 @ 2:01 pm, , Reply, , , , , , Super easy and came out great! I used a bag of frozen brown rice from Trader Joe’s and it was too much sauce for the amount of rice so next time I’ll halve the amount of sauce. Thanks for the great recipe!, , , , , , , , Lauren D, —, March 16, 2021 @ 5:12 pm, , Reply, , , , , , so easy and delicious! I ended up using only half of the sauce and I thought it was enough., , , , , , , , Rene, —, March 21, 2021 @ 9:55 am, , Reply, , , Great! So glad you liked it!, , , , , , , , Tatjana, —, September 15, 2021 @ 5:17 pm, , Reply, , , , , , I added snow peas, water chestnuts and Sriracha. I also added some chicken for protein. It cooked super fast and was loaded with flavor!, , , , , , , , Rene, —, September 17, 2021 @ 8:07 am, , Reply, , , Hi Tatjana – so glad you were able to add lots of extras to make it your own!, , , , , , , , , , , , , , jacquie, —, March 11, 2021 @ 6:40 pm, , Reply, , , looks delicious.   could cauliflower rice be used?, , , , , , , , Rene, —, March 16, 2021 @ 8:11 am, , Reply, , , I haven’t tried it with cauliflower rice, but yes, it should definitely work!, , , , , , , , Naomi, —, July 31, 2021 @ 8:13 pm, , Reply, , , , , , There was too much sauce compared to rice. It came out super salty and just didn’t have enough rice. It would turn out wonderful if I just added more rice., , , , , , , , , , Simone, —, November 5, 2021 @ 2:42 am, , Reply, , , , , , I was super stocked to try this recipe because it looked super easy. I substituted coconut amino for the low sodium soy sauce and added bean sprouts.I agree with others too much sauce for the rice and the flavor profiles were just meh! Not what I expected tastes like it’s missing something! Also cilantro topper on this dish is not a good garish, flavors are all wrong., , , , , , , Leave a comment », , , , , , , , , , , , Nice to Meet You!, , I’m Rene! So-cal native, dog mom and lover of all things spicy., Learn more., , , More About Me, , , , , Follow Me:, , , , , , , , , , , , Cozy & Comforting Vegan Cookbook, , Shop my newest ebook!, , , Get Yours Today, , , , , , , , , , , , ^ Back to Top, , Home, , About me, , Contact Me, , Recipe Index, , Privacy Policy, , , , , , , , , ©2025 This Savory Vegan, . All Rights Reserved., , Design by, Purr, ., , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,"
    }
}