{
    "ingredients": {
        "Honey Chilli Potatoes": "potatoes,corn flour,vinegar,spring onion,red chilli paste",
        "Tofu in chilli garlic sauce": "tofu,onion,red bell pepper,rice vinegar,cornstarch,garlic,ginger",
        "Honey Chilli Cauliflower": "cauliflower,honey,garlic,sriracha,hoisin,cornstarch",
        "Kung pao cauliflower": "besan,cornstarch,almond milk,cauliflower,rice vinegar,bell pepper",
        "Gobi Pepper Fry": "cauliflower,maida,corn flour,fennel,garlic,ginger,capsicum,tomato sauce",
        "Baby Corn Pepper Fry": "baby corns,rice flour,plain flour,bell peppers,pepper",
        "Lemon Pepper Tofu Cutlets": "Firm tofu,oil,vegan stock powder,lemon juice,pepper",
        "Pan Fried Garlic Tofu": "firm tofu,soy sauce,rice wine vinegar,garlic,honey,cornstarch,oil",
        "Bang Bang Brocolli": "brocolli, plain flour, sriracha buttermilk,breadcrumbs",
        "Tofu with Spicy Peanut Sauce": "Tofu,shallot,peanut butter,ginger,coconut milk,sambal oelek,soy sauce",
        "Kung Pao Brussel Sprouts": "brown basmati, brussel sprouts, corn starch, garlic, ginger, hot chili paste, soy sauce, honey, rice vinegar, salted peanuts",
        "Kung Pao Tofu": "Sichuan peppercorns, firm tofu, corn flour, ginger,garlic,spring onions, red pepper, green pepper, dark soy sauce, orange juice, rice vinegar, maple syrup",
        "Vegan tofu stir fry with veggies": "tofu,red onion,ginger,garlic,celery,green beans,brocolli, red bell pepper, zucchini, yellow bell pepper, white vinegar, dark soy sauce, chiili garlic sauce, veg stock/broth, sesame seeds, spring onion",
        "General Tso's Tofu": "brown rice, broccoli, sesame oil, cornstarch, garlic, ginger, rice vinegar, maple syrup, soy sauce, firm tofu, chili garlic sauce, green onions, thai red chillies, sesame seeds",
        "General Tso's Cauliflower": "all purpose flour, almond milk, bread crumbs, cauliflower, sesame oil, garlic, ginger, tomato paste, sugar, rice vinegar, soy sauce, veg broth, corn starch, sesame seeds, green onions, cooked rice",
        "Mongolian Tofu Stir Fry": "extra firm tofu, cornstarch, ginger,garlic, green chili, sugar, dark soy sauce, red chilli sauce, rice wine vinegar, dry red chili, colored peppers, green beans, onion, green onion",
        "Orange Tofu": "tofu, all purpose flour, cornstarch, orange juice, sugar, soy sauce, rice vinegar, sriracha, garlic, orange zest",
        "Soy Garlic Tofu": "garlic,soy sauce, oyster sauce, rice vinegar, corn starch, red wine, tofu, green onions",
        "Vegan Bang Bang Brocolli": "Vegan mayo, chili paste, agave nectar, almond milk, apple cider vinegar, all purpose flour, cornstarch, hot sauce, bread crumbs, broccoli",
        "Sweet Chili Tofu Balls": "Korean Chili paste, tomato ketchup, sesame seeds, sugar, rice vinegar/white vinegar, garlic, firm tofu, soy sauce, carrot, onion, bread crumbs, all purpose flour, green onions"
    },
    "recipe_url": {
        "Honey Chilli Potatoes": "https://myfoodstory.com/honey-chilli-potatoes-recipe/",
        "Tofu in chilli garlic sauce": "https://theflavoursofkitchen.com/crispy-tofu-in-chinese-garlic-sauce-recipe/",
        "Honey Chilli Cauliflower": "https://healthyfitnessmeals.com/sweet-and-spicy-baked-cauliflower/",
        "Kung pao cauliflower": "https://elavegan.com/kung-pao-cauliflower/",
        "Gobi Pepper Fry": "https://hebbarskitchen.com/gobi-pepper-fry-recipe-cauliflower/",
        "Baby Corn Pepper Fry": "https://www.cookclickndevour.com/baby-corn-pepper-fry/?fbclid=IwAR2iH6awA50ZswDogJEpb7MrLPTgS9Nn_aT3I0y7KvhqdcTGn-ldREohlbo",
        "Lemon Pepper Tofu Cutlets": "https://www.pinterest.com/pin/496592296424240296/",
        "Pan Fried Garlic Tofu": "https://www.pinterest.com/pin/496592296424257027/",
        "Bang Bang Brocolli": "https://www.facebook.com/watch/?ref=saved&v=811250096310766",
        "Tofu with Spicy Peanut Sauce": "https://sixhungryfeet.com/tofu-with-spicy-peanut-sauce/?fbclid=IwAR0kTWL1csuKUt5WbYfHrBJX6V7D6fwf1WtMhLPROtmYjO-s_qj0a_VUi5I",
        "Kung Pao Brussel Sprouts": "https://pinchandswirl.com/kung-pao-brussels-sprouts/",
        "Kung Pao Tofu": "https://www.wearesovegan.com/kung-pao-tofu/?fbclid=IwAR31ri0vRczdBie9zGdBpgYREu3q5Qw9UjNJ62WimvZ-KhUUfa2816WSPI8",
        "Vegan tofu stir fry with veggies": "https://www.funfoodfrolic.com/tofu-vegetable-stir-fry/",
        "General Tso's Tofu": "https://minimalistbaker.com/general-tsos-tofu/",
        "General Tso's Cauliflower": "https://veganheaven.org/recipe/general-tsos-cauliflower/",
        "Mongolian Tofu Stir Fry": "https://myspicetrunk.com/2020/10/09/mongolian-tofu-stir-fry/?fbclid=IwAR08g0ieHWOjUy89YtjETbsZnW7FSGn4Z5wmgCzLBwNBzhaNN9RWxiE5CTo",
        "Orange Tofu": "https://healthysimpleyum.com/vegan-orange-tofu/",
        "Soy Garlic Tofu": "https://www.pinterest.co.uk/pin/496592296426641339/",
        "Vegan Bang Bang Brocolli": "https://www.rabbitandwolves.com/vegan-bang-bang-broccoli/",
        "Sweet Chili Tofu Balls": "https://thefoodietakesflight.com/sweet-chili-tofu-balls/"
    },
    "Recipe": {
        "Honey Chilli Potatoes": "Ingredients: , Here’s what you’ll need for batter frying these potatoes:, , , , Potatoes:, Use old potatoes. Should be cut into 1/3 inch thickness, approx 2-3 inches long. Ideally cut them all the same size so they cook at the same time, , Chilli Paste:, Basically ground chillies made by soaking dried red chillies in hot water for 10-15 minutes and grinding to a paste, , Chilli Powder:, Ground red chilli powder, different from ‘chili powder’ that you get in the U.S. which is a seasoning mix, , , , The honey chilli sauce is really addictive. Its sweet, spicy, sticky and like a coating on the potatoes. This is not meant to be a sauce., , , Garlic:, Finely chopped – lots of it because flavour bomb!, , Honey:, Plain honey, flavoured will not work well here, , Ketchup:, It has the perfect balance and umami, , Soy sauce:, Light soy sauce to add saltiness and rich flavour, , Chilli Paste and Chilli Flakes:, This is meant to pack in some heat. If you are not a fan, reduce both the quantities in the sauce, , Sesame Seeds:, They add flavour and crunch and stick to the potatoes because of the sauce, , Cornflour:, Thickening agent, can be substituted with potato starch or tapioca starch, , Vinegar:, To add some acidity and balance, , , How to make Crispy Honey Chilli Potatoes – Step by Step, , Here’s the detailed recipe broken down into three steps to help you ace this recipe!, , 1. First Coating + First Fry, , , , chilli paste, garlic paste, all purpose flour, cornflour and salt. This will become a scraggly crumb like mixture, , Add potatoes and coat them well in the dry batter, , Deep fry the potatoes in batches. Drop them one potato at a time so they don’t stick together, , Deep fry on a medium high flame for a few minutes till the potatoes are almost cooked and golden brown. Remove and set aside, , , 2. Second Coating + Double Fry, , , 5. Make a thick batter by mixing together all purpose flour, corn flour, pepper and water, , 6. Dip each half fried potato stick in it, , 7. Fry the batter coated potatoes on high heat. Make sure to add potatoes one at a time so they don’t stick to each other too much. Fry the potatoes in batch so you don’t overcrowd the pan, , 8. Fry till they are a nice golden brown. Remove on a tissue lined plate and set aside, , 3. Tossing in Honey Chilli Sauce, , , 9. As soon as the potatoes are fried, heat oil in a large wok and add garlic. Saute the garlic for 30 seconds. Don’t let it brown, , 10. Add sesame seeds and saute for another 30 seconds or so, being careful not to brown them or they can taste burnt, , 11. Add soy sauce, honey, ketchup, chilli paste, chilli flakes, vinegar and water and mix well, , 12. Add the potatoes and toss them well so that the sauce covers the potatoes, , 13. Add cornflour slurry and toss again for a minute or two till the cornflour cooks through, , 14. The Honey Chilli Potatoes are ready to go!, , These are not particularly saucy and they shouldn’t be. Because they are not meant as a side. They really are an appetizer or more like a bar snack to serve with beer or mocktails. So what you should do is hand out some toothpicks and let people dig in, or if your friends are like ours, they’ll just use their fingers., , Richa’s Top Tips, , , It’s important to cut the potato fingers into a, uniform, size so that they cook, evenly, while frying. I like to cut them into 1/4 inch to 1/3 inch thickness, , The, temperature, of the oil should be between, 175C to 180C, for frying the potato fingers., , You will need approximately, two cups, oil for deep frying, and you can use the same oil for the second frying, , You may, adjust, the quantity of honey as per your taste., , A, wok, is the best way to coat the potatoes in sauce, because it provides enough space to toss them around, but if you don’t have one, feel free to use a frying pan, , , , Once you try making these crispy honey chilli potatoes at home, there’s no going back! I have made these as snack for the family, as a party appetiser, as well as a side dish when hosting, and each time they’ve disappeared within minutes!, , I love serving these with, fried rice, and, veg manchurian, , but they pair really well with just about any Chinese dish., , Watch the Recipe Video:, , , , , LOVE THIS RECIPE?, Subscribe to my, newsletter, and be the first to receive all new recipes!, , , , , 4.88, from, 24, votes, , Crispy Honey Chilli Potatoes, , By:, Richa, , Watch Recipe Video Above. Crispy Honey Chilli Potatoes are a super addictive snack – fried potato fingers are tossed in a sesame honey chilli sauce that's sweet and spicy and will give you sticky fingers that you'll be licking to get every last bit of sauce!, , Prep:, 10, minutes, , mins, Cook:, 30, minutes, , mins, Total:, 40, minutes, , mins, Servings:, 4, , Portions, , , , , Save, Saved, , , Pin Recipe, , Rate Recipe, , Print Recipe, , , , , , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , 1x, 2x, 3x, ▢, 4-5, , Potatoes, , , 450 grams, peeled and cut into fingers (1/3-1/2 inch thick, 2 -3 inches long), refer to Note 1, ▢, Oil for deep frying, , , refer to Note 2, First Coating:, ▢, 2, , teaspoon, , Chilli powder, ▢, 1, , teaspoon, , Garlic Paste, ▢, 1, , teaspoon, , Red Chilli Paste, ▢, 3, , tablespoon, , Corn Flour, ▢, 3, , tablespoon, , All Purpose Flour, ▢, 1, , tablespoon, , Salt, Second Coating:, ▢, ⅓, , cup, , All Purpose Flour, ▢, ⅓, , cup, , Corn Flour, ▢, ¼, , teaspoon, , Black Pepper, ▢, ¼, , cup, , Water, For the Sauce:, ▢, 2, , tablespoon, , Oil, ▢, 1, , tablespoon, , Garlic, , , finely chopped, ▢, 1, , teaspoon, , Red Chilli Flakes, ▢, 3, , tablespoon, , White Sesame Seeds, ▢, 1, , teaspoon, , Vinegar, ▢, 2, , teaspoons, , Soy Sauce, ▢, 2, , tablespoon, , Tomato Ketchup, ▢, 2-3, , tablespoons, , Honey, ▢, 2, , teaspoons, , Red Chilli Paste, ▢, 1/4, , cup, , Water, ▢, 1, , teaspoon, , Corn Flour, ▢, 2, , tablespoon, , Spring Onion, , , chopped (green part only), ▢, ½, , teaspoon, , Salt, , , optional, ▢, ½, , teaspoon, , Pepper, , , optional, , Cook Mode, Prevent your screen from going dark,  Instructions: Wash potato fingers well in running water and set aside. This removes any extra starch in the potatoes., Mix together corn flour, all purpose flour, chilli powder, chilli paste and salt. Coat the potato fingers evenly with this flour mix., Heat oil in a wok or karahi and deep fry the potato fingers in batches till the potato is half cooked. It's important that you drop one potato finger at a time in to the oil so that they don't stick together (watch video above to see how to do this)., Remove the potato fingers on a tissue lined plate and let them cool., For the second coating, make a medium thick batter with all purpose flour, corn flour and pepper powder by adding just a few tablespoons of water. Dip the half done fries in this batter and fry again in hot oil till crisp and golden. Drain on a kitchen paper and keep aside., Heat 2 tablespoons oil in another wok, add chopped garlic and stir fry for a few seconds. Add chili flakes and sesame seeds and saute for another minute to toast them., Now add vinegar, soy sauce, ketchup, honey and the red chili paste and stir together. x, Mix 1 teaspoon corn flour with 1/4 cup water to make a slurry and add this to the honey- vinegar mixture in the wok and stir for a few seconds till it thickens., Add the fried potato fingers and spring onion greens and toss together so that they are coated evenly in sauce., Switch off the flame and serve immediately garnished with some more sesame seeds and spring onion greens., , Video, , Notes, , Its important to cut the potato fingers in a, uniform, size so that they cook, evenly, while frying, , The, temperature, of the oil should be between, 165C to 175C, for frying the potato fingers., , You will need approximately, two cups, oil for deep frying, and you can use the same oil for the second frying, , You may, adjust, the quantity of honey as per your taste., , A, wok, is the best way to coat the potatoes in sauce, because it provides enough space to toss them around, but if you don’t have one, feel free to use a frying pan, , , Nutrition, Calories:, 394, kcal, , , Carbohydrates:, 69, g, , , Protein:, 7, g, , , Fat:, 11, g, , , Saturated Fat:, 1, g, , , Sodium:, 1356, mg, , , Potassium:, 978, mg, , , Fiber:, 6, g, , , Sugar:, 10, g, , , Vitamin A:, 513, IU, , , Vitamin C:, 47, mg, , , Calcium:, 91, mg, , , Iron:, 3, mg, , , , , , , , Like this recipe? Rate and comment below!, , More Crispy Snack Recipes:, , Appetizers, Veg Cutlets with Potatoes and Beetroot | Veg Croquettes, Appetizers, How to make Cheese Balls (fail proof recipe), Appetizers, Crispy Fried Spinach | Crackling Spinach, Vegetarian Recipes, Crispy Thread Paneer | Threaded Paneer, , , Explore More, , Indian Chinese Recipes, Chinese Bhel, Indian Chinese Recipes, Chicken Manchurian | Street Style, Indian Chinese Recipes, Chicken Majestic, Air Fryer Recipes, Air Fryer Salt & Pepper Chicken, , , , 4.88 from 24 votes (, 4 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Cooked this? Rate this recipe!, , , , Cooked this? Rate this recipe!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , 90 Comments, , , , , , Ayush, , says:, , , , June 16, 2024 at 2:17 pm, , , , , Will be making it today, just a question. Cornflour and Cornstarch the same thing? Would be really helpful if I a get a quick reply., , , Reply, , , , , , , , Richa, , says:, , , , July 16, 2024 at 10:51 am, , , , , Yes its the same thing, , , Reply, , , , , , , , , , Asian Food Lover, , says:, , , , May 24, 2024 at 8:30 am, , , , , I am in the kitchen to try this recipe but my spring onion has ended. I can use regular onion to substitute this., , , Reply, , , , , , , , Richa, , says:, , , , July 16, 2024 at 11:12 am, , , , , Yes you can, , , Reply, , , , , , , , , , Bernadette, , says:, , , , January 20, 2023 at 12:10 pm, , , , , Iam thouroughly impressed with your professional way of presenting your foody recipes.. really tempting and mouth watering.. Simply delicious.. Hats off to you.. You really make all the Mums day with sumptuously delicious recipes… Way to go Girlie 🙏🙌👍💐, , , Reply, , , , , , , , jasa buzzer, , says:, , , , October 20, 2022 at 3:14 pm, , , , , hai  im from Indonesia. i really like this food, looks very good, it seems i have trouble finding food like this in indonesia. thanks to share this.., , , Reply, , , , Comment navigation, Older Comments, , , , Hi I'm Richa!, , the cook, writer and photographer behind this little blog. I’ve grown up in the kitchen along side my mum and grandmothers and conversations in my family are always about the next meal. I’ve picked up their love for food along the way, and with this blog, I share my food story with you., , , Read more about me, , , , , ⭐️ Reader Favs ⭐️, , Indian Recipes, The Best Chicken Biryani (Step by step video recipe), Indian Recipes, Dhaba Style Chicken Curry, Desserts, Homemade Eggless Chocolate Brownies, Vegetarian Recipes, Restaurant Style Paneer Butter Masala, Curry, Restaurant Style Butter Chicken Masala (Murgh Makhani), Drinks, How to make Hibiscus Tea + its Benefits, , , Rainy Day Hits, , Indian Recipes, Egg Tadka | Egg Fry, Vegetarian Recipes, Soondubu Jjigae (Korean Soft Tofu Stew), Appetizers, Paneer Pakora Recipe 2 Ways, Appetizers, The Best Indian Punjabi Samosa, Appetizers, Chicken 65 – Spicy & Crispy, Appetizers, Bread Chaat, Back to top, My Food Story, , , , , Home, , Recipe Index, , Meet Richa, , Subscribe, , ©2025 My Food Story. All rights reserved., , Privacy Policy, Disclaimer and Copyright, •, Accessibility Statement, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Tofu in chilli garlic sauce": "Ingredients: Expand, , , , Beef, , Chicken Recipes, , Fish and Seafood, , Pork, , Vegetarian, , , , , , Beef, , Chicken Recipes, , Fish and Seafood, , Pork, , Vegetarian, , , , , Tofu, – Refer to the next section on how to select the right tofu., Onions, garlic & ginger, – Flavor agents used in all asian recipes., Cornstarch, – To thicken the garlic sauce, Sauces, – Soya sauce, rice vinegar and tomato ketchup – These sauces give the chinese garlic sauce its distinct flavor., Red & Green chili, – Red chilies are for the heat and green chilies are chopped for garnish., Green onions, – Adds flavor and used as garnish., Red bell pepper, – Gives heat, flavor and color to the dish., , Tips To Make Tofu Crispy?, , Making Crispy Tofu is very easy. Few basic steps to prep the Tofu and you will be surprised with the outcome., , Always choose extra firm Tofu among other varieties. As the name says it is firm and easy to work with., I always soak tofu in lightly salted warm water for 15 minutes. This helps in to soften and season the tofu. (I do this even with Paneer- Indian Cottage cheese)., Last but most importantly drain extra moister. Keep Tofu on a clean kitchen towel/ tissue. Cover it with another layer of tissue. Place some heavy weight on it, heavy enough to put little pressure and squeeze out extra water., , How to make, , Marination of tofu pieces is quite easy and needs tossing of tofu with salt, oil, and pepper., , The next step is to prepare the base for the sauce. Needs stirring of all the sauces and cornstarch in a bowl., , Cook the tofu over high heat and flip until all sides are browned. Do not crowd the tofu and keep them on a single layer. Once it is browned, remove and cover them with a paper towel to soak up all the excess oil., , garlic, ginger, etc) on the pan/skillet. Toss in the tofu and the sauce base. Toss everything well and wait for the sauce to thicken., , , Serve With, , You can serve this crispy tofu with any kind of rice – plain rice, brown rice, jasmine rice, or even fried rice like, Jeera rice recipe, , or, Kimchi Fried Rice, ., , It can also be served with noodles. This can also be had as an appetizer., , Store, , Crispy tofu will not stay crispy in the refrigerator. It will become soft but the overall dish will taste good., , I would not recommend storing it and it is better to prepare when needed as it is so quick to make., , Other chinese recipes, , Chinese Chicken Salad With Sesame Dressing, , Chili Chicken Dry, , Chinese Five Spice Ginger Chicken, , Chinese Noodle Soup with Chicken, , Chinese Chicken Salad With Sesame Dressing, , Crispy Spring Rolls, , , , , , , , , Crispy Tofu In Chinese Garlic Sauce, , Course, Side Dish, Cuisine, Chinese, , Prep Time, 10, minutes, , mins, Cook Time, 10, minutes, , mins, Total Time, 20, minutes, , mins, , , Crispy Tofu In Chinese Garlic Sauce: Take less than 20 minutes to prepare this stir fry. I have used Tofu here but you can just replace it with Chicken, Prawns, Mushrooms, even Paneer (Indian Cottage Cheese)., , , , , , , , Servings, 4, , Servings, , , , Print, , Pin, , Rate, , , , , , , , 1x, 2x, 3x, ▢, 250, , gm, , tofu, , Fresh,cut into strips, ▢, 2, , tbsps, , vegetable oil, , or Peanut oil, ▢, 2, , onions, , large, thinely sliced, ▢, 1, , Medium, , red bell pepper, ▢, 8 – 10, , pods, , garlic, , minced, ▢, ½, , tbsp, , ginger, , grated, ▢, 1, , tsp, , red chilli, , flakes, ▢, ½, , tablespoon, , rice vinegar, ▢, 1, , tablespoon, , soy sauce, , light, ▢, 1, , tsp, , soy sauce, , dark, ▢, 1, , tsp, , Tomato Ketchup, ▢, 2, , tsps, , cornstarch, ▢, salt pepper, , and  as per taste, ▢, green onions green chillies, , Chopped and sliced to garnish, , , , Reply, , , , , , , , Adam Gash, , says:, , , , at, , , , , I loved it! I dont really eat noodles or rice so I had it as the entree and a side salad!, I added sliced almonds in the last minute for an extra crunch, and I used flour as I didnt have any cornstarch on hand. (1 tablespoon), , , Reply, , , , , , , , , , , , Subhasmita, , says:, , , , at, , , , , @the take it easy chef Thank you very much, , , Reply, , , , , , , , Subhasmita, , says:, , , , at, , , , , @Sandhya Thanks dear..  That would be the best combo., , , Reply, , , , , , , , Subhasmita, , says:, , , , at, , , , , @Shibani Thank you very much. Glad to see you here., , , Reply, , , , , , , , Sandhya Hariharan, , says:, , , , at, , , , , Love Love !!!  All that I need is a bowl of fried rice with it., , , Reply, , , , , , , , The take it easy chef, , says:, , , , at, , , , , Looks really appetizing!, , , Reply, , , , , , , , Shibani Mishra, , says:, , , , at, , , , , Hi. I stumbled upon your lovely blog from Cumcumber town. Nice to see your lovely recipes and photographs. I am also from Odisha., , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , , , Don't subscribe, , All new comments, , Replies to my comments, , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., , , , Δ, , , , , , , , , , , Reader's Favorites, , , , Chicken Broccoli Stir Fry, Skillet Pork Chops, Classic French Onion Soup, Oven Baked Creamy Chicken Thighs, , , , , Latest Recipes, , , , Air fryer Chicken Skewers, Oven Baked Rack Of Lamb, White Bean Dip, Everyday Lettuce Salad, , , , , , , , Hi, , I'm Subhasmita!, , , Learning from my experience of a decade of cooking, as a professional food photographer, I publish family-friendly tried and tested recipes., , , , More About Me, , , , , , , , , , , , , Seasonal Recipes, , , , Beef Barley Soup, Broccoli Cheddar Soup, Hearty Tortellini Soup With Sausage, Homemade Tomato Soup, , , , , , , , , , , More You’ll Love, , , , Chicken in Garlic Sauce Chinese, Thai Red Curry With Chicken, Chicken Ramen Noodle Recipe, Baked Meatballs In Garlic Butter Sauce, Instant Pot Garlic Herb Chicken and Rice, , , , , , , , Featured On, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Browse Recipes, , Chicken Recipes, , One pot, , Pasta, , Soups, , , , , Flavour In Your Inbox, , Subscribe for recipes straight to your inbox, , Subscribe For More, , , , , , , , , , , , , ©2025, The flavours of kitchen., Contact, , Hey There!!, , Privacy Policy, , , Back To Top, , , Design by, , , , , , , , ×, , , Flavours in your inbox, , Subscribe for recipes straight to your inbox, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Subscribe, , , , Loading..., , , , , , , , , , Subscribe, , , , Loading..., , , , , , , , , Thank you!, , You have successfully joined our subscriber list., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , Instructions: Expand, , , , Air Fryer, , Instant Pot Recipes, , Slow Cooker Recipes, , Stir fry, , , , Hey There!!, , , , , , , , , Search for:, , , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Search, , , , , , , , , , , Menu, Recipe Index, , Course, , , Breakfast, , Appetizers, , Main Dishes, , Side dish, , Soups, , Pasta, , Dessert, , , , , , Air Fryer, , Instant Pot Recipes, , Slow Cooker Recipes, , Stir fry, , , , Hey There!!, , , , Search for:, , , , , Search, , , , , , , , , , , , , , , , , New Flavours, in your inbox!, , , , , Home, », Main Dishes, », 30 Minutes Recipe, , , , , , , , , , Crispy Tofu in Chinese Garlic Sauce, , , By, Subhasmita, , , July 18, 2022, , , Recipe, , , , , , This Crispy Tofu In Chinese Garlic Sauce is delicious with tons of flavor. Make this stir fry in just 20 minutes., , , Prepared Crispy Tofu in Chinese Garlic Sauce Sunday evening to snack on. Sunday is always a day of indulgence and we have our lunch late afternoon. So it is obvious that we skip dinner, Instead, I make something quickly like an appetizer for the dinner., , Most of my weekends are also lined up with lots of work. Shooting for the blog, working on the photography assignment, cleaning, dusting, and the day ends with spending time with the little one. Among all these things a quick dinner comes to the rescue., , , We love this Crispy Tofu in Chinese garlic Sauce because of the flavorful sauce. The sauce is a bomb, loaded with lots of garlic and chili. The sweetness of the caramelized onion balances the spicy sauce., , Do you love Crispy tofu? Whenever I make this or any other recipe that calls for crispy tofu, I pop a few of them before making it to the final dish. Let me tell you a few tips for super crispy tofu with a soft center., , In a large bowl, toss tofu strips with some oil,salt and pepper. Marinate for 10-15 minutes., In a small bowl, stir together rice vinegar, soy sauce, dark soy sauce, Ketchup and cornstarch. Set aside., Heat a large frying pan over high heat. Add 1 tbsp oil. Arrange the tofu strips in a single layer. Let it cook undisturbed on medium-high heat for 1-2 minutes.  Flips the strips and let it crisp on the other side.  The tofu strips should look brown and crisp on both sides., Remove and place on a kitchen towel/tissue paper to absorb extra oil., In the same pan add remaining oil. Once it is hot add in garlic, ginger, and red chili flakes. Fry over low heat for about 10-15 seconds, or until aromatic, taking care not to burn the garlic., Increase the flame and add Sliced onion. Saute over high heat for a minute. Add red bell pepper and toss in high flame for about 1 minute. Make sure to stir and toss the vegetables well., Add the crisp tofu strips followed by the prepared sauce. Toss everything well. Season with salt or pepper if required., The sauce will start to thicken. If it is very thick add 1-2 tablespoons of water. Cook further for a minute or so., Garnish with chopped green onions and green chilies., Serve hot as an appetizer or along with rice or noodles., , , , , , , , , , Did You Make This Recipe?, Tag, @theflavoursofkitchen, on Instagram and hashtag it, #theflavoursofkitchen, , , , , , , Post navigation, , Previous, , Previous, Blueberry Banana Muffin, Next, Continue, , No-Knead  Foccacia, , , 11 Comments, , , , , , , Joanne, , says:, , , , at, , , , , I am making this recipe now but it doesn’t say if I should chop the garlic, , , Reply, , , , , , , , Subhasmita, , says:, , , , at, , , , , Please use minced garlic., , , Reply, , , , , , , , , , RandyHoD, , says:, , , , at, , , , , This looks amazing! One question, but not the ingredient list. Did you use an entire medium red bell pepper or is it really just to preference?, , , Reply, , , , , , , , subhasmita, , says:, , , , at, , , , ",
        "Honey Chilli Cauliflower": "Ingredients: , recipe card., , , Cauliflower, cut into bite-sized florets, , Cooking Oil Spray, , Garlic Salt or garlic powder, , Salt and pepper, to taste, , Green Onions, sliced, , Sesame Seeds: either white or black, , , For the Sweet and Spicy Sticky Sauce:, , , Honey: I prefer honey but you can use maple syrup, , Garlic Cloves: use fresh if possible, , Low sodium soy sauce or coconut amino, , Sriracha: or another hot sauce, , Hoisin Sauce, , Gluten-free flour or cornstarch, , , How to make it, , , Preheat oven to 400 degrees F and line a baking tray with parchment pepper., , Arrange the cauliflower florets in a single layer onto the prepared baking tray and spray with cooking oil. Sprinkle with garlic salt, and pepper, and using your hands toss well to coat., , , , , Bake in the preheated oven for 15-20 minutes, until it starts to brown on the edges. While cauliflower is cooking, , Place the saucepan over medium heat and stir frequently until sauce thickens, about 4-5 minutes., , Once the cauliflower has finished baking, remove from the oven and allow to cool for a few minutes., , Pour the sauce over and toss until fully coated. Top with green onions and sesame seeds and enjoy!, , , , Recipe notes, , , You may want to cook the cauliflower to whatever crispiness you prefer., , The sauce should be cooked well enough to get it thick. You do not want a watery sauce. So, I recommend using cornstarch if you can., , , Frequently asked questions, , Can you eat cauliflower on keto?, , This recipe is not keto. Generally speaking, cauliflower is very similar to Broccoli and is low in carbs. Even though this particular baked cauliflower recipe is not keto-friendly because of the sweet and spicy sauce that’s added to it, generally simply baked cauliflower with no added sugar sauces are, keto-friendly, . They are a great cruciferous veggie with 1.5 grams of net carbs per half a cup., , , Why do you soak cauliflower before cooking?, , Cauliflower tends to have a lot of dirt and sometimes bugs stuck in its crevices. So, it is recommended to soak it in salted water for 10-15 minutes., , , Why is my roasted cauliflower not crispy?, , This may have happened by overcrowding your pan. Cauliflower has a high water content. If baking, it may be hard to get them crispy if you overcrowd the pan. Make sure you space it out., , , How to store leftovers?, , If you have leftovers, place them in a sealed container and store them in the fridge for up to 5 days., , , , , How to make this recipe in an air fryer, , If you prefer to use your air fryer to cook the cauliflower instead of baking them in the oven you can. Follow the following steps on how to make this in the air fryer., , , Preheat the air fryer to 400F and lightly spray the grates with cooking oil spray., , Lay the seasoned cauliflower in the air fryer basket and stir fry for 22-25 minutes or until crispy enough to your liking. Open the air fryer halfway through cooking and toss the florets., , While the cauliflower is cooking, about 4-5 minutes. Set aside., , Once the cauliflower is ready, place in a bowl, toss it with the sauce, and garnish with sliced onions and sesame seeds. Enjoy!, , , What to serve it with, , , Beef Wellington, , Garlic Beef Tenderloin Roast, , Lemon garlic oven-roasted whole chicken, , Air Fryer Turkey Breast, , Honey Glazed Air Fryer Salmon, , Honey Garlic Air Fryer Tofu, , , Pin this now to find it later, Pin It, , , You may also like, , , Chimichurri grilled cauliflower steaks, , Creamy Broccoli Cauliflower Salad, , Keto Cauliflower Mac and Cheese, , Shrimp Cauliflower Fried Rice, , Spicy Honey Baked Cauliflower, , Air Fryer BBQ Cauliflower Wings, , , , , Get my free eBook!, Grab my free ebook featuring 20 of my top 30 minutes family-friendly healthy dinner recipes., Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Download, , , , Also, remember to subscribe to my, , NEWSLETTER for free and receive recipes like this Baked Cauliflower Recipe delivered right to your inbox!, , FOLLOW, Healthy Fitness Meals on, FACEBOOK, |, INSTAGRAM, |, PINTEREST, |, TWITTER, for all of my latest blog posts and recipes., , , , 4.74, from, 109, votes, , Sweet and Spicy Baked Cauliflower, , By:, Rena, Servings:, 4, , Prep:, 10, minutes, , mins, Cook:, 25, minutes, , mins, 0, minutes, , mins, Total:, 35, minutes, , mins, , , , Save, Saved, , , , , , Rate, , , Pin, , , Print, , , , , , , This sweet and spicy cauliflower is baked to perfection and then topped with a sweet and spicy sticky sauce. So easy and tasty., , , , Cook Mode, Prevent your screen from going dark, , 1x, 2x, 3x, ▢, 1, , Large, , Head Cauliflower, , , cut into bite-sized florets, ▢, Cooking Oil Spray, ▢, 1, , teaspoon, , Garlic Salt, ▢, Salt and pepper, to taste, ▢, 1, , tablespoon, , Green Onions, , , sliced, ▢, 1, , tablespoon, , Sesame Seeds, For the Sweet and Spicy Sticky Sauce:, ▢, ¼, , Cup, , Honey, ▢, 2, , Garlic Cloves, , , minced, ▢, ¼, , Cup, , Low sodium soy sauce or coconut amino, ▢, 1, , tablespoon, , Sriracha, ▢, 1, , tablespoon, , Hoisin Sauce, ▢, 1, , teaspoon, , Gluten-free flour or cornstarch, , ¼ Cup Honey, , , 2 Garlic Cloves, (minced), , ¼ Cup Low sodium soy sauce or coconut amino, , , 1 tablespoon Sriracha, , , 1 tablespoon Hoisin Sauce, , and, 1 teaspoon Gluten-free flour or cornstarch, ) into a small saucepan and whisk until well incorporated., Place the saucepan over medium heat and stir frequently, until sauce thickens about 4-5 minutes., Once the cauliflower has finished baking, remove from the oven and allow to cool for a few minutes., Pour the sauce over and toss until fully coated. Top with, 1 tablespoon Green Onions, (sliced) and, 1 tablespoon Sesame Seeds, and enjoy!, , Video, , Notes, , Soak the cauliflower in salted water to make sure all debris is removed. Rinse well., , Cut the florets into even sizes to ensure even cooking., , Use cornstarch if you can, it will make the sauce thicken well.,  Instructions: Preheat oven to 400 degrees F and line a baking tray with parchment pepper., Arrange the, 1 Large Head Cauliflower, florets in a single layer onto the prepared baking tray and spray with, Cooking Oil Spray, . Sprinkle with, 1 teaspoon Garlic Salt, , , Salt and pepper, to taste, , and using your hands, toss well to coat., Bake in the preheated oven for 15-20 minutes, until it starts to brown on the edges. While cauliflower is cooking, , Store leftovers in a sealed container in the fridge for up to 5 days., , , Nutrition, Calories:, 152, kcal, Carbohydrates:, 33, g, Protein:, 6, g, Fat:, 2, g, Saturated Fat:, 1, g, Cholesterol:, 1, mg, Sodium:, 1328, mg, Potassium:, 678, mg, Fiber:, 5, g, Sugar:, 23, g, Vitamin A:, 15, IU, Vitamin C:, 104, mg, Calcium:, 74, mg, Iron:, 2, mg, Nutrition information is automatically calculated, so should only be used as an approximation., , Additional Info, Course:, Main Course, Side Dish, Cuisine:, Asian, , , , , , Tried this recipe?, Mention, @healthyfitnessmeals, or tag, #healthyfitnessmeals, !, , , , , 545.1K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , About Rena Awada, Hi, I’m Rena! Welcome to my blog. I am here to help you prepare delicious, light, fresh meals that your whole family will love!, , , , , , Read More About Me, , , You May Also Like, , Baked Italian Chicken, Air Fryer Chicken Bites, Baked Zucchini Chips, Cauliflower “Mac” and Cheese, , , , 4.74 from 109 votes (, 75 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , 67 Comments, , , , , , Dina B, , says:, , , , November 5, 2024 at 9:07 am, , , , , Delicious, I served as a side w grilled chicken. Very easy, I did have to bake the cauliflower a little longer than 15 minutes. My husband was pleasantly surprised. He is not a cauliflower fan., , , Reply, , , , , , , , Rena Awada, , says:, , , , November 5, 2024 at 8:41 pm, , , , , So happy you guys loved it., , , Reply, , , , , , , , , , Alessandra, , says:, , , , September 24, 2024 at 7:34 pm, , , , , Made it and it came out delicious. I served it with rice and it was the perfect balanced combination. I didn’t have Hoisin sauce but it was delicious nonetheless. Can’t wait to try it with the Hoisin sauce. Thank you for sharing this amazing easy recipe., , , Reply, , , , , , , , Rena Awada, , says:, , , , September 24, 2024 at 8:27 pm, , , , , Thank you so much. So glad you loved it., , , Reply, , , , , , , , , , Mary Alexander Adams, , says:, , , , August 28, 2024 at 6:57 pm, , , , , Delicious recipe!, You have got to try it, and so easy. I substituted a few things… was not about to go to the store, Loved it, , , Reply, , , , , , , , Rena Awada, , says:, , , , August 29, 2024 at 9:58 pm, , , , , Lol. Glad you loved it., , , Reply, , , , , , , , , , Alison, , says:, , , , July 20, 2024 at 7:30 pm, , , , , Great flavor!, , , Reply, , , , , , , , Patience Lacy-Smith, , says:, , , , June 25, 2024 at 12:14 pm, , , , , Looks more than good enough to eat!, , , Reply, , , , , , , , Danielle, , says:, , , , January 10, 2024 at 7:01 pm, , , , , I really likes this recipe! I loved the sweet and the spicy together. Could have ate the entire thing by myself lol., , , Reply, , , , , , , , Rena Awada, , says:, , , , January 10, 2024 at 7:12 pm, , , , , Great, Glad you loved it. Thanks for taking the time to leave feedback. Appreciate it, , , Reply, , , , , , , , , , Maura J, , says:, , , , February 26, 2023 at 5:42 pm, , , , , why is this included as a “healthy” food? It’s not, It is drenched in sugar., , , Reply, , , , , , , , Jackie, , says:, , , , February 19, 2023 at 10:24 am, , , , , I’m making this again today. I’m planning on adding tofu and serving it over rice. I’m so glad I’m the only one who will eat it so it’s all mine!, , , Reply, , , , , , , , Kim, , says:, , , , January 17, 2023 at 9:53 pm, , , , , Simple and delicious!! The key to the steps is definitely not to overcook the  cauliflower, and too simmer or boil the sauce enough until it is very thick or it won’t stick to the cauliflower., , , Reply, , , , , , , , Rochelle, , says:, , , , January 13, 2023 at 8:52 pm, , , , , My family cannot get enough of this., , , Reply, , , , , , , , Diane, , says:, , , , January 10, 2023 at 8:30 pm, , , , , Made this tonight and it was fantastic!  My husband loved it and said he really liked it and wants to have it again. Also said I should make more next time!!! Healthy Vegan recipe too!  Winner!!!, , , Reply, , , , , , , , Stephanie Lanzalotto, , says:, , , , January 6, 2023 at 8:49 am, , , , , I made this exactly as written and it was FABULOUS! Brought it to a pot luck gathering and it was the first thing to go. Will make it again and again., , , Reply, , , , , , , , Rena Awada, , says:, , , , January 7, 2023 at 1:13 pm, , , , , Glad you loved it, , , Reply, , , , , , , , Tina, , says:, , , , April 17, 2023 at 3:27 pm, , , , , I am wondering if you could make this ahead of time, like bake it the night before, and put it altogether for a potluck?, , , Reply, , , , , , , , Rena Awada, , says:, , , , April 20, 2023 at 8:57 am, , , , , I don’t recommend cooking the nights before., , , , , , , , , , , , , marie, , says:, , , , April 10, 2022 at 12:31 am, , , , , Hello,, Great recipe. I look forward to more. I’d like to point out however, that whatever editing programme you are using is putting capital letters on almost everything. Although that is an error in English, most of the time it is harmless. However in the case of distinguishing teaspoons and tablespoons it might cause user errors. The short form of teaspoon is tsp. The shortform of tablespoon is T. These have been the norms for decades and were developed to avoid confusion. Capital T is always big. Small t is always small. Thjanks for listening., M.Susan, , , Reply, , , , , , , , Rena, , says:, , , , April 10, 2022 at 1:09 pm, , , , , Thank you for the info. I agree it could be confusing. Thanks for bringing it to my attention. We will do better, , , Reply, , , , , , , , , , Paula Kurpjuweit, , says:, , , , March 29, 2022 at 10:16 pm, , , , , Excellent recipe!! Thank you so much for sharing it with all of us!  A new family favorite.  I can’t wait to make it again!!!, , , Reply, , , , , , , , Rena, , says:, , , , April 2, 2022 at 10:23 am, , , , , amazing. So glad., , , Reply, , , , , , , , , , nyleahs, , says:, , , , March 22, 2022 at 11:01 pm, , , , , Is the posted nutrition info for one serving or four?, , , Reply, , , , , , , , Rena, , says:, , , , March 24, 2022 at 9:26 am, , , , , It is per serving, , , Reply, , , , , , , , , , Heidi J Hawkins, , says:, , , , March 11, 2022 at 8:28 pm, , , , , Can’t wait to try this. Looks so yummy!!, , , Reply, , , , Comment navigation, Older Comments, , , , Hello & Welcome!, , Hi, I'm Rena! I am here to help you prepare delicious, light, fresh meals that your whole family will love! Healthyfitnessmeals.com was founded in 2014 and all my recipes are nutritionally reviewed by a, Registered Dietician, ., , , Read more about me, , , , , , , , , Contact us at support@healthyfitnessmeals.com, , , , , , Brunch Ideas, , Easy Crustless Quiche, Keto Deviled Eggs, Hot German Potato Salad, Banana Bread Pudding, , , Easter Recipes, , Easy Carrot Cake, Maple Glazed Baked Whole Chicken, One Pot Cheesy Creamed Corn, Roasted Honey Glazed Carrots, Baked Balsamic Asparagus, Garlic Beef Tenderloin Roast, , , Popular Recipes, , Easy Homemade Beef Stew, Creamy Chicken Enchilada Soup, Asparagus Stuffed Chicken Breast, Baked BBQ Chicken Breast, Creamy Tuscan Chicken Pasta, Easy Baked Teriyaki Salmon, Back to top, Healthy Fitness Meals, , , , , Explore, , , All Recipes, , Recipe Index, , How To, , My Favorites, , Main Courses, , Kid Friendly Recipes, , Vegetarian, , Low Carb Recipes, , Desserts, , Side Dishes, , Gluten Free, , Breakfast, , High Protein, , , , Connect, , , Work with Me, , About Me, , Contact, , Instant Updates, , , , ©2025 Healthy Fitness Meals. All rights reserved., , Privacy Policy, •, Accessibility, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Kung pao cauliflower": "Ingredients: , , , , How To Make Kung Pao Cauliflower?, , This recipe has only 8 steps which are easy to follow and not complicated at all. First, you allow the cauliflower a nice cozy bath in a batter made from chickpea flour, cornstarch, soy sauce, and water. While the cauliflower florets bake in the oven you can fry the bell pepper, garlic, fresh ginger and peppercorns in a skillet. Your kitchen will smell amazing!, , bring to a boil, and allow it to simmer for one minute., , Finally, add the roasted cauliflower to the skillet and give it a good stir. You can enjoy it right away. However, if you want the cauliflower to be crispy, transfer it back to the oven for a further 10-15 minutes! Check the easy instruction pictures below:, , , What about Kung Pao Tofu?, , This spicy Kung Pao can be made with either cauliflower or tofu. I don’t eat tofu very often but if you want your Kung Pao to be packed with lots of plant-based protein you can use tofu., How to make Kung Pao Tofu?, , you will need to press the tofu for about 15-20 minutes, slice it into cubes and fry it in a pan until nicely brown. You can try out both versions and let me know which one you preferred. 🙂, , , Spicy Kung Pao, , Do you love spicy food? I know it’s super, healthy, and I like spicy food as long as it’s not too spicy. Yesterday I ate a whole dried chili (yes, the whole chili with the seeds) and almost fainted, haha. It was too much for my tastebuds. You can make this Kung Pao with 4-6 dried chilies which you can fry with the garlic, ginger, peppercorns, and bell pepper., , However, I would suggest removing the chilies before you pour in the sauce. If you don’t have dried chilies, simply use 1/4 teaspoon (or more) cayenne pepper. Not a fan of spicy meals? Leave it out completely for a mild Kung Pao Cauliflower., , , Does it keep?, , Yes! Leftovers can be stored covered in the fridge for up to 4 days. Simply reheat in a pan/skillet., , , You Will Love This Kung Pao Cauliflower. It’s:, , , Vegan, , Gluten-free, , Spicy, , Sweet & Salty, , Satisfying, , Comforting, , , Perfect for a weeknight dinner, , And it can be made oil-free, , , , A Few Helpful Tips, , , Serve it with Jasmine rice, Basmati rice or rice noodles, , Double the batch and store leftovers in the fridge for up to 4 days, , Use tofu instead of cauliflower for a protein-rich variation, , , , Should you recreate this tasty spicy Chinese stir-fry, please leave a comment below and don’t forget to tag me in your Instagram or Facebook post with, @elavegan, and #elavegan because I love to see your remakes! If you love spicy food, definitely also check out the following vegan spicy recipes:, , , Vegan Meatballs With A Spicy Gravy, , Buffalo Chickpea Taquitos, , Gnocchi All’Arrabbiata, , , , , , Kung Pao Cauliflower, , , Author:, Michaela Vais, , , This Kung Pao Cauliflower is a delicious stir-fry which is spicy, hearty, satisfying, and comforting. It's a great meat-free Chinese takeout alternative to Kung Pao Chicken! The Kung Pao sauce has the perfect combination of spicy, salty and sweet flavors which will make your mouth water. The recipe is vegan, gluten-free, low in fat and calories, and can be made oil-free!, , , 4.82, from, 58, votes, , , Servings, 2, , , Prep, 15, minutes, , mins, Cook, 35, minutes, , mins, Total, 50, minutes, , mins, , , , Rate recipe, , Print recipe, , Pin recipe, , , , , , , , , , Video, , , , , , , , , , , 1x, 2x, 3x, Batter:, ▢, ½, , cup, , , (, 60, , g, ), , chickpea flour, , (*see recipe notes), ▢, 4, , tbsp, , , (, 30, , g, ), , cornstarch, ▢, ½, , cup, , , (, 120, , ml, ), , plant-based milk, ▢, ½, , tbsp, , , , soy sauce, , (*see recipe notes), ▢, 1, , medium, , , (, 600, , g, ), , head of cauliflower, , cut into bite-sized florets, Sauce:, ▢, ½, , cup of, , , (, 120, , ml, ), , water, ▢, 3, , tbsp, , , , soy sauce, , (*see recipe notes), ▢, 2, , tbsp, , , , rice vinegar, ▢, 2, , tbsp, , , , maple syrup, , (*see recipe notes), ▢, 1, , tbsp, , , , cornstarch, ▢, ½, , tsp, , , , smoked paprika, ▢, 1/4-1/3, , tsp, , , , cayenne pepper, , OR 4-6 dried chilies (*see recipe notes), For the skillet:, ▢, 2, , tsp, , , , oil, , or water, ▢, 4, , cloves, , , , garlic, , minced, ▢, 1, , tbsp, , , , fresh ginger, , minced, ▢, ¾, , tsp, , , , peppercorns, , (optional), ▢, 1, , small/medium, , , , bell pepper, , sliced into fine strips, ▢, 1, , tsp, , , , sesame seeds, ▢, , , fresh chives, , chopped, ▢, , , peanuts, , (optional), , but I imagine it could work well., , , Reply, , , , , , , , , , howie, , , 17. June, 2024 at 17:09, , , , Hi Ela! I’ve enjoyed this a few times. How do you stir the bell peppers with the lid on? Is it OK to remove it a few times, or should I be swinging the pan with the lid sealing it? Thanks for your recipes!, , , Reply, , , , , , , , Ela, , , 18. June, 2024 at 08:06, , , , Hi Howie, I am glad you like it. Yes, remove it a few times. You can see it in the video. 🙂, , , Reply, , , , , , , , , , Randy Klinger, , , 16. March, 2024 at 16:00, , , , We found that the batter ran onto the sheet, baked onto the sheet and created a kind of ‘platform’ that then burnt….., , , Reply, , , , , , , , Selma Paganfullmoon, , , 16. November, 2023 at 18:22, , , , , , , I just did this recipe and wow thank you so much! it is really easy and I had everything already so satisfying to have such an easy weeknight dinner on hand. I was kinda out of idea with the cauliflower, didn’t want to make any classic gratin or soup and there you pop up in my Pinterest 😍 so nice! I love Asian food and especially when it is homemade it tastes always so much better!, , well one last thing I didn’t have bell pepper so I used beautiful colored carrots cut in the Asian way, in diagonal and was put of corn starch so I used tapioca starch. 😊, , this recipe is directly going to my favourites, , , Reply, , , , , , , , Ela, , , 17. November, 2023 at 05:29, , , , That’s wonderful. Thanks for your great feedback. 🙂, , , Reply, , , , , , , , , , Vasilios, , , 2. February, 2023 at 09:29, , , , Your recipes are spectacular, thank you. unfortunately I’m unable to view / locate the video. can you help?, , , Reply, , , , , , , , Ela, , , 2. February, 2023 at 10:43, , , , No worries, the recipe video is now embedded in the recipe card. There is a green button on top of each post that says “Jump to Video”. If you click it, you will skip right to the video. I hope this helps!, , , Reply, , , , , , , , , , Joanne, , , 27. January, 2023 at 10:14, , , , , , , Hi there, I made this for dinner for my vegan daughter, we all thought it was very tasty ( incl my meat eating husband) but I thought the batter was very thick. Next time I would add a bit more water. Thank you!, , , Reply, , , , , , , , Ela, , , 27. January, 2023 at 10:20, , , , You are very welcome, Joanne. 🙂, , , Reply, , , , , , , , Jim Gramprie, , , 16. June, 2023 at 20:14, , , , , , , Agree with making it a bit more thick., Very tasty! Trying with tofu tonight, , , Reply, , , , , , , , , , Alky Newton, , , 22. November, 2022 at 21:48, , , , https://pin.it/4Jeh49Z, , Made this tonight and it was amazing!  Used gluten free flour in the batter, sriracha sauce for the spiciness, and cashews instead of peanuts.  Next time I won’t return it to the oven and maybe make some extra sauce.  Now one of my favourite recipes., , , Reply, , , , , , , , Ela, , , 23. November, 2022 at 08:59, , , , That’s great, Alky! Thanks for your amazing feedback. 🙂, , , Reply, , , , , , , , , , Anastasia, , , 17. August, 2022 at 00:00, , , , , , , We just made this for supper–we went step by step, skipped the second bake round and it literally came out perfect.  The chickpea flour is such a great choice for the batter and they came out perfectly crisped but a little firm.  My kids rated this a 10/10 and asked me to put it in our family cookbook of favorites.  It was absolutely delicious and the smell was divine.  Thank you so much for the wonderful recipe–I can’t wait to try more of your amazing recipes.., , , Reply, , , , , , , , Ela, , , 17. August, 2022 at 08:33, , , , That’s so good to hear, Anastasia! Thanks for your amazing feedback. 🙂, , , Reply, , , , , , , , , , Katie, , , 1. August, 2022 at 20:13, , , , , , , I had everything on hand, and this was amazing. Love how the batter gave some depth to the cauliflower. I look at your blog often, and both recipes I made were a win. Thanks!, , , Reply, , , , , , , , Ela, , , 2. August, 2022 at 11:04, , , , Wonderful! Thanks for your lovely feedback, Katie. 🙂, , , Reply, , , , , , , , , , C, , , 2. June, 2022 at 13:36, , , , Hey I’m making this dish rn and the batter keeps coming out too thick and I’m following the recipe to the t I’m thinking adding more milk to thin it out but I’m not sure, , , Reply, , , , , , , , Ela, , , 2. June, 2022 at 15:07, , , , Yes, just add more milk. 🙂, , , Reply, , , , , , , , , , Kelly, , , 25. December, 2021 at 22:51, , , , , , , Excellent flavour! Delicious! Just a few adjustments…..I would suggest making an extra batch of just the sauce’ especially if serving rice noodles. The cauliflower soaked up all the deliciousness. Also, this is great for maybe a small head of cauliflower, so adjust accordingly.. Can’t go wrong with extra sauce! I used the convection setting on my oven and used the top rack….perfect????????. Definitely making again!, , , Reply, , , , , , , , Ela, , , 26. December, 2021 at 09:38, , , , Thanks for your feedback, Kelly! 🙂, , , Reply, , , , , , , , , , Candice Howrish, , , 14. November, 2021 at 23:18, , , , , , , The flavors were good but it did not come out crispy at all, even with the extra time in the oven, just soggy ????, , , Reply, , , , , , , , Ela, , , 15. November, 2021 at 08:39, , , , Sorry to hear you didn’t like it, Candice. 🙂, , , Reply, , , , , , , , , , Christina, , , 13. October, 2021 at 15:09, , , , , , , I have made this twice now.  It was great!  I didn’t do the step where you put it back in the oven when second time — didn’t think it needed it.  Also, I think I like it better without the smoked paprika.  This is a great recipe!!!  Thank. You., , , Reply, , , , , , , , Ela, , , 13. October, 2021 at 15:33, , , , That’s wonderful, Christina. Thanks for sharing. 🙂, , , Reply, , , , , , , , , , Tammy Black, , , 11. April, 2021 at 18:46, , , , , , , Delicious! I subbed all purpose GF flour for the chickpea flour and arrowroot starch in the sauce. So yummy! Will make again!, , , Reply, , , , , , , , Ela, , , 11. April, 2021 at 19:39, , , , Sounds great! Thanks for sharing. 🙂, , , Reply, , , , , , , , , , Amanda, , , 2. February, 2021 at 21:41, , , , , , , These are sooooo delicious and filling! My husband recently went onto a vegan diet and has been wanting to stick to a certain website’s recipes initially…they are not super flavorful and I was still hungry all the time. This was so flavorful and I was happily full after and didn’t even finish the whole serving! I’m super excited to try more of your other recipes., , , Reply, , , , , , , , Ela, , , 2. February, 2021 at 21:47, , , , That’s awesome, Amanda! I am so glad they turned out filling and delicious. 🙂, , , Reply, , , , , , , , , , Lynda, , , 30. November, 2020 at 21:33, , , , , , , Looks amazing! I’m planning on making it next  week!  One question..I just found out that I have a food sensitivity to bell peppers, do you think it would be OK to leave them out? Or could I substitute with some thing else? Thanks for the great recipe!, , , Reply, , , , , , , , Ela, , , 1. December, 2020 at 00:06, , , , Use your favorite roasted veggies of choice. 🙂, , , Reply, , , , , , , , , , Terra Kohl Parris, , , 25. August, 2020 at 02:25, , , , , , , This was the first recipe of yours that I’ve made and let me say, Thank you!! I’ve been following you on Instagram. Everything you always posts looks so great. I had a head of cauliflower that I needed to use asap so I checked your blog for inspiration!, , Danke! I can’t wait to try another recipe! My boyfriend was literally licking his plate! Prost!, , , Reply, , , , , , , , Ela, , , 25. August, 2020 at 13:35, , , , Wow, that’s such a sweet compliment! Thanks for your great feedback, Terra. I am glad you and your boyfriend liked the dish. 🙂, , , Reply, , , , , , « Older Comments, , , , 4.82 from 58 votes (, 8 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , Primary Sidebar, Facebook, Instagram, Pinterest, RSS, YouTube, , About Me, , , Welcome to my blog ElaVegan. My name is Michaela Vais, I’m a passionate food blogger, recipe developer, food photographer, and author of the cookbook, Simple and Delicious Vegan, . Being creative in the kitchen and eating healthy vegan food is my passion., Read More…, , , , , Order My Cookbook, , , AMAZON ASSOCIATES DISCLOSURE, , This website is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com., The affiliate links are marked with an asterisk (*)., , , , Copyright © 2025 · Elavegan.com, Privacy Policy, ·, Disclosure, , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: , Meanwhile, you can also start making the spicy Kung Pao sauce which takes literary, just 60 seconds, . All you need to do is, , This recipe has a, video, Batter:, Preheat oven to 425 degrees F (220 degrees C) and line a large baking sheet with parchment paper. In a large bowl whisk together cornstarch, chickpea flour, plant-based milk, and soy sauce. Let it sit for about 1 minute, then add the cauliflower florets., Toss until all cauliflower florets are coated with batter. Transfer the cauliflower to the prepared baking sheet and bake in the oven for about 20 minutes, Skillet:, Heat oil (or water) in a skillet over low to medium heat, add garlic, ginger, peppercorns. Saute for 1 minute, stirring frequently to avoid burning., Next, add bell pepper and saute with a lid on for a further 5-6 minutes, stirring frequently. Add more water if necessary (I used 1 tbsp)., Sauce:, Meanwhile, prepare the sauce. In a medium/large bowl, combine water, soy sauce, rice vinegar, sugar, cornstarch, smoked paprika, and cayenne. Whisk., Pour the sauce into the skillet. Bring to a boil and let simmer on low heat for 1 minute. Add the roasted cauliflower florets and toss to coat., Transfer back to the baking sheet and bake for a further 10-15 minutes if you like the cauliflower to be crispy OR enjoy immediately., Serve with rice or rice noodles. Garnish with sesame seeds, fresh chives and peanuts (optional). Enjoy!, , , Notes, , Chickpea flour alternative, : I would suggest using gluten-free all-purpose flour (or regular flour if not gluten-free) instead of chickpea flour (haven't tried it out though)., , Soy sauce, : Use gluten-free if needed or tamari or coconut aminos. You can also use low-sodium soy sauce., , Sweetener, : You can use a sweetener of choice, e.g. maple syrup, coconut sugar, brown sugar, etc., , Use 1/4 teaspoon (or more) of cayenne pepper OR 4-6 dried chilies instead. If you prefer dried chilies, add them to the pan and fry together with garlic, ginger, peppercorns, and bell pepper. Then remove the chilies before you pour in the sauce, otherwise, the Kung Pao will be too spicy!, , Make sure to also check out my, Sticky Teriyaki Tofu, recipe., , Recipe serves 2. Nutrition facts are for one serving (without rice or rice noodles)., , , , , Nutrition Facts, Kung Pao Cauliflower, Amount per Serving, Calories, 266, % Daily Value*, Fat, , 4, g, 6, %, Carbohydrates, , 37, g, 12, %, Fiber, , 10, g, 40, %, Sugar, , 10, g, 11, %, Protein, , 14, g, 28, %, * Percent Daily Values are based on a 2000 calorie diet., , Nutrition information is an estimate and has been calculated automatically, , , , , , , Simple and Delicious Vegan Cookbook by ElaVegan, CLICK HERE to order!, , If you are using Pinterest, feel free to pin the following photos:, , , , Share this post:, , Share on, Pinterest, , Share on, Facebook, , Share on, X (Twitter), , , Previous Post:, « Vegan Calzone Recipe (Gluten-Free Pizza Pockets), Next Post:, Vegan Apple Muffins (Gluten-Free) », Reader Interactions, Comments, , , , , , Tracey, , , 5. March, 2025 at 08:57, , , , Tried this and I love it.  I’m making it again but experimenting with Brussels sprouts as well as they need using up.  Do you think it would also work with halloumi?, , , Reply, , , , , , , , Ela, , , 5. March, 2025 at 12:54, , , , Hi Tracey",
        "Gobi Pepper Fry": "Ingredients: , , , , 4, , how to make gobi pepper fry with step by step photo:, , , , , 5, , notes:, , , , , , gobi pepper fry recipe | cauliflower pepper fry | gobi pepper dry, with step by step photo and video recipe. gobi based recipes or particularly cauliflower snacks are super popular across india. it is typically used as a meat alternative and used mainly in the indo chinese manchurian and chilli recipes. yet it is also used in other south indian variants and the gobi pepper fry recipe is one such popular snack that inherits the spice level from chettinad cuisine., , indo chinese recipes have always been my all-time favourite snack meal recipe. it is mainly due to the combination of flavour and taste it has to offer in each bite. the main reason to mention about indo chinese in this south indian recipe post is to acknowledge the fact that, it has been derived from it. generally, indian cuisine does not use cornflour in its snacks recipes. but this recipe does use cornflour to get the crisp texture, very similar to indo chinese. later it is used in a south indian tadka which makes it unique and native to south india. in other words, the combination of onions, garlic and fresh herbs makes it native to south india., , , , , , , furthermore, some more important tips, suggestions and variants to the, gobi pepper fry recipe, . firstly, i would always recommend using fresh and tender cauliflower for any kind of gobi snacks recipe. this would make it crispier, juicier and also tastier with the final recipe. secondly, the combination of cornflour and maida used in this recipe should be ideal to get a crunchy and crispy gobi pakora. but if you need crispier you can add more cornflour to make it even crispier. lastly, once the deep-, fried, process is done, it should be immediately used for tempering., , finally, i request you to visit my other related, snacks recipes collection, with this post of, gobi pepper fry recipe, . it mainly includes my other related recipes like, potato murukku, , , crispy veg starter, , , macaroni kurkure, , , onion samosa, , , railway cutlet, , , aloo papdi, , , roti tacos, , , palak patra, , , moong dal kachori, , , cabbage pakoda, . further to these i would also like to highlight my other related recipe categories like,, , , street food recipes, , chaat recipes, , indo chinese recipes, , , gobi pepper fry video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for cauliflower pepper fry recipe:, , , , , , , , , gobi pepper fry recipe | cauliflower pepper fry | gobi pepper dry, , , HEBBARS KITCHEN, , , easy gobi pepper fry recipe | cauliflower pepper fry | gobi pepper dry, , , 5, from, 25, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 30, minutes, , mins, Total Time, 40, minutes, , mins, , , , , , , Course, starters, Cuisine, south indian, , , , , , Servings, 3, , Servings, Calories, 400, , kcal, , , , , , , 1x, 2x, 3x, for crispy gobi:, ▢, 2, , cup, , gobi / cauliflower, , , florets, ▢, 1, , tsp, , salt, ▢, hot water, , , for blanching, ▢, 1, , cup, , maida, ▢, ¾, , cup, , corn flour, ▢, ¼, , tsp, , turmeric, ▢, ½, , tsp, , pepper powder, ▢, ½, , tsp, , salt, ▢, 1, , cup, , water, , , for batter, ▢, oil, , , for frying, for pepper fry:, ▢, 2, , tbsp, , oil, ▢, ½, , tsp, , cumin, ▢, ½, , tsp, , fennel / saunf, ▢, few curry leaves, ▢, 1, , onion, , , finely chopped, ▢, 5, , clove, , garlic, , , crushed, ▢, 1, , inch, , ginger, , , chopped, ▢, ½, , capsicum, , , finely chopped, ▢, ¼, , tsp, , turmeric, ▢, ½, , tsp, , cumin powder, ▢, ½, , tsp, , coriander powder, ▢, ½, , tsp, , pepper powder, ▢, ½, , tsp, , salt, ▢, 2, , tbsp, , tomato sauce, ▢, 2, , tbsp, , coriander, , , finely chopped,  Instructions: , firstly, in a large bowl take 2 cup gobi. make sure to take the florets of the same size., now add 1 tsp salt and pour hot water., soak for 5 minutes, or until the gobi is blanched slightly., drain off and keep aside to cool completely., in a bowl take 1 cup maida and ¾ cup corn flour., also add ¼ tsp turmeric, ½ tsp pepper powder and ½ tsp salt., adding 1 cup water, mix well using a whisk making sure there are no lumps., now add blanched gobi and coat well with batter., deep fry in hot oil, keeping the flame on medium., stir occasionally, making sure to fry uniformly., fry until the gobi turns golden brown and crisp. you can double fry for a crunchier bite., drain off making sure to get rid of excess oil. keep aside., in a large wok, heat 2 tbsp oil. add ½ tsp cumin, ½ tsp fennel and few curry leaves., splutter until the spices turn aromatic., now add 1 onion, 5 clove garlic and 1 inch ginger. stir fry on high flame., further, add ½ capsicum and stir fry until it turns crunchy., add ¼ tsp turmeric, ½ tsp cumin powder, ½ tsp coriander powder, ½ tsp pepper powder, ½ tsp salt and 2 tbsp tomato sauce., stir fry on high flame until the spices are well combined., add in fried gobi and mix gently. do not overcook as gobi will lose its crunchiness., finally, and 2 tbsp coriander leaves and enjoy crispy gobi pepper fry., , , , , Nutrition, Calories:, 400, kcal, Carbohydrates:, 70, g, Protein:, 6, g, Fat:, 10, g, Saturated Fat:, 1, g, Polyunsaturated Fat:, 3, g, Monounsaturated Fat:, 6, g, Trans Fat:, 1, g, Sodium:, 1618, mg, Potassium:, 307, mg, Fiber:, 3, g, Sugar:, 3, g, Vitamin A:, 1030, IU, Vitamin C:, 39, mg, Calcium:, 62, mg, Iron:, 4, mg, , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make gobi pepper fry with step by step photo:, , , firstly, in a large bowl take 2 cup gobi. make sure to take the florets of the same size., , , , , , , now add 1 tsp salt and pour hot water., , , , , , , soak for 5 minutes, or until the gobi is blanched slightly., , , , , , , drain off and keep aside to cool completely., , , , , , , in a bowl take 1 cup maida and ¾ cup corn flour., , , , , , , also add ¼ tsp turmeric, ½ tsp pepper powder and ½ tsp salt., , , , , , , adding 1 cup water, mix well using a whisk making sure there are no lumps., , , , , , , now add blanched gobi and coat well with batter., , , , , , , deep fry in hot oil, keeping the flame on medium., , , , , , , stir occasionally, making sure to fry uniformly., , , , , , , fry until the gobi turns golden brown and crisp. you can double fry for a crunchier bite., , , , , , , drain off making sure to get rid of excess oil. keep aside., , , , , , , in a large wok, heat 2 tbsp oil. add ½ tsp cumin, ½ tsp fennel and few curry leaves., , , , , , , splutter until the spices turn aromatic., , , , , , , now add 1 onion, 5 clove garlic and 1 inch ginger. stir fry on high flame., , , , , , , further, add ½ capsicum and stir fry until it turns crunchy., , , , , , , add ¼ tsp turmeric, ½ tsp cumin powder, ½ tsp coriander powder, ½ tsp pepper powder, ½ tsp salt and 2 tbsp tomato sauce., , , , , , , stir fry on high flame until the spices are well combined., , , , , , , add in fried gobi and mix gently. do not overcook as gobi will lose its crunchiness., , , , , , , finally, and 2 tbsp coriander leaves and enjoy crispy, gobi pepper fry, ., , , , , , , , notes:, , , firstly, to make the gobi more crispy, you can use a 1:1 ratio of maida and cornflour., , also, doubled frying the gobi will keep them crunchy for a longer time., , additionally, adjust the pepper based on your spice level., , finally, crispy, gobi pepper fry recipe, tastes great when served hot and spicy., , , , , , , , , Related Recipes, , , , , , , , , , biryani, , , Paneer Biryani Recipe | Veg Paneer Dum Biriyani, , , , Hebbars Kitchen, , -, , , April 4, 2025, , , , , , , , , , , , appetizer, , , Pizza Puff Recipe | Mcdonald’s Veg Pizza McPuff, , , , Hebbars Kitchen, , -, , , April 1, 2025, , , , , , , , , , , , , 00:02:10, , , , snacks recipes, , Aloo Cutlet Recipe | Crispy Potato Cutlet –..., , , , Hebbars Kitchen, , -, , , March 31, 2025, , , , , , , , , , , , , gluten free, , Besan Ladoo Recipe | Besan Ke Laddu –..., , , , Hebbars Kitchen, , -, , , March 28, 2025, , , , , , , , , , , 00:01:33, , , , side dish, , Aloo Pakora Recipe | Aloo Bajji | ..., , , , Hebbars Kitchen, , -, , , March 17, 2025, , , , , , , , , , , , , snacks recipes, , Alasanda Vada Recipe | Black Eyed Peas Fritters, , , , Hebbars Kitchen, , -, , , March 12, 2025, , , , , , , , , , , 00:02:05, , , , appetizer, , Chilli Mushroom Recipe | Mushroom Chilli Dry –..., , , , Hebbars Kitchen, , -, , , March 6, 2025, , , , , , , , , , , 00:02:11, , , , appetizer, , Honey Chilli Potato Recipe – Street Style with..., , , , Hebbars Kitchen, , -, , , February 18, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 4 COMMENTS, , , , , , , , Usha Shenoy Kulkarni, , , August 1, 2021                                                At                                                11:19 am, , , , , awesome recipe!, , , , , , , , , , , , Hebbars Kitchen, , , August 22, 2021                                                At                                                3:47 pm, , , , , Thanks a lot, , , , , , , , , , , , , , Mangala Devi, , , July 30, 2021                                                At                                                9:06 am, , , , , Love your recipe, , , , , , , , , , , , Hebbars Kitchen, , , August 22, 2021                                                At                                                5:13 pm, , , , , Thanks a lot., , , , , , , , , , , , , , Comments are closed., , , , 5 from 25 votes (, 25 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , breakfast recipes, , , , , Akki Roti Recipe | Masala Akki..., , , , , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , indian street food, , bread upma recipe | south indian bread upma recipe, , , , , , , , What's New, , , , , , , , gluten free, , Besan Ladoo Recipe | Besan Ke Laddu – Halwai Style, , , , , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Baby Corn Pepper Fry": "Ingredients: , In this dish, you first fry the flour coated baby corn. Then prepare a quick base with onions and peppers to which you add the fried baby corns., , As you see, , Next try to use freshly pounded pepper for sharp flavor. For milder flavor you can use white peppercorns too., , How to prep baby corns for this recipe?, , As I said above we love baby corn at our home. I don’t buy the peeled and packed ones though. We get really tender and fresh bay corns that are so delicious which I very frequently purchase., , I peel the baby corns and store them in closed box for 3-4 days. For this recipe, you will have to par boil the baby corns in salted water for five minutes., , Can I replace baby corn with any other ingredient in this recipe?, , Yes, if you don’t want to use baby corn you can use mushrooms, potatoes, paneer or tofu in this recipe. Just clean, toss the flours and fry as mentioned in the recipe., , Here is an easy step by step tutorial of the recipe for you all!, , How To Make Baby Corn Pepper Fry, , Peel the baby corns and remove the feathers thoroughly. Chop them as required., , , Bring a big pot of water to a rolling boil. Add salt and turmeric powder. Mix well and add the chopped baby corns., , Blanch for five minutes. Drain and let dry for few minutes., , , Combine the blanched baby corns, plain flour, rice flour, salt and pepper powder in a bowl., , , Mix and toss well. Do not add water., , , Heat oil in a pan. Slide the batter coated corns into the hot oil., , , Fry until golden and crispy. Set aside., , , Heat 2 tablespoons sesame oil in a pan or wok. Add cumin seeds, chopped onions and saute well till onions turn soft., , , Add chopped bell pepper and mix well., , , Next add pepper powder and salt to taste. Saute in high flame for 6-7 minutes., , , Add the fried baby corns and toss quickly., , , Serve with a squeeze of lemon juice., , , Some Variations With The Recipe, , Along with pepper powder you can add a dash of chili powder or paprika for more spice, , Instead of lemon juice you can add 2 teaspoons vinegar towards the end., , For more saucy version you can add 2 tablespoons tomato sauce after sauteing bell peppers., , Serving Suggestions, , Serve baby corn pepper fry warm or hot as snack with a drink or as side dish with rice, noodles., , You Might Also Like, , Chili Potatoes, , gobi manchurian, , chili garlic okra, , paneer manchurian, , I hope you will try this baby corn pepper fry recipe and enjoy as much as we did. P, lease give a star rating, ★, in the recipe card below. Follow us on, Pinterest, ,, Instagram, ,, Facebook, for more recipes and ideas., , Baby Corn Pepper Fry Recipe, , , , , Baby Corn Pepper Fry, , , Cook Mode, Prevent your screen from going dark, , Harini, , , Baby corn pepper fry- an easy side dish for you that is vegan, gluten free and super delicious. Pair this Asian style fry with your fried rice, noodles or just serve as snack with drink of your choice. How ever you choose to serve, this baby corn fry is sure to please everyone’s palate. Here is how to make easy baby corn pepper fry with step by step photos., , , 4, from, 13, votes, , , Print Recipe, , Pin Recipe, , , Prep Time, 10, minutes, , mins, Cook Time, 20, minutes, , mins, Total Time, 30, minutes, , mins, , , , , , , Course, Snack, Cuisine, continental, , , , , , Servings, 3, Calories, 198, , kcal, , , , , 1 CUP = 250 ml, , , 1x, 2x, 3x, For Frying the baby corns, ▢, 20, , baby corns, ▢, 3, , tablespoons, , rice flour, ▢, 1, , tablespoon, , plain flour, ▢, 1/2, , teaspoon, , pepper powder, ▢, salt, , to taste, ▢, oil, , for frying, To make baby corn pepper fry, ▢, 2, , tablespoons, , sesame oil, ▢, 1/2, , teaspoon, , cumin seeds, ▢, 1/2, , cup, , chopped onions, ▢, 1, , cup, , chopped bell peppers, ▢, 3/4, , teaspoon, , pepper powder, ▢, salt, , to taste, ▢, 2, , teaspoons, , lemon juice,  Instructions: , Peel the baby corns and remove the feathers thoroughly. Chop them as required., Bring a big pot of water to a rolling boil. Add salt and turmeric powder. Mix well and add the chopped baby corns., Blanch for five minutes. Drain and let dry for few minutes, Combine the blanched baby corns, plain flour, rice flour, salt and pepper powder in a bowl. Mix and toss well. Do not add water., Heat oil in a pan. Slide the batter coated corns into the hot oil., Fry until golden and crispy. Set aside., Heat 2 tablespoons sesame oil in a pan or wok., Add cumin seeds, chopped onions and saute well till onions turn soft., Add chopped bell pepper and mix well., Next add pepper powder and salt to taste. Saute in high flame for 6-7 minutes., Add the fried baby corns and toss quickly., Serve with a squeeze of lemon juice., , Notes, , You can use corn flour instead of rice flour but rice flour retains the crispiness for long time, , You can double or triple the recipe, , , Nutrition, Serving:, 3, g, Calories:, 198, kcal, , , , , , , , , Tried this recipe? Snap a pic and share 🙂, Mention cookclickndevou or tag cookclickndevour, , , , , , , 10341, , shares, , , , , , , , Share, , , , , , , Pin, 10339, , , , , , , Yummly, , , , , , , Flipboard, , , , , , , Twitter, , , Shared by, Harini, , About, Harini, I am Harini. The recipe developer, food photographer and chef behind cook click n devour. My aim behind this blog is to provide easy, tried and tested recipes that beginners can cook with confidence. I took keen interest in cooking and took courses on cooking, baking during teens purely out of passion. With a decade of cooking experience I am glad to share my recipes and culinary knowledge with you all here. Stay tuned and happy cooking!, Harini :), , Comments, , , , , , Lisa, , says, , , June 16, 2019 at 6:06 pm, , , , Can you use canned baby corn if fresh is not available?, , , , , , , , , Harini, , says, , , June 17, 2019 at 4:47 pm, , , , yes you can. Drain them thoroughly and if they are salted, go easy on salt., , , , , , , Leave a Reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., , Hello, I am Harini, , , , , , The chef, author and photograper of cook click n devour. Here you'll find tried & tested vegetarian recipes with step by step photos and videos to make cooking a pleasure and fulfilling experience. Happy cooking!, , , Read More, , , , , Popular Recipes, , , , As Seen In, , , About, Contact, Privacy, Copyright ©2025, Cook Click N Devour!!!. All Rights Reserved., , , , , , , , , , , , ,",
        "Lemon Pepper Tofu Cutlets": "Ingredients:  Instructions: ",
        "Pan Fried Garlic Tofu": "Ingredients:  Instructions: ",
        "Bang Bang Brocolli": "Ingredients:  Instructions: ",
        "Tofu with Spicy Peanut Sauce": "Ingredients: a saucepan for the peanut sauce, a pan to pan-fry the tofu and 20 minutes!, , What Our Readers Think of This Recipe:, , , Sharom: this was perfect! exactly the flavor I was searching for, and I tried so many different recipes! Thank you so much, , Astrid: Soooo Yummy. I made this for dinner a few nights ago and will be making this again soon. I added some green beans and served it over rice noodles. This sauce will work great with any vegetable in addition to the tofu or even without it. I've been searching for an easy, yet super flavorful peanut sauce and I think I finally found it. Thank you., , Cillian: This is such a good, simple recipe when you want something tasty but don't want to be cooking for ages! Just made it tonight for dinner - I ended up throwing in a chopped red bell pepper and some brown mushrooms when sauteeing the shallot and ginger and let them simmer in the sauce along with the tofu. Served it over jasmine rice with baby spinach wilted with garlic, sesame oil and soy sauce. Thank you!, , , Jump to:, , Tofu., For this recipe, where the tofu is the centerpiece and gets cooked and coated with a rich sauce, you will need firm or extra firm tofu. If you are getting tofu fresh from an Asian supermarket, you may need to get the extra firm type. They tend to be softer than the tofu you can buy at your regular supermarket., , Peanut Butter, . We use toasted peanut butter as it has a deeper flavor. Choose a smooth peanut butter that uses just one ingredient: Peanuts., , Coconut Milk., To get the perfect creaminess of the sauce, we add coconut milk to the mixture. You can also use cashew cream or another vegetable milk or cream., , Sambal Oelek, . We use, Sambal Oelek, for the spicy touch, but if you prefer a milder sauce, you can skip this ingredient or add ½ teaspoon of chili flakes instead. You can substitute this ingredient for sriracha or another chili paste or sauce. If you are making this dish for young kids or toddlers, skip this!, , Shallot, . Shallots or yellow onion give the sauce the perfect sweetness., , Ginger, . Use fresh or, dried ginger, ., , Soy Sauce or Tamari, . To balance the sweetness from the sauce, we like adding some soy sauce or, tamari, for a gluten-free option., , Lime juice., The last and really important ingredient is lime juice, which adds some tanginess to the sauce., , , , , , Stirfry for 2-3 minutes and add the coconut milk., , , Add the peanut butter and mix well., , , Add the sambal, lime juice, and soy sauce., , , , All you need to do now is add, combine the pan-fried tofu with the spicy peanut sauce and serve with some rice or noodles, or prepare a hearty tofu bowl., , , , , , Tofu with Spicy Peanut Sauce, , , Our Tofu served with a Spicy Peanut Sauce is creamy, rich, nutty, vegan, and gluten-free, the perfect weeknight dinner or appetizer., , , 4.50, from, 16, votes, , , Print, , Pin, , Rate, , , Course:, Appetizer, Main Course, Cuisine:, asian, Keyword:, Tofu with Spicy Peanut Sauce, , Prep Time:, 5, minutes, , minutes, Cook Time:, 20, minutes, , minutes, Total Time:, 25, minutes, , minutes, , Servings:, 4, , people, , Calories:, 283, kcal, , , ▢, 14, , oz, , firm tofu, ▢, 1, , shallot, ▢, 1, , thumb-sized piece ginger, ▢, 1, , cup, , coconut milk, ▢, ¼, , cup, , peanut butter, ▢, ½, , tablespoon, , Sambal Oelek, ▢, ½, , tablespoon, , soy sauce, ▢, Juice of ½ lime, US Customary, -, Metric, , Cook Mode, Prevent your screen from going dark, , 1 shallot, , 1 thumb-sized piece ginger, Heat some coconut or vegetable oil in a saucepan and add the shallot and ginger. Stir-fry for 2-3 minutes and add the coconut milk., 1 cup coconut milk, Add the peanut butter and mix well. Straight after, add the sambal, lime juice and soy sauce., ¼ cup peanut butter, , ½ tablespoon Sambal Oelek, , Juice of ½ lime, , ½ tablespoon soy sauce, Add the tofu, mix until all the pieces are perfectly coated and serve., , , Newsletter, , , , , , , , Join our Community of Foodies., Exclusive plant-based recipes, meal plans, and pro cooking tips directly to your inbox., Join Now!, , Nutrition, Calories:, 283, kcal, |, Carbohydrates:, 8, g, |, Protein:, 14, g, |, Fat:, 23, g, |, Saturated Fat:, 12, g, |, Polyunsaturated Fat:, 5, g, |, Monounsaturated Fat:, 6, g, |, Sodium:, 211, mg, |, Potassium:, 240, mg, |, Fiber:, 2, g, |, Sugar:, 2, g, |, Vitamin A:, 1, IU, |, Vitamin C:, 1, mg, |, Calcium:, 144, mg, |, Iron:, 3, mg, , , Serving Suggestions, , Our Tofu with Spicy Peanut Sauce is an easy recipe that can be served as an appetizer or as a main dish., , When we serve it as an, appetizer,, we place the tofu bowl in the middle for people to serve themselves. If you have a, clay, dish, use it to serve the tofu, as it will hold the heat for longer. Adding some cilantro or fresh chili on the top gives the dish the perfect touch for a nice presentation., , Served as a main dish, we enjoy cooking some jasmine rice or noodles with it. Adding some vegetables will make a perfectly balanced meal., , You can use this spicy tofu for your Poke Bowls, , Buddha Bowls, , Tofu Bowls, Burritos, Salads, and other dishes., , If you have any leftovers, you can keep them in the fridge for 3-4 days., , , , FAQ, , What veggies can I add to this recipe?, , Bell peppers, mushrooms, carrots, broccoli, or cauliflower are our top choices for this spicy peanut sauce., , , What can I use instead of Tofu?, , We like using tofu for this recipe, as it soaks up all the flavors, but you can also use soy curls, seitan, or tempeh., , , , Other Recipes You May Like:, , , Tofu Stir fry with Cashews, , Teriyaki Tofu, , Tofu Satay with Peanut Sauce, , 15 Chinese Tofu Recipes, , , About, Laura Arteaga, I'm Laura, originally from Mallorca, Spain. My culinary journey began at 21, and despite my background in Economics, cooking stole my heart. I am now a full time writer and food blogger. My food philosophy is simple: \"Eat more real food.\" Through my writing and recipes, I want to inspire people to transition to a plant-based life style, to eat more vegetarian food, or simply to try new recipes in the comfort of their homes., , Subscribe for More!, , , Reader Interactions, Comments, , , , , , Robin, , says, , , September 09, 2021 at 1:27 pm, , , , One of the tastiest tofu recipes I’ve ever tried!! It literally left me craving tofu!!!!, , , Reply, , , , , , , , Laura, , says, , , September 09, 2021 at 1:52 pm, , , , Thank you Robin! Glad you liked it!, , , Reply, , , , , , , , , , Cillian, , says, , , September 19, 2021 at 2:15 am, , , , This is such a good, simple recipe when you want something tasty but don't want to be cooking for ages! Just made it tonight for dinner - I ended up throwing in a chopped red bell pepper and some brown mushrooms when sauteeing the shallot and ginger and let them simmer in the sauce along with the tofu. Served it over jasmine rice with baby spinach wilted with garlic, sesame oil and soy sauce. Thank you!, , , Reply, , , , , , , , Laura, , says, , , September 19, 2021 at 2:54 pm, , , , Thank you Cillian, we are glad you liked it!, , , Reply, , , , , , , , , , Astrid, , says, , , January 14, 2022 at 6:30 pm, , , , Soooo Yummy. I made this for dinner a few nights ago and will be making this again soon. I added some green beans and served it over rice noodles. This sauce will work great with any vegetable in addition to the tofu or even without it. I've been searching for an easy, yet super flavorful peanut sauce and I think I finally found it. Thank you., , , Reply, , , , , , , , Laura, , says, , , January 26, 2022 at 1:10 pm, , , , Thank you Astrid, so glad you liked our recipe. We make it really often at home, so simple and good!, , , Reply, , , , , , , , , , Nina, , says, , , February 17, 2022 at 9:53 pm, , , , I want to add udon noodles, mushrooms and red pepper, maybe one more veg. If I want to double the sauce so there’s enough for all the additions, should I double everything, even the shallot and ginger?, , , Reply, , , , , , , , Laura, , says, , , February 18, 2022 at 1:24 pm, , , , Hi Nina, , , Reply, , , , , , , , , , Linda, , says, , , May 06, 2022 at 10:12 pm, , , , Can I use Silk unsweetened coconut milk?, , , Reply, , , , , , , , Laura, , says, , , May 08, 2022 at 7:36 pm, , , , Hi Linda, we've never tried using silk unsweetened coconut milk before but I think it will work just fine!, , , Reply, , , , , , , , , , Sarom, , says, , , October 29, 2022 at 3:17 am, , , , this was perfect! exactlly the flavor I was searching for and tried so many different recipes! Thank you so much 🙂, , , Reply, , , , , , , , Laura, , says, , , October 29, 2022 at 12:40 pm, , , , Thank you Sarom, really glad you enjoyed our recipe!, , , Reply, , , , , , , , , 4.50 from 16 votes (, 12 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, , , , Six Hungry Feet is a blog dedicated to plant-based recipes from around the world. Our recipes are influenced by our travels around Asia, our childhood in Spain (Laura) and Ireland (Astra), and by parenthood, which made us develop more and more family-friendly recipes., More about us →, , , Featured Recipes, , Oyster Mushroom Tacos, Mediterranean Loaded Hummus, Vegan Wonton Soup, Vegan Strawberry Crumble, , Stock images by, Depositphotos, , , , , , Footer, , ↑ back to top, , , , , Privacy Policy, -, Disclaimer, -, Contact, -, Work with Us, , Copyright © 2024 Six Hungry Feet, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: Tofu with Spicy Peanut Sauce, Serving Suggestions, FAQ, Other Recipes You May Like:, , , , , , Cook your tofu. We have been cooking this protein in different ways, and our favorite way is to fry the tofu in a pan with a little bit of vegetable or sesame oil. Pan-frying the tofu at a medium-low temperature while you keep turning the tofu pieces to cook each side is a perfect way, in our opinion, to cook it., , It gets golden and crispy on the outside and moist and fluffy on the inside. It may take a bit longer than baking or deep frying it, but it's definitely worth it., , , Remove any excess of water from the tofu with a paper towel, gently pressing the block. Cut into medium size square pieces., 14 oz firm tofu, Heat some sesame oil or vegetable oil in a pan and add the tofu cubes. Pan fry each side of the tofu for a few minutes or until golden. Leave aside.",
        "Kung Pao Brussel Sprouts": "Ingredients: 1x, 2x, 3x, ▢, 1, , cup, , rice, , I used brown basmati, ▢, 2, , pounds, , Brussels sprouts, , halved, ▢, 3, , tablespoons, , peanut oil, , divided, ▢, salt and freshly ground black pepper, , to taste, ▢, 1, , teaspoon, , cornstarch, ▢, 3, , cloves, , garlic, , minced, ▢, 2, , tablespoons, , minced peeled fresh ginger, ▢, 1, , tablespoon, , hot chili paste, , such as sambal oelek, ▢, 1/4, , cup, , soy sauce, ▢, 1/4, , cup, , water, ▢, 1, , tablespoon, , honey, ▢, 1, , tablespoon, , rice vinegar, ▢, 1, , teaspoon, , Sichuan peppercorns, , (also called Szechuan peppercorns) coarsely ground in a spice grinder or well crushed with a mortar and pestle or a rolling pin, ▢, 1/2, , cup, , roasted unsalted peanuts, ▢, red pepper flakes, , to taste, , mouth-watering recipes designed for home cooks., , , Read more, , , , , , , , , Reader Favorites, , Carne Asada Recipe, Oven Roasted Crispy Pork Belly, Lemon Garlic Pasta, Bacon Wrapped Scallops, Shrimp Tacos, Tomato Bisque, , , Recent Recipes, , Sausage Quiche, Mexican Cauliflower Rice, Skillet Potatoes, Creamy Garlic Shrimp, As Seen In, Pinch and Swirl, , , , Recipes, , Collections, , About, , Free EBook, , Contact, , ©2025 Pinch and Swirl. All rights reserved., , Privacy Policy, •, Disclosure Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: Preheat oven to 425°F., Line a rimmed baking sheet with parchment paper., In a medium bowl, toss Brussels sprouts with 2 tablespoons of the peanut oil and spread in a single layer on prepared baking sheet; season with salt and freshly ground black pepper. Roast 20 minutes, until tender with crispy edges, stirring once about half way through roasting time., After stirring Brussels sprouts and returning to oven (while they have 10 minutes left to roast), whisk together cornstarch and 1 teaspoon water in a small bowl until smooth., Heat remaining 1 tablespoon peanut oil in a small saucepan over medium heat. Add garlic and ginger; cook and stir until garlic is golden brown, about 2 minutes. Add chili paste, soy sauce, water, honey, rice vinegar and crushed Sichuan peppercorns and bring to a boil; stir in cornstarch mixture. Reduce heat and simmer, stirring constantly until sauce has thickened slightly, about 2 minutes. Remove from heat., When Brussels sprouts are done, transfer to medium bowl. Pour sauce over and toss to coat. Transfer to serving platter or divide among 4 bowls. Sprinkle with peanuts and red pepper flakes (optional); serve with hot cooked rice., , Notes, , For a vegan version, skip the honey and use sugar or other sweetener instead., , , , Nutrition, Calories:, 510, kcal, |, Carbohydrates:, 70, g, |, Protein:, 18, g, |, Fat:, 21, g, |, Saturated Fat:, 3, g, |, Polyunsaturated Fat:, 6, g, |, Monounsaturated Fat:, 10, g, |, Sodium:, 949, mg, |, Potassium:, 1141, mg, |, Fiber:, 11, g, |, Sugar:, 11, g, |, Vitamin A:, 1724, IU, |, Vitamin C:, 194, mg, |, Calcium:, 133, mg, |, Iron:, 4, mg, , Nutrition information is automatically calculated, so should only be used as an approximation., , , , , , , , , , , Leave a comment & rate the recipe below!, , Share:, Pin, Facebook, Tweet, Email, , , Related Recipes, , Miso Ramen Recipe, Shrimp Ramen, Bacon Fried Rice, Birria Ramen, , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , , 52 Comments, , , , , , Holly, , says:, , , , February 12, 2021 at 10:56 am, , , , , My kids don’t like brussels sprouts but they love Kung Pao chicken. So hopefully, they will like this roasted version with yummy sauce. Looks lovely., , , Reply, , , , , , , , Marissa Stevens, , says:, , , , February 12, 2021 at 2:42 pm, , , , , Thank you, Holly! I hope it’s a hit., , , Reply, , , , , , , , , , annie@ciaochowbambina, , says:, , , , February 11, 2021 at 6:03 pm, , , , , This one amazing dish, Marissa! Yep – I’m a fan of Brussels sprouts, and you have upped their game! Love it!, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , February 12, 2021 at 2:44 pm, , , , , Thanks so much, Annie!, , , Reply, , , , , , , , , , Valentina, , says:, , , , January 25, 2021 at 6:47 pm, , , , , Such a delicious preparation for brussles sprouts. We love them roasted and I’m certain with all of these added flavors, they’ll be even more amazing. 🙂 ~Valentina, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , January 26, 2021 at 9:00 am, , , , , Thanks so much, Valentina!, , , Reply, , , , , , , , , , Mary Ann | The Beach House Kitchen, , says:, , , , January 25, 2021 at 5:01 pm, , , , , I’m already in love with Brussels sprouts Marissa and I know I’d love this flavor! Can’t wait to give your recipe a try!, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , January 26, 2021 at 9:01 am, , , , , Fantastic! Thank you, Mary Ann., , , Reply, , , , , , , , , , Sally Humeniuk, , says:, , , , January 25, 2021 at 1:55 pm, , , , , We had this last night and it was a huge hit with my family, Marissa! The flavors of the sticky sauce were so perfect; My husband is not very tolerant of hot spicy foods, so I did only add 1 teaspoon of the sambal and then my son and I added more to our individual dishes. We also added a red bell pepper during the last 10 minutes of roasting the sprouts, because we needed to use them and that was another fresh addition. The only complaint at the table was they wished there was even more sticky sauce so next time I might double the sauce and serve the extra at the table. As with many of your recipes, this was a winner!, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , January 25, 2021 at 2:07 pm, , , , , This is wonderful to hear, Sally! I’m so glad that you and your family enjoyed this and that you added your own twists. Thank you for your detailed cooking notes too!, , , Reply, , , , , , , , , , Liz, , says:, , , , January 23, 2021 at 4:47 pm, , , , , Such magnificent flavors paired with your BS! I’m going to air fry mine tomorrow (fingers crossed they’re edible!), but have almost everything on hand to make your Kung Pao recipe. They sound fabulous!, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , January 24, 2021 at 2:52 pm, , , , , Thank you, Liz! I hope you’ll enjoy them., , , Reply, , , , , , , , , , Katherine | Love In My Oven, , says:, , , , January 22, 2021 at 9:07 am, , , , , Such a fun way to eat some brussels sprouts, Marissa! Yum! I have been eating a ton of sprouts these days, much to my childrens’ chagrin…they may actually enjoy these ones though! 🙂, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , January 23, 2021 at 4:25 pm, , , , , Thanks so much, Katherine! May be worth a try… 😉, , , Reply, , , , , , , , , , David @ Spiced, , says:, , , , January 22, 2021 at 4:29 am, , , , , I 100% agree with you about roasted Brussels – truthfully they are one of my favorite veggies!  And whole Brussels in a brothy soup is another great way to eat them.  We roast Brussels on a regular rotation around here, and next time I want to try ’em with this Kung Pao sauce.  What a great idea!, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , January 23, 2021 at 4:25 pm, , , , , Thanks, David! I haven’t tossed them into soup before, but I’ll have to give it a try., , , Reply, , , , , , , , , , Sonali- The Foodie Physician, , says:, , , , March 19, 2015 at 12:56 pm, , , , , From one BS ambassador to another, these look amazing!  And if all Brussels Sprouts were prepared like this, they would be loved by all!, , , Reply, , , , , , , , Marissa, , says:, , , , March 23, 2015 at 10:35 am, , , , , haha! Thanks, Sonali…, , , Reply, , , , , , , , , , shashi at runninsrilankan, , says:, , , , March 17, 2015 at 8:09 am, , , , , I adore  Brussels sprouts – but I’ve never had them so well seasoned – this sounds phenomenal – wow – this would make the humble  Brussels sprout totally addicting! Thanks Marissa!, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , March 18, 2015 at 4:41 pm, , , , , Thanks so much, Shashi! I hope you’ll give them a try., , , Reply, , , , , , , , , , nagimaehashi, , says:, , , , March 17, 2015 at 2:10 am, , , , , I’m Team Brussel Sprouts!! I love love LOVE them. But then again, I have never experienced soggy boiled ones 🙂 Only ones like yours, crisp golden brown or shaved (I love them shaved!) And Kung Pao? GOLD!! 🙂, , , Reply, , , , , , , , Marissa Stevens, , says:, , , , March 18, 2015 at 4:42 pm, , , , , Woohoo! Thanks so much, Nagi., , , Reply, , , , , , Comment navigation, Older Comments, , , , Hi there! I'm Marissa., ",
        "Kung Pao Tofu": "Ingredients: , , 2 tsp Sichuan peppercorns, , 300g firm tofu, , salt and pepper, , 4 tbsp cornflour, , coconut oil, for frying, , 1/2 thumb of ginger, , 3 garlic cloves, , 1 tsp chilli flakes, , 3 spring onions, , 1 red pepper, , 1 green pepper, , 2 tbsp dark soy sauce, , 1 tsp sesame oil, or tamari for gluten-free, , 5 tbsp orange juice, , 1 tbsp rice vinegar, , 1.5 tbsp maple syrup, , , To serve:, , , jasmine rice, , handful of salted peanuts, , , , , , Roughly chop the peanuts and add them the wok along with the tofu and spring onion. Stir to combine, then serve on a bed of rice., , , , , , , , , Quick dinners, Terrific tofu, Watch videos, , , , , , , , , , , 1 Comment, , , 8, , , Facebook, Twitter, Pinterest, Email, , , , , , , Previous post, , , , , Crepes 3 Ways, , , , , , , , , Next post, , , , , Mixed Berry Rosé Sangria, , , , , , , , You may also like, , , , , , , , , , Tofu Cottage ‘Cheese’ + Avocado On Toast, , , March 14, 2025, , , , , , , , , , , Mushroom + Miso Bourguignon With Butter Bean Mash, , , February 14, 2025, , , , , , , , , , , Hoisin Mushroom ‘Duck’ Sandwiches, , , January 31, 2025, , , , , , , , , , , Leeks On Toast With Hot Maple Sauce, , , January 28, 2025, , , , , , , , , , , Beetroot Pasta With Tofu Cream Cheese, , , January 24, 2025, , , , , , , , , , , Cheat’s Cauliflower Kyiv Steaks, , , January 16, 2025, , , , , , , , , , , Spiced Tempeh With Smoky Aubergine Yoghurt, , , January 13, 2025, , , , , , , , , , , Roasted Aubergine Dhal, , , December 4, 2024, , , , , , , , , , , Cauliflower Fritters, , , November 14, 2024, , , , , , , , , , , Courgette Ribbons + Tahini Yoghurt On Toast, , , September 16, 2024, , , , , , , , Leave a comment, , Cancel reply, , , , , Δ, , , 1 Comment, , , , , , , , , Danielle, , June 8, 2020 - 8:19 pm, , , This was absolutely amazing!!!, , , , Reply, , , , , , , , , , , , , , , , About Us, , , , Hello! We're Roxy & Ben. We created SO VEGAN in 2016 to make it easy for everyone to eat more delicious plants so people and the planet can thrive, and since then our videos have been seen by hundreds of millions of people all over the world. It's amazing to see so many people enjoying our plant-based creations, and this is only the beginning!, , , The SO VEGAN App, , , , Download our app today and start your 7-day free trial to discover over 600 fuss-free and flavoursome recipes!, Find out more, , , , , , SO VEGAN EASY, , , , Have you heard about our latest cookbook EASY? It's packed with 100 quick, nutritious and absolutely delicious recipes...and we think you’ll love it!, Find out more, , , Newsletter, Subscribe to our newsletter to get your hands on a copy of our, Fan Favourites eBook, and more goodies!, , , , , , , , , , , , , , , , , , , , , , , , Popular Posts, , , , , 1, , , , , , , , , , How To Make A Classic Falafel Wrap, , , , August 28, 2019, , , , , , , , 2, , , , , , , , , , Broccoli Fritters, , , , May 14, 2024, , , , , , , , 3, , , , , , , , , , 15 Minute Chilli Tofu Noodles, , , , February 29, 2024, , , , , , , , 4, , , , , , , , , , Creamy Miso + Coconut Butter Beans, , , , September 22, 2023, , , , , , , , 5, , , , , , , , , , High Protein Spinach Pasta, , , , May 2, 2023, , , , , , , , , , , , , , , , , , , , , , , , , , Facebook, , , , Twitter, , , , Instagram, , , , Youtube, , , , , , , © 2025 SO VEGAN -, Terms, -, Contact, , , , , , , , , , , , , , , , , , Recipes, , , Dinners, , Lunches + lights, , Breakfasts & Brunch, , Desserts, , Snacks, , Staples, , Drinks, , Party, , Sides, , , , Join our team, , Contact, , Cookbooks, , SO VEGAN App, , Blog, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , Pick out and discard any black seeds from the Sichuan peppercorns, then add the remaining 'husks' (outer shells) to a wok on a medium heat and toast for a couple of minutes until fragrant. Transfer them to a pestle and mortar, crush until fine, then push them through a sieve to remove any large gritty pieces. Set aside for later., , Remove the tofu from its packaging and press if needed to remove excess liquid. Then dice the tofu into 2cm wide cubes. Transfer the cornstarch to a mixing bowl along with generous pinches of salt and pepper, then add the cubes of tofu to the bowl and toss with your hands until fully coated., , Wipe out the wok from earlier, set it on a medium-high heat and add a generous spoonful of coconut oil. Once melted, add the tofu and fry for 10-15 minutes, turning occasionally or until golden on all sides (adding more oil if needed)., , , Meanwhile peel and dice the garlic and ginger and roughly chop the spring onion. Remove the seeds from the peppers and cut into bite-size pieces., , Once the tofu is ready, remove it from the wok and leave to one side in a bowl. Next add a tsp of coconut oil to the wok, followed by the garlic, ginger and chilli flakes. Fry for 2 minutes. Then add the peppers and fry for 3 minutes., ",
        "Vegan tofu stir fry with veggies": "Ingredients: , firm tofu, red and yellow peppers, broccoli, zucchini, green beans, onion, and celery., , For the sauce, you will need, garlic ginger paste, , rice vinegar, light soy sauce, , vegetable stock, , brown sugar, chilli powder, Chinese Five Spice Mix, sa, lt, and pepper., , Equipment:, You will need a towel to squeeze out the extra moisture from the tofu, a mixing bowl to season the tofu, a Wok or non-stick pan to cook in, a heat-safe spatula to flip the tofu, a chopping board & knife., , How to prepare the Tofu, , (, ▢, 200, , gram, , fresh tofu, cut into cubes, ▢, ½, , Cup, , roughly chopped red onion, ▢, 1, , tablespoon, , finely chopped ginger, ▢, 1, , tablespoon, , finely chopped garlic, ▢, 1, , tablespoon, , chopped celery stalk, ▢, 5 – 6, , green beans, cut into half lengthwise, ▢, ½, , Cup, , broccoli florets, ▢, ½, , Cup, , red bell pepper diced, ▢, ½, , Cup, , zucchini cut into cubes, ▢, ½, , Cup, , yellow bell pepper cut into cubes, ▢, 4, , tablespoon, , sesame oil or olive oil, ▢, Salt and black pepper to taste, ▢, ½, , Cup, , vegetable stock or broth, , (, get recipe, ), ▢, ⅛, , Cup, , light soy sauce, ▢, 2, , tablespoon, , rice vinegar, ▢, 1, , tablespoon, , ginger garlic paste, , (, get recipe, ), ▢, 1, , tablespoon, , brown sugar, ▢, 1, , teaspoon, , red chilli powder, ▢, 1, , teaspoon, , Chinese Five Spice Mix, ▢, 1, , teaspoon, , sesame seeds, ▢, 2, , tablespoon, , spring onion greens,  Instructions: ), , First of all,, press the tofu firmly, with a towel. You can use a cloth or paper towel (, image 1, )., , Then,, cut the tofu into cubes, ., , In a bowl,, season the tofu cubes, with salt, pepper, and soy sauce. Mix well, making sure the tofu is evenly coated., , Heat 2 of the 4 tablespoon of sesame oil, in a non-stick pan, and, cook the tofu, until it’s crispy on all sides, using the heatproof spatula to flip (, image 4, )., , , , Tofu Stir Fry Recipe Variations, , Can I use other vegetables?, , Yes!, Other vegetables that work well in tofu stir fry are:, , , yellow summer squash, , carrots, , sugar snap peas, , bean sprouts, , water chestnuts, , bok choy, , baby corn, , Brussels sprouts., , , Feel free to suggest more options in the comments below!, , , , Meal Prep Tips, , This Vegan Tofu Stir fry is great to make in bulk and store for lunch or dinner for the week!, , Here are a few ideas for making this work for you:, , Double the recipe!, This recipe serves 4 people; doubling it would make 8 servings. I would freeze half and use it a few weeks later for an easy weeknight meal., , Take this dish to work for lunch!, After you’ve finished cooking, separate the Vegan Tofu Stir Fry (plus a side of rice or noodles if desired) into, 4 microwave-safe containers, and, when cool, put their lids on and pop them in the fridge., , When you’re going to work, if the container is in a warm environment for more than 2 hours, pack an ice pack with the container to keep it fresh., , To reheat, simply, warm tofu stir fry in a microwave, until it’s piping hot., , , , How do I store this stir fry?, , Fridge:, After the tofu stir fry has completely cooled, store it in an airtight container for up to 5 days., , Freezing:, After completely cooling the stir fry, store it in a freezer bag or container for up to 3 months. The veggies may become relatively soft after freezing, but the flavour will still be amazing!, , Serving Suggestion, , The best way to enjoy this tofu stir fry is with aromatic jasmine rice. You can serve it with any other variety of rice as well., , For a vegan dinner, I serve it with fried, chili oil noodles, , or pineapple fried rice., , Store the leftover stir fry in the refrigerator. It remains fresh and suitable for consumption for 2 – 3 days. Reheat in a stir-frying pan or microwave., , Watch Tofu Stir Fry Video, , , , , , , , , , , , , , More Stir-Fry Recipes, , , Pineapple Fried Rice, , Stir-Fried Broccoli, , Indian Beetroot Stir Fry, , Stir Fry Pasta With Veggies, , Quinoa Stir Fry With Shrimps, , Instant Noodles Chicken Stir Fry, , , , Subscribe to our, weekly newsletter, or follow us on, Youtube, , for video recipes., , , If you try this recipe and love it, please leave a comment and a rating. This helps us grow and reach other food lovers like you., , , , , , Vegan Tofu Stir Fry Recipe, , , This healthy tofu stir fry with veggies is ready in 30 minutes. It is a vegan, and gluten-free stir-fry recipe., , , 5, from, 2, votes, , , Save, Saved!, , Print, , Pin, , Rate, , , Course:, Main Course, Cuisine:, Chinese, , Prep Time:, 15, minutes, , minutes, Cook Time:, 15, minutes, , minutes, Total Time:, 30, minutes, , minutes, , Servings:, 4, , Calories:, 229, kcal, , Author:, Hina Gujral, , Chinese Wok, Mixing Bowl, , Cook Mode, Prevent your screen from going dark, , , 1x, 2x, 3x, , Prepare Tofu:, Firmly press the tofu with a paper towel to drain all the moisture/water. Make sure tofu is completely dry. Then cut into cubes., Combine salt, black pepper, half a tablespoon soy sauce, and tofu in a bowl. Mix nicely., Heat 2 tablespoon oil in a non-stick pan. Fry the tofu cubes till crisp from both sides. Transfer to a plate lined with an oil absorbing paper. Set it aside., Combine vegetable stock, soy sauce, vinegar, ginger garlic paste, brown sugar, Chinese five spice mix, salt, and pepper in a bowl. Whisk to combine. Keep it aside., In a Chinese wok heat remaining oil and swirl to coat the wok with oil., Add ginger, garlic, red chili, celery stalk, and red onion. Stir fry for 10 – 20 seconds to release the aroma of herbs., Then add veggies one by one and stir-fry on high heat. Cook for 5 -7 minutes, stirring the skillet. When the vegetables have a shining layer and have softened a bit, add the sauce prepared earlier. Stir to combine., Add the crispy tofu cubes. Mix. Cook the stir-fry for 3 – 5 minutes or until the sauce thickens., Add spring onion greens and sesame seeds for garnishing., Tofu Veggie Stir Fry tastes best with steamed jasmine rice or, chilli garlic noodle, s., , , Recipe Notes:, , Make sure the tofu is completely dry before frying. Else, it might not turn crispy and stick to the pan., , Do not cook the vegetables for too long. They will lose the colour and crunch., , To thicken the sauce, you can use corn starch, potato starch, rice flour, or any other gluten-free thickening agent as well., , Instead of tofu you can use paneer (cottage cheese), shrimp, boneless chicken, or fish., , , , , Nutrition, Calories:, 229, kcal, |, Carbohydrates:, 13, g, |, Protein:, 7, g, |, Fat:, 17, g, |, Saturated Fat:, 2, g, |, Polyunsaturated Fat:, 7, g, |, Monounsaturated Fat:, 6, g, |, Sodium:, 546, mg, |, Potassium:, 291, mg, |, Fiber:, 3, g, |, Sugar:, 6, g, |, Vitamin A:, 1080, IU, |, Vitamin C:, 76, mg, |, Calcium:, 108, mg, |, Iron:, 2, mg, , , If you try this recipe, please leave a comment and a rating. This helps us grow and reach more food lovers like you., , , , , , , , , , Get an exclusive newsletter about Behind The Scene Story., , , , , , , SUBSCRIBE NOW, , , We follow a strict NO SPAM Policy, , , , , , , , , , , , , Share with your friends!, 1k, SHARES, Facebook, 1k, Pinterest, WhatsApp, , , Related posts:, , , , Instant Pot Pumpkin Pasta Recipe, , , Pineapple Fried Rice Recipe, , , Red Sauce Spaghetti With Shrimp, , , Quinoa Fried Rice Recipe, , , , , «, Fattoush Salad Recipe, Dum Aloo Recipe, », Reader Interactions, Comments, , , , , , Beulah Arun, , says, , , June 03, 2014 at 3:31 pm, , , , Lovely dish!, , , Reply, , , , , , , , Pritish Soundararajan, , says, , , March 28, 2017 at 11:51 am, , , , Lovely recipe. Since I’ve been eating healthy for over a month now, this recipe is apt. Thanks., , , Reply, , , , , , , , Hina Gujral, , says, , , April 03, 2017 at 6:04 pm, , , , I am so thrilled that you liked it. Stay tuned with us for more such recipes., , , Reply, , , , , , , , , , Tara Nair, , says, , , March 29, 2017 at 12:15 pm, , , , Lots of love to this healthy recipe. Thanks Hina 😀, , , Reply, , , , , , , , Hina Gujral, , says, , , April 03, 2017 at 6:03 pm, , , , Happy me 🙂, , , Reply, , , , , , , , , , Shruthi, , says, , , March 20, 2020 at 11:26 pm, , , , This looks so simple and delicious. Definitely trying it this weekend!, , , Reply, , , , , , , , Hina Gujral, , says, , , March 21, 2020 at 1:12 pm, , , , Great! It’s healthy and wholesome too., , , Reply, , , , , , , , , , Shamla, , says, , , April 10, 2020 at 6:33 pm, , , , Hi Hina thank you for your super collection of vegan food they turn out delicious, , , Reply, , , , , , , , Hina Gujral, , says, , , April 10, 2020 at 7:27 pm, , , , I am so thrilled to hear your sweet feedback. More vegan recipes coming your way!, , , Reply, , , , , , , , , , Roberto, , says, , , December 15, 2020 at 8:48 am, , , , Really a solid recipe, and a super alternative to mapo dofu without the pork.  We’re not vegans, but this’ll be on our go-to menu list.  Our only modification was increasing the veg broth and adding corn starch to thicken the sauce.  Thanks!, , , Reply, , , , , , , , Hina Gujral, , says, , , December 15, 2020 at 11:37 am, , , , Thank you for your feedback. You can always customize the recipe as per personal preference., , , Reply, , , , , , , , , , Judy Hillhouse, , says, , , August 09, 2021 at 10:31 pm, , , , What’s the serving size how many cups or oz, , , Reply, , , , , , , , Hina Gujral, , says, , , August 10, 2021 at 11:51 am, , , , It will give you 4 Cups of 100 grams each., , , Reply, , , , , , , , , , Diana, , says, , , August 11, 2022 at 10:26 pm, , , , Would a regular pan work in the absence of a Chinese wok?, , , Reply, , , , , , , , Hina Gujral, , says, , , August 12, 2022 at 11:28 am, , , , Yes, it will work. Just make sure not to overcrowd the pan otherwise, the veggies won’t get properly stir-fried. Each ingredient should get evenly distributed high heat for stir-frying. Hence, pick your pan accordingly., , , Reply, , , , , , , , , 5 from 2 votes (, 2 ratings without comment, ), , , , Leave Your Rating & Comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , Δ, , , Primary Sidebar, , , , , , , Hello, I’m Hina Gujral, ., , , , , , Banker to Blogger. Married to a like-minded food lover. Mother of a food critique, pug – MOMO, ., , More about me →, , , , , , , , , , , , , , , , Reader Favourites, , Eggless Atta Cake Recipe, Eggless Rava Cake Recipe, Corn Salsa Recipe, Mango Ice Cream – 3 Ingredient!, 30 Everyday Indian Meals, Eggless Orange Cake Recipe, , , , , , , , , Get an exclusive newsletter about Behind The Scene Story., , , , , , , SUBSCRIBE NOW, , , We follow a strict NO SPAM Policy, , , , , , , , , , , , , , , , , Follow Me, , , , , Footer, , ↑ back to top, , , , , , , , Newsletter, |, Privacy Policy, |, About, , , , Facebook, , Instagram, , Pinterest, , YouTube, , , , © Copyright, Fun Food Frolic, 2021, , , , , , , , , , , , , , , Get an exclusive newsletter about Behind The Scene Story., , , , , , , SUBSCRIBE NOW, , , We follow a strict NO SPAM Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "General Tso's Tofu": "Ingredients: US Customary, –, Metric, FOR SERVING, optional, 4, , cups, , cooked white or brown rice, Steamed broccoli, STIR-FRY SAUCE, 2, , tsp, , sesame oil, 2, , tsp, , cornstarch, 2, , large cloves, , garlic, minced, , (2 cloves yield ~1 heaping Tbsp), 1, , Tbsp, , ginger, minced, 1, , Tbsp, , rice vinegar, , (or sub white vinegar), 1/4, , cup, , maple syrup, 3, , Tbsp, , tamari or soy sauce, , (or coconut aminos), 1, , Tbsp, , water, TOFU, 12, , ounces, , extra-firm tofu, 3, , Tbsp, , tamari or soy sauce, , (tamari for gluten-free eaters), 1, , tsp, , chili garlic sauce, 1, , tsp, , toasted sesame oil, 1, , Tbsp, , maple syrup, 4-5, , Tbsp, , cornstarch, 2, , Tbsp, , neutral oil, , (such as grape seed or avocado), STIR-FRY, 1, , Tbsp, , sesame oil, 1, , bundle, , green onions, , (bulbs removed, roughly chopped), 4-7, , dried, , Thai red chilies, , (omit for less  heat // or sub 1 Tbsp chili garlic sauce // more or less to taste), Sesame seeds, for garnish, , (, optional, ), , , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 2, 2025 at 9:32 am, , , , Hi Debbie, did you perhaps mean to comment on a different recipe? This recipe calls for a 12 ounce package of tofu!, , , Reply, , , , , , , , , , Rebecca, , says, , , February 14, 2025 at 8:20 am, , , , Overall I really liked this and would make again. The sauce was too sweet for my palate so I would significantly decrease the maple syrup next time. I looooved the marinade and technique for the tofu. After I cooked the tofu I couldn’t stop myself from eating it dipped in the prepped sauce!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 14, 2025 at 1:05 pm, , , , Thanks so much for sharing your experience, Rebecca! We’re so glad you enjoyed it! xo, , , Reply, , , , , , , , , , Laura Green, , says, , , February 10, 2025 at 6:38 pm, , , , I was craving a saucy tofu dish, and this did the trick! I had my usual bad luck trying to stir-fry tofu, so next time I will do what I usually do–I’ll marinate and bake the tofu (no starch) and then add it at step 11. I didn’t include the maple syrup in the marinade, only in the stir-fry sauce, and found the result perfectly balanced.  I used arrowroot rather than cornstarch to thicken the sauce–mixed with the water and added separately, at the end. Delicious!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 11, 2025 at 11:52 am, , , , Thank you for sharing, Laura! We’re glad you enjoyed it overall. You might prefer our, Spicy Garlicky Sesame Tofu, , which we bake in the oven!, , , Reply, , , , , , , , , , Julie Kane, , says, , , January 24, 2025 at 3:19 am, , , , Wow 🤩 insanely gooood – droool. Love a summery Friday evening when all teenage kids out and hubby working – = vego new recipe night 🙌🙌🙌🙌🙌, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 24, 2025 at 12:10 pm, , , , Whoop! We’re so glad you got to make a recipe just for you :) Thank you for sharing, Julie! xo, , , Reply, , , , , , , , , , Kimmie, , says, , , January 15, 2025 at 5:34 pm, , , , What did I do wrong? The tofu was nice and crispy then when I added it back to the sauce it became gummy and lost the crisp. Where did I mess up? The sauce tasted amazing!!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 16, 2025 at 11:09 am, , , , Oh no! We’re so sorry the tofu became gummy, Kimmie. Did you make any modifications, such as to the type of starch? If not, we wonder if maybe the tofu had a bit too much cornstarch on it?, , , Reply, , , , , , , , , , Elizabeth DeNiro-Wallace, , says, , , January 15, 2025 at 2:19 pm, , , , I love this recipe!  It’s one of my staples and everyone in my family likes it, kids included. I’ve been making it for a few years now and thought id finally leave a review considering how often i make it, and I’m grateful to have a go-to recipe i know everyone in my family will eat., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 15, 2025 at 5:18 pm, , , , We’re so glad you and your family enjoy it, Elizabeth! Thanks so much for the lovely review. xo, , , Reply, , , , , , , , , , John Burns, , says, , , November 15, 2024 at 6:45 pm, , , , Hi making this now! Roughly how long are you heating the skillet in step 5?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 17, 2024 at 6:25 am, , , , Hi John, about 1-4 minutes. It will depend on the stove/pan you’re using and how quickly they heat up. For example, gas stoves typically heat up faster than electric and metal heats faster than cast iron. Hope that helps!, , , Reply, , , , , , , , , , Dave, , says, , , October 8, 2024 at 8:08 pm, , , , This was incredible! We did it with tofu, broccoli, and red bell peppers, and followed it closely aside from garlic chilli sauce (we used sweet chilli sauce instead). We put it in the oven for 15 minutes after the initial fry, then back in the wok with the sauce. Served on brown rice. Perfection. All three of us voted “would repeat.” GREAT recipe., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 9, 2024 at 9:01 am, , , , Whoop! We’re so glad it got everyone’s vote of approval :) Thank you for the lovely review, Dave!, , , Reply, , , , , , , , , , Lisa, , says, , , October 8, 2024 at 7:36 pm, , , , This was soooo delicious!  I would rather have this than take out.  I only made some slight modifications.  My husband likes things saucy so I doubled the sauce and used a 16 oz block of super firm tofu  I ended up using about 2/3 to 3/4 of the sauce. I also used red chili flakes in place of the Thai red chilis.  Lastly, I cut back the ginger just a little as I am not a fan of strong ginger flavors. I sprinkled the top with the sliced onion bulbs and chopped peanuts. I served this alongside seasoned and roasted green beans. My family loved the dish too!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 9, 2024 at 9:01 am, , , , Yay! We’re so glad it was a hit with the whole family. Your additions sound lovely! Thank you for sharing, Lisa! xo, , , Reply, , , , , , , , , , The Vegan Goddess, , says, , , September 17, 2024 at 8:27 pm, , , , Which starch would work best as a substitute for cornstarch:   potato, tapioca or arrowroot?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 18, 2024 at 10:25 am, , , , Hi, arrowroot would probably be best! Some readers have reported success with arrowroot, but one reader did report it made the sauce gummy. We think using less of it would be the best move for preventing that. Let us know if you do some experimenting!, , , Reply, , , , , , , , , , JoAnn, , says, , , September 15, 2024 at 12:11 pm, , , , Can I use soy curls instead of reg tofu?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 16, 2024 at 11:13 am, , , , Hi JoAnn, we haven’t tested with soy curls, but think it should work!, , , Reply, , , , , , , , , , nadia, , says, , , September 15, 2024 at 4:06 am, , , , Looks amazing 😊 I can’t eat tofu… would this work with prawns or chicken instead?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 16, 2024 at 10:34 am, , , , Hi Nadia, Yes, but we haven’t tried it ourselves. Let us know if you do some experimenting!, , , Reply, , , , , , , , , , Jill, , says, , , August 29, 2024 at 7:50 am, , , , Delicious. I made this last night and it came out great. Will be making it again. I didn’t have everything I needed so I made a few substitutions., , Substituted red curry paste for the Chili garlic sauce and crushed dried red peppers for the Thai red chilis., , 5/5!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 29, 2024 at 8:57 am, , , , Yay! We’re so glad you enjoyed the recipe and will be making it again. Thank you for the lovely review and for sharing your modifications, Jill! xo, , , Reply, , , , , , , , , , Stephanie T, , says, , , April 3, 2024 at 6:26 pm, , , , This was amazing – my whole family’s new favorite way to prepare tofu. I followed the recipe pretty much as is, except I used a frozen stir-fry veggie mix. I’ll definitely add this to our regular meal rotation. The only thing I might change is marinate the tofu a bit longer if there’s time; it was really good as is, but I think if the flavors had time to penetrate deeper… Thanks so much for this recipe., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 4, 2024 at 3:29 am, , , , We’re so glad you and your family enjoyed it, Stephanie. Thank you for sharing your experience! xo, , , Reply, , , , , , , , , , Mo, , says, , , February 24, 2024 at 7:07 am, , , , I made this last night.  This is fantastic!!!  I have struggled with finding tasty vegan meals, but this is the bomb!!!!  I will be making this often.  Thank you!!!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 26, 2024 at 8:14 am, , , , Yay! We’re so glad you found this one and enjoyed it, Mo. Thank you for the lovely review! xo, , , Reply, , , , , , , , , , Carmella, , says, , , February 15, 2024 at 6:38 pm, , , , I’ve always wanted to make this and was feeling lazy and thought… I’ll just buy the pre-made sauce… I NEVER do that, the sauce is amazing (I added more chili garlic sauce to the marinade because I wanted to have the heat from the chili’s and I’m so loving this dinner.  Wow!! What an amazing recipe! Yay! I have NEVER had a MB recipe I didn’t love and I make a lot of your recipes so that’s saying something. Thanks so much for sharing your wonderful skill with the world!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 16, 2024 at 9:52 am, , , , Aw, we love that you’ve had so much success with our recipes, Carmella. Thank you so much for your kind words and lovely review! xoxo, , , Reply, , , , , , , , , , Kristina D, , says, , , February 10, 2024 at 2:59 pm, , , , 10 stars!!!  This was so flavorful!  I’m so mad at myself for not making this until today., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 12, 2024 at 1:57 pm, , , , We’re SO glad you enjoyed it, Kristina! Thanks so much for the lovely review. xo, , , Reply, , , , , , , , , , Mary, , says, , , February 3, 2024 at 8:38 pm, , , , which was great to be able to do.  The only thing I was missing were the optional dried peppers.  I just left them out, and the dish was very nice!  It might be fun to try the peppers in the future., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 5, 2024 at 2:12 pm, , , , We’re so glad you enjoyed it, Mary! Thanks so much for the lovely review. xo, , , Reply, , , , , , , , , , TJ, , says, , , December 30, 2023 at 7:46 pm, , , , All of the  crispy Tofu skin just peels off and sticks to the bottom of the pan.  What am I doing wrong?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 2, 2024 at 10:24 am, , , , Hi TJ, What material is the pan you’re using? Cast iron and non-stick are best for tofu. We would also suggest making sure the pan is hot before adding it., , , Reply, , , , , , , , , , Susan, , says, , , December 28, 2023 at 3:14 am, , , , Tasty, but not even close to General Tso’s taste.  Too salty, too much sesame. Just not the same on any level., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 28, 2023 at 9:22 am, , , , Sorry to hear it wasn’t what you were hoping for, Susan! If you were using soy sauce, you might prefer it with tamari – it’s usually less salty.  For less sesame flavor, you could stir-fry the veggies in a neutral oil, such as avocado oil., , , Reply, , , , , , , , , , Emma, , says, , , December 12, 2023 at 12:31 am, , , , This recipe was DELICIOUS! We loved it. That SAUCE, the crispyness of the tofu, well DONE. I made with a little less soy sauce on accident and it came out perfect!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , December 12, 2023 at 9:01 am, , , , YAY! We’re so glad you enjoyed it, Emma. Thank you for the lovely review! xo, , , Reply, , , , , , , , , , Candace, , says, , , October 5, 2023 at 12:32 pm, , , , I love this recipe, however one thing keeps being an issue for me— whenever I put the sauce on the tofu after cooking it the crispy cornstarch coating dissolves! What am I doing wrong?, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , October 5, 2023 at 1:23 pm, , , , We’re so glad you enjoy it, Candace! Hmm, it sounds like the sauce might need to be thicker or the tofu needs to be crispier. You could possibly try cooking the sauce briefly before adding the tofu or cooking the tofu longer so it gets more crispy. Or using the oven step if you’re skipping that! Hope that helps!, , , Reply, , , , , , , , , , Michelle, , says, , , September 26, 2023 at 11:05 pm, , , , Hi! I would love to try this recipe this weekend but I cannot find the Huy Fong Chili Garlic Sauce in my local stores (or online, for that matter) and I was not able to pin down a viable substitute after searching online. Any suggestions for an alternative ingredient and/or recipe for something comparable? Thank you!!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 27, 2023 at 9:29 am, , , , Hi Michelle, sriracha would be another option! We have a recipe for a, homemade version, of that if it’s also tricky to find online/in stores., , , Reply, , , , , , , , , , Fran, , says, , , September 17, 2023 at 10:24 am, , , , Your video showed you adding coconut sugar to the sauce, but the recipe uses maple syrup. Was that a mistake?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , September 17, 2023 at 1:28 pm, , , , Hi Fran, sorry for the confusion! We updated the recipe because we prefer maple syrup, but either coconut sugar or maple syrup will work. Hope that helps!, , , Reply, , , , , , , , , , Laura, , says, , , August 30, 2023 at 7:27 pm, , ,  Instructions: The Kitchn, )!, Simply marinate the tofu in a bit of soy sauce, maple syrup, and chili garlic sauce before dredging in cornstarch and pan-frying in a little oil. The result is a flavorful tofu that’s crispy on the outside, tender (not mushy) on the inside, and comes together in about 20 minutes!, This dish gets some serious heat from dried red chilies, which you can find in most traditional and Asian grocery stores. However, if you have trouble locating some, either use fresh red chilies or extra chili garlic sauce., Whatever you do, don’t skip the heat! That’s what makes this dish balanced and delicious., I think you guys are going to LOVE this fake-out takeout dish. It’s:, Extremely flavorful, Perfectly spiced, Not too sweet, Satisfying, Comforting, Quick, & Dang delicious, This would make the perfect entrée to make when you’re craving takeout but want to stay in and make it a little healthier! Don’t get me wrong – I wouldn’t call this “health food.” But it is much lighter than what you’ll find at restaurants. Plus, , 20 grams protein per serving, !, If you give this recipe a try, let us know! Leave a comment, rate it, and don’t forget to take a picture and tag it, #minimalistbaker, on Instagram. We’d love to see what you come up with. Cheers, friends!, NOTE: Recipe modified to include texture improvements November 9, 2020., , , General Tso’s Tofu Stir-Fry, , Extremely flavorful, General Tso’s Tofu Stir-Fry in just 30 minutes! Spicy-sweet, protein-packed, and a healthier spin on takeout!, , Author, Minimalist Baker, , , , , Print, , , SAVE, SAVED, , , 4.75, from, 300, votes, , , , , , Prep Time, 15, minutes, , minutes, Cook Time, 15, minutes, , minutes, Total Time, 30, minutes, , minutes, , Servings, 2, , (Servings), , Course, Entrée, Cuisine, Chinese-Inspired, Gluten-Free, Vegan, Freezer Friendly, No, Does it keep?, 2-3 Days, , Cook Mode, Prevent your screen from going dark, , If serving with rice and broccoli, begin preparing at this time. Cook the rice on the, stovetop, , in the, Instant Pot, , or in a rice cooker. Steam the broccoli in a, steamer basket, set over boiling water for ~4-6 minutes. Otherwise, move onto the next step., Drain tofu and wrap it in a clean, absorbent towel. Set something heavy on top to absorb excess moisture, such as a, cast iron skillet, (or use a, tofu press, ). Let rest for about 10 minutes., Prep/chop green onions, garlic, and ginger at this time. Set aside., While tofu is pressing, prepare stir-fry sauce by combining sesame oil, cornstarch, minced garlic, minced ginger, rice vinegar, maple syrup, tamari or soy sauce, and water in a small mixing bowl and whisk thoroughly to combine. Taste and adjust seasonings as needed (I left mine as is)., Heat a large metal or cast iron skillet (mine is 10”) over medium heat. In the meantime, unwrap tofu and cut into even pieces, about 3/4-inch cubes (see photo)., Add tofu to a shallow mixing bowl (see photo) and top with 3 Tbsp tamari or soy sauce, 1 tsp chili garlic sauce, 1 tsp sesame oil, and 1 Tbsp maple syrup (adjust amounts if altering number of servings // DO NOT ADD CORNSTARCH AT THIS TIME). Toss to combine. Let rest 2-3 minutes, stirring occasionally., Use a slotted spoon or fork to transfer tofu to a quart-size or large freezer bag (or tupperware container), leaving the remaining marinade behind (can be drizzled over rice and broccoli for serving). Add cornstarch 1 Tbsp at a time and toss to coat. Continue adding more cornstarch and tossing until tofu is coated in a gummy, white layer – about 4-5 Tbsp (adjust amount if altering number of servings)., To the hot skillet, add 2 Tbsp neutral oil (adjust amount if altering number of servings) and let warm for 30 seconds. Then use a slotted spoon or fork to add tofu to the pan (leaving any excess cornstarch behind)., Cook tofu on all sides for ~1 minute, or until light golden brown. You don’t want it blackened or burned, as you’ll be cooking it again later with the sauce. Aim for a consistent golden brown crust (see photo). Remove tofu from pan as it’s finished browning. Set aside., NOTE: If you prefer firmer / crispier tofu, , option at this time to transfer tofu to a 375 degree F (190 C) oven in a cast iron pan or parchment-lined baking sheet and bake for 10-15 minutes (or more) to dry it out. This will create a firmer, chewier tofu in the final dish. However, it does make it more than a 30 minute recipe., Return skillet to burner and increase heat to medium-high. Add 1 Tbsp sesame oil (adjust amount if altering number of servings), chopped green onions, and dried red chilies. Sauté for 1-2 minutes, stirring frequently., Add the sauce and tofu. Cook, stirring frequently, to coat the tofu and vegetables for 1-2 minutes, or until warmed through and the sauce has slightly thickened (see photo)., Remove pan from heat and add sesame seeds (optional). Toss to coat., Serve with rice and steamed broccoli (optional), or other desired sides. Best when fresh, though leftovers keep for 2-3 days in the refrigerator. Reheat on the stovetop or microwave., , Video, , Notes, * Recipe loosely adapted from, Pure Wow, and, Food.com, The Kitchn, ., * Nutrition information is a rough estimate calculated without additional sides, such as rice or broccoli., , Nutrition (1 of, 2, servings), , Serving:, 1, , serving, , Calories:, 632, , , Carbohydrates:, 46.9, , g, , Protein:, 29.4, , g, , Fat:, 39.4, , g, , Saturated Fat:, 5.7, , g, , Polyunsaturated Fat:, 12.65, , g, , Monounsaturated Fat:, 17.13, , g, , Trans Fat:, 0, , g, , Cholesterol:, 0, , mg, , Sodium:, 3076, , mg, , Potassium:, 521, , mg, , Fiber:, 2.3, , g, , Sugar:, 21.9, , g, , Vitamin A:, 4241, , IU, , Vitamin C:, 6.81, , mg, , Calcium:, 689.76, , mg, , Iron:, 6.25, , mg, Did You Make This Recipe?, Tag, @minimalistbaker, on Instagram and hashtag it, #minimalistbaker, so we can see all the deliciousness!, Facebook, Twitter, Pin It, If you love this recipe..., , Recipes, Spicy Garlicky Sesame Tofu (30 Minutes!), Recipes, Sesame Sautéed Swiss Chard, Recipes, Gingery Smashed Cucumber Salad (Asian-Inspired), Recipes, Vegan Ginger Sesame Noodles with Crispy Tofu, , , Reader Interactions, , , Leave a Comment & Rating!, Cancel reply, Have a question?, Use ctrl+f or ⌘+f on your computer or the \"find on page\" function on your phone browser to search existing comments! Need help?, Check out this tutorial!, Comment:, , My Rating:, , , , My Rating:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , I Made this, I Have a Question, , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., You will not be subscribed to our newsletter list., , , , Δ, , , All comments, I made this, Questions, , , , , , Debbie, , says, , , April 1, 2025 at 2:18 pm, , , , Hi, Nora,, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , August 31, 2023 at 9:52 am, , , , Aw, thanks Laura! We’re so glad you enjoy the recipes! xoxo, , , Reply, , , , , , , , , , Deb, , says, , , July 13, 2023 at 10:57 am, , , , This was absolutely delicious!  Thank you for this quick and easy recipe., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , July 13, 2023 at 11:09 am, , , , We’re so glad you enjoyed it, Deb! Thank you for the lovely review! xo, , , Reply, , , , , , , , , , Anna, , says, , , April 13, 2023 at 1:09 am, , , , How long would you say the stir fry sauce is good for? I love this recipe so much and use the sauce in other recipes as well, and would really like to keep it on hand in the fridge depending on how long it keeps :) thanks!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , April 13, 2023 at 9:21 am, , , , Hi Ana, we’re so glad you enjoy it. We haven’t tried storing it, but our guess would be 1 week because of the ginger and garlic!, , , Reply, , , , , , , , , , Rebecca, , says, , , March 20, 2023 at 7:10 pm, , , , Hi! Is there substitutes for sesame oil? Would olive work?, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , March 20, 2023 at 9:16 pm, , , , Hi Rebecca, avocado or olive oil will work!, , , Reply, , , , , , , , , , Hannah, , says, , , February 18, 2023 at 5:33 pm, , , , This is the greatest recipe of all time! We make it every single week. It’s our go-to meal when we’re cooking for meat eaters or trying to demonstrate to friends how good tofu can be!, , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , February 20, 2023 at 11:29 am, , , , Yay! Thanks for the lovely review, Hannah. So glad this is a staple for you!, , , Reply, , , , , , , , , , Sarah, , says, , , January 31, 2023 at 11:17 am, , , , Whole family went bananas for this dish! Crunchy/sticky/delightful tofu was worth the steps., , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 31, 2023 at 12:10 pm, , , , We’re so glad you and your family enjoyed it, Sarah! Thanks so much for sharing! xo, , , Reply, , , , , , , , , , Caroll Flores, , says, , , January 5, 2023 at 3:59 pm, , , , This was amazing! AMAZING!!! I was intimidated at first with all the different sauces/marinade but recipe turned out to be super easy to make. I have made it 3 times already!  I used Coconut Aminos (instead of Tamari) since it had the lowest sodium content but otherwise, I followed the recipe as is. I promise, you will not be disappointed!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , January 5, 2023 at 4:01 pm, , , , We’re so glad you enjoyed it, Caroll. Thanks so much for the lovely review! xo, , , Reply, , , , , , , , , , Valerie, , says, , , November 20, 2022 at 4:27 pm, , , , Thanks for the recipe. I used my cuisinart air fryer for the tofu; 15 minutes at 350 F. I agree w another commenter the Tamari/soy sauce could be less. One tblsp is enough. I misread the sesame oil amt and put a tablespoon. Don’t do this . Too hard to crisp up. But tasted good!, , , , , , Reply, , , , , , , , Support @ Minimalist Baker, , says, , , November 21, 2022 at 11:07 am, , , , Thank you for sharing, Valerie!, , , Reply, , , , , , Older Comments, Primary Sidebar, , , , Search for, , , , , , , Recipe Key, GF, , Gluten-Free, VG, , Vegan, V, , Vegetarian, DF, , Dairy-Free, NS, , Naturally Sweetened, , Want More Deliciousness?, Get our copy of, FAN FAVORITES, featuring 20 of our most loved, highly-rated recipes!, Please enable JavaScript in your browser to complete this form., Email, *, Comment, Submit, , , Find Us, , Facebook, , Instagram, , Pinterest, , Twitter, , YouTube, , Minimalist Baker Brandmark, Simple Recipes That, , Make You Feel Good, Recipes, , Cookbook, , Shop, , About, , ©MinimalistBaker.com, , Privacy Policy, , Terms, , , , , Please enable JavaScript in your browser to complete this form., Email, *, Name, Submit, , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Website, Submit, , , , , , X, , , , , , , , , , Want More Deliciousness?, , Our FREE 49-Page Fan Favorites e-Book has 20 recipes we think you’ll LOVE!, , Please enable JavaScript in your browser to complete this form., Email, *, Email, Submit, , , , , , X, , , , , , , Please enable JavaScript in your browser to complete this form., Email, *, Comment, Submit, , , , X, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "General Tso's Cauliflower": "Ingredients: For the cauliflower:, ▢, 3/4, , cup, , all-purpose flour, ▢, 3/4, , cup, , unsweetened almond milk, ▢, 3/4, , cup, , panko bread crumbs, ▢, salt, ▢, black pepper, ▢, 1/2, , head, , of cauliflower, For the general tso sauce:, ▢, 1, , tablespoon, , sesame oil, ▢, 2, , cloves of, , garlic, chopped, ▢, 1, , teaspoon, , chopped ginger, ▢, 1, , tablespoon, , tomato paste, ▢, 1/4, , cup, , brown sugar, ▢, 1/4, , cup, , rice vinegar, ▢, 1/4, , cup, , soy sauce, ▢, 1/2, , cup, , vegetable broth, ▢, 2, , tablespoons, , corn starch, ▢, salt, ▢, black pepper, ▢, 2, , tablespoons, , sesame seeds, ▢, 2, , green onions, ▢, cooked rice, , Coat the cauliflower florets with the sauce. Sprinkle with sesame seeds and green onions and enjoy immediately. I like serving the general tso's cauliflower with rice., , , Nutrition, Calories:, 317, kcal, |, Carbohydrates:, 58, g, |, Protein:, 9, g, |, Fat:, 6, g, |, Saturated Fat:, 1, g, |, Polyunsaturated Fat:, 2, g, |, Monounsaturated Fat:, 2, g, |, Sodium:, 1658, mg, |, Potassium:, 418, mg, |, Fiber:, 5, g, |, Sugar:, 15, g, |, Vitamin A:, 250, IU, |, Vitamin C:, 49.5, mg, |, Calcium:, 160, mg, |, Iron:, 3.1, mg, , , , , Tried this recipe?, Mention, @_veganheaven_, or tag, #veganheaven, !, , , Rate the recipe!, If you like this recipe, please leave a good rating! This will help other readers., , , More Recipes, Spinach Tomato Pasta, Sofritas, Lemon Olive Oil Cake, Corn Tomato Avocado Salad, Reader Interactions, Comments, , , , , , Suze, , , October 31, 2021 at 8:42 pm, , , , This is fantastic!!!! This is def one of the top three “faux” WFPB recipes I’ve ever made due to the unique techniques resulting in a chicken-like mouthfeel and spot-on sauce. I can’t thank you enough for sharing. This is a “do over and over…”. Looking forward to trying your other cauliflower recipes. It’s recipes like this that give the take-out feel with a better flavor and nutrition profile with the added value of a lower cost. Kudos and thx. I’ll always credit you and send folks your way when sharing. 🙏🏻, , , Reply, , , , , , , , Bob, , , November 22, 2020 at 10:30 pm, , , , Excellent dish! On our favorite meal rotation now!, , , Reply, , , , , , , , Sharmila, , , May 15, 2020 at 7:17 am, , , , Fun recipe!! So delicious, it was hard to stop myself. I don’t remember the last time I had Gen Tso’s chicken, but this is so much better!!, , , Reply, , , , , , , , Deb, , , July 15, 2019 at 3:20 am, , , , I tried this recipe and it turned out good! I’m a novice cook and this recipe is pretty easy to follow. Most important, the end product is yummy., , , Reply, , , , , , , , Elise, , , June 04, 2019 at 5:56 pm, , , , This recipe was great, the breading/dredging process really makes it.  The texture of the cauliflower was just like General Tso’s from the takeout place. Fairly easy to make and was a big hit. I didn’t have any brown sugar but used the sugar in the raw and it was just fine. I added in peppers, carrots and broccoli and it was perfect over rice. Thank you for this recipe – I’ll definitely make it again., , , Reply, , , , , , , , Tony Beaman, , , January 23, 2019 at 4:18 am, , , , Is there a way to cut the carbs out of this otherwise healthy and good recipe?, , , Reply, , , , , , , , Jennifer, , , June 01, 2018 at 11:09 pm, , , , Wow! I wasn’t expecting that this would be too good! I don’t eat cauliflower that often, but I guess I should! I will definitely try you wings as well. Thank you so much for sharing., , , Reply, , , , , , , , Diane, , , April 17, 2018 at 5:09 am, , , , Oh my. This was outstanding. I chose your recipe over the others I found and I’m glad I did. My cauliflower took a bit longer, but no worries Instructions: , , You’ll need:, , , 1/2 head of cauliflower, , all-purpose flour, , unsweetened almond milk (it’s really important to use unsweetened milk for this recipe), , panko bread crumbs, , salt and pepper, , , , For the homemade general tso sauce you’ll need the following:, , , rice vinegar, , soy sauce, , vegetable broth, , cornstarch, , brown sugar, , garlic, , ginger, , tomato paste, , , , I would really recommend using homemade general tso sauce for this recipe. It’s just soo much better than store-bought sauce and it’s also pretty easy to make. You can prepare it while the cauliflower bites are in the oven., , Once the cauliflower florets are crispy (this takes about 25 minutes in the oven), you coat them with the general tso sauce. I absolutely LOVE it’s sweet and sour taste. BIG yum!!, , I usually serve this vegan general tso’s cauliflower with rice and sprinkle it with sesame seeds and green onions., , I hope you like this general tso’s cauliflower as much as the vegan cauliflower hot wings. If you’re looking for spicy cauliflower wings, check out my, cauliflower buffalo wings, . Or have a look at my roundup of 20 game changing, vegan cauliflower recipes, . Cauliflower can be so versatile!, , Sina – xx, , Looking for more delicious cauliflower recipes? Then check out these, cauliflower BBQ hot wings, !, , , , , , , , General Tso's Cauliflower, , , This general tso's cauliflower is so crispy, delicious, and spicy-sweet! And it's just as good as the fried version, while being so much healthier! Welcome to cauliflower heaven!, , , 5, from, 12, votes, , , Print, , Pin, , Rate, , , Course:, Main Course, Cuisine:, American, Chinese, , Prep Time:, 10, minutes, , mins, Cook Time:, 5, minutes, , mins, Total Time:, 40, minutes, , mins, , Servings:, 4, , servings, , Calories:, 317, kcal, , Author:, Sina, , , Heat the oven to 350 °F., In a  bowl, combine the flour, the almond milk, and salt and pepper. Pour the panko bread crumbs on to a flate plate., Cut the cauliflower into bite-sized florets. Dip the florets into the batter, so they're completely coated. Then roll them in the panko bread crumbs., Line a baking sheet with parchment paper and lay the cauliflower florets on the baking sheet. Don't put them on top of each other. Bake for 25 minutes., In the meantime, make the general tso sauce. Add two tablespoons of water to the corn starch and stir well. Put aside. In a small sauce pan, heat the oil and sauté the garlic until it becomes lightly brown. Then add the ginger, the sugar, , , Reply, , , , , , , , Chrissy, , , September 29, 2017 at 11:32 pm, , , , This is amazing!!! I’ve been wanting Chinese takeout so I made this instead! Delicious!, , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , Primary Sidebar, Facebook, Instagram, Pinterest, RSS, Tumblr, Twitter, , , , Hi, I'm Sina and this is my recipe blog where I share heavenly simple and sinfully delicious vegan recipes., , , Popular Recipes, , Lemon Spaghetti with Spinach (One Pot), One Pan Mexican Quinoa, Roasted Chickpeas, Thai Pineapple Fried Rice Recipe (Vegan), Vegan Meatballs with Spaghetti, Creamy Vegan One Pot Pasta (Asian Style), , , , Grilling, , Vegetable Kabobs, Vegan Black Bean Burgers (Grillable!), Vegan Potato Salad, Creamy Vegan Dip with Dates, Tofu Vegetable Skewers, Lentil Burgers, , , , , , , , , About Sina, , As a mom of twins, I know how busy life can be. So if you're looking for easy and quick vegan recipes the whole family loves, this is the right place for you!, , Learn more about me →, , , , Popular Recipes, , Lemon Spaghetti with Spinach (One Pot), One Pan Mexican Quinoa, Roasted Chickpeas, Thai Pineapple Fried Rice Recipe (Vegan), Vegan Meatballs with Spaghetti, Creamy Vegan One Pot Pasta (Asian Style), , Healthy Recipes, , Greek Pasta Salad with Easy Greek Vinaigrette, Quinoa Black Bean Salad, Sofritas, Vegan Chickpea Salad, Vegan Pad Thai, Easy Vegan Chickpea Curry, Footer, , , , , Impressum/Legal Notice, , , Privacy Policy, , Facebook, Instagram, Pinterest, RSS, Tumblr, Twitter, , Search, , Affiliate Disclaimer:, , Some posts may contain affiliate links, which means that if you click on one of the product links and actually decide to buy it, I’ll receive a small percentage of the total price - of course this does not cause any extra costs for you. I only recommend products that I personally love and use regularly., , , , , , Copyright © 2025 by Vegan Heaven, ·, Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Mongolian Tofu Stir Fry": "Ingredients: , My family is always my guinea pig when it comes to these experiments. So obviously, we choose Mongolian tofu stir fry to make as it's not very common and is amazingly delicious., , , , Today, we had a heavy Indian lunch, so while discussing dinner happening, the man of the house announced that he would skip dinner today or may have some salad later., , While the kids were happy with their dinner provisions, I checked the fridge and found that, besides several other items, I had this pack of tofu that was going to expire soon. So, I thought I would make a Mongolian tofu stir fry., , , , When I tasted this tofu stir fry, I was just stunned. It tasted heavenly, and I consider this one of my best tofu dishes., , Everyone loved it, and the best part was that my husband couldn't resist it and had a bowl., , , , What is Mongolian Tofu Stir-Fry?, , It's a vegan alternative to Mongolian beef stir fry. It is one of the most popular take-out dishes., , The stir-fry sauce is simple and flavorful. I don't like very spicy things, so it's fantastic in that case, , , , . The tofu is shallow fried and quite crispy. However, you can always bake or stir fry., , How to Make Mongolian Tofu Stir Fry-, , I have divided this into two steps., , , , The first step is to coat the tofu with cornflour, salt, and pepper. Then I  shallow fried the tofu till it looked and felt crispy., , The second step is to make a wonderful sauce with ginger, garlic, chili, soy sauce, chili sauce, and brown sugar. I have used peppers and green beans for freshness and crunch., , , What to Serve With Mongolian Tofu?, , You can have this as an appetizer. I like serving this with rice, fried rice, noodles, or salad leaves. It will taste fantastic with anything and everything., , Recipes to check out-, , , , Stir-Fried Veg Noodles, , Veg Fried Rice, , , , Veg Thai Fried Rice, , Spicy Korean Style Soba Noodles, , , Can You Store Mongolian Tofu Stir Fry?, , Any stir fry tastes best when it is made fresh. However, if you want to store it or have some leftovers, you can keep them for one day., , You can store fried tofu and cut vegetables in a separate container in the fridge. You can whip up the sauce quickly in 10 minutes, and serving dinner or lunch will be easy., , https://www.health.com/nutrition/is-tofu-healthy, , , , , , New Recipes, , , Mongolian Tofu Stir Fry, , , Smita, , , Crispy fried / baked tofu coated with flavorful Mongolian sauce., , , , , Print Recipe, , , , , , Prep Time, 15, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 30, minutes, , mins, , , , , , , Course, Appetizer, Main Course, Side Dish, Cuisine, Chinese, , , , , , Servings, 4, , , , , 1x, 2x, 3x, For Preparing Crispy Tofu, 13, , Oz, , Extra Firm Tofu, 2, , Tbsp, , Corn Starch, 1, , Tsp, , Salt, 1, , Tsp, , Black Pepper (Crushed), For Sauce, 1, , Tbsp, , Chopped Ginger, 1, , Tbsp, , Chopped Garlic, 1, , Tsp, , Chopped Green /red chilli, 1.5, , Tbsp, , Brown Sugar, 2, , Tbsp, , Dark Soy Sauce, 2, , Tbsp, , Red Chilli Sauce(Sriracha, Schezwan ,or any asain hot red chili sauce), 1, , Tsp, , Rice Wine Vinegar, 4, , Dry red Chilli, Vegetables for Stir Fry, ½, , Cup, , Colored Pepper cubes(big ), ¼, , Cup, , Green string Beans(Cut into big pieces), ¼, , Cup, , Onion cubes, Some oil for shallow frying, 1, , Tbsp, , Oil ,You need to  use during sauce Making., For sauce thickener, 1, , Tsp, , Corn Starch, 2, , Tbsp, , Room Temp Water, For Garnish, ¼, , Cup, , Green Onion /Scalion, 2, , Green or red Chillies (optional),  Instructions: , Preparing the Tofu, Press tofu between layers of paper towel  or clean kitchen towel. Press with a heavy object .You can use tofu press as well., Press it for 20 minutes to remove water., Cut tofu into big cubes and Place in a big bowl., Coat tofu with corn starch ,salt and pepper mixture. Make sure they are evenly coated. Dust off the excess corn starch., Take a pan /wok .Heat it .Add little oil for shallow frying., When it is quite hot, fry tofu from all sides till they are golden and crispy .Do not over fry them otherwise they will feel chewy., Remove it in a plate lined with paper towel., Blanching of Vegetable, Take a pan .Fill it with sufficient water .When it starts boiling add green beans to it., Remove them after one boil /1 minute and place them in a bowl filled with ice water., Making Of Sauce, Take a wok/Pan., Add one tbsp of oil to it., When its hot enough Add chopped ginger garlic to it .Saute for 30 seconds and add chopped green /red chillies to it., When they look light brown add brown sugar and stir it once .Let it caramelize for 1 minute., Add Soy sauce to it  and stir it .Let it cook for 30 second., Add red chilli sauce to it and stir again., Now is the time to add the vegetables .Mix it well with the sauce ., Add tofu to it .Mix it well with the sauce and vegetables without breaking them., At this time add vinegar to it., Mix 2 tbsp of water and 1 tsp of corn starch .whisk it to remove any lumps and mix with vegetables and tofu., Let it simmer on low /medium flame for 1 minute  or till the sauce thickens and coat the tofu nicely., Add green onion to it just before serving ., Enjoy., , , , , , , , , Tried this recipe?, Let us know, how it was!, , , , , , , , , , , , Air Fryer Sabudana Vada, , , , , by, , Smita, , , April 3, 2025, , , , , , , , , , , , Methi ,Matar ,Malai Kofta, , , , , by, , Smita, , , April 1, 2025, , , , , , , , , , , , Beans Kara Poriyal/ Easy Beans Poriyal, , , , , by, , Smita, , , March 31, 2025, , , , , , , , , , , , Malai Gobhi Korma, , , , , by, , Smita, , , March 27, 2025, , , , , , , , , , , , Malai Kofta in Creamy  Black Pepper Gravy, , , , , by, , Smita, , , March 26, 2025, , , , , , , , , , , , Air Fryer Loaded Chili Cheese Toast, , , , , by, , Smita, , , March 25, 2025, , , , , , , , , , , , Vegan Nasi Goreng (Indonesian Fried Rice), , , , , by, , Smita, , , March 19, 2025, , , , , , , , , , , , Easy Soft Dahi Bhalla /Dahi Vada Recipe, , , , , by, , Smita, , , March 13, 2025, , , , , , , , , , , , Rigatoni in Vodka Sauce/ Vodka sauce Pasta, , , , , by, , Smita, , , February 25, 2025, , , , , , , , , , , , Black Pepper Veggie Udon Noodles, , , , , by, , Smita, , , February 4, 2025, , , , , , , , , , , , Amritsari Palak Paneer Bhurji, , , , , by, , Smita, , , January 17, 2025, , , , , , , , , , , , Mushroom Korma, , , , , by, , Smita, , , January 10, 2025, , , , , , , , , , , , Masala Onion Grilled Cheese Sandwich-Air Fryer Recipe, , , , , by, , Smita, , , January 9, 2025, , , , , , , , , , , , Stir Fried Chili Garlic Udon Noodles, , , , , by, , Smita, , , December 20, 2024, , , , , , , , , , , , Creamy Garlicky Mushroom Toast, , , , , by, , Smita, , , December 18, 2024, , , , , , , , , , , , Greek Tomato Fritters (Air Fried+ Pan Fried), , , , , by, , Smita, , , November 21, 2024, , , , , , , , , , , , 15 Minute Paneer Masala -Quick Paneer Recipe, , , , , by, , Smita, , , November 5, 2024, , , , , , , , , , , , Banarasi Dum Aloo, , , , , by, , Smita, , , October 30, 2024, , , , , , , , , , , , Stuffed Dahi Ke Kabab, , , , , by, , Smita, , , October 28, 2024, , , , , , , , , , , , Easy Kathal Kebab, , , , , by, , Smita, , , October 22, 2024, , , , , , , , , , , , Chickpea Pulao/Kabuli Chana Pulao, , , , , by, , Smita, , , October 9, 2024, , , , , , , , , , , , Lasaniya Batata/Garlicky Potatoes, , , , , by, , Smita, , , October 4, 2024, , , , , , , , , , , , Spinach Rice With Garlic & Cashew, , , , , by, , Smita, , , June 21, 2024, , , , , , , , , , , , Sun-Dried Tomato Pesto Pasta, , , , , by, , Smita, , , June 20, 2024, , , , , , , , , , , , Cold Noodle Salad, , , , , by, , Smita, , , June 13, 2024, , , , , , , , , , , , Mushroom & Thai Basil Rice, , , , , by, , Smita, , , June 6, 2024, , , , , , , , Share this:, Click to share on Twitter (Opens in new window), Click to share on Facebook (Opens in new window), Like this:, Like, , Loading..., , , Related, , , , Related posts:, , , , Tofu Stir Fry, , , Air Fryer Crispy Tofu With Lemon, , , Tofu with Sichuan PepperCorn and Chili, , , Tofu Steak in Garlic Sauce, , , , , , «, Eggplant Tikka Masala, Baked Missi Roti, », Reader Interactions, Comments, , , , , , Jia, , says, , , December 03, 2020 at 1:58 am, , , , Hi, wondering which brand of red chili sauce do you use..., , , Loading..., , , , , Reply, , , , , , , , Smita, , says, , , December 04, 2020 at 2:35 am, , , , Hi Jia,, I Use My home made chilli paste.Sri-racha or any red chilli paste will work here as well., Thank you, , , Loading..., , , , , Reply, , , , , , , , , , Andréa Janssen, , says, , , January 28, 2021 at 9:58 pm, , , , This looks really delicious!, , , Loading..., , , , , Reply, , , , , , , , Smita, , says, , , January 29, 2021 at 1:47 pm, , , , Hi Andrea,, Thank you so much., , , Loading..., , , , , Reply, , , , , , , , , , Debbie, , says, , , September 26, 2023 at 4:55 pm, , , , corn flour or cornstarch?, , , Loading..., , , , , Reply, , , , , , , , Smita, , says, , , September 26, 2023 at 4:56 pm, , , , Corn starch., I will do the edit . Thanks, , , Loading..., , , , , Reply, , , , , , , , , , brachdebbie, , says, , , September 28, 2023 at 10:44 pm, , , , I loved this! I only changed by 1 Tbsp of sriracha, but added an extra Tbsp of soy sauce., , , Loading..., , , , , Reply, , , , , , , , Smita, , says, , , October 18, 2023 at 8:34 pm, , , , Thank you so much., Your substitutions are pretty smart., , , Loading..., , , , , Reply, , , , , , , , Leave a Reply, Cancel reply, , , , , , , , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , Footer, , ↑ back to top, , , , , , , Like us, , , , , Facebook, , Pinterest, , Instagram, , , , Privacy Policy, , , , , , , , Please sign up to get latest recipes in your Inbox!, , , , , , , , , Type your email…, , , , , , , , , , , , , Subscribe, , , , , , , , , , , , , , , , , , , , , , Copyright © 2021, myspicetrunk.com, , , Related, , , , , , , , , , , , , , , , Discover more from myspicetrunk, , Subscribe now to keep reading and get access to the full archive., , , , , , , Type your email…, , , , , , , , , , , , , Subscribe, , , , , , , Continue reading, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Loading Comments..., , , , , , , , , Write a Comment..., , , , , , Email (Required), , , , , Name (Required), , , , , Website, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , %d, , , , ,",
        "Orange Tofu": "Ingredients: , , Making vegan orange chicken in 4 easy steps:, , , Break the tofu into small pieces., , Make the batter and coat the tofu in the batter., , Fry tofu until golden brown., , Make sauce, heat it up, and add tofu!, , , , 1-inch nuggets, , Added batter, , Frying, , Crispy and ready for sauce, , Simmer sauce until thickened, , Submerge tofu, , , Better than take-out and it will even be ready by the time your food delivery would arrive anyway! There is a bit of cleaning involved but trust me, this vegan orange chicken recipe will be worth it., , Oil-Free Options, , Avoiding oil? No problem! Make this recipe in an air fryer to get that same texture. If using an air fryer: set to 375 F and air fry for 18-22 minutes while flipping every 7 minutes., , If you want to bake the tofu I recommend coating it in cornstarch only instead of coating it with the batter.  Mix ⅓ cup corn starch with garlic powder and salt before coating the tofu., , This will help the tofu achieve a more crispy texture in the oven. Bake at 400 F for 25 minutes flipping halfway through., , , Substitutes and tips:, , Can’t have tofu? Try, cauliflower, ! It’s equally as delicious., Click here, for a delicious cauliflower orange chicken recipe!, , Corn starch, is absolutely necessary for this recipe, don’t skip it!, , If using oil, I recommend:, avocado, canola, or vegetable oil, . Avoid olive oil, the smoking point is too low and can become toxic when frying at high heat., , Soy sauce, tamari or coconut aminos, are all great to use in this recipe., , BONUS TIP:, Freeze tofu and fully defrost before using it for a chicken-like texture that will make it taste like real orange chicken!, , More delicious tofu recipes, , Here are other tofu recipes I think you’ll love:, , , Saucy Savory Tofu, , Savory Peanut Sauce Tofu, , Crispy Breaded Tofu, , , , , , , , , , Print, , clock, , clock icon, cutlery, , cutlery icon, flag, , flag icon, folder, , folder icon, instagram, , instagram icon, pinterest, , pinterest icon, facebook, , facebook icon, print, , print icon, squares, , squares icon, heart, , heart icon, heart solid, , heart solid icon, , , , , , Vegan Orange Chicken (Tofu), , , , , , , , , , 5 Stars, , , , , , , , , 4 Stars, , , , , , , , , 3 Stars, , , , , , , , , 2 Stars, , , , , , , , , 1 Star, , , , 5, from, 30, reviews, , , , , Author:, , Anna Rios, , , , Total Time:, , 30, , , , Yield:, , 4, , 1, x, , , , Diet:, , Vegan, , , , , , , , , , Print Recipe, , , , , Pin Recipe, , , , , , Description, , , Fried tofu in sweet and sour homemade orange sauce. I’m sure this dish can turn anyone who hates tofu into a tofu lover!, , , , , , , , , , Copy to clipboard, , Copy to clipboard, , , , , , , , Scale, , 1x, 2x, 3x, , , , , , Tofu:, , , ½ cup, of neutral oil (I used canola), , 1, package of tofu (, 16 oz, /, 454 g, ), , ⅓ cup, all-purpose flour, , ⅓ cup, cornstarch, , ¼, –, ⅓, cup water, , 1 teaspoon, garlic powder, , ½ teaspoon, salt, , , Sauce:, , , 1 cup, of orange juice, , ⅓, –, ½, cup sugar, , 2 tablespoons, tamari or soy sauce, , 2 tablespoons, of rice vinegar, , 1 tablespoon, Sriracha (optional), , 2 teaspoons, crushed ginger, , 1 teaspoon, minced garlic, , 1 teaspoon, red pepper flakes, , 2 tablespoons, cornstarch, , 1 tablespoon, orange zest, , , , , , , , , , , , Cook Mode, , Prevent your screen from going dark, , , , , , , , , be sure to get the oil out first., , Once the sauce has thickened and simmered for at least 5 minutes, add the crispy tofu. Mix into sauce until all pieces are evenly coated., , Serve over steamed white or brown rice and enjoy!, , , , , , Notes, , , * See above for oil-free options, , * For a chicken-like texture, freeze and thaw the tofu before cooking, , * Can be made gluten-free with GF all-purpose flour, , , , , , Prep Time:, , 15, Cook Time:, , 15, Category:, , Dinner Instructions: , , , , Press and pat dry the tofu. No need to press if you use Trader Joe’s High Protein Tofu. Break the tofu into small 1-inch nuggets. The rough edges allow the dough to stay and become crisper., , Add the flour, cornstarch, salt, and garlic powder to a mixing bowl. Mix well. Add water and whisk until batter forms. You want it to be a little runny but not too thick., , Add chunks of tofu to the batter and coat evenly., , Turn a large skillet over medium-high heat and add oil. Once the oil is hot, add the tofu pieces one by one. Fry for 5-6 minutes on each side or until golden brown. When ready, place on a plate lined with paper towels to absorb excess oil., , , Baked / Fried, Cuisine:, , Asian, , , , , Nutrition, , , Serving Size:, , ½ cup, , , , , , , , Did you make this recipe?, , Share a photo and tag @healthysimpleyum, — we can’t wait to see what you’ve made!, , , , , , , Spread the love, , , This entry was posted in, Mains, , , Tofu, . Bookmark the, permalink, ., , , , , , , , , , Anna Rios, , , , , , , , , Vegan Flautas (Vegetarian Taquitos), , , , Vegan Mozzarella Cheese (Stretchy), , , , , , , , 70 thoughts on “, Vegan Orange Chicken (Tofu), ”, , , , , , , , , , , , doverto loperte, , says:, , I like this weblog so much, saved to bookmarks., , , , October 28, 2021 at 6:04 am, , , Reply, , , , , , , , , , , , , , , , , Lisa, , says:, , Had to come back and comment because it was the best orange chicken ever! After going vegan last year, I did not think I would ever have orange chicken again. Thank you for this amazing recipe, will definitely make it again., , , , , November 11, 2021 at 8:45 pm, , , Reply, , , , , , , , , , , , , , , , , Taylor, , says:, , Howdy! Someone in my Facebook group shared this site with us so I came, to check it out. I’m definitely loving the information. I’m book-marking, and will be tweeting this to my followers!, , Exceptional blog and brilliant style and design., , , , , November 25, 2021 at 4:00 am, , , Reply, , , , , , , , , , , , , , , , , Elissa, , says:, , That is a really good tip especially to those fresh to the blogosphere., Brief but very precise info… Thanks for sharing this one., A must read article!, , , , , November 27, 2021 at 12:34 am, , , Reply, , , , , , , , , , , , , , , , , Macallan, , says:, , First time making this!! I tried using honey instead of sugar. It was a little too citrusy and tart. So next time I’ll stick to sugar to see if that solves my problem! But the consistency of the sauce was incredible!, , , , December 1, 2021 at 3:13 am, , , Reply, , , , , , , , , , , , , , , , , Sarah, , says:, , Do you happen to have the nutrition info for this recipe?!?, , , , December 3, 2021 at 2:25 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Hi Sarah,, Im an intuitive eating dietitian so I do not add nutrition facts to avoid promoting calorie counting etc. However, I can say that this is a high protein dish with moderate amount of sugar. Let me know if you have any other specific questions., , Anna, , , , December 3, 2021 at 2:54 am, , , Reply, , , , , , , , , , , , , , , , , , , Tom, , says:, , Hello! Quick question that’s totally off, topic. Do you know how to make your site mobile friendly?, My weblog looks weird when viewing from my apple iphone., I’m trying to find a template or plugin that might be able to fix this problem., If you have any suggestions, please share. Thanks!, , , , , December 14, 2021 at 10:34 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Hi Tom,, , I hired someone to help me with side of my blog! I am not sure what they did, so sorry 🙁, , , , December 29, 2021 at 6:09 pm, , , Reply, , , , , , , , , , , , , , , , , , , Nola, , says:, , Great post., , , , , December 16, 2021 at 6:11 am, , , Reply, , , , , , , , , , , , , , , , , Katrina, , says:, , We absolutely love your blog and find many of your post’s to be exactly what I’m looking for., can you offer guest writers to write content for you personally?, I wouldn’t mind composing a post or elaborating on a few of the subjects you write in relation to, here. Again, awesome blog!, , , , , December 26, 2021 at 10:59 pm, , , Reply, , , , , , , , , , , , , , , , , Armand, , says:, , whoah this weblog is magnificent i really like studying your, articles. Stay up the good work! You know, a lot of people are looking around for this info,, you could help them greatly., , , , , December 28, 2021 at 7:10 am, , , Reply, , , , , , , , , , , , , , , , , Carmen, , says:, , It seemed like it took a while to make but it was worth it!  Love the sauce., , , , , January 5, 2022 at 5:06 am, , , Reply, , , , , , , , , , , , , , , , , Amanda H, , says:, , This is the FIRST tofu dish iv ever made my family… I literally just finished licking the pan. My two year old and husband also thought it was the BEST! Looks like we are tofu fans now! Thanks!, , , , , January 14, 2022 at 1:58 am, , , Reply, , , , , , , , , , , , , , , , , Debbie Doherty, , says:, , I bet you would love this served over Ben’s Original Ready Jasmine White Rice. It is so soft with a creamy texture. It comes in a packet and you have to do is steam it in the microwave for a few minutes. It’s amazing! Good eating! I love it…just thought I’d share. 😊, , , , September 6, 2024 at 6:26 am, , , Reply, , , , , , , , , , , , , , , , , , , Beryl, , says:, , Thanks to my father who stated to me concerning this webpage, this website is actually remarkable., , , , , January 26, 2022 at 5:36 am, , , Reply, , , , , , , , , , , , , , , , , Hung, , says:, , Write more, thats all I have to say. Literally, it seems as though you, relied on the video to make your point. You definitely know what youre talking about, why waste your intelligence on just posting, videos to your weblog when you could be giving us something informative to read?, , , , , February 3, 2022 at 6:45 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Write more? You weren’t specific. Did I miss something? What did you have trouble with? Happy to help 🙂 Thanks for the review, , , , February 8, 2022 at 4:28 pm, , , Reply, , , , , , , , , , , , , , , , , , , Mary Holder, , says:, , DELICIOUS!! Need I say more? I’ll be making this one many more times!!, , , , , March 1, 2022 at 12:19 am, , , Reply, , , , , , , , , , , , , , , , , tinyurl.com, , says:, , You actually make it seem really easy with your presentation but I in finding, this matter to be actually one thing which I think I would never understand., It sort of feels too complex and extremely large for me., I’m looking forward on your next submit, I, will try to get the dangle of it!, , , , , March 23, 2022 at 1:31 am, , , Reply, , , , , , , , , , , , , , , , , Rebecca, , says:, , I finally found an orange tofu recipe that’s easy and oh so very tasty!  I do meal prep every Sunday and put this over rice with broccoli and carrots.   Thank you for this delicious recipe!, , , , , March 27, 2022 at 5:28 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad to hear you loved it! 🙂 such a great recipe for meal prep., , , , March 30, 2022 at 2:58 am, , , Reply, , , , , , , , , , , , , , , , , , , Marion, , says:, , An excellent recipe! Instead of sugar, I used honey., This is something we no longer order at our favorite Chinese restaurant because we can make better at home. Thank you very much for sharing this recipe with us. It’s going to be a keeper!, , , , , April 11, 2022 at 3:07 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad you loved it Marion! 🙂 thanks for sharing, , , , April 13, 2022 at 2:02 pm, , , Reply, , , , , , , , , , , , , , , , , , , Paula Cooper, , says:, , So very good! My first tofu dish after going vegan almost 3 years! Love it!!, , , , April 23, 2022 at 11:46 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad you loved it 🙂 thanks for sharing!, , , , April 25, 2022 at 11:13 pm, , , Reply, , , , , , , , , , , , , , , , , , , Matt, , says:, , I’m going to make this dish soon, I am salivating !!, , , , April 25, 2022 at 11:28 pm, , , Reply, , , , , , , , , , , , , , , , , ErynR., , says:, , Best orange tofu recipe ever!!!, , , , , May 19, 2022 at 9:44 pm, , , Reply, , , , , , , , , , , , , , , , , Jo Hidden, , says:, , Just absolutely wonderful!, , , , , May 28, 2022 at 6:55 pm, , , Reply, , , , , , , , , , , , , , , , , Jennifer, , says:, , I made this recipe not that long ago and the orange tofu came out ridiculously good! I am a fan of orange chicken and this recipe just blew orange chicken away! I love love love this recipe. Thank you ❤️, , , , , December 27, 2022 at 10:53 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad you loved it! thank you for the sweet words 🙂 Happy new year!, , , , January 6, 2023 at 1:21 am, , , Reply, , , , , , , , , , , , , , , , , , , Jacqui, , says:, , I made this for dinner tonight! For the sauce I peeled two oranges and blended them instead of using just juice to keep the fiber! And then I also skipped the sugar and added 1-2 tbsp of maple syrup instead. It was super delicious!, , I also sautéed broccoli with onion to have some greens along, and topped my bowl brown-rice quinoa and orange tofu with sesame and flax seeds., , Such an easy to follow and delicious recipe! Thanks for sharing., , , , , December 29, 2022 at 5:49 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Hey Jacqui! GREAT idea of blending the oranges to keep the fiber, I’ll need to try that 🙂 thank you for the review and I hope you try some more recipes., – Anna, , , , January 6, 2023 at 1:22 am, , , Reply, , , , , , , , , , , , , , , , , , , Kayla, , says:, , My family was pleasantly surprised! We’ve never made anything with tofu, but as it was my night to make dinner I wanted to make something vegan or vegetarian… and I found this! My dad was not exactly excited to hear we’d be having something without meat, so my mom made actual chicken but… he ended up wanting more tofu from my plate when he finished his!! Thank you for this amazing recipe, I’ll definitely be doing more meals with tofu!!, , , , , January 19, 2023 at 11:35 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , That’s so great to hear Kayla! 🙂 Hopefully your dad will be open to trying more tofu dishes now!, , , , January 22, 2023 at 4:52 pm, , , Reply, , , , , , , , , , , , , , , , , , , Terry Leon Guerrero, , says:, , Just finished making this & it was delicious! I didn’t have store bought orange juice so I used freshly squeezed & used less sugar as the juice was more sweet than tart! I also Cut the sauce recipe in half & it was surprisingly enough to coat all of the tofu! Also the tip of freezing then thawing the tofu, spot on! Lovee the texture!, Thank you for this recipe!, , , , , January 28, 2023 at 7:42 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Thanks for trying it out and adjusting it to your preference! that is the beauty of recipes 🙂 I hope you try more recipes, I think you’d really like my “crispy tofu air fryer” version 🙂 It’s turned so many tofu haters into tofu lovers., , , , February 1, 2023 at 10:49 pm, , , Reply, , , , , , , , , , , , , , , , , , , Sarah, , says:, , I made this last night! I substituted the tofu for cauliflower and it came out so yummy! Will def make again!, , , , , March 17, 2023 at 11:29 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Hi Jordy,, , I just edited the word that said “dough” for the word “batter”. Thanks for the feedback! I made this recipe multiple times before posting it here. no one else seems to have this issue with the amount of water. Can I ask how much water you needed to use to make it into a batter? Was it more than 1/3 cup? the reason I listed a range (1/4-1/3 cup) because flours can differ in texture so some might be dryer or tougher to thin out. I hope you still enjoyed it 🙂  – Anna, , , , March 30, 2023 at 11:27 pm, , , Reply, , , , , , , , , , , , , , , , , Andrea, , says:, , The recipe is gone.  Otherwise my computer has lost it’s mind 🙁, , , , April 4, 2023 at 9:45 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Hi Andrea, there was a glitch on my Tasty recipe card plug-in last week, my apologies! It should be up now 🙂, , , , April 7, 2023 at 8:23 pm, , , Reply, , , , , , , , , , , , , , , , , , , Andrea, , says:, , I’ve made this about 5 times now, I bake the tofu instead of frying it and it’s always SO GOOD. Such a good substitute for when I’m craving orange chicken 💖, , , , , August 16, 2023 at 9:49 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Thank you for trying it! I hope you get inspired to try other recipes on here 🙂, , , , September 6, 2023 at 4:38 pm, , , Reply, , , , , , , , , , , , , , , , , , , Anna Rios, , says:, , This is one of the best-rated recipes on my blog for a reason. It sounds like 1) you didn’t actually make it 2) you did not follow the steps correctly 3) are just an idiot., , , , September 6, 2023 at 4:37 pm, , , Reply, , , , , , , , , , , , , , , , , K, , says:, , Ouch 😬, , , , February 3, 2024 at 6:38 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , 😉 it’s true, , , , February 8, 2024 at 12:01 am, , , Reply, , , , , , , , , , , , , , , , , , , K, , says:, , Can you make this dish ahead of time or does it lose something if reheated, , Thanks, , , , February 3, 2024 at 6:42 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , You can make it ahead of time but per most recipes it is always best fresh! I don’t think it will be too big of a difference 😉, , , , February 8, 2024 at 12:00 am, , , Reply, , , , , , , , , , , , , , , , , , , , , AL, , says:, , Wow! The orange sauce here is delightful and kind of trumps Panda Express! The end result is a saucy and if fried correctly, slightly crunchy “mock” orange chicken. I would recommend battering each piece separately and then frying individually (as in, not touching in the pan). I have made this twice and one of those times, I tried to rush the process and mixed all the tofu in at once, and end up with a LOT of extra starch just kind of hanging out and clumping in the sauce. Which is all on me! But otherwise, the flavor and the texture is delightful. Highly recommend all try!, , , , , December 20, 2023 at 5:36 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad you enjoyed this recipe! It’s definitely a favorite around here 🙂 I hope you get to explore some of the Mexican dishes on here too!, , , , December 21, 2023 at 10:48 pm, , , Reply, , , , , , , , , , , , , , , , , , , Rachel, , says:, , This turned out great! I am new to tofu and did the freeze and thaw technique. Taste very similar to chicken and it looked like it! I wish I took a picture but I ate it all 🙂, , , , , January 6, 2024 at 2:42 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , I am so glad you loved it Rachel! 🙂 I hope you give my other tofu recipes a try!, , , , January 8, 2024 at 5:17 pm, , , Reply, , , , , , , , , , , , , , , , , , , Jenny, , says:, , This was SO good, and probably the first time a recipe called for the right amount of batter for the amount of tofu require. I usually end up with a bunch leftover. I’m new to tofu, so I’m trying out a few different recipes, and I absolutely loved this. The tofu had a nice crunch, and the sauce was so good. I ended up only using around 1/4 of sugar, and it was still perfect., , , , , January 30, 2024 at 9:00 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad you gave it a try Jenny! 🙂 If you’re new to tofu make sure to check out my other tofu recipes, especially the shredded tofu or crispy air fried tofu 😉 I think you’ll love them. Have a wonderful week!, , , , January 31, 2024 at 12:56 am, , , Reply, , , , , , , , , , , , , , , , , , , Mandy K., , says:, , Hi!  Might be a silly question but when recommending to freeze and then rethaw – would I do freeze it after breaking it down into 1 inch nuggets or just freeze the whole package?  Thanks!, , , , February 4, 2024 at 7:59 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , I freeze the whole packet because it is easier to squeeze the excess liquid out when it is whole 🙂 Not a silly question at all., , , , February 7, 2024 at 11:58 pm, , , Reply, , , , , , , , , , , , , , , , , , , Karen, , says:, , I just finished making this for my vegetarian daughter who’s a busy working mom & her family.Will make rice to add to this dish. It tastes incredible they will love it . 🥰🇨🇦, , , , February 6, 2024 at 9:31 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , So glad you made it! Let us know what your daughter and her family think 🙂, , , , February 8, 2024 at 12:02 am, , , Reply, , , , , , , , , , , , , , , , , , , Kelli, , says:, , Stumbled upon this recipe and happy I did!  Made this organge tofu last night and it’s awesome! Even my carnivorne husband loved it and asked to throw it in our regular dinner rotation.  Thanks for sharing!, , , , , February 20, 2024 at 4:35 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , SO glad you and your husband loved it! 🙂 I hope you explore my other tofu and non-tofu recipes on here as well!, , , , February 20, 2024 at 7:37 pm, , , Reply, , , , , , , , , , , , , , , , , , , Em, , says:, , Not going to lie, I was hoping I wouldn’t love this because I already have a pretty decent orange tofu recipe that uses a lot less sugar and oil. However, it surpassed my expectations! This is something I would serve to someone if I’m trying to get them to love tofu, because I really don’t see how anyone couldn’t like it. Thank you so much for this recipe!, , , , , July 26, 2024 at 9:33 pm, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Yay! 🙂 Thank you for giving it a try. It’s truly such a satisfying recipe. I think you might also like the miso tofu on here, it’s incredible. Have a wonderful week!, , , , July 29, 2024 at 5:36 pm, , , Reply, , , , , , , , , , , , , , , , , , , Kellie J, , says:, , This was amazing!  I appreciate this recipe, it’s going in the recipe book of fame!, , , , August 6, 2024 at 12:50 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , , , , August 7, 2024 at 4:02 pm, , , Reply, , , , , , , , , , , , , , , , , , , Debbie Doherty, , says:, , I now this is a vegan recipe, but would it be ok if chicken was substituted instead of tofu? Just wondering if the recipe would need any alterations other than the chicken?, Thank you for all your delicious recipes and the time that you take to share them with us., God Bless you! 😊, , , , September 6, 2024 at 6:33 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , Hi Debbie, it would work exactly the same work chicken! Just make sure you it cooks through when frying it 🙂, , , , September 6, 2024 at 9:20 pm, , , Reply, , , , , , , , , , , , , , , , , , , Mike, , says:, , I do not eat a vegan diet, but I found this perfectly wonderful!, , Only suggestion is that the sauce to tofu ratio could be reduced.  I found it a little soupy.  Didn’t affect my enjoyment, but we did have a lot of sauce left in the bowl afterward., , , , , January 2, 2025 at 12:18 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , so glad you enjoyed it! (: I hope you try a few other of my recipes! thanks for the feedback Mike., , , , January 2, 2025 at 11:53 pm, , , Reply, , , , , , , , , , , , , , , , , Rachel, , says:, , but that was just a big gloppy mess sticking together so after about 10 minutes, I moved it to a frying pan with oil. Not sure how to successfully make it in the air fryer – any tips? Less batter? Use a liner?, , Anyway, when we finally ate it, my husband said it was the best tofu I’ve ever made multiple times. I think the sauce to tofu ratio is spot on as you have a little extra for veggies and/or rice. Super delicious and super easy recipe that I’ll clearly be making all the time now! 😉 Thank you!, , , , , March 12, 2025 at 3:12 am, , , Reply, , , , , , , , , , , , , , , , , Anna Rios, , says:, , SO happy to hear that you guys loved it! 🙂 as for the air fryer: I would recommend coating the tofu in cornstarch only instead of coating it with the batter. It works well for baking it and I it should work for air-frying it too! Mix ⅓ cup corn starch with garlic powder and salt before coating the tofu., , , , March 20, 2025 at 8:35 pm, , , Reply, , , , , , , , , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , , Δ, , , , , , , , , , , , , , , , , , , , Categories, , , Breakfast, , , Drinks, , , Health & Wellness, , , Mains, , , Mexican, , , Pasta, , , Salads, , , Sauces, , , Sides, , , Sides & Snacks, , , Soups, , , Sweets, , , Tofu, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Get to know Anna, a passionate Mexican-American Registered Dietitian Nutritionist, here to share flavorful plant-based recipes that make healthy eating accessible and enjoyable., , , , , , , Quick Links, , Home, About Me, Recipes, Contact, Shop & More, , , , , , Follow Us, , Facebook, Instagram, Pinterest, Youtube, , , , , , Contact Us, , hello@healthysimpleyum.com, PO Box 1234, City, State, Zip, , , , , , , , , , , , , , , , Privacy Policy, , , , , Copyright 2025 ©, Healthy Simple Yum, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Home, , About Me, , Recipes, , Contact, , Shop & more, , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Soy Garlic Tofu": "Ingredients:  Instructions: ",
        "Vegan Bang Bang Brocolli": "Ingredients: the sauce is only 3! A customary Bang Bang sauce has sweet chilli sauce and honey. I thought that was WAY too much sugar, so I went with a simple Vegan mayo, chilli paste and agave. So easy, so sweet and spicy, and everything is just thrown together. After dipping into the batter, you just toss it in panko, and it is ready to get nice and brown and crispy., , , , What You Need To Make This Vegan Fried Broccoli:, , , Fresh Broccoli:, It really is best to use fresh and not frozen, , Vegan Mayo:, This starts the bang bang sauce., , Chili Paste and Agave Syrup:, I like to use garlic chili paste and light agave., , Non-dairy Milk:, I used almond milk, but any unsweetened plant milk will do., , Apple Cider Vinegar, Cornstarch, Flour, Salt and Hot Sauce:, Mixed with the milk, these create the wet batter., , Panko Bread Crumbs:, To coat the broccoli in and make it extra crunchy., , Oil:, For frying!, , , , , If you love broccoli, you should make my, Vegan Crispy BBQ Broccoli Tacos!, , , , , , Vegan Bang Bang Broccoli, , , , , Print Recipe, , , Asian-inspired broccoli panko fried to perfection drizzled with a creamy sweet and spicy sauce., , , Course, Main Course, , Prep Time, 15, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 30, minutes, , mins, , Author, Lauren Hartmann, , , Bang Bang Sauce, 1/4, , C., , Vegan mayo, 2, , Tbsp., , Chili paste, 1, , Tbsp., , Agave nectar, Batter, 1, , C., , Almond milk, 1, , tsp., , Apple cider vinegar, 3/4, , C., , All purpose flour, 1/2, , C., , Cornstarch, 1, , tsp., , Salt, 2, , tsp., , Hot sauce, And the rest, 2, , C., , Panko bread crumbs, 1, , Head, , of Broccoli, Oil for frying, Chives for garnish(optional), , Put the panko in a separate bowl., Cut broccoli into florets, then h, eat the oil on medium high in a large pan, I like to use a cast iron skillet, you need about 1/2-1 inch of oil at the bottom of the pan., Dip each floret of broccoli in the batter, then into the panko and coat thoroughly. Once the oil is hot add the broccoli to the hot oil., Fry for about a minute or two on each side, or until brown and crispy., Drizzle with sauce and serve immediately., , Cook Mode, Prevent your screen from going dark, , Video, , , , , , , , , , Notes, If you want to bake the broccoli instead of frying it, bake at 425 degrees for about 15-20 minutes or until it browns., , , , , , Other popular recipes:, The Best Vegan Gnocchi with Creamy Pesto and Crispy Tofu, by Lauren Hartmann, 0, Incredible Vegan French Onion Garlic Bread, by Lauren Hartmann, 0, Vegan Banana Split Cookies, by Lauren Hartmann, 0, Filed Under:, Entrees, , Tagged With:, bang bang broccoli, , , broccoli, , , vegan, , , vegan entree, Reader Interactions, Comments, , , , , , Sara Field, , , February 13, 2017 at 9:16 pm, , , , Saw this on insta, was so tempted that I had to visit this. Amazing idea . Totally gonna try making this one. Thankx for this one, , , Reply, , , , , , , , Lauren Hartmann, , , February 13, 2017 at 11:28 pm, , , , Thank you so much! It is so delicious, I hope you enjoy!, , , Reply, , , , , , , , Melisa, , , February 10, 2019 at 1:54 am, , , , Same!, , , Reply, , , , , , , , Daniel Helgeson, , , August 5, 2019 at 9:55 pm, , , , Is there anything i can replace the agave nectar with?, , , Reply, , , , , , , , Ann, , , March 24, 2020 at 9:26 pm, , , , SOOO GOOD! You can also make Yum Yum Cauliflower … and onion. or whatever you have waiting in your fridge., It’s great even without agave, but real maple syrup can be a substitute sweetener., I prefer to add sweet to the dipping sauce., , , Reply, , , , , , , , Pat, , , March 31, 2020 at 10:56 pm, , , , I’d use maple syrup, , , Reply, , , , , , , , Kristwn, , , April 7, 2020 at 3:58 pm, , , , Honey or syrup can be used instead., , , Reply, , , , , , , , Deanna, , , July 27, 2020 at 8:54 pm, , , , Honey or maple syrup, , , Reply, , , , , , , , , , , , Katia, , , November 11, 2021 at 2:00 pm, , , , How many servings does it make?, , , Reply, , , , , , , , , , Kim, , , March 13, 2017 at 3:32 pm, , , , Can this be baked instead of frying?, , , Reply, , , , , , , , Lauren Hartmann, , , March 13, 2017 at 8:28 pm, , , , Yes. You should be able to. I would bake at a high temperature, and maybe spray them with oil of your choice. I love avocado oil spray!, , , Reply, , , , , , , , Jacki Congdon, , , November 29, 2019 at 3:53 pm, , , , This was so great!! Made it for thanksgiving appetizer yesterday and everyone loved it! Baked at 425 for 25 minutes or so and sprayed with avocado oil before putting in – turned out great!! Thank you for all of your recipes!, , , Reply, , , , , , , , , , Roxanne, , , April 16, 2017 at 12:56 am, , , , I baked it at 425 for 20 min.  It was perfect except for the colour. It was not golden brown but white.  But it was delicious! I also replaced the floor with quinoa flour and agave with a heaping TBSP of organic unsweetened apple butter. ….YUMMY!, , , Reply, , , , , , , , Lauren Hartmann, , , April 16, 2017 at 12:59 am, , , , Yay! Sounds delicious! Yeah, to get it to brown, you probably have to give it a spray of oil. However, if you are trying to avoid oil all together this sounds like a great alternative! Thank you for sharing and the feedback!!, , , Reply, , , , , , , , Cookster, , , May 5, 2019 at 1:56 pm, , , , I always prerogatives my panko before using to ensure it isn’t “raw” and it comes out perfect on cauliflower wings etc, , , Reply, , , , , , , , , , , , , , Brandon, , , March 14, 2017 at 6:33 pm, , , , This was great, and the only criticism is when to put in the hot sauce, as it is slightly ambiguous in the recipe details. Does one place it right into the milk and vinegar mixture? This is obviously a minor note, and thank you for the wonderful recipe., , , Reply, , , , , , , , shoshi, , , April 18, 2017 at 1:00 am, , , , for there was a lot of batter left after coating the florets., Anyway, thanks a lot for this !, , , Reply, , , , , , , , Chastity, , , March 10, 2018 at 8:58 am, , , , like for the Super Bowl or something., , , Reply, , , , , , , , Carolyn Pendley, , , February 5, 2020 at 1:00 am, , , , Delicious. Had to sub a few things that made it vegetarian instead of vegan – honey in my aquafaba mayo, sriracha and trader joes chile onion crunch for heat, Yogurt for buttermilk.  Bread Crumbs for Panko.  Air Fried at 400 F about 8 minutes, flipping 1/2 way through.  Family loved it., , , Reply, , , , , , , , Rich Benham, , , February 26, 2020 at 7:43 pm, , , , Made this tonight and blown away by how nice they are!!!!! My sauce was a little thicker than the video (wrong type of paste I think) but 100% one for the list of things I’ll make on a regular basis.   Great work!!, , , Reply, , , , , , , , Jeanne, , , March 22, 2020 at 7:56 pm, , , , Amazing recipe. I am trying to ensure I eat healthy during this COVID-19 self-quarantine. While I like broccoli, I don’t prepare it often. I used potato starch instead of corn starch and baked it in the toaster oven at 425 for 20 minutes and finished it off on broil so they were browned. Liked the fact that they were nice and chewy and yummy. Will definitely use the batter for other veggies, and the sauce for other dishes. Thanks for posting, and certainly will check out more of your recipes. Stay well and healthy., , , Reply, , , , , , , , Jeanne, , , March 23, 2020 at 6:39 pm, , , , Bang-Bang Broccoli is the best! Made it the other night as I am self-quarantined in Ohio. Used potato starch in the batter instead of corn starch. Baked it in toaster oven and broiled it at the end to get them brown. Crunchy and tasty even the next day cold. Will be using the batter recipe and sauce for other veggies! Thanks and stay well!, , , Reply, , , , , , , , Stacey, , , March 30, 2020 at 12:14 pm, , , , Hi. Do you think it will work with Cauliflower?, , , Reply, , , , , , , , Lauren Hartmann, , , March 30, 2020 at 12:29 pm, , , , Absolutely!, , , Reply, , , , , , , , , , Marna, , , April 1, 2020 at 2:48 am, , , , Would Ripple Milk work instead of almond milk?, , , Reply, , , , , , , , Lauren Hartmann, , , April 3, 2020 at 5:34 pm, , , , Yes, that should work fine!, , , Reply, , , , , , , , , , Jeroen, , , April 9, 2020 at 5:37 pm, , , , So good!!!, , , Reply, , , , , , , , Gaibrielle, , , July 7, 2020 at 10:43 am, , , , I googled a vegan broccoli recipe as i had a head in the fridge that I wanted to use – and OMG I’m so glad that I came across this recipe!!! 😍😍😍, I expected it to taste good, but it was SUPER DELICIOUS 🤤🤤🤤👍👍👍👌👌👌🐱‍🏍🐱‍🏍🐱‍🏍, I’ve shared with a whole lotta Aussie vegan friends, so I’m expecting this at the next potluck I go to 😊, , , Reply, , , , , , , , Holly, , , July 20, 2020 at 1:25 pm, , , , Hi there, this looks fab! I haven’t got cornstarch or arrowroot, is there a substitute please? X, , , Reply, , , , , , , , Van, , , October 7, 2020 at 8:56 pm, , , , I have to say, this is absolutely AMAZING. We probably make it at least once a week and it’s my boyfriend’s most requested dish. Love this so much. Thank you!, , , Reply, , , , , , , , Britt, , , December 4, 2020 at 4:27 pm, , , , Do you think you could air fry this??, , , Reply, , , , , , , , Julie Grace, , , December 8, 2020 at 11:40 am, , , , Yes you can!, , , Reply, , , , , , , , , , Kendra rodriguez, , , December 18, 2020 at 6:25 am, , , , Can you use oat milk instead of almond milk?, , , Reply, , , , , , , , choice cooker, , , February 25, 2021 at 12:19 am, , , , Thanks for sharing.Will try once time., , , Reply, , , , , , , , Anna, , , March 16, 2021 at 7:47 pm, , , , Soooo glad I made this. SO YUMMY!!!!!! Will definitely make again.  The bang bang sauce is amazing., , , Reply, , , , , , , , Michelle, , , August 26, 2021 at 4:07 pm, , , , We have A LOT of broccoli in the garden all coming ready at the same time! I wanted to use it for something new and came across this recipe. WOW! This is fantastic!!!!, , , Reply, , , , , , , , laurie, , , October 1, 2021 at 12:02 pm, , , , YUM!!!  I made this last night. I baked it and it was still so crunchy~  I had extra sauce and my husband put it on his corn on the cob.  It was so good! Thank you!, , , Reply, , , , , , , , Erin, , , June 20, 2022 at 7:18 pm, , , , I used cauliflower and baked it at 425 for 25 minutes. It was amazing. We made tacos with some Mexican. Rice and vegan mozzarella. It is a keeper., , , Reply, , , , , , , , Raven, , , September 19, 2022 at 1:06 am, , , , I have made this at least once a fortnight for the last 4 years. A must try recipe. Even toddlers wolf it up 🙂, , , Reply, , , , , , , , Raven, , , September 19, 2022 at 1:07 am, , , , I have made this at least once a fortnight for the last 4 years. A must try recipe. Even toddlers wolf it up 🙂 Even people who are not really into Broccoli think it is delicious, , , Reply, , , , , , , , Rachel Lake, , , November 9, 2024 at 6:40 pm, , , , Hi Lauren,, , I wanted to let you know the good you have been doing in the world.  You influenced me that I could go vegan. . the first recipe I tried was your bang bang broccoli.  I loved it and the vegan parmesan and it was then that I realized that I could be vegan and no miss a thing!  That began in 2019.  Thank you for your work and awesome sauces, especially.  .  You have such tremendous value in this world and I just want you to know!, , , Reply, , , , Trackbacks, , , , , , Lunch, Light Meals & Entrees – Vegan Recipes, Desserts and Drinks, , says:, , , , March 28, 2017 at 8:32 pm, , , , , […] Vegan Bang Bang Broccoli  […], , , Reply, , , , , , , , Vegan General Tso's Broccoli - Rabbit and Wolves, , says:, , , , May 15, 2017 at 1:35 pm, , , , , […] you tried my Bang Bang Broccoli? It is my most popular recipe, and there is a reason. Frying broccoli is the shit, that’s […], , , Reply, , , , , , , , 7 Broccoli Recipes That Prove It's Way More Than a Boring Side Dish - google healths, , says:, , , , May 18, 2017 at 3:23 pm, , , , , […] 3. Vegan Bang Bang Broccoli […], , , Reply, , , , , , , , 35 Best Broccoli Recipes Ever Created – What The Hack!, , says:, , , , July 21, 2017 at 3:26 pm, , , , , […] rabbitandwolves […], , , Reply, , , , , , , , 35 Best Broccoli Recipes Ever Created - Diy, , says:, , , , July 21, 2017 at 9:26 pm, , , , , […] rabbitandwolves […], , , Reply, , , , , , , , www.rabbitandwolv …… | I Blog dal mondo, , says:, , , , January 5, 2018 at 11:58 pm, , , , , […], http://www.rabbitandwolv, …  […], , , Reply, , , , , , , , 250 Best Vegan Recipes | Prudent Penny Pincher, , says:, , , , January 13, 2018 at 12:18 pm, , , , , […] Vegan Bang Bang Broccoli from Rabbit and Wolves […], , , Reply, , , , , , , , 20 Tasty Vegan Recipes That Will Make Your Taste Buds Very Happy!, , says:, , , , January 22, 2018 at 3:37 pm, , , , , […] Source: Rabbit and Wolves […], , , Reply, , , , , , , , 10 Things I Love Sunday – A Beautiful Mess, , says:, , , , February 25, 2018 at 10:02 am, , , , , […] 5. This recipe looks soooo delicious!! I’ve had it pinned for a while, but I really need to try it soon. I love getting veggies prepared like that out at sushi-type places, so I’d love to see if we could make a good version at home too! […], , , Reply, , , , , , , , 10 Things I Love Sunday – Enter Tint Name, , says:, , , , February 25, 2018 at 3:06 pm, , , , , […] 5. This recipe looks soooo delicious!! I’ve had it pinned for a while, but I really need to try it soon. I love getting veggies prepared like that out at sushi-type places, so I’d love to see if we could make a good version at home too! […], , , Reply, , , , , , , , 10 Things I Love Sunday – A Beautiful Mess | Life Tank, , says:, , , , February 25, 2018 at 3:33 pm, , , , , […] 5. This recipe looks soooo delicious!! I’ve had it pinned for a while, but I really need to try it soon. I love getting veggies prepared like that out at sushi-type places, so I’d love to see if we could make a good version at home too! […], , , Reply, , , , , , , , What Do Vegans Eat? - The 55 Most Popular Vegan Recipes! - Vegan Heaven, , says:, , , , February 25, 2018 at 6:03 pm, , , , , […] Vegan Bang Bang Broccoli by Lauren from Rabbit and Wolves […], , , Reply, , , , , , , , Meatless Monday – Noodle Bowl with Tofu & Broccoli | Breakfast, Lunch & Dinner...and then some, , says:, , , , March 26, 2018 at 8:12 pm, , , , , […] go along with it, I made Bang Bang Broccoli, named as such probably because of a chili mayonnaise sauce that goes along with it.  Broccoli […], , , Reply, , , , , , , , Vegan Garlic Buffalo Brussels Sprouts - Rabbit and Wolves, , says:, , , , May 30, 2018 at 5:41 pm, , , , , […] Batter adapted from my Vegan Bang Bang Broccoli […], , , Reply, , , , , , , , Vegan Fried Lasagna - Rabbit and Wolves, , says:, , , , August 12, 2018 at 12:46 pm, , , , , […] not just saying that, I sincerely mean that! It is so perfect for healthy fried veggies, my Bang Bang Broccoli is a great recipe to make in an air […], , , Reply, , , , , , , , 20 Tasty Vegan Recipes That Will Make Your Taste Buds Very Happy!, , says:, , , , August 18, 2018 at 12:43 am, , , , , […] Source: Rabbit and Wolves […], , , Reply, , , , , , , , Vegan Bang Bang Broccoli – Recipes Mild, , says:, , , , September 5, 2018 at 5:42 am, , , ,  Instructions: Make the sauce, whisk together the mayo, chilli paste and agave in a small bowl. Set aside., Make the batter, add the apple cider vinegar to the almond milk in a small bowl and let sit for a few minutes to make vegan buttermilk., Add the flour, cornstarch, and salt to a medium sized mixing bowl, and after it’s all done you dip or drizzle, , , Reply, , , , , , , , , , Shannon, , , May 11, 2017 at 6:47 am, , , , My boyfriend doesn’t like mayo based sauces, so I am going to do a separate sauce for him. Is there something else I can use? I was thinking to replace the mayo with veggie broth and thicken it with flour. Do you have any advice?, , , Reply, , , , , , , , Lauren Hartmann, , , May 11, 2017 at 10:53 am, , , , I think it needs to be creamy. How does he feel about avocado? You could do a creamy avocado sauce blended with veggie broth and then mixed with the agave and chili paste. Or you could use vegan plain yogurt? Or you could just mix the agave and chili paste without the creaminess. It would still be delicious! I hope that helps! Let me know if none of these appeal to you! I will do more brainstorming!, , , Reply, , , , , , , , LAINE, , , October 27, 2022 at 6:37 pm, , , , Try olive oil with  honey and brown mustard, thin with white balsamic vinegar.  It’s a good, simple dressing for fried food., , , Reply, , , , , , , , , , , , pom7756G, , , June 29, 2017 at 2:04 pm, , , , Wondering if anyone has tried this with an air fryer? Looking for yet another reason to dig in and buy one…and this recipe must might be the push!, , , Reply, , , , , , , , Lauren Hartmann, , , June 29, 2017 at 2:10 pm, , , , Actually, yes! Someone sent me a picture a few days ago of the outcome of the using an air fryer for this recipe. They said it was amazing, and it looked really good!, , , Reply, , , , , , , , Peazl, , , February 26, 2020 at 12:02 am, , , , Thanks for asking this, I had the same question! 🙂, , , Reply, , , , , , , , , , Lesa, , , July 6, 2017 at 4:15 pm, , , , This is delicious. I replaced the 2nd tsp of chili pepper with agave. I don’t like hot, hot. Thanks, , , Reply, , , , , , , , Lauren Hartmann, , , July 6, 2017 at 8:25 pm, , , , Yay! I’m so glad you liked it! You are so welcome!, , , Reply, , , , , , , , , , Karen B Zimmer, , , July 9, 2017 at 11:22 am, , , , I like my broccoli cooked, not raw or crunchy… does the broccoli soften up or is it still hard?? Maybe i can steam it a tad first. I know… I am weird but I like all veggies cooked. ????, , , Reply, , , , , , , , Lauren Hartmann, , , July 9, 2017 at 4:08 pm, , , , It definitely gets soft, but you can try and steam it a bit first if you want. I do think it gets soft enough just frying, so it is up to you. I am not sure how well the coating would work on steamed broccoli. However, you could give it a try., , , Reply, , , , , , , , Car, , , January 5, 2020 at 8:29 pm, , , , You might try leaving your broccoli uncovered in the refrigerator a couple of days. It tends to get softer., , , Reply, , , , , , , , , , Cary Adkison, , , July 11, 2017 at 9:58 pm, , , , Made this evening. Used coconut milk instead of almond.  Whole family LOVED it!! Definitely making it again.  Thanks for the recipe, , , Reply, , , , , , , , Lauren Hartmann, , , July 12, 2017 at 2:06 am, , , , Yay! You are so welcome!, , , Reply, , , , , , , , , , Angela, , , July 16, 2017 at 3:16 pm, , , , has anyone made this using frozen broccoli? I have some on hand and was just curious…, , , Reply, , , , , , , , Lauren Hartmann, , , July 16, 2017 at 7:44 pm, , , , I have not tried that, and I am not sure if anyone else has.  However, you could definitely give it a try! I would just defrost it first and then coat it like you would with fresh. I can’t guarantee it will work, but I would love to know if it does! I think it will!, , , Reply, , , , , , , , , , Zuzu Petals, , , July 22, 2017 at 2:26 am, , , , I appreciate vegan recipes with good flavor!! Thanks for this., , , Reply, , , , , , , , Lauren Hartmann, , , July 22, 2017 at 10:42 am, , , , You are so welcome!, , , Reply, , , , , , , , Roz, , , December 26, 2020 at 8:06 pm, , , , Could you use an air fryer, , , Reply, , , , , , , , , , , , Cindy, , , July 31, 2017 at 9:35 pm, , , , Thank you.  can’t wait to try it…looks delicious!, , , Reply, , , , , , , , Cindy, , , July 31, 2017 at 11:36 pm, , , , Is 1/2 cup cornstarch a typo?  Holy cow, that seems like a lot, , , Reply, , , , , , , , Lauren Hartmann, , , July 31, 2017 at 11:44 pm, , , , Nope, not a typo. It is mixed with flour to make the batter. So it just makes a nice light crispy batter. I promise it works????, , , Reply, , , , , , , , S, , , December 5, 2018 at 1:35 am, , , , Can you use arrowroot instead?, , , Reply, , , , , , , , Lauren Hartmann, , , December 5, 2018 at 2:46 pm, , , , I think that would work, but I haven’t tested it., , , Reply, , , , , , , , Kara, , , October 5, 2021 at 8:24 pm, , , , Just made with arrowroot and it worked! Don’t know how it compares to the cornstarch but it was super crispy!, , , , , , , , , , , , , , , , , Kenys, , , August 4, 2017 at 10:43 am, , , , OMG!! I think I’m in LOVE! This is the most delicious vegan appetizer EVER! Thanks!, , , Reply, , , , , , , , Lauren Hartmann, , , August 4, 2017 at 7:20 pm, , , , This makes my heart happy!, , , Reply, , , , , , , , , , Kenys, , , August 4, 2017 at 10:46 am, , , , By the way, I used rice milk and it works just ad good., , , Reply, , , , , , , , Lauren Hartmann, , , August 4, 2017 at 7:21 pm, , , , Awesome! So good to know!, , , Reply, , , , , , , , , , Susanna, , , August 20, 2017 at 8:46 pm, , , , I am new to the vegan world and havent tried a lot just yet. But I am also gluten free. What is the best flour to use for this?, , , Reply, , , , , , , , Roxanne, , , August 20, 2017 at 8:53 pm, , , , I have tried quinoa, almond and brown rice flour.  Brow rice flour have me the best results.  It have it a crispy texture.  I do not fry bit bake in oven., , , Reply, , , , , , , , Lauren Hartmann, , , August 21, 2017 at 12:50 am, , , , I have been told by many people that a gluten free all purpose flour works! You can also find some gluten free panko, Ian’s makes really good gluten free panko! Also Bob’s red mill makes my favorite gluten free ap flour!, , , Reply, , , , , , , , , , Shannon, , , August 22, 2017 at 8:56 am, , , , Where can I find chili paste?, , , Reply, , , , , , , , Lauren Hartmann, , , August 22, 2017 at 1:16 pm, , , , You should be able to find it at any grocery store in the international section or Asian section. If you can’t find it, I would try sriracha or a thicker hot sauce. I think you should be able to find it though. I use Sambal chili paste!, , , Reply, , , , , , , , , , c, , , September 28, 2017 at 11:06 pm, , , , This was DECLICIOUS. I mean insanely good. We are basically non vegans eating mostly vegan for health reasons. Looking for new, tasty things for dinner. I made this with a side of teryaki zoodles and not only was it our of this world, but super filling as well! Thanks for such a great recipe., , , Reply, , , , , , , , Lauren Hartmann, , , September 28, 2017 at 11:42 pm, , , , That makes me so incredibly happy! I  love hearing that! You are so welcome!, , , Reply, , , , , , , , , , Susan, , , October 22, 2017 at 8:45 pm, , , , Hi Lauren! This looks s9 good! I was wondering his many servings it makes?, , , Reply, , , , , , , , Lauren Hartmann, , , October 22, 2017 at 9:28 pm, , , , Thank you! It is soooo good! If you are serving as a side dish, I would say 3 or 4. If you are serving as a main dish I would say 2 or 3., , , Reply, , , , , , , , , , Angel, , , October 24, 2017 at 9:43 pm, , , , Wowwwwwwwwzers!! Bang Bang in my mouth…delicious!!, , , Reply, , , , , , , , Kelly, , , December 18, 2017 at 8:50 pm, , , , Ah.may.ZING!! Like seriously…delish…I baked the broccoli and it browned nicely…will definitely make this again!!!, , , Reply, , , , , , , , Yoi, , , February 26, 2018 at 2:20 pm, , , , I’m so glad I bought a broccoli today !, I made a few minor adjustments, turned out wonderful and full of flavor. My new favorite recipe. Thank you for the recipe!, , , Reply, , , , , , , , stephanie, , , June 11, 2018 at 6:47 pm, , , , we are transitioning to vegan. I don’t have agave, or almond milk. Can I sub with sugar, and 1% milk?, , , Reply, , , , , , , , Lauren Hartmann, , , June 11, 2018 at 7:02 pm, , , , You can totally use regular milk. I would use honey instead of sugar if you have it. If you only have sugar, that may work, but it may be a little grainy. I don’t normally add regular sugar to a sauce that won’t be cooked. You can totally give it go though and see how it turns out. However, I would definitely go with honey if you have it. I hope that helps!, , , Reply, , , , , , , , , , NANCY, , , July 1, 2018 at 12:05 am, , , , For anyone looking for a non-mayo sauce – I have served it twice with a sour cream/horseradish dip to raves. I make it in a 425 degree oven, just turning the pieces once during cooking, and I use a combination of broccoli and mushrooms. Thanks so much for this!, , , Reply, , , , , , , , Emily, , , September 24, 2018 at 7:26 pm, , , , If I only have vanilla (unsweetened) almond milk, will the vanilla flavor be too strong?  Thanks!, , , Reply, , , , , , , , Lauren Hartmann, , , September 25, 2018 at 3:33 pm, , , , I have accidentally used vanilla almond milk in savory recipes before, and it usually doesn’t taste great. However, you could give it a try. The rest of the flavors may over power it., , , Reply, , , , , , , , , , Julia Wisdom, , , October 3, 2018 at 11:53 pm, , , , This recipe is DELICIOUS!! We are recent vegans for health reasons. We have 3 growing teenagers they complain how hungry they are all the time. Well this recipe is fixing that., I made 8 heads of broccoli b/c they take leftovers for lunch at school. They are still eating and 90% of the 8 heads are gone. Lol my 6’4″ autistic teenage son is on his second plate already. I doctored the sauce a little with Dave’s insanity sauce and some crush lime flavored peanuts. The question has come up as to when I am making this again., Honestly I expected them to like it but this is the absolute best result we could’ve expected., , , Reply, , , , , , , , Lauren Hartmann, , , October 4, 2018 at 1:05 pm, , , , You have no idea how happy this made me! Seriously, thank you so much for sharing this!, , , Reply, , , , , , , , , , Samantha, , , December 5, 2018 at 12:36 am, , , , I just made these and OMG sooo good. I used gf panko bread crumbs and fried in avacado oil. Make these!, , , Reply, , , , , , , , Alison, , , January 1, 2019 at 6:38 pm, , , , I made this today for New Year’s. It was SO good, I will def make it again!! I baked it, it was nice and crunchy. A good balance between plain old veggies-and-dip and a super-heavy, greasy app. I didn’t feel guilty eating….. well, let’s just say, “many.” Thanks!! Just discovered this site, love it 🙂, , , Reply, , , , , , , , Melissa, , , January 3, 2019 at 9:59 pm, , , , Made this last night using my new Air Fryer – all I can say is WOW! I cannot wait to get home from work to eat the leftovers!  🙂  What a delicious way to eat broccoli! I’m sure this would be an amazing coating for Brussels sprouts and tofu as well. Can’t wait to experiment. Thanks for the awesome vegan recipe – I really love your stuff, I have made at least half a dozen of your recipes and they were all winners!, , , Reply, , , , , , , , Marlene, , , January 4, 2019 at 7:15 pm, , , , Hi Lauren. Oh wow. Thank you!!! I made these for an all-vegan New year’s Eve dinner and they were a HUGE hit. Seriously delicious! I only wish I had saved this dish for last because nothing afterwards quite measured up to it.  My suggestion to anyone planning to make this, is to double the bang bang sauce and set it aside because it’s awesome and everyone was hunting around for more., I just have one question: my dish came out looking just like the thumbnail image for your video but in the photos there’s bright red specks of something and visually it looks really awesome. What may I ask is that bright red?, Anyway, thanks again for this recipe… AND for your blog because I made the birthday cinnamon rolls too and they were OMG  outstanding!, , , Reply, , , , , , , , Marlene, , , May 19, 2019 at 3:29 pm, , , , Just made this recipe again and want to mention that not only can you prepare this a day in advance ( keep the broccoli in the batter mix and bread before frying ), but that it also reheats really well the next day! This dish is the perfect (vegan) appetizer for any party!, PS I’ve think the bright red flecks I mentioned in my previous comment, come from chili sauce. This recipe doesn’t call for chili sauce but I served it and chili oil on the side for those who wanted more heat. Both were also great with this dish., , , Reply, , , , , , , , , , lillian, , , March 8, 2019 at 3:00 am, , , , I just made these baked and they came out bang bang!  What a great recipe., , , Reply, , , , , , , , Sarah Tomatoe, , , March 14, 2019 at 4:56 pm, , , , I’ve been saving this recipe in my bookmarks for a while, so I tried it out today and man! This is an amazing recipe! Thanks so much. I oven baked mine, and it turned out great 👍🏽, , , Reply, , , , , , , , Haizel, , , March 18, 2019 at 12:00 am, , , , Just made this and bang bang broccoli is bangin’! It’s just the right amount of crunchy and spicy. The flavors are so yummy. Thanks for a great recipe!, , , Reply, , , , , , , , Cindy Boston-Brown, , , April 16, 2019 at 11:24 pm, , , , Just made these. Baked. Sprayed with olive oil spray beforehand to encourage browning.  Baked for 20 minutes then flipped them to crisp up the other side.  Baked for an additional 3-4 minutes. Wow! Fabulous!  Flipping them is key to get all around browning. Will be making these again …and again!, , , Reply, , , , , , , , Kate I, , , June 24, 2019 at 11:43 pm, , , , My family loves this recipe! I swap cornstarch for arrowroot, all purpose flour with almond flour, and agave with honey. There is never any leftovers and they hover the dish while I’m still cooking. Thanks so much for sharing!, , , Reply, , , , , , , , Danyelle Marie Doldoorian, , , September 17, 2019 at 12:28 am, , , , This was sooo good!  We used soy milk and Frank’s Red Hot and it was bomb.  We also added ghost pepper sauce into the batter to add some more extra heat and it was delicious.  Can’t wait to make for my friends and family!, , , Reply, , , , , , , , Lauren, , , October 4, 2019 at 8:50 pm, , , , Just made this and it was so delicious! I drizzled 1 tbsp of avocado oil over it and sprayed it with oil, then put it in my air fryer at 360 for 15 minutes. So good! And the sauce makes it., , , Reply, , , , , , , , Lisa Shields, , , November 5, 2019 at 12:53 am, , , , Amazing recipe! Used soy milk and Thai garlic chili paste. Sprinkled fresh chives, basil and oregano as a garnish! Air fryer temp 360 for 14 minutes., , , Reply, , , , , , , , , , Matt, , , January 4, 2020 at 11:29 pm, , , , We just made this and it was incredible!!! 😍😍, , , Reply, , , , , , , , Carey, , , January 12, 2020 at 10:06 pm, , , , I made this tonight and it was really good.  I used honey and I did half broccoli and half cauliflower. I baked it and I didn’t spray with oil. It was a little chewy, thought maybe it was because I didn’t use oil???? But it was still delicious., , , Reply, , , , , , , , Amanda, , , January 27, 2020 at 7:24 pm, , , , , , Reply, , , , , , , , Vegetable Recipes – Danica De La Mora, , says:, , , , September 16, 2018 at 5:13 am, , , , , […] Bang Bang Broccoli Broccoli & Mushrooms in Garlic Black Bean Sauce* […], , , Reply, , , , , , , , 31 Lip-smacking Light Vegan Recipes | Tasted Recipes, , says:, , , , December 4, 2018 at 6:13 am, , , , , […] 1. Bang Bang Broccoli […], , , Reply, , , , , , , , 23 soul-fulfilling Plant-based food recipes - Healthy lifestyle, , says:, , , , December 4, 2018 at 11:38 am, , , , , […] Recipe:, http://www.rabbitandwolves.com, […], , , Reply, , , , , , , , Vegan Ramen with Fried Broccoli | Our Vegan Revolution, , says:, , , , February 4, 2019 at 6:41 pm, , , , , […] to the broth. When it comes to the toppings, I wanted to opt for veggies instead of tofu, so I made this deep fried broccoli to add to the broth. I also went with bamboo shoots, spring onions, parsley and black sesame as […], , , Reply, , , , , , , , Vegan General Tso's Broccoli - Rabbit and Wolves, , says:, , , , March 13, 2019 at 9:00 pm, , , , , […] you tried my Bang Bang Broccoli? It is my most popular recipe, and there is a reason. Frying broccoli is the shit, that’s […], , , Reply, , , , , , , , 30 Indulgent Comfort Foods With No Meat Or Dairy - Angle News, , says:, , , , April 12, 2019 at 12:25 pm, , , , , […] 3. Bang Bang Broccoli […], , , Reply, , , , , , , , 4 Easy, Plant-Based Meals I Always Make For Non-Vegan Dinner Guests, , says:, , , , June 18, 2019 at 1:29 pm, , , , , […] Bang bang broccoli […], , , Reply, , , , , , , , 23 SOUL-FULFILLING PLANT-BASED FOOD RECIPES - Kalomy, , says:, , , , July 28, 2019 at 11:58 am, , , , , […] Recipe: www.rabbitandwolves.com […], , , Reply, , , , , , , , 42 Comfort Food Recipes With No Meat Or Dairy - 2019, , says:, , , , August 8, 2019 at 5:36 pm, , , , , […] via rabbitandwolves.com […], , , Reply, , , , , , , , 32 Best Broccoli Recipes | Healthy Vegetable Side Dishes, , says:, , , , January 20, 2020 at 1:54 pm, , , , , […] rabbitandwolves […], , , Reply, , , , , , , , 10 Plant-based foods to boost your immune system – Powerpeas, , says:, , , , March 20, 2020 at 1:46 pm, , , , , […] and minerals. Don’t like broccoli? Swap it with kale, cauliflower or brussels sprouts. Try my favourite broccoli recipe if you need some […], , , Reply, , , , , , , , 100's Of Vegan And Vegetarian Recipes You Will Ever Need, , says:, , , , March 24, 2020 at 2:12 am, , , , , […] Vegan Bang Bang Broccoli […], , , Reply, , , , , , , , Vegan Broccoli Recipes: 9+ Broccoli Meals to Try! - Healthify, , says:, , , , May 23, 2020 at 4:00 pm, , , , , […] Get it here: Rabbit & Wolves […], , , Reply, , , , , , , , The Only 12 Broccoli Recipes You’ll Ever Need – My Simple Mom, , says:, , , , June 9, 2020 at 4:11 am, , , , , […] Vegan Bang Bang Broccoli from Rabbit and […], , , Reply, , , , , , , , The 9 best recipe blogs every vegan should follow | The Vegan Review, , says:, , , , August 4, 2020 at 8:31 am, , , , , […] Our favourite vegan recipe: Vegan Bang Bang Broccoli […], , , Reply, , , , , , , , 16 Healthy Vegan Broccoli Recipes - Healthier Info, , says:, , , , October 16, 2020 at 12:35 pm, , , , , […] Get Recipe […], , , Reply, , , , , , , , Santa Approved These 76 Christmas Side Dishes - Lean Actualy, , says:, , , , November 7, 2020 at 1:19 pm, , , , , […] 34. Vegan bang bang broccoli […], , , Reply, , , , , , , , Oyster Mushroom Vegan Milanese - Rabbit and Wolves, , says:, , , , August 14, 2022 at 9:00 am, , , , , […] You can serve this vegan Milanese with all kinds of sauces on top if you want. The mushrooms are delicious with pesto or balsamic vinaigrette as well as the lemon vinaigrette. However, the mushrooms are so flavorful, you can serve them on their own or with just a salad or pasta! This recipe takes less than 30 minutes and is incredible! If you love fried veggies, try my Vegan Bang Bang Broccoli! […], , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , , , Δ, , , Primary Sidebar, , , , Hi, I'm Lauren!, Welcome to the magical land of delightful vegan comfort food. I'm the Creatrix of Rabbit & Wolves and I'm thrilled to have you here., , More about me →, , , SUBSCRIBE TO OUR NEWSLETTER, , , Popular Recipes, , Vegan Banana Split Cookies, Incredible Vegan French Onion Garlic Bread, The Best Vegan Gnocchi with Creamy Pesto and Crispy Tofu, The Best Vegan Lasagna Primavera, , , see more, freebies, →, , , © Lauren Hartmann and Rabbit and Wolves, 2021. Unauthorized use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Lauren Hartmann and Rabbit and Wolves with appropriate and specific direction to the original content., , , , Footer, Search, , Footer, , ↑ back to top, , , , About, , Privacy Policy, , , , Newsletter, , Sign Up!, for emails and updates, , , , FAQ, , FAQ, , , , As an Amazon Associate I earn from qualifying purchases., , , Copyright © 2025 Rabbit and Wolves on the, Foodie Pro Theme, , , , , ,",
        "Sweet Chili Tofu Balls": "Ingredients: , 1x, 2x, 3x, Sweet Chili Sauce, 1/4, , cup, , water, , plus 1-2 tbsp more to adjust consistency, 1, , tbsp, , Gochujang, , or Korean chili paste, 2, , tbsp, , tomato ketchup, 1, , tbsp, , sesame oil, 1, , tsp, , sesame seeds, 1, , tbsp, , sugar, 1, , tbsp, , rice vinegar, , or regular white vinegar, Tofu Balls, 1, , tbsp, , oil, 2, , cloves, , garlic, , minced, 15, , pieces, , air fried tofu balls, , (see homemade, recipe here, or use meatballs of your choice), For Serving, Chopped green onions or scallions, , for topping, Sesame seeds, , for topping, Steamed rice, , Heat a large pan over medium heat. Add the oil. Saute the garlic until aromatic and lightly brown. Add in the sauce and leave to simmer over medium until it boils and slowly thickens. Add the tofu balls. Mix the tofu balls in the sauce., If desired, you can thin out the glaze if you want it a bit runnier by adding 1-2 tbsp more water., Leave to cook for 1-2 minutes until the meatballs are completely coated in the sauce., Turn off the heat. Top with more green onions and sesame seeds, if desired. Serve and enjoy with rice or noodles., , WATCH Video, , , NUTRITIONAL INFO, Serving:, 1, serving, |, Calories:, 352, kcal, |, Carbohydrates:, 18, g, |, Protein:, 19, g, |, Fat:, 23, g, |, Saturated Fat:, 3, g, |, Polyunsaturated Fat:, 11, g, |, Monounsaturated Fat:, 10, g, |, Trans Fat:, 1, g, |, Sodium:, 149, mg, |, Potassium:, 94, mg, |, Fiber:, 2, g, |, Sugar:, 11, g, |, Vitamin A:, 93, IU, |, Vitamin C:, 3, mg, |, Calcium:, 271, mg, |, Iron:, 3, mg, , , , DID YOU MAKE THIS RECIPE?, Please leave a rating or comment and share a photo on, Instagram,, and tag me @thefoodietakesflight or use #thefoodietakesflight 🙂, , You can pin this image:, , , , , , , , , , , , , , , , This Post Has 19 Comments, , , , , , , , , Robin, , , March 12, 2022, , Reply, , , , , , , These look amazing!  I’m making them today – just took my tofu out of the freezer to thaw.  Can you tell me where to find those chopsticks you use in the video?  They look like they’re really good quality., , , , , , , , , , , , Jeeca, , , March 14, 2022, , Reply, , , , , , , The chopsticks I used came from the container I had and it was a gift 😅there are probably similar ones online. And i hope you enjoyed your tofu balls!, , , , , , , , , , , , , , Rinnie, , , March 13, 2022, , Reply, , , , , , , I baked mine and it was so good especially with the sweet chili sauce., , The sweet chili sauce is also perfect for pasta night. Defo one of my go to meals in the future., , Thanks for making this recipe. It is so simple and good. 😭❤️, , , , , , , , , , , , Keerthana, , , July 11, 2022, , Reply, , , , , , , Okay wow! This was sooo good.I added pre-fried tofu from the asian store and some soy sauce for a darker color and boom it was amazing! So simple too! Thanks a bunch! 🙂, , , , , , , , , , , , Jeeca, , , July 12, 2022, , Reply, , , , , , , That’s a great idea!! And glad you liked it! Thanks Keerthana  ◡̈, , , , , , , , , , , , , , Ms. CC, , , October 22, 2022, , Reply, , , , , , , This was so simple to make…and tasty! I’ve been looking for a “not meat” ball recipe and this is it! I’ve tried with lentils and me and lentils do not get along. Thanks for this wonderful recipe. Even my husband who isn’t a fan of tofu really enjoyed this recipe., , , , , , , , , , , , Jeeca, , , October 23, 2022, , Reply, , , , , , , Glad you guys enjoyed it  ◡̈ thanks so much!!, , , , , , , , , , , , , , Robert, , , August 28, 2023, , Reply, , , , , , , What’s holding the round shape 🤔? Please do tell thank you, , , , , , , , , , , , Jeeca, , , August 29, 2023, , Reply, , , , , , , Hi Robert! The tofu balls are made form a mix of tofu and flour. The flour absorbs some of the moisture and helps keep the shape of the balls. H ◡̈, , , , , , , , , , , , , , Sue K, , , , December 9, 2023, , Reply, , , , , , , I made the sweet chili tofu balls for a party. Will these be ok if I keep them in a crockpot in the sauce to stay warm?, , , , , , , , , , , , Jeeca, , , December 10, 2023, , Reply, , , , , , , Hi Sue! These should be good to keep them warm, but do note that they can become very soggy and break apart faster since there’s that extra moisture from the steam that’ll be trapped in the pot. Another good option would be to keep the sauce in the crockpot and keep the balls in a separate container – then your guests can just pour the sauce depending on the number number of tofu balls they get. Hope this helps!  ◡̈, , , , , , , , , , , , , , Marjan, , , , March 5, 2024, , Reply, , , , , , , The best vegan dish I’ve made so far 😋 thank you for the recipe!, , , , , , , , , , , , Jeeca, , , March 5, 2024, , Reply, , , , , , , Thank you Marjan! Appreciate this a lot 🙂, , , , , , , , , , , , , , Tanya, , , May 14, 2024, , Reply, , , , , ,  Instructions: , , , , , , , , , , , , Jeeca, , , May 17, 2024, , Reply, , , , , , , Hi Tanya, this recipe is for the sauce. The main air fryer tofu balls recipe is here –, https://thefoodietakesflight.com/air-fried-tofu-balls/, 🙂, , , , , , , , , , , , , , Ronny, , , August 10, 2024, , Reply, , , , , , , These look so good and I’ll be making them this week. Can I ask, are they ok to reheat? I’m thinking of taking them to work for lunch. Thank you, , , , , , , , , , , , Jeeca, , , August 12, 2024, , Reply, , , , , , , Hey Ronny! Yes these store really well! I like to just reheat them in the microwave or in a small oven/air-fryer if you have access to that in your lunch spot 🙂, , , , , , , , , , , , , , Diana, , , February 26, 2025, , Reply, , , , , , , This is one of my favourite recipes for the vegetarians in my family. It is simple to make and really delicious. Thank you!, , , , , , , , , , , , Jeeca, , , March 9, 2025, , Reply, , , , , , , Yay, so glad you like it! 🙂, , , , , , , , , , , , 5 from 11 votes (, 6 ratings without comment, ), , , , Leave a Reply, Cancel reply, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, Enter your name or username to comment, , Enter your email address to comment, , Enter your website URL (optional), , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Hello there!, , , , , , I’m Jeeca, a food content creator and recipe developer passionate about creating easy yet tasty and flavour-packed vegan recipes. I share a lot of Asian recipes inspired by my travels and those I grew up enjoying., , , , , , , , , , , , , ​\nMORE ABOUT TFTF >, , , , , , , , , , , , , , MY COOKBOOK, , , , , , , , , , , , , , , , , , , , , Subscribe for recipes and updates, , , , , , , , , , , , , , , , , First name or full name, , , Email, , , , , , , , , , , , , , , , , , , Search for a recipe:, , , , , , , , , Search, , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Prev, Air-Fried Tofu Balls￼, , , , , , , Lemongrass Tofu, Next, , , , , , , , , , , , , , , , Latest Recipes, , , , , , , , , , , , , 15 Delicious Tofu Recipes You Need To Try!, , , GET THE RECIPE », , , , , , , , , , Vietnamese-Inspired Tomato Noodle Soup, , , GET THE RECIPE », , , , , , , , , , Mushroom and Tofu Patties with Garlic Sauce, , , GET THE RECIPE », , , , , , , , , , Easy Stir-Fried Rice Noodles, , , GET THE RECIPE », , , , , , , , , , Braised Mushrooms and Tofu with Soy, Ginger, and Garlic, , , GET THE RECIPE », , , , , , , , , , Mushroom Freekeh Bowl with Chili Lime Tahini Dressing, , , GET THE RECIPE », , , , , , , Page, 1, , Page, 2, , Page, 3, , …, , Page, 10, , , , , , , , , , , , , , , , , , Search, , , , Search, , , , , , , , , , , , , , , , , , , , , , , , , , RECIPES, , , , , , SHOP MY ESSENTIALS, , , , , , ABOUT, , , , , , COOKBOOKS, , , , , , , , , , , , , , FOLLOW ME ON SOCIAL MEDIA:, , , , , , , , , Youtube, , , , , , , Facebook, , , , , , , Instagram, , , , , , , Pinterest, , , , , , , Tiktok, , , , , , , , , , , , , , , , , , PRIVACY POLICY, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 19658, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , ,"
    }
}