{
    "ingredients": {
        "Aloo Paratha": "coriander,flour,ginger,methi,potato,whole wheat flour,",
        "Aloo Methi Parathas": "coriander,dahi,flour,ginger,methi,potato,whole wheat flour,",
        "Aloo Methi Paratha": "coriander,flour,garlic,methi,potato,whole wheat flour,",
        "Aloo Palak Paratha": "whole wheat flour,potato,spinach",
        "Aloo Cheese Paratha": "coriander,flour,ginger,onion,potato,whole wheat flour,",
        "Aloo Kulcha": "flour,curd,milk,potato",
        "Pudina Aloo Paratha": "whole wheat flour,potato,mint",
        "Aloo Roti": "aloo,coriander,flour,ginger,methi,potato,",
        "Garlic Aloo Roti": "potato,flour,coriander,baking powder,garlic,green chili,butter"
    },
    "recipe_url": {
        "Aloo Paratha": "https://www.indianhealthyrecipes.com/aloo-paratha/",
        "Aloo Methi Parathas": "https://www.tarladalal.com/aloo-methi-parathas-4776r",
        "Aloo Methi Paratha": "https://www.indianhealthyrecipes.com/aloo-methi-paratha/",
        "Aloo Palak Paratha": "https://www.manjulaskitchen.com/aloo-palak-paratha/",
        "Aloo Cheese Paratha": "https://hebbarskitchen.com/aloo-cheese-paratha-recipe/",
        "Aloo Kulcha": "https://rakskitchen.net/aloo-kulcha-recipe-indian-flatbread/",
        "Pudina Aloo Paratha": "https://www.bawarchi.com/recipe/pudina-aloo-paratha-oesswddhegabi.html",
        "Aloo Roti": "https://hebbarskitchen.com/aloo-roti-recipe-potato-roti-recipe/",
        "Garlic Aloo Roti": "https://www.pinterest.co.uk/pin/496592296426636416/"
    },
    "Recipe": {
        "Aloo Paratha": "Ingredients: , Potatoes, : Choosing the right kind of potatoes to make these parathas is very important. Some kind of potatoes turn too mushy and sticky after boiling. Avoid using such potatoes. Avoid using newly harvested potatoes. Old potatoes, Yukon Gold & Russet are suitable for parathas., , Spices, : Most people make aloo paratha with minimal spices like cumin, coriander powder and red chilli powder. The combination of spices I have used here makes the parathas so flavorful that your home will be filled with a delicate aroma while frying., , However if you do not have or don’t prefer any particular spice, then you can simply skip it. You can also increase or decrease the spices to suit your taste., , Ghee, : Aloo parathas are pan fried mostly with a generous amount of ghee as it imparts that smoky aroma and flaky texture. If you do not eat ghee then use any regular oil., , Variations, , 1.You can also temper the spices before adding to the mashed potatoes. To do this, heat 1 tbsp oil or ghee in a small pan. Add ginger and green chilies. Saute for 30 seconds and then add all the spice powders and salt. Turn off and add this to the mashed potatoes., , Even without the tempering the aloo parathas will be great as the stuffing gets steam cooked while frying., , 2. Some people also add onions to the stuffing. They are added raw or sauteed in oil until they lose the raw smell., , , Related Recipes, , Gobi Paratha Reci..., , , Chapati Recipe (I..., , , Paratha Recipe, , , Palak Paratha (Sp..., , , Methi Paratha Rec..., , , Paneer Paratha Re..., , , , , Recipe Card, , , , , , Aloo Paratha Recipe | Potato Stuffed Paratha, , , 5, from, 203, votes, , , , These stuffed parathas are made with spiced potato filling. Known as aloo paratha, these flatbreads are simply delicious and make a great meal. Serve them topped with butter alongside plain yogurt, mint chutney or pickle., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 20, minutes, , minutes, Cook Time, 25, minutes, , minutes, Total Time, 45, minutes, , minutes, , Servings, 8, , Author, Swasthi, , , , For dough, ▢, 2, , cups, , whole wheat flour, , (240 grams) (atta), ▢, ¼, , teaspoon, , salt, ▢, 1, , tablespoon, , oil, , (optional, refer notes), ▢, water, , as needed for kneading (I used ¾ cup + 2 tbsps), For filling, ▢, 350, , grams, , potatoes, , (3 medium potatoes), ▢, 1, , green chilli, , chopped (optional), ▢, ¾, , teaspoon, , grated ginger, , (or ¼ tsp ginger powder), ▢, 2, , tablespoons, , coriander leaves, , (very fine chopped), ▢, ½, , teaspoon, , salt, , (adjust to taste), ▢, ½ to ¾, , teaspoon, , garam masala, , (adjust to taste), ▢, ½, , teaspoon, , kashmiri red chilli powder, , (adjust to taste), ▢, ¾ to 1, , teaspoon, , coriander powder, ▢, ½, , teaspoon, , chaat masala, , (or 1 tbsp lemon juice or ½ tsp amchur), ▢, 1, , teaspoon, , kasuri methi, , (dried fenugreek leaves), ▢, ¼, , teaspoon, , ajwain, , (carom seeds) (optional), ▢, ½, , teaspoon, , fennel seeds powder, , (saunf powder) (optional), To pan fry, ▢, 4, , tablespoons, , ghee, , (use as per preference), , ▢, ▢, Divide the aloo stuffing to 8 parts. Also divide the dough to 8 parts. Keep the dough covered., How to Make Aloo Paratha, ▢, Roll a dough ball in your palms to smooth. Lightly sprinkle some flour on the rolling area. Flatten the dough ball and dip it in some flour., ▢ Instructions: , I have shared 3 ways to roll the parathas (pics below). Take a look first to see which one looks easier to you., , 8. Sprinkle little flour on the rolling area. Smoothen a dough ball and dip it in flour. Flatten it and roll to a 4 inch round roti/disc., , , , 9. Place a spiced potato ball in the center and bring the sides up., , , , 10. Press down the stuffing to the center and bring the sides higher giving it a cup shape. If the aloo stuffing is sticky, then smear your fingers generously with some flour., , , , 11. Bring the sides higher by simply rotating the whole thing on your hand in clock-wise direction. The dough gets stretched by itself and comes over the stuffing. (check video), , , , 12. Repeat this step of pushing the aloo inside and bringing the sides higher by rotating until the edges come over to the top., , , , 13. Join all the edges well to ensure no filling is visible. I do not remove any excess dough, instead press it down back to the ball., , , , 14. Dip this ball in flour on both the sides and gently flatten it with your fingers. This is very important so the filling is evenly spread all over the paratha., , , , 15. Place the sealed side down on the rolling area and gently roll it evenly without putting pressure. Do not roll the aloo paratha continuously. Instead rotate in clock-wise direction a little after every 4 to 6 rolls to ensure it does not tear or get stuck., , You can make as thin or thick you like. I make mine thin and about 8 to 9 inches. If you see the filling coming out while rolling, then apply some flour there. Sprinkle flour only as needed and avoid using excess., , , , , I had shot these pictures in 2015 but never got to share it on the blog. The stuffing I made here is by tempering the spices in oil first and then I added it to the mashed potatoes. It is on the hotter side with more chilli powder., , Place the aloo stuffing in a 5 inch roti. Then make pleats and bring all the edges on top. Gently join them and pinch off the excess dough. Flatten slightly and dip in flour. Flatten it again to a 4 inch disc with your fingers to spread the filling evenly. Then roll it to as big as you can., , , , , you will be able to make only 6 large parathas. So divide the dough to 12 and stuffing to 6 parts., , , , Fry Aloo Paratha, , 16. After you are done rolling 3 to 4 paranthas, heat a griddle on a medium high flame. When the pan is hot enough, dust off excess flour from the aloo paratha & gently transfer it to the griddle. Within 2 minutes, you will see bubbles. Turn it to the other side., , , , 17. Press down gently with a spatula. You will see the aloo paratha begins to puff. Drizzle some ghee or oil. I add about 1 teaspoon ghee., , , , 18. Turn it to & fro to the other side and drizzle more ghee. Cook pressing down on the edges with a spatula so they cook well. Well-cooked parathas will leave your entire house filled with a great aroma. When you see golden to light brown spots on the aloo paratha, remove to a plate., , , , 19. To fry the next one, ensure the pan is hot enough and not extremely hot. Keep regulating the flame to medium or low as needed so the parathas don’t burn. Place a clean cloth in a container or arrange a cooling rack & Stack the parathas to keep them moist., , Serve Aloo Paratha with pickle or yogurt. You can also top your parathas with butter. We love them with this, Mint chutney, or Cilantro /, coriander chutney, ., , , , Pro Tips, , Firstly boiling potatoes, the right way is the key to make the best aloo parathas. Boil them just until fork tender, meaning they are just cooked and not overcooked. Soggy potatoes will make a sticky and very moist stuffing which is not good to make parathas., , Mashing or grating potatoes, properly is also very important. There should be no chunks of potatoes left in the mash as they will tear the parathas. Do not over mash to the extent they become pasty. So you can also grate them rather than mashing to avoid pasty texture., , Stuffing the parathas, , Flattening and spreading the stuffing, after sealing the spiced aloo in the dough is what makes the aloo paratha perfect. This avoids the parathas from tearing and spreads the filling evenly., , Lastly frying parathas, on a low heat will make them hard. Cook them on a moderately medium high heat so they cook well. Also regulating the flame as needed is very important so they don’t burn., , , , Preparation, ▢, Boil potatoes just until fork tender without making them mushy. To pressure cook in traditional cooker, cook for 3 to 4 whistles depending on the size of potatoes. In instant pot I pressure cooked for 5 mins since I used medium sized potatoes., ▢, While the potatoes boil, make the dough. Add flour,oil and salt to a bowl. Pour half cup water and begin to mix to form a dough. Pour more water as needed and make a soft yet non-sticky dough., ▢, Knead it well until soft & pliable. If you press down the dough with your finger, it should dent easily meaning it is soft enough. Cover and rest until the filling is ready., ▢, When the potatoes are done, cool them slightly and peel while still warm. Ensure your boiled potatoes are not mushy or soggy., ▢, Grate or mash them well until no bits of potatoes remain. Using your fingers break any chunks of potatoes left in the mash otherwise they will tear the parathas. Also do not over mash it as the potatoes will turn pasty and sticky., ▢, Add ginger, green chilies, coriander leaves, salt, red chilli powder, garam masala, coriander powder, kasuri methi and chaat masala. Crush the kasuri methi before adding., ▢, Optional, – Dust off the excess & roll it to a 4 inch disc or roti. Place a portion of aloo stuffing in the center. Gently bring the sides of the roti up shaping like a cup. Repeat the steps of pushing the stuffing inside with your finger and bringing the dough up until the edges come over the stuffing. (Refer video)., ▢, If the stuffing is sticky, dip your fingers in flour. Bring the edges together over the stuffing and join them to seal carefully. (Refer step-by-step photo or video)., ▢, – Roll a 5 inch roti and place the stuffing in the center, hold the edges and make small pleats. Bring all of them on top and join them together to seal the stuffing. Remove the excess dough on top., ▢, Dip the stuffed ball in flour and flatten it gently to spread the stuffing evenly. This ensures the stuffing does not come out at all. Dust off the excess., ▢, Sprinkle some flour on the rolling area ., ▢, Place the paratha disc on the rolling area with the sealed side down. Begin to roll evenly all over without putting pressure., ▢, Do not roll the aloo paratha continuously. Instead rotate in clock-wise direction a little after every 4 to 6 rolls to ensure it does not tear or get stuck. Sprinkle flour as needed and avoid using excess. If you see the stuffing coming out, gently apply some flour to seal it., ▢, Roll the aloo paratha as thin or thick you like without tearing them. I roll mine to 8 to 9 inches., ▢, Transfer the rolled ones to a dry area. Once you are done with 3 you can begin to fry them., ▢, you will be able to make only 6 large parathas. So divide the dough to 12 and stuffing to 6 parts. Roll 2 rotis of 6 inches each. Spread the aloo mixture on one of the roti. Wet the edges with little water. Place the other roti on top of it. Press down gently on the sides to seal both the rotis. Then sprinkle flour and roll it evenly as thin as you want., Frying, ▢, Heat a pan or griddle to cook the aloo parathas. The griddle should be hot enough otherwise the parathas will turn hard,, ▢, When the pan is hot, gently transfer a rolled aloo paratha to it., ▢, With in 2 to 3 mins, you will see bubbles over it. Then flip it to the other side and cook., ▢, You will see the aloo paratha puffs and cooks well. Drizzle ghee or oil all over and flip it to the other side and cook., ▢, Smear some ghee on this side as well and press down the edges to cook thoroughly., ▢, Soon you will see golden to light brown spots on the aloo parathas. Remove to a plate and stack them. This keeps them soft., ▢, Top aloo paratha with some butter and serve with pickle or yogurt. This, coriander chutney, or, mint chutney, also go well., , , Notes, , Adjust the amount of spices and herbs to suit your liking., , Avoid using too much flour while rolling as it makes the parathas hard and dry., Roll the parathas evenly without putting pressure in one place., , For variation you can use store bought grated paneer or steamed carrots and peas. Ensure you mash the veggies very well., , You can also saute little methi leaves or spinach leaves until they wilt. Cool and add them to the mashed potato mixture. Also use only the leaves and not stalks of these greens., , Avoid using new potatoes. Old potatoes are best for this recipe. Boil potatoes just until fork tender and don’t overcook. We don’t want soggy potatoes soaked up in excess moisture., , Grate or mash potatoes well until you see no bits of potatoes in them. But do not over mash to the extent they become pasty and sticky., , After sealing aloo in the dough, do not forget to flatten and spread the stuffing. This way the stuffing is well distributed and won’t come out while rolling., , Do not fry parathas on a low heat. Fry them on a moderately high flame. Keep adjusting the flame while you fry them so you don’t burn the aloo parathas., , , , Video, Watch Aloo Paratha Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Aloo Paratha Recipe | Potato Stuffed Paratha, , , Amount Per Serving, , , Calories, 189, , Calories from Fat 90, , , , , % Daily Value*, , , Fat, 10g, 15%, Saturated Fat 5g, 31%, Cholesterol, 19mg, 6%, Sodium, 239mg, 10%, Potassium, 131mg, 4%, Carbohydrates, 22g, 7%, Fiber 4g, 17%, Sugar 1g, 1%, Protein, 4g, 8%, , , Vitamin A, 29IU, 1%, Vitamin C, 4mg, 5%, Calcium, 18mg, 2%, Iron, 1mg, 6%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 10.7K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 203 votes (, 154 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 120, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Jyothi, , , , , , March 26, 2025 5:40 pm, , , , , , I followed the recipe and got delicious aloo parathas. I also fried little fresh methi leaves in little ghee and included to the aloo mixture. Unique, healthy and delicious. Thank you Swasthi, , , , , , Reply, , , , , , , , , , , Amrita, , , , , , March 21, 2025 4:16 pm, , , , , , My kids love all kinds of parathas and these aloo paratha are their favorite. Thank you for teaching me how to make them easily. Now mine are perfectly shaped and so good like yours., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Amrita, , , , March 26, 2025 5:33 pm, , , , , , Happy to read that Amrita. Thank you for letting me know, , , , , , Reply, , , , , , , , , , , Ten, , , , , , January 31, 2025 2:07 am, , , , , , I used half whole wheat & half all purpose flour for the dough. For the filling I used lemon juice instead of chaat masala per recipe & didn’t use kasurimethi, ajwuin and funnel seeds as I don’t have those in my pantry. Regard less it came out really good. My 3 year old said “it’s yummy” and that’s all matters to me 🙂, , , , , , Reply, , , , , , , , , , , Sangita, , , , , , November 8, 2024 7:30 pm, , , , , , Does the dough need to be firm or the same as chapatti dough?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sangita, , , , November 9, 2024 2:23 am, , , , , , Soft, like chapati dough. Take a look at the video where I show the texture, , , , , , Reply, , , , , , , , , , , , , , Sangita, , , , , , Reply to, swasthi, , , , November 9, 2024 1:05 pm, , , , , , Thank you, they were really nice 😊, , , , , , Reply, , , , , , , , , , , Mira, , , , , , November 7, 2024 6:54 pm, , , , , , Do we need to soak the methi leaves first or can we add them in dry?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Mira, , , , November 8, 2024 2:35 am, , , , , , Add it dry, , , , , , Reply, , , , , , , , , , , Himanshi, , , , , , October 27, 2024 10:02 pm, , , , , , Nice recipe 😋, , , , , , Reply, , , , , , , , , , , Viraja Bantwal-Adur, , , , , , October 26, 2024 11:51 pm, , , , , , Flavorful and tasty. My go to site for all Indian recipes!, I used yellow potatoes and maybe I should not have. Probably Idaho or baking potatoes would have been better. My potatoes were over cooked and mushy. Even with 6 mins in instant pot. I had to add some potato starch to thicken it up. But didn’t help much.  Had trouble rolling them but managed after all!, Thanks for all the recipes… each and everyone comes out absolutely YUM!, , , , , , Reply, , , , , , , , , , , Nisha, , , , , , August 8, 2024 8:54 am, , , , , , Thank you for having such awesome recipes! Your attention to detail is so appreciated! Do you have any tips on how to freeze already made parathas?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Nisha, , , , August 8, 2024 9:01 am, , , , , , Thank you Nisha. Cool them completely on a wire rack and place them in between parchment papers. Place in a air tight container or plastic bag., , , , , , Reply, , , , , , , , , , , D jean, , , , , , August 6, 2024 9:57 pm, , , , , , I’m trying aloo paratha I love anything potatoes.love indian food thanks ever so much for sharing dj, , , , , , Reply, , , , , , , , , , , Elizabeth, , , , , , April 28, 2024 4:58 pm, , , , , , well let’s just say it wasn’t winning any beauty awards. The filling was delicious and saved how ugly they were ?, Thanks for the recipe!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Elizabeth, , , , April 28, 2024 5:11 pm, , , , , , Haha! So nice to hear that you were able to make them well at the first attempt. If you have not watched my video, I insist watching that. I have shown the easiest way to make beautiful parathas. It needs some practice but you can easily master that. Thanks for sharing back Elizabeth., , , , , , Reply, , , , , , , , , , , Ali Hamza, , , , , , April 19, 2024 6:32 am, , , , , , I just made these for my wife for breakfast and she absolutely loved it., Thanks., , , , , , Reply, , , , , , , , , , , Vanessa, , , , , , March 15, 2024 3:18 pm, , , , , , I was really excited to learn making aloo paratha and your recipe helped me. They came out so good, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Vanessa, , , , March 16, 2024 2:51 pm, , , , , , , , , , , Reply, , , , , , , , , , , Deepti, , , , , , December 18, 2023 1:44 am, , , , , , Delicious, authentic and a kids favorite healthy dish.., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Deepti, , , , December 30, 2023 2:06 pm, , , , , , Thanks Deepti, , , , , , Reply, , , , , , , , , , , sravani, , , , , , December 14, 2023 9:45 am, , , , , , I made this day before yesterday for dinner and my mom absolutely loved it. Thank you., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, sravani, , , , December 14, 2023 9:59 am, , , , , , Wow! That’s nice to know Sravani! You are welcome!, , , , , , Reply, , , , , , , , , , , shaheen, , , , , , October 14, 2023 2:01 pm, , , , , , Thanks for this aloo paratha recipe, , , , , , Reply, , , , , , , , , , , Ethan, , , , , , October 4, 2023 10:26 am, , , , , , I’m looking to make this for a large crowd of around 9 people. Some will eat a lot: What’s your recommendation of how many servings to cook? Or if you know approximately how many parathas is in one serving that would greatly help with planning., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ethan, , , , October 4, 2023 11:08 am, , , , , , Hi,, Most people will eat only 2 parathas if you have other dishes on the side like rice, curry or raita. But if you are making only these they will be able to eat 3 plus may be some raita and salad. I think 3x recipe should make enough – 24 parathas and I guess you will have other options like rice etc, , , , , , Reply, , , , , , , , , , , Jackie, , , , , , September 29, 2023 5:33 pm, , , , , , Hi, Swasthi, , I tried your Aloo Paratha recipe and it came out amazing., , Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Jackie, , , , September 30, 2023 2:38 am, , , , , , Hi Jackie,, That’s nice to know! Thank you, , , , , , Reply, , , , , , , , , , , treasa philipose, , , , , , August 3, 2023 11:34 pm, , , , , , nice, , , , , , Reply, , , , , , , , , , , Vijayalakshmi P C, , , , , , June 20, 2023 3:33 pm, , , , , , Hi Swasthi, I tried today and it came out very well. Kids loved it. “Rotate it clock wise direction after every 4 to 6 rolls” what a great tip! Thanks a ton., , , , , , Reply, , , , , , , , , , , Rupali, , , , , , March 31, 2023 2:27 am, , , , , , Thank you for this aloo paratha recipe. Added some paneer as suggested to another reader. They were the best., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rupali, , , , March 31, 2023 3:33 am, , , , , , Happy to know Rupali. Thanks for the comment, , , , , , Reply, , , , , , , , , , , Emma, , , , , , March 20, 2023 2:09 pm, , , , , , This is the first time I made aloo paratha. They turned out beautiful with delicious flavors. I’m never reverting back to the frozen stuff. Would adding some grated paneer work in this recipe? Please advice. Thank you for the amazing work! I’m loving it!!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Emma, , , , March 20, 2023 2:24 pm, , , , , , So glad to know Emma. Thank you so much. Yes you can add about ½ to ¾ cup of grated paneer. If you want you can increase the spice level or cut down the quantity of potatoes to keep the spice level same. Hope you like them too., , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Aloo Methi Parathas": "Ingredients: , , , , , , , , Aloo methi paratha, can be relished anytime of the day! Have this versatile paratha for breakfast, lunch, dinner or even as an evening snack. I pack, aloo methi paratha, for my kiddo s tiffin as it is tummy filling and satiating., Packed with excitement; that describes the, aloo methi parathas, best of all!, aloo methi paratha, are sumptuous whole wheat, parathas, stuffed with a delectable mixture of potatoes flavoured with fenugreek leaves, cumin seeds and spice powders, which makes them so tasty that they can be served straight and simple with just, curd, and, pickles, ., When the methi is sautéed, it sheds its bitterness, thereby imparting only its positive characteristics such as its strong aroma and unmistakable flavour to the, aloo methi paratha, . Indeed, this is a, main course, that will appeal to all!, Aloo methi parathas, would taste even better and finger licking when you smear, homemade safed makhan, over it and serve with a tall glass of, lassi, on the side., Enjoy, aloo methi paratha recipe | Punjabi aloo methi paratha | stuffed aloo methi paratha | aloo ka paratha |, with detailed step by step photos and video below., , , , , , , , Tags, , , , , Tava, , Indian Tawa, , Frozen Foods, Indian Freezer Recipes, , Frozen Foods Indian Paratha, , Indian Dinner, , Stuffed Paratha Recipes for Dinner, , Indian Lunch, , Lunch Paratha, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 15 Mins, , , , , , , Total Time, , 30 Mins, , , , , , , Makes, , 5 parathas, , , , , , , , , , , , , , , For The Dough, , , 1 cup, whole wheat flour (gehun ka atta), , , 1 tsp, oil, , , , salt, to taste, , , For The Aloo Methi Stuffing, , , 1 1/4 cups boiled and, mashed potatoes, , , 1 cup finely, chopped fenugreek leaves (methi), leaves, , 2 tbsp, oil, , , 1/2 tsp, cumin seeds (jeera), , , 2 tsp, ginger-green chilli paste, , , 1/2 tsp, turmeric powder (haldi), , , 1 tsp, coriander (dhania) powder, , , 1 tsp, chaat masala, , , , salt, to taste, , , , , , whole wheat flour (gehun ka atta), for rolling, , 6 tsp, oil, for cooking, , , For Serving With Aloo Methi Parathas, , , fresh, curd (dahi), , , , green chutney, , , , , , , Divide the dough into 5 equal portions and keep aside., For the methi aloo stuffing, , Heat the oil in a broad non-stick pan and add the cumin seeds., When the seeds crackle, add the fenugreek leaves and sauté on a medium flame for 2 minutes., Add the ginger-green chilli paste, turmeric powder, coriander powder, chaat masala and salt and sauté on a medium flame for a few seconds., Add the potatoes, mix well and cook on a medium flame for 1 to 2 minutes, while stirring occasionally., Divide the stuffing into 5 equal portions and keep aside., How to proceed to make aloo methi parathas, , To make, aloo methi parathas, , roll out one portion of the dough into a 100 mm. (4\") diameter circle using a little whole wheat flour for rolling., Place one portion of the aloo methi stuffing in the centre of the circle, bring together all the sides in the centre and seal tightly., Roll out again into a 150 mm. (6\") diameter circle, using a little whole wheat flour for rolling., Heat a non-stick tava (griddle) and cook the, aloo methi parathas, , using 1 tsp of oil, till golden brown spots appear on both the sides., Repeat steps 1 to 4 to make 4 more parathas., Serve the, aloo methi parathas, hot with fresh curds or pickle., , , , , , , , , , , , , , aloo methi paratha recipe | Punjabi aloo methi paratha | stuffed aloo methi paratha | aloo ka paratha | Video by Tarla Dalal, , , , , ×, , , , , , Aloo Methi Parathas recipe with step by step photos, , , , , , , , , , , , , , , , , , , Like Aloo Methi Paratha, , , , , , , , , , , Aloo Methi paratha, also known as, Methi Aloo Paratha, is a great kids tiffin box option., Paratha, or stuffed paratha are sumptuous Indian flat-breads that can be relished with curd, , pickle, , raita or even sabji. They can be as simple as the, plain paratha, or something as filling as the aloo, bhujiya paratha, or the, lifafa paneer paratha, . Below are some of my favorite stuffed paratha recipes that you can relish for, breakfast, or, lunch, :, , , , ?, , Aloo Gobi Ke Parathe, , ?, , Stuffed Potato and Green Peas Paratha, , ?, , Aloo Paratha, , , , , , , , , , , , , , , , , Dough for Aloo Methi Paratha, , , , , , , , , , For making the dough of, aloo methi paratha recipe | Punjabi aloo methi paratha | stuffed aloo methi paratha | methi aloo ka paratha |, in a deep bowl, take 1 cup whole wheat flour., , , , , , , , Add 1 tsp oil . Oil can be substituted with ghee or butter. The fat helps in making soft parathas., , , , , , , , Add salt to taste., , , , , , , , Gradually add water to form a dough. The quantity of water will depend upon the quality of flour. Knead into a soft dough using enough water. We have used approx. 5 tbsp of water. Always while making stuffed paratha knead the dough little soft so it is easy to roll the parathas., , , , , , , , Divide the dough into 5 equal portions and keep aside., , , , , , , , , , , , , , , , , , , , , For the Methi Aloo stuffing:, , , , , , , , , , For preparing the, aloo methi paratha | Punjabi aloo methi paratha | stuffed aloo methi paratha | methi aloo ka paratha |, stuffing, take a bunch of methi leaves., , , , , , , , Firstly, we will clean and wash the Methi Leaves and separate the leaves from the stems., , , , , , , , Now chop the methi leaves finely and keep aside., , , , , , , , To begin making the, aloo methi parathas, , heat the oil in a broad non-stick pan. Once the oil is hot, add the cumin seeds., , , , , , , , When the seeds crackle, add the fenugreek leaves. Fresh methi leaves tastes the best but, if you don’t have them then add kasuri methi or dried fenugreek leaves., , , , , , , , Sauté on a medium flame for 2 minutes., , , , , , , , Add the ginger-green chilli paste. You can also make use of finely chopped ginger-green chillies., , , , , , , , Add the turmeric powder and coriander powder., , , , , , , , Add the, chaat masala, . You can substitute it with, amchur powder, , , anardana powder, or lemon juice., , , , , , , , Add the salt, mix well and sauté on a medium flame for a few seconds., , , , , , , , Add the potatoes., , , , , , , , Mix well and cook on a medium flame for 1 to 2 minutes, while stirring occasionally., , , , , , , , Divide the stuffing into 5 equal portions and keep aside., , , , , , , , , , , , , , , , , , , , , How to make aloo methi paratha:, , , , , , , , , , To make the, methi aloo paratha, , take a portion of the dough and flatten them between the palms. Deep it in whole wheat flour nicely and remove the excess flour., , , , , , , , Roll out the dough into a 125 mm. (5\") diameter circle using a little whole wheat flour for rolling., , , , , , , , Place one portion of the aloo methi stuffing in the centre of the circle., , , , , , , , Bring together all the sides in the centre. Seal the dough ball tightly., , , , , , , , Roll out again into a 150 mm. (6\") diameter circle, using a little whole wheat flour for rolling. Roll it very lightly, if you press hard while rolling then the stuffing may come out from the sides of the paratha., , , , , , , , Place the stuffed, aloo methi paratha, gently on the hot tava. Cook one side of the paratha till you see small blisters on top of the paratha., , , , , , , , Flip the, Aloo Methi paratha, and cook a little. Drizzle 1 tsp oil around the paratha., , , , , , , , Flip the, Aloo Methi paratha, , press it lightly on the edges and cook the paratha well one one side., , , , , , , , Once the, aloo methi paratha, is cooked nicely on both sides, remove it on a plate., , , , , , , , Serve the, aloo methi parathas, , (methi aloo paratha), hot with fresh curds or pickle., , , , , , , , If you enjoyed this, aloo methi paratha | Punjabi aloo methi paratha | stuffed aloo methi paratha | methi aloo ka paratha |, then also try other, stuffed parathas, like, Gobhi Paneer Palak Parathas, , , Hare Mutter Ke Parathe, , , Methi Paneer Paratha, . Enjoy them for, lunch, or, dinner, smeared with a dollop of safed makhan., , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per paratha, Energy, 222 cal, Protein, 3.8 g, Carbohydrates, 24.4 g, Fiber, 4.1 g, Fat, 12.6 g, Cholesterol, 0 mg, Sodium, 12 mg, , , , , , , Click here to view, Calories for Aloo Methi Parathas, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Sofia Khaja-Peterson, , March 13, 2025, midnight, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like Aloo Methi Paratha, , , , , , , , , Dough for Aloo Methi Paratha, , , , , , , , , For the Methi Aloo stuffing:, , , , , , , , , How to make aloo methi paratha:, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , aloo methi paratha recipe | Punjabi aloo methi paratha | stuffed aloo methi paratha | aloo ka paratha |, with amazing 30 images., methi paratha recipe, is a Punjabi aloo methi paratha, supremely tasty variant to the very popular aloo paratha., stuffed aloo methi paratha, is made from aloo, methi, , , , For the dough, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! keep reviewing recipes and articles you loved., , , , , , , , , , , , , Foodie #648642, , March 13, 2025, midnight, , wonderful taste. tastes like a restaurant one., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , manisha, , March 13, 2025, midnight, , Yummyyyyy\nI added garam masala instead of chaat masala, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi Maisha. We are delighted you loved the paratha. Please keep posting your thoughts and feedback and good to see you make changes to the recipe. Happy Cooking., , , , , , , , , , , , , Foodie #542484, , March 13, 2025, midnight, , This came out very well, and it was the first time I tried it., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , n_katira, , March 13, 2025, midnight, , The stuffing is just amazing....All the spices blend just perfect...I served it with fresh curds sprinkled with chilli powder., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #637808, , March 13, 2025, midnight, , Love this recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks. Please continue to review recipes which you have made and loved from tarladalal.com It will help thousands of food lovers to try the recipe based on your review., , , , , , , , , , , , , Nihung Singh, , March 13, 2025, midnight, , Mouth watering.......Love this recipe., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks Nihung. Please continue to review recipes which you have made and loved from tarladalal.com, , , , , , , , , , , , , Lakshmi, , March 13, 2025, midnight, , Great one. Recipe explained very well. I tried it and it came out very well. Thank you so much., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi Lakshmi, we are delighted you loved the Aloo Methi Parathas  recipe and it came out perfectly. Well done! Please keep posting your thoughts and feedback and review recipes you have loved. Happy Cooking., , , , , , , , , , , , , Priya, , March 13, 2025, midnight, , Thank-you for doing the great work. I have tried your recipes time to time ,from paranthas to sabzis to starters like cheese corn balls. Must say you are a great cook. Thank-you ??, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi, Thank you for your kind words. Do try more and more recipes and let us know how you enjoyed them. Happy Cooking !!, , , , , , , , , , , , , Nivea, , March 13, 2025, midnight, , Tastes Amazing, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , We are very happy to know you have loved the recipe. Do try more and more recipes and let us know how they turned out. Happy Cooking !!, , , , , , , , , , , , , rushale mane, , March 13, 2025, midnight, , ?? ??? ?? ??? ???? ??? ????? ?????? ?? ?? ?????? ?? ????????? ?????? ???? ????? ????? ???, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Parul shroff, , March 13, 2025, midnight, , it has become one of the favorite dish of my family, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , spring onion paratha recipe | hara pyaz paratha | step by step |, , , 216 Calories, , , , , , , , , , , , , , , , , palak corn and cheese paratha recipe | corn spinach paratha | spinach cheese and corn paratha |, , , 179 Calories, , , , , , , , , , , , , , , , , Parathas, Plain Paratha, Basic Paratha Recipe, How to Make Paratha?, , , 126 Calories, , , , , , , , , , , , , , , , , rajma cheese paratha | rajma vegetable paratha | stuffed rajma paratha |, , , 215 Calories, , , , , , , , , , , , , , , , , onion cheese paratha recipe | cheese onion paratha |, , , 125 Calories, , , , , , , , , , , , , , , , , paneer stuffed green pea paratha recipe | matar paneer paratha | healthy paneer green peas paratha |, , , 178 Calories, , , , , , , , , , , , , , , , , rajma paratha recipes | stuffed rajma paratha | healthy kidney beans paratha |, , , 302 Calories, , , , , , , , , , , , , , , , , papad stuffed paratha | papad paratha recipe | parathas stuffed with papad |, , , 140 Calories, , , , , , , , , , , , , , , , , green moong dal paratha | moong dal paratha | split moong dal paratha |, , , 117 Calories, , , , , , , , , , , , , , , , , Mexican paratha recipe | Indian style Mexican stuffed paratha | Mexican vegetarian paratha |, , , 197 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Aloo Methi Paratha": "Ingredients: , Potatoes, : Choosing the right kind of potatoes to make these parathas is very important. Some kind of potatoes turn too mushy and sticky after boiling. Avoid using such potatoes. Avoid using newly harvested potatoes. Old potatoes, Yukon Gold & Russet are suitable for parathas., , Spices, : Most people make aloo paratha with minimal spices like cumin, coriander powder and red chilli powder. The combination of spices I have used here makes the parathas so flavorful that your home will be filled with a delicate aroma while frying., , However if you do not have or don’t prefer any particular spice, then you can simply skip it. You can also increase or decrease the spices to suit your taste., , Ghee, : Aloo parathas are pan fried mostly with a generous amount of ghee as it imparts that smoky aroma and flaky texture. If you do not eat ghee then use any regular oil., , Variations, , 1.You can also temper the spices before adding to the mashed potatoes. To do this, heat 1 tbsp oil or ghee in a small pan. Add ginger and green chilies. Saute for 30 seconds and then add all the spice powders and salt. Turn off and add this to the mashed potatoes., , Even without the tempering the aloo parathas will be great as the stuffing gets steam cooked while frying., , 2. Some people also add onions to the stuffing. They are added raw or sauteed in oil until they lose the raw smell., , , Related Recipes, , Gobi Paratha Reci..., , , Chapati Recipe (I..., , , Paratha Recipe, , , Palak Paratha (Sp..., , , Methi Paratha Rec..., , , Paneer Paratha Re..., , , , , Recipe Card, , , , , , Aloo Paratha Recipe | Potato Stuffed Paratha, , , 5, from, 203, votes, , , , These stuffed parathas are made with spiced potato filling. Known as aloo paratha, these flatbreads are simply delicious and make a great meal. Serve them topped with butter alongside plain yogurt, mint chutney or pickle., , Cook Mode, Prevent your screen from going dark, , , , Print Recipe, , Pin Recipe, , 1x, 2x, 3x, , , , , For best results follow the step-by-step photos above the recipe card, , , , , , Prep Time, 20, minutes, , minutes, Cook Time, 25, minutes, , minutes, Total Time, 45, minutes, , minutes, , Servings, 8, , Author, Swasthi, , , , For dough, ▢, 2, , cups, , whole wheat flour, , (240 grams) (atta), ▢, ¼, , teaspoon, , salt, ▢, 1, , tablespoon, , oil, , (optional, refer notes), ▢, water, , as needed for kneading (I used ¾ cup + 2 tbsps), For filling, ▢, 350, , grams, , potatoes, , (3 medium potatoes), ▢, 1, , green chilli, , chopped (optional), ▢, ¾, , teaspoon, , grated ginger, , (or ¼ tsp ginger powder), ▢, 2, , tablespoons, , coriander leaves, , (very fine chopped), ▢, ½, , teaspoon, , salt, , (adjust to taste), ▢, ½ to ¾, , teaspoon, , garam masala, , (adjust to taste), ▢, ½, , teaspoon, , kashmiri red chilli powder, , (adjust to taste), ▢, ¾ to 1, , teaspoon, , coriander powder, ▢, ½, , teaspoon, , chaat masala, , (or 1 tbsp lemon juice or ½ tsp amchur), ▢, 1, , teaspoon, , kasuri methi, , (dried fenugreek leaves), ▢, ¼, , teaspoon, , ajwain, , (carom seeds) (optional), ▢, ½, , teaspoon, , fennel seeds powder, , (saunf powder) (optional), To pan fry, ▢, 4, , tablespoons, , ghee, , (use as per preference), , ▢, ▢, Divide the aloo stuffing to 8 parts. Also divide the dough to 8 parts. Keep the dough covered., How to Make Aloo Paratha, ▢, Roll a dough ball in your palms to smooth. Lightly sprinkle some flour on the rolling area. Flatten the dough ball and dip it in some flour., ▢ Instructions: , I have shared 3 ways to roll the parathas (pics below). Take a look first to see which one looks easier to you., , 8. Sprinkle little flour on the rolling area. Smoothen a dough ball and dip it in flour. Flatten it and roll to a 4 inch round roti/disc., , , , 9. Place a spiced potato ball in the center and bring the sides up., , , , 10. Press down the stuffing to the center and bring the sides higher giving it a cup shape. If the aloo stuffing is sticky, then smear your fingers generously with some flour., , , , 11. Bring the sides higher by simply rotating the whole thing on your hand in clock-wise direction. The dough gets stretched by itself and comes over the stuffing. (check video), , , , 12. Repeat this step of pushing the aloo inside and bringing the sides higher by rotating until the edges come over to the top., , , , 13. Join all the edges well to ensure no filling is visible. I do not remove any excess dough, instead press it down back to the ball., , , , 14. Dip this ball in flour on both the sides and gently flatten it with your fingers. This is very important so the filling is evenly spread all over the paratha., , , , 15. Place the sealed side down on the rolling area and gently roll it evenly without putting pressure. Do not roll the aloo paratha continuously. Instead rotate in clock-wise direction a little after every 4 to 6 rolls to ensure it does not tear or get stuck., , You can make as thin or thick you like. I make mine thin and about 8 to 9 inches. If you see the filling coming out while rolling, then apply some flour there. Sprinkle flour only as needed and avoid using excess., , , , , I had shot these pictures in 2015 but never got to share it on the blog. The stuffing I made here is by tempering the spices in oil first and then I added it to the mashed potatoes. It is on the hotter side with more chilli powder., , Place the aloo stuffing in a 5 inch roti. Then make pleats and bring all the edges on top. Gently join them and pinch off the excess dough. Flatten slightly and dip in flour. Flatten it again to a 4 inch disc with your fingers to spread the filling evenly. Then roll it to as big as you can., , , , , you will be able to make only 6 large parathas. So divide the dough to 12 and stuffing to 6 parts., , , , Fry Aloo Paratha, , 16. After you are done rolling 3 to 4 paranthas, heat a griddle on a medium high flame. When the pan is hot enough, dust off excess flour from the aloo paratha & gently transfer it to the griddle. Within 2 minutes, you will see bubbles. Turn it to the other side., , , , 17. Press down gently with a spatula. You will see the aloo paratha begins to puff. Drizzle some ghee or oil. I add about 1 teaspoon ghee., , , , 18. Turn it to & fro to the other side and drizzle more ghee. Cook pressing down on the edges with a spatula so they cook well. Well-cooked parathas will leave your entire house filled with a great aroma. When you see golden to light brown spots on the aloo paratha, remove to a plate., , , , 19. To fry the next one, ensure the pan is hot enough and not extremely hot. Keep regulating the flame to medium or low as needed so the parathas don’t burn. Place a clean cloth in a container or arrange a cooling rack & Stack the parathas to keep them moist., , Serve Aloo Paratha with pickle or yogurt. You can also top your parathas with butter. We love them with this, Mint chutney, or Cilantro /, coriander chutney, ., , , , Pro Tips, , Firstly boiling potatoes, the right way is the key to make the best aloo parathas. Boil them just until fork tender, meaning they are just cooked and not overcooked. Soggy potatoes will make a sticky and very moist stuffing which is not good to make parathas., , Mashing or grating potatoes, properly is also very important. There should be no chunks of potatoes left in the mash as they will tear the parathas. Do not over mash to the extent they become pasty. So you can also grate them rather than mashing to avoid pasty texture., , Stuffing the parathas, , Flattening and spreading the stuffing, after sealing the spiced aloo in the dough is what makes the aloo paratha perfect. This avoids the parathas from tearing and spreads the filling evenly., , Lastly frying parathas, on a low heat will make them hard. Cook them on a moderately medium high heat so they cook well. Also regulating the flame as needed is very important so they don’t burn., , , , Preparation, ▢, Boil potatoes just until fork tender without making them mushy. To pressure cook in traditional cooker, cook for 3 to 4 whistles depending on the size of potatoes. In instant pot I pressure cooked for 5 mins since I used medium sized potatoes., ▢, While the potatoes boil, make the dough. Add flour,oil and salt to a bowl. Pour half cup water and begin to mix to form a dough. Pour more water as needed and make a soft yet non-sticky dough., ▢, Knead it well until soft & pliable. If you press down the dough with your finger, it should dent easily meaning it is soft enough. Cover and rest until the filling is ready., ▢, When the potatoes are done, cool them slightly and peel while still warm. Ensure your boiled potatoes are not mushy or soggy., ▢, Grate or mash them well until no bits of potatoes remain. Using your fingers break any chunks of potatoes left in the mash otherwise they will tear the parathas. Also do not over mash it as the potatoes will turn pasty and sticky., ▢, Add ginger, green chilies, coriander leaves, salt, red chilli powder, garam masala, coriander powder, kasuri methi and chaat masala. Crush the kasuri methi before adding., ▢, Optional, – Dust off the excess & roll it to a 4 inch disc or roti. Place a portion of aloo stuffing in the center. Gently bring the sides of the roti up shaping like a cup. Repeat the steps of pushing the stuffing inside with your finger and bringing the dough up until the edges come over the stuffing. (Refer video)., ▢, If the stuffing is sticky, dip your fingers in flour. Bring the edges together over the stuffing and join them to seal carefully. (Refer step-by-step photo or video)., ▢, – Roll a 5 inch roti and place the stuffing in the center, hold the edges and make small pleats. Bring all of them on top and join them together to seal the stuffing. Remove the excess dough on top., ▢, Dip the stuffed ball in flour and flatten it gently to spread the stuffing evenly. This ensures the stuffing does not come out at all. Dust off the excess., ▢, Sprinkle some flour on the rolling area ., ▢, Place the paratha disc on the rolling area with the sealed side down. Begin to roll evenly all over without putting pressure., ▢, Do not roll the aloo paratha continuously. Instead rotate in clock-wise direction a little after every 4 to 6 rolls to ensure it does not tear or get stuck. Sprinkle flour as needed and avoid using excess. If you see the stuffing coming out, gently apply some flour to seal it., ▢, Roll the aloo paratha as thin or thick you like without tearing them. I roll mine to 8 to 9 inches., ▢, Transfer the rolled ones to a dry area. Once you are done with 3 you can begin to fry them., ▢, you will be able to make only 6 large parathas. So divide the dough to 12 and stuffing to 6 parts. Roll 2 rotis of 6 inches each. Spread the aloo mixture on one of the roti. Wet the edges with little water. Place the other roti on top of it. Press down gently on the sides to seal both the rotis. Then sprinkle flour and roll it evenly as thin as you want., Frying, ▢, Heat a pan or griddle to cook the aloo parathas. The griddle should be hot enough otherwise the parathas will turn hard,, ▢, When the pan is hot, gently transfer a rolled aloo paratha to it., ▢, With in 2 to 3 mins, you will see bubbles over it. Then flip it to the other side and cook., ▢, You will see the aloo paratha puffs and cooks well. Drizzle ghee or oil all over and flip it to the other side and cook., ▢, Smear some ghee on this side as well and press down the edges to cook thoroughly., ▢, Soon you will see golden to light brown spots on the aloo parathas. Remove to a plate and stack them. This keeps them soft., ▢, Top aloo paratha with some butter and serve with pickle or yogurt. This, coriander chutney, or, mint chutney, also go well., , , Notes, , Adjust the amount of spices and herbs to suit your liking., , Avoid using too much flour while rolling as it makes the parathas hard and dry., Roll the parathas evenly without putting pressure in one place., , For variation you can use store bought grated paneer or steamed carrots and peas. Ensure you mash the veggies very well., , You can also saute little methi leaves or spinach leaves until they wilt. Cool and add them to the mashed potato mixture. Also use only the leaves and not stalks of these greens., , Avoid using new potatoes. Old potatoes are best for this recipe. Boil potatoes just until fork tender and don’t overcook. We don’t want soggy potatoes soaked up in excess moisture., , Grate or mash potatoes well until you see no bits of potatoes in them. But do not over mash to the extent they become pasty and sticky., , After sealing aloo in the dough, do not forget to flatten and spread the stuffing. This way the stuffing is well distributed and won’t come out while rolling., , Do not fry parathas on a low heat. Fry them on a moderately high flame. Keep adjusting the flame while you fry them so you don’t burn the aloo parathas., , , , Video, Watch Aloo Paratha Video, , NUTRITION INFO (estimation only), , Nutrition Facts, , Aloo Paratha Recipe | Potato Stuffed Paratha, , , Amount Per Serving, , , Calories, 189, , Calories from Fat 90, , , , , % Daily Value*, , , Fat, 10g, 15%, Saturated Fat 5g, 31%, Cholesterol, 19mg, 6%, Sodium, 239mg, 10%, Potassium, 131mg, 4%, Carbohydrates, 22g, 7%, Fiber 4g, 17%, Sugar 1g, 1%, Protein, 4g, 8%, , , Vitamin A, 29IU, 1%, Vitamin C, 4mg, 5%, Calcium, 18mg, 2%, Iron, 1mg, 6%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Tried this recipe?, Mention, @SwasthisRecipes, or tag, #swasthisrecipes, !, , , © Swasthi’s Recipes, , , , 10.7K, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Meat Recipes, , Butter Chicken Recipe (Indian Chicken Makhani), Chicken Korma Recipe, Chicken Tikka Masala Recipe, Chicken Vindaloo, Chicken Biryani Recipe, Chicken Curry Recipe, , , , , About Swasthi, , I’m Swasthi Shreekanth, the recipe developer, food photographer & food writer behind Swasthi’s Recipes. My aim is to help you cook great Indian food with my time-tested recipes. After 2 decades of experience in practical Indian cooking I started this blog to help people cook better & more often at home. Whether you are a novice or an experienced cook I am sure Swasthi’s Recipes will assist you to enhance your cooking skills., More about me, , Follow Swasthi’s Recipes, , , Facebook, , Twitter, , Instagram, , Pinterest, , YouTube, , , , , , , , , , , , , Please leave this field empty, Email sign up to receive awesome Swasthi's Recipes in your inbox, *, , , , Check your inbox or spam folder to confirm your subscription., , , , , , , , , , , , , Comments, , , , , 5 from 203 votes (, 154 ratings without comment, ), , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , , , , , , Label, , , , , , , , , , , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name*, , , , , , , Email*, , , , , , , , , , , , , , , , , , , , 120, Comments, , , , , , , Inline Feedbacks, , View all comments, , , , , , , , , Jyothi, , , , , , March 26, 2025 5:40 pm, , , , , , I followed the recipe and got delicious aloo parathas. I also fried little fresh methi leaves in little ghee and included to the aloo mixture. Unique, healthy and delicious. Thank you Swasthi, , , , , , Reply, , , , , , , , , , , Amrita, , , , , , March 21, 2025 4:16 pm, , , , , , My kids love all kinds of parathas and these aloo paratha are their favorite. Thank you for teaching me how to make them easily. Now mine are perfectly shaped and so good like yours., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Amrita, , , , March 26, 2025 5:33 pm, , , , , , Happy to read that Amrita. Thank you for letting me know, , , , , , Reply, , , , , , , , , , , Ten, , , , , , January 31, 2025 2:07 am, , , , , , I used half whole wheat & half all purpose flour for the dough. For the filling I used lemon juice instead of chaat masala per recipe & didn’t use kasurimethi, ajwuin and funnel seeds as I don’t have those in my pantry. Regard less it came out really good. My 3 year old said “it’s yummy” and that’s all matters to me 🙂, , , , , , Reply, , , , , , , , , , , Sangita, , , , , , November 8, 2024 7:30 pm, , , , , , Does the dough need to be firm or the same as chapatti dough?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Sangita, , , , November 9, 2024 2:23 am, , , , , , Soft, like chapati dough. Take a look at the video where I show the texture, , , , , , Reply, , , , , , , , , , , , , , Sangita, , , , , , Reply to, swasthi, , , , November 9, 2024 1:05 pm, , , , , , Thank you, they were really nice 😊, , , , , , Reply, , , , , , , , , , , Mira, , , , , , November 7, 2024 6:54 pm, , , , , , Do we need to soak the methi leaves first or can we add them in dry?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Mira, , , , November 8, 2024 2:35 am, , , , , , Add it dry, , , , , , Reply, , , , , , , , , , , Himanshi, , , , , , October 27, 2024 10:02 pm, , , , , , Nice recipe 😋, , , , , , Reply, , , , , , , , , , , Viraja Bantwal-Adur, , , , , , October 26, 2024 11:51 pm, , , , , , Flavorful and tasty. My go to site for all Indian recipes!, I used yellow potatoes and maybe I should not have. Probably Idaho or baking potatoes would have been better. My potatoes were over cooked and mushy. Even with 6 mins in instant pot. I had to add some potato starch to thicken it up. But didn’t help much.  Had trouble rolling them but managed after all!, Thanks for all the recipes… each and everyone comes out absolutely YUM!, , , , , , Reply, , , , , , , , , , , Nisha, , , , , , August 8, 2024 8:54 am, , , , , , Thank you for having such awesome recipes! Your attention to detail is so appreciated! Do you have any tips on how to freeze already made parathas?, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Nisha, , , , August 8, 2024 9:01 am, , , , , , Thank you Nisha. Cool them completely on a wire rack and place them in between parchment papers. Place in a air tight container or plastic bag., , , , , , Reply, , , , , , , , , , , D jean, , , , , , August 6, 2024 9:57 pm, , , , , , I’m trying aloo paratha I love anything potatoes.love indian food thanks ever so much for sharing dj, , , , , , Reply, , , , , , , , , , , Elizabeth, , , , , , April 28, 2024 4:58 pm, , , , , , well let’s just say it wasn’t winning any beauty awards. The filling was delicious and saved how ugly they were ?, Thanks for the recipe!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Elizabeth, , , , April 28, 2024 5:11 pm, , , , , , Haha! So nice to hear that you were able to make them well at the first attempt. If you have not watched my video, I insist watching that. I have shown the easiest way to make beautiful parathas. It needs some practice but you can easily master that. Thanks for sharing back Elizabeth., , , , , , Reply, , , , , , , , , , , Ali Hamza, , , , , , April 19, 2024 6:32 am, , , , , , I just made these for my wife for breakfast and she absolutely loved it., Thanks., , , , , , Reply, , , , , , , , , , , Vanessa, , , , , , March 15, 2024 3:18 pm, , , , , , I was really excited to learn making aloo paratha and your recipe helped me. They came out so good, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Vanessa, , , , March 16, 2024 2:51 pm, , , , , , , , , , , Reply, , , , , , , , , , , Deepti, , , , , , December 18, 2023 1:44 am, , , , , , Delicious, authentic and a kids favorite healthy dish.., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Deepti, , , , December 30, 2023 2:06 pm, , , , , , Thanks Deepti, , , , , , Reply, , , , , , , , , , , sravani, , , , , , December 14, 2023 9:45 am, , , , , , I made this day before yesterday for dinner and my mom absolutely loved it. Thank you., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, sravani, , , , December 14, 2023 9:59 am, , , , , , Wow! That’s nice to know Sravani! You are welcome!, , , , , , Reply, , , , , , , , , , , shaheen, , , , , , October 14, 2023 2:01 pm, , , , , , Thanks for this aloo paratha recipe, , , , , , Reply, , , , , , , , , , , Ethan, , , , , , October 4, 2023 10:26 am, , , , , , I’m looking to make this for a large crowd of around 9 people. Some will eat a lot: What’s your recommendation of how many servings to cook? Or if you know approximately how many parathas is in one serving that would greatly help with planning., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Ethan, , , , October 4, 2023 11:08 am, , , , , , Hi,, Most people will eat only 2 parathas if you have other dishes on the side like rice, curry or raita. But if you are making only these they will be able to eat 3 plus may be some raita and salad. I think 3x recipe should make enough – 24 parathas and I guess you will have other options like rice etc, , , , , , Reply, , , , , , , , , , , Jackie, , , , , , September 29, 2023 5:33 pm, , , , , , Hi, Swasthi, , I tried your Aloo Paratha recipe and it came out amazing., , Thank you, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Jackie, , , , September 30, 2023 2:38 am, , , , , , Hi Jackie,, That’s nice to know! Thank you, , , , , , Reply, , , , , , , , , , , treasa philipose, , , , , , August 3, 2023 11:34 pm, , , , , , nice, , , , , , Reply, , , , , , , , , , , Vijayalakshmi P C, , , , , , June 20, 2023 3:33 pm, , , , , , Hi Swasthi, I tried today and it came out very well. Kids loved it. “Rotate it clock wise direction after every 4 to 6 rolls” what a great tip! Thanks a ton., , , , , , Reply, , , , , , , , , , , Rupali, , , , , , March 31, 2023 2:27 am, , , , , , Thank you for this aloo paratha recipe. Added some paneer as suggested to another reader. They were the best., , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Rupali, , , , March 31, 2023 3:33 am, , , , , , Happy to know Rupali. Thanks for the comment, , , , , , Reply, , , , , , , , , , , Emma, , , , , , March 20, 2023 2:09 pm, , , , , , This is the first time I made aloo paratha. They turned out beautiful with delicious flavors. I’m never reverting back to the frozen stuff. Would adding some grated paneer work in this recipe? Please advice. Thank you for the amazing work! I’m loving it!!, , , , , , Reply, , , , , , , , , , , , , , swasthi, , , , , , Reply to, Emma, , , , March 20, 2023 2:24 pm, , , , , , So glad to know Emma. Thank you so much. Yes you can add about ½ to ¾ cup of grated paneer. If you want you can increase the spice level or cut down the quantity of potatoes to keep the spice level same. Hope you like them too., , , , , , Reply, , , , , , , , , Load Rest of Comments, , , , , , , , , , , , , , , , , , Popular Recipes, , Chana Masala Recipe (Chickpea Masala), Samosa Recipe (Punjabi Potato Samosa), Dosa Recipe, How to make Dosa Batter, Palak Paneer Recipe (Indian Spinach Paneer), Dal Makhani Recipe (Restaurant Style), Paneer Butter Masala Recipe, , Rajma Recipe | Rajma Masala | Rajma Chawal, , , , , , Collections, , 100+ Indian Dinner Recipes & Easy Ideas, Paneer Recipes, Rice Recipes (Variety Indian Rice Dishes), Diwali Snacks Recipes | 100 Diwali Special Recipes, Diwali Sweets Recipes | Diwali Recipes 2024, 25 Bread Recipes for Snacks & Breakfast, , , , , , Sweets, , Rava Laddu Recipe (Rava Ladoo), Moong Dal Halwa Recipe, Jalebi recipe, Rasgulla recipe, Rasmalai Recipe, Gulab Jamun Recipe, , , , , , , , , , , , , , , , , , © 2025 Swasthi's Recipes, , Privacy policy, , , , , , , , , , , , , , , Insert, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Aloo Palak Paratha": "❌ Error scraping https://www.manjulaskitchen.com/aloo-palak-paratha/: ('Connection aborted.', ConnectionResetError(10054, 'An existing connection was forcibly closed by the remote host', None, 10054, None))",
        "Aloo Cheese Paratha": "Ingredients: , , , , 2, , cheesy stuffing recipe:, , , , , 3, , chapathi / paratha dough recipe:, , , , , 4, , assembling and rolling aloo paratha recipe:, , , , , 5, , roasting paratha recipe:, , , , , 6, , notes:, , , , , , aloo cheese paratha recipe | cheese paratha recipe, with step by step photo and video recipe. paratha’s are traditionally a, breakfast recipe, throughout the western and northern part of india. more often, these parathas are served with curd, , carrot pickle, and topped with butter. cheese stuffed aloo paratha is prepared very similarly to traditional aloo parathas. however, cheese is added to the stuffing to make it more delicious., , paratha’s are usually my fall back option for, breakfast, for those busy mornings. i usually prepare the, roti, dough in bulk and keep it for 2-3 days in fridge. recently, i had prepared the, stuffed mushroom recipe, , for which i had prepared the aloo cheese stuffing. i have reused the same stuffing and but with a new recipe. i have to admit that aloo cheese paratha recipe was hit and tasted even better compared to aloo paratha recipe., , , , , , , paratha’s are one of the popular, breakfast recipes, in, north india, . same recipe of paratha’s can be tried with myriad options of stuffing. there are several paratha’s variants like gobi, mooli, paneer, , laccha paratha, etc. most common one is aloo paratha and this recipe is adapted version to it. cheese stuffing with aloo will enhance the taste of this simple paratha’s. i have not deep fried this paratha’s and i have pan fried it. i wouldn’t recommend deep frying as the cheese may burst out while frying., , check my other, roti recipes, , especially, rumali roti, ,, garlic naan, ,, ragi rotti recipe, , , akki rotti recipe, and, jolada rotti recipe, . also check my other, breakfast recipes, ., these paratha’s taste good with, curry recipes., , i prefer to have it with, rajma masala recipe, , , aloo gobhi recipe, , , ennegayi recipe(stuffed brinjal), and, dal tadka recipe, ., , , cheese paratha recipe | aloo cheese paratha video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , stuffed cheese paratha recipe | aloo cheese paratha recipe card:, , , , , , , , , aloo cheese paratha recipe | cheese paratha recipe, , , HEBBARS KITCHEN, , , cheese paratha recipe | aloo cheese paratha recipe, , , 5, from, 28, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 10, minutes, , mins, Total Time, 20, minutes, , mins, , , , , , , Course, Breakfast, Cuisine, Indian, , , , , , Servings, 3, , Servings, , , , , , , 1x, 2x, 3x, for stuffing:, ▢, 1, , potato, , , boiled and peeled, ▢, ¼, , onion, , , finely chopped, ▢, ½ -1, , inch, , ginger, , , finely chopped, ▢, few coriander leaves, , , finely chopped, ▢, salt to taste, ▢, ¼, , cup, , mozzarella cheese, , , shredded, ▢, ½-1, , tsp, , kashmiri chilli powder, ▢, ¼, , tsp, , chaat masala, ▢, ¼, , tsp, , dry mango powder / amchur powder, for chapathi / paratha dough:, ▢, 1, , cup, , whole wheat flour / atta, ▢, salt to taste, ▢, 1, , tsp, , oil or ghee, ▢, water as required for kneading, ▢, ¼, , cup, , wheat flour for dusting, for roasting parata:, ▢, ghee or oil as required,  Instructions: , cheesy stuffing recipe:, firstly, in a large mixing bowl, smash 1 boiled potato., also add finely chopped onion, ginger, coriander and grated cheese., furthermore, add all the spices and mix well., chapathi / paratha dough recipe:, firstly, in a large mixing bowl, take 1 cup of wheat flour along with some salt., also add water and knead till the dough is non sticky, soft and smooth., furthermore, grease the dough with a tsp of oil and cover with moist cloth and rest for atleast 20 minutes., assembling and rolling aloo paratha recipe:, firstly, pinch a medium sized ball dough, and roll it in a circle of about 5 to 5.5 inches in diameter., place the prepared cheese stuffing in the center., take the edge and start pleating bringing to center., sprinkle some flour and roll to of a chapati size., roasting paratha recipe:, firstly, place the rolled paratha., when the base is partly cooked, flip the paratha., furthermore, add more oil / ghee and roast both sides., finally, serve hot cheese parathas., , , , , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , stuffed cheese paratha recipe | aloo cheese paratha step by step photo recipe:, , cheesy stuffing recipe:, , , firstly, in a large mixing bowl, smash 1 boiled potato., , , , , , also add finely chopped onion, ginger and coriander leaves to it., , , , , , furthermore, add grated / shredded cheese., , , , , , also add spices like chilli powder, chaat masala, dry mango powder and salt to taste., , , , , , mix everything well and keep aside., , , , , , , chapathi / paratha dough recipe:, , , firstly, in a large mixing bowl, take 1 cup of wheat flour., , , , , , also add required salt to taste. you can also add a tsp of oil to make dough more soft., , , , , , now add water in batches and knead the dough., , , , , , add more water if required and knead for 5 minutes., , , , , , knead till the dough is non sticky, soft and smooth., , , , , , furthermore, grease the dough with a tsp of oil to prevent from drying., , , , , , finally, cover with moist cloth and rest for atleast 20 minutes., , , , , , , assembling and rolling aloo paratha recipe:, , , firstly, pinch a medium sized ball dough, roll and flatten it., , , , , , also dust with some wheat flour., , , , , , roll it in a circle of about 5 to 5.5 inches in diameter., , , , , , place the prepared cheese stuffing in the center., , , , , , take the edge and start pleating bringing to center., , , , , , also join the pleats together and press the pleats from center., , , , , , furthermore, sprinkle some flour and roll to of a chapati size., , , , , , , roasting paratha recipe:, , , firstly, on a hot tava add a tsp of oil., , , , , , place the rolled paratha and cook for a minute., , , , , , furthermore, when the base is partly cooked, flip the paratha., , , , , , also add more oil / ghee and press slightly. flip again once or twice till both the sides are cooked properly., , , , , , finally, serve hot cheese parathas to kids with sauce, , raita, or, pickle, ., , , , , , , , notes:, , , firstly, parathas taste great when served hot as we have added cheese. you can microwave the paratha’s for 30 secs if it is cold., , furthermore, i have added less oil, however you can add more oil or ghee while roasting to make it more tasty. you can also add vegetable ghee or dalda while heating., , moreover, adjust the spices according to your taste. you may need to be careful while serving to kids with spicy paratha’s., , do not over stuff the stuffing if you are beginner as it may be difficult to roll. you can also, mix stuffing to dough and than roll the paratha’s., , lipsa das, has shared a beautiful tip to, make perfect paratha: “always dry roast the paratha on tava first and once both sides are slightly white, then put oil and flip it around for both sides again. otherwise the atta won’t be properly cooked and might taste raw. also, after pleating, make sure to remove the excess flour from top so that it does accumulate in the centre of paratha once u start rolling”., , , , , , , , , Related Recipes, , , , , , , , , , breakfast recipes, , , Paneer Kulcha Recipe | Paneer Stuffed Kulcha Naan, , , , Hebbars Kitchen, , -, , , April 2, 2025, , , , , , , , , , , , appetizer, , , Pizza Puff Recipe | Mcdonald’s Veg Pizza McPuff, , , , Hebbars Kitchen, , -, , , April 1, 2025, , , , , , , , , , , , , , , gluten free, , Besan Ladoo Recipe | Besan Ke Laddu –..., , , , Hebbars Kitchen, , -, , , March 28, 2025, , , , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli –..., , , , Hebbars Kitchen, , -, , , March 19, 2025, , , , , , , , , , , 00:02:05, , , , appetizer, , Chilli Mushroom Recipe | Mushroom Chilli Dry –..., , , , Hebbars Kitchen, , -, , , March 6, 2025, , , , , , , , , , , , , curry recipes, , Tawa Paneer Masala Recipe | Paneer Tawa Fry..., , , , Hebbars Kitchen, , -, , , February 24, 2025, , , , , , , , , , , 00:01:09, , , , gluten free, , Peanut Chutney Powder Recipe | Shenga Chutney Pudi, , , , Hebbars Kitchen, , -, , , February 21, 2025, , , , , , , , , , , 00:02:11, , , , appetizer, , Honey Chilli Potato Recipe – Street Style with..., , , , Hebbars Kitchen, , -, , , February 18, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 16 COMMENTS, , , , , , , , Claire, , , January 16, 2018                                                At                                                11:16 pm, , , , , I just LOVE this page. I have already cooked some things I’ve learned here. So easily showed. Thanks for your great work. Keep doing it!, , , , , , , , , , , , Hebbars Kitchen, , , January 18, 2018                                                At                                                5:47 pm, , , , , thank you very much, , , , , , , , , , , , , , Daksha, , , August 17, 2017                                                At                                                2:15 am, , , , , Hi first time commenting, your recipes are very easy to follow. When you are making doughs to you use cold water or hot water? Also more Gujarati recipes please. Thank you, , , , , , , , , , , , Hebbars Kitchen, , , August 24, 2017                                                At                                                9:45 am, , , , , use warm water, , , , , , , , , , , , , « Older Comments, , , Comments are closed., , , , 5 from 28 votes (, 26 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , breakfast recipes, , , , , Akki Roti Recipe | Masala Akki..., , , , , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , indian street food, , Kulcha Recipe | Amritsari Aloo Kulcha – Street Style on Tawa, , , , , , , , What's New, , , , , , , , gluten free, , Besan Ladoo Recipe | Besan Ke Laddu – Halwai Style, , , , , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Aloo Kulcha": "Ingredients: , Potato, - Aloo in Hindi means potato. In this recipe, especially for stuffing, it's important to cook the potato perfectly without over cooking or undercooking., , 1, , cup, , Maida/ All purpose flour, ¼, , cup, , Milk, 1, , tablespoon, , Curd, ½, , teaspoon, , Baking powder, ¼, , teaspoon, , Cooking soda, 1, , teaspoon, , Sugar, Salt, Butter- to smear, For stuffing, 2, , Potato, , Medium, 1, , teaspoon, , Red chilli powder, 1, , teaspoon, , Amchoor powder, , Dry mango powder, ¾, , teaspoon, , Coriander seeds powder, ¼, , teaspoon, , Garam masala, ½, , teaspoon, , Ajwain, 3, , tablespoon, , Chopped coriander, Salt, , Cook Mode, Prevent your screen from going dark,  Instructions: pressure cooking. Just make sure not to overcook., , Flour, - Maida means All purpose flour / plain flour. This gives soft results. You can also mix 50 50 wheat flour and maida for more nutritional value., , 🍞 Kulcha vs Naan, , Usually kulcha doesn't have yeast. Just the leavening agents and made fairly thin. This is the main difference., , 💬 Storage, , You can prepare the dough and stuffing ahead, store in fridge. Oil the surface of dough and should be cling wrapped for retaining freshness. To use, leave it in counter top for 30 mins before using., , Aloo stuffing can be cooled down and stored in airtight box. I am not used to freezing stuffs, so I do not have any recommendations., , 📖 Related posts, , Butter kulcha, Naan without yeast, Kashmiri naan, , Recipe card, , , , , Print, , Pin, , 5, from 1 vote, , , Aloo kulcha recipe, , , Aloo kulcha is an Indian flat bread made with all purpose flour, stuffed with spiced potato mix. Full video step by step detailed post., , , , Course, Main Course, , Cuisine, Indian, , , , Prep Time, 10, minutes, , minutes, , Cook Time, 20, minutes, , minutes, , Resting time, 3, hours, , hours, , Total Time, 3, hours, , hours, , 30, minutes, , minutes, , , , Author, Raks Anand, , , , Servings, 5, , 1x, 2x, 3x, , , Cup measurements, , Prepare Dough, Take flour, baking powder, cooking soda, sugar, salt in a bowl, mix well with a whisk., Make a dent and add milk, curd., Mix together and sprinkle more water and make it to a non sticky dough. Dough should be soft, not too tight., Keep aside for 3 hrs, knead again to make it smooth and make 5 equal sized balls., Potato stuffing, Pressure cook potato for 3 whistles. Once done, peel the skin and crumble it., Add all the masala powders mentioned, salt, ajwain, coriander leaves and mix well., Make equal sized balls same as maida dough., Make kulcha, Spread the rolled maida dough to a thick disk., Place the potato stuffing inside. Gather the sides and cover the stuffing and pinch together to seal., Dust well with flour and spread to thick kulchas., Sprinkle some sesame seeds and chopped coriander leaves and put the rolled kulchas over it., Gently roll again to make it stick to the kulcha., Sprinkle few drops on the top surface of the kulcha and smear every where., Heat tawa and place the kulcha with water applied side over it.  Cook covered for a minute., Flip and cook for ½ a minute and if you want, you can cook in direct flame for few seconds., , Video, , Notes, , Keeping the dough for resting gives you soft dough and kulchas. So don’t skip it., , Do not over cook potatoes as it may retain water and become gooey. This will make the stuffing come out while rolling the kulcha., , In case if you run into problem and the stuffing becomes too sticky, add some bread crumbs to make it stiff., , , , , Youtube, Do you like short videos?, Subscribe now!, , , , , , Instagram, Mention, @rakskitchen, or tag, #rakskitchen, if you have tried this recipe., , , 📸 Stepwise photos, , 1. Mix flour, baking powder, cooking soda, sugar, salt well with a whisk. Make a dent and add milk, curd., , , 2. Mix together and sprinkle more water and make it to a non sticky dough. Dough should be soft, not too tight. Keep aside for 3 hrs, knead again to make it smooth and make 5 equal sized balls., , , 3. Meanwhile, you can prepare potato stuffing. Pressure cook potato for 3 whistles. Once done, peel the skin and crumble it. Add all the masala powders mentioned, salt, ajwain, coriander leaves and mix well., , , 4. Make equal sized balls same as maida dough. Spread the rolled maida dough to a thick disk., , , 5. Place the potato stuffing inside. Gather the sides and cover the stuffing and pinch together to seal., , , 6. Dust well with flour and spread to thick kulchas. Sprinkle some sesame seeds and chopped coriander leaves and put the rolled kulchas over it. Gently roll again to make it stick to the kulcha., , , 7. Sprinkle few drops on the top surface of the kulcha and smear every where. Heat tawa and place the kulcha with water applied side over it.  Cook covered for a minute., , , 8. Flip and cook for ½ a minute and if you want, you can cook in direct flame for few seconds., , , Smear with butter on top if desired and serve with any rich side dish – you see shahi paneer in the picture and it was perfect match! Side dishes :, Shahi paneer, , , butter paneer masala, , , corn capsicum masala, , , mutter paneer, , , , Other Paratha recipes, Sabudana Thalipeeth Recipe, Avocado Paratha Recipe, Tandoori roti recipe, tandoori style roti in tawa, Buckwheat flour paratha, Kuttu ka paratha, Comments, , , , , , Unknown, , says, , , October 18, 2015 at 7:53 am, , , , Its vey yummy... i like it.., , , Reply, , , , , , , , Unknown, , says, , , October 18, 2015 at 7:53 am, , , , Its vey yummy... i like it.., , , Reply, , , , , , , , Unknown, , says, , , October 18, 2015 at 7:53 am, , , , Its vey yummy... i like it.., , , Reply, , , , , , , , Krishnaveni Srinivasan, , says, , , October 18, 2015 at 7:54 am, , , , Its vey yummy... i like it.., , , Reply, , , , , , , , Veena Theagarajan, , says, , , October 18, 2015 at 9:42 am, , , , Looks perfect. Quite filling and perfect for any party, , , Reply, , , , , , , , Traditionally Modern Food, , says, , , October 18, 2015 at 2:08 pm, , , , Looks amazing.. I would love it have it for dinner, , , Reply, , , , , , , , Durga Karthik., , says, , , October 19, 2015 at 2:38 am, , , , Wonderful., , , Reply, , , , , , , , uma ponnudurai, , says, , , October 19, 2015 at 2:58 am, , , , Looks yum...was wondering whats the meaning of 'place the kulcha with water applied side over it'? sorry if its a ridiculous question, , , Reply, , , , , , , , sankar saranya, , says, , , October 19, 2015 at 4:06 am, , , , Tempting, yummy dish for dinner., , , Reply, , , , , , , , Raks anand, , says, , , October 19, 2015 at 5:47 am, , , , water applied side should be put on the tawa. Hope its clear. Refer video if not clear. Let me know if you need further clarification 🙂, , , Reply, , , , , , , , Unknown, , says, , , October 19, 2015 at 6:07 am, , , , Can I ferment the dough instead of adding cooking soda and baking powder. If so how long should I allow it to ferment, , , Reply, , , , , , , , saravanan MP, , says, , , October 19, 2015 at 6:14 am, , , , Can I ferment the dough instead of adding cooking soda and baking powder. If so how long should I allow it to ferment, , , Reply, , , , , , , , Raks anand, , says, , , October 21, 2015 at 8:23 am, , , , It will not puff and turn out spongy as it will be when we use cooking and baking powder, , , Reply, , , , , , , , vyas venkatesh, , says, , , December 30, 2015 at 1:49 am, , , , Very tempting super soft khulchas, , , Reply, , , , , , , , vyas venkatesh, , says, , , December 30, 2015 at 1:50 am, , , , Very tempting super soft kulchas, , , Reply, , , , , , , , Unknown, , says, , , November 16, 2016 at 3:23 pm, , , , Hi Raks... if I want to make plain butter kulcha, , , Reply, , , , , , , , Meena Srinivasan, , says, , , July 07, 2017 at 10:32 am, , , , super recipe Raks. Surely i will try this. How to make Onion Kulcha?, , , Reply, , , , , , , , indumathi r, , says, , , August 11, 2018 at 1:26 am, , , , Maida quantity??, , , Reply, , , , , , , , Raks Kitchen, , says, , , August 11, 2018 at 1:37 am, , , , I have posted plain kulcha recipe too 🙂, https://www.rakskitchen.net/2014/02/butter-kulcha-recipe-plain-kulcha-recipe.html, , , Reply, , , , , , , , Raks Kitchen, , says, , , August 11, 2018 at 1:38 am, , , , I will try to post sometime 🙂, , , Reply, , , , , , , , Raks Kitchen, , says, , , August 11, 2018 at 1:38 am, , , , Oh somehow it got deleted. Updated now. Thanks for asking 🙂, , , Reply, , , , , , , 5 from 1 vote (, 1 rating without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , , , , Hi, I'm Rajeswari Vijayanand, , I am the person behind Rakskitchen, sharing recipes with pictures & videos., , , More about me, , , , Trending recipes, , Ugadi Pachadi Recipe, ABC juice recipe, Apple Beetroot Carrot juice, Rose milk recipe - With homemade rose syrup, Chandrakala recipe Chandrakala, suryakala sweet, , Tamil New Year Recipes, , Medhu vadai, Ulundu vadai recipe - With video, Masala vada, Masal vadai step by step recipe, Mango pachadi recipe, Manga pachadi, Veppam poo rasam recipe | Tamil new year recipes, , , , , Footer, , ↑ back to top, , , , Links, , , Privacy Policy, , FAQ, , , , , Also from Rakskitchen, , , Rakskitchen Tamil, , , , , Contact, , , [email protected], , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2025, Rakskitchen, , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Pudina Aloo Paratha": "Ingredients:  Instructions: , Recipe Counter, , , , , , , , , , Home, , Recipes, , Articles, , Chefs, , Galleries, , , , , , Veg Recipes, , Non-Veg Recipes, , Glossary, , Videos, , Sify.com, , , , , , , Create your own Cookbook, , Download Sify Bawarchi App, , , , , , , , , , Disclaimer, |, Privacy Policy, |, careers@sify.com, |, About Us, |, Feedback, |, Advertise, |, Sitemap, , , Copyright, Sify Technologies Ltd, , 2021. All Right Reserved., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Aloo Roti": "Ingredients: , , , , 4, , how to make alu roti with step by step photo:, , , , , 5, , notes:, , , , , , aloo roti recipe | potato roti recipe | how to make alu roti, with step by step photo and video recipe. there are myriad ways to make roti or indian flat breads making it a versatile staple for many indians. it is generally made with wheat or plain flour with or without extra flavour or ingredient infused to the dough. but this recipe is unique and the boiled potatoes are directly mixed to the wheat dough and thus making an healthy roti recipe., , i guess by now, many would have confused this recipe with the popular stuffed punjabi aloo paratha recipe. whenever you have aloo and flatbread together in one recipe, it fair to assume the alu paratha. but trust me this recipe is entirely different from it. there is a major difference between these 2 recipes. basically the main difference in these 2 recipe is, in this recipe i have mixed and infused the boiled and mashed potatoes within the dough. in other words the recipe is very similar to thepla or masala roti where the spiced ingredient is mixed directly to wheat dough. whereas, in, aloo paratha, , the aloo stuffing is prepared separately and later stuffed within the wheat-based covering to roll it into a flatbread., , , while there isn’t any complicated steps in this aloo roti recipe, yet some tips and suggestions for perfect recipe. firstly, the recipe can be shaped to desired shape as per your preference. i have shaped it to basic circular shaped roti, but it can be made as triangular and even square-shaped roti. secondly, these roti’s remain fresh for days and hence can be prepared as travel meal. moreover it does not require any fancy curry and can be eaten as it is. lastly, the same recipe can be extended by adding other boiled and mashed veggies to the wheat dough. for instance, you can add gobi, carrot, peas and even, broccoli, for extra flavour., , finally, i would like to highlight my other, roti or naan bread recipes collection, with this post of aloo roti recipe. it includes recipes like, , tandoori roti, , , rice roti, , , jowar bhakri, , , akki roti, , , sabakki roti, , , rumali roti, , , ragi roti, and, jolada rotti recipe, . in addition to visit my other related and popular recipes collection like,, , , top paneer recipes collection, , paratha recipes collection, , sandwich recipes collection, , , aloo roti video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for aloo roti recipe:, , , , , aloo roti recipe | potato roti recipe | how to make alu roti, , , HEBBARS KITCHEN, , , easy aloo roti recipe | potato roti recipe | how to make alu roti, , , 4.95, from, 35, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Total Time, 10, minutes, , mins, , , , , , , Course, roti, Cuisine, north indian, , , , , , Servings, 8, , roti, , , , , , , 1x, 2x, 3x, ▢, 2, , potato / aloo, , , boiled & grated, ▢, 2, , cup, , wheat flour / atta, ▢, 1, , chilli, , , finely chopped, ▢, ½, , tsp, , ginger paste, ▢, ¼, , tsp, , ajwain / carom seeds, ▢, ½, , tsp, , coriander seeds, , , crushed, ▢, ½, , tsp, , cumin powder, ▢, ¼, , tsp, , kashmiri red chilli powder, ▢, ½, , tsp, , garam masala, ▢, 2, , tbsp, , coriander, , , finely chopped, ▢, 1, , tsp, , lemon juice, ▢, ½, , tsp, , salt, ▢, 2, , tsp, , kasuri methi, , , crushed, ▢, water to knead, ▢, 1, , tsp, , oil, ▢, oil for roasting,  Instructions: , firstly, in a large bowl take all the ingridents and knead to a smooth and soft dough., pinch a ball sized dough and flatten slightly., dust with wheat flour and roll gently., now on a hot tawa place the rolled roti and cook for a minute., furthermore, when the base is partly cooked, flip the aloo roti., also, spread ½ tsp oil / ghee and press slightly both the sides., flip again once or twice till both the sides are cooked properly., finally, serve aloo roti with mix veg sabzi, raita and pickle., , , , , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make alu roti with step by step photo:, , , firstly, in a large bowl take 2 boiled & mashed potato and 2 cup wheat flour., , , also add 1 chilli, ½ tsp ginger paste, ¼ tsp ajwain, ½ tsp coriander seeds, ½ tsp cumin powder, ¼ tsp chilli powder, ½ tsp, garam masala, ., , , additionally add 2 tbsp coriander, 1 tsp lemon juice, ½ tsp salt and 2 tsp kasuri methi., , , crumble and mix the dough for 2 minutes without adding any extra water., , , now add ¼ cup water and knead to a smooth and soft dough. add water as required., , , further, add 1 tsp oil and knead the dough., , , knead to a smooth and soft dough., , , pinch a ball sized dough and flatten slightly., , , dust with wheat flour and roll gently., , , now on a hot tawa place the rolled roti and cook for a minute., , , furthermore, when the base is partly cooked, flip the aloo roti., , , also, spread ½ tsp oil /, ghee, and press slightly both the sides., , , flip again once or twice till both the sides are cooked properly., , , finally, serve, aloo roti, with, mix veg sabzi, ,, raita, and, pickle, ., , , , notes:, , , firstly, pressure cook aloo well, else it will be difficult to knead the dough., , also, the roti can be folded triangle and rolled for layered roti recipe., , additionally, add onions to make roti tastier., , finally, , aloo roti recipe, tastes great when served hot., , , , , , , , , Related Recipes, , , , , , , , , , breakfast recipes, , , Paneer Kulcha Recipe | Paneer Stuffed Kulcha Naan, , , , Hebbars Kitchen, , -, , , April 2, 2025, , , , , , , , , , , , breakfast recipes, , , Lemon Rice | South Indian Chitrannam & Gojju..., , , , Hebbars Kitchen, , -, , , March 25, 2025, , , , , , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti –..., , , , Hebbars Kitchen, , -, , , March 24, 2025, , , , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli –..., , , , Hebbars Kitchen, , -, , , March 19, 2025, , , , , , , , , , , 00:01:33, , , , side dish, , Aloo Pakora Recipe | Aloo Bajji | ..., , , , Hebbars Kitchen, , -, , , March 17, 2025, , , , , , , , , , , , , breakfast recipes, , Tomato Sevai Recipe | Thakkali Semiya – Healthy..., , , , Hebbars Kitchen, , -, , , March 10, 2025, , , , , , , , , , , 00:02:05, , , , appetizer, , Chilli Mushroom Recipe | Mushroom Chilli Dry –..., , , , Hebbars Kitchen, , -, , , March 6, 2025, , , , , , , , , , , 00:01:49, , , , chaat recipes, , Ragda Recipe – Multipurpose Curry for Chaat Recipes, , , , Hebbars Kitchen, , -, , , March 3, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 4.95 from 35 votes (, 35 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , breakfast recipes, , , , , Akki Roti Recipe | Masala Akki..., , , , , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , chutney recipes, , dosa chutney recipe | chutney for mysore masala dosa, , , , , , , , What's New, , , , , , , , gluten free, , Besan Ladoo Recipe | Besan Ke Laddu – Halwai Style, , , , , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Garlic Aloo Roti": "Ingredients:  Instructions: "
    }
}