{
    "ingredients": {
        "Savory Cheddar Bay Donuts": "all purpose flour,vegan butter,cheddar cheese,parsley,baking powder,old bay seasoning,soy milk,maple syrup",
        "Vegan Quiche Muffins with Sun dried tomatoes": "firm tofu,coconut oil,mushrooms,spinach,garlic,onions,sundried tomatoes,almond milk,nutritional yeast,dried chives",
        "Vegetable oats muffins": "regular oats,besan,carrot,zucchini,cabbage,spinach,peanuts,yogurt,sesame seeds,baking soda,vegan butter",
        "Vegan Spinach Artichoke cups": "phyllo shells,spinach,vegan mayo,vegan cream cheese,bread crumbs,nutritional yeast,garlic,onion powder",
        "Healthy Bread Rolls": "capsicum,onion,sweet corn,paneer,green chillies,vegan cheese,whole wheat bread",
        "Vegan Garlic Doughballs": "bread flour,instant yeast,sugar,non dairy milk,cashews,garlic,tapioca starch,nutritional yeast,cider vinegar,vegan butter,dried oregano",
        "Vegan Sausage Rolls": "coconut oil,onion,garlic,mushrooms,walnuts,white beans,nutritional yeast,rosemary,miso,gluten free flour,almond ground,agave syrup,almond milk,sesame seeds",
        "Caramelised Onion and Spinach Puff Patries": "spinach,onion,garlic,thyme,nutritional yeast,puff pastry sheets,nutmeg,maple syrup"
    },
    "recipe_url": {
        "Savory Cheddar Bay Donuts": "fixate_recipes\\Side and Snack\\FXR-EN-Savory_Cheddar_Bay_Donuts-7.30.20-Recipe.pdf",
        "Vegan Quiche Muffins with Sun dried tomatoes": "https://jessicainthekitchen.com/vegan-quiche-muffins-with-sun-dried-tomatoes-and-spinach/",
        "Vegetable oats muffins": "https://ruchirasoi.weebly.com/vegetable-oats-muffins.html",
        "Vegan Spinach Artichoke cups": "https://veganhuggs.com/vegan-spinach-artichoke-cups/#recipe",
        "Healthy Bread Rolls": "https://youtu.be/6Hi6y3BctIw",
        "Vegan Garlic Doughballs": "https://domesticgothess.com/blog/2021/12/29/vegan-garlic-dough-balls/",
        "Vegan Sausage Rolls": "https://www.rhiansrecipes.com/gluten-free-vegan-sausage-rolls/#recipe",
        "Caramelised Onion and Spinach Puff Patries": "https://cookingwithparita.com/caramelised-onion-and-spinach-puff-pastries/"
    },
    "Recipe": {
        "Savory Cheddar Bay Donuts": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., SAVORY CHEDDAR BAY DONUTS, SERVES: 6 (1 donut each)  Prep Time: 10 min.  Cooking Time: 15 min., CONTAINER EQUIVALENTS (per serving):, 1, 1⁄2, 2, 1 cup, gluten-free all-purpose flour, (preferably Bob’s Red Mill® All-, Purpose Baking Flour, red label), ¼ cup, salted organic grass-fed butter, cold, , cut into cubes, ¾ cup, shredded cheddar cheese, 1 Tbsp., chopped fresh parsley, 2 tsp., baking powder, gluten-free, 1½ tsp., Old Bay Seasoning®, 1 tsp., garlic powder, ¾ cup, unsweetened organic soy milk, 2 tsp., pure maple syrup, SPECIAL EQUIPMENT:, Nonstick cooking spray, Donut pan, 1.\t\t Preheat oven to 450° F., 2.\t\t Lightly coat donut pan with spray; set aside., 3.\t\t Add flour and butter to a food processor; pulse until butter is chopped into, pea-sized pieces., 4.\t\t Add cheddar cheese, parsley, baking powder, seasoning, and garlic powder;, pulse to combine., 5.\t\t Add soy milk and maple syrup; blend until a smooth batter forms., 6.\t\t Transfer batter to a resealable plastic bag; seal. Snip off one corner from bag;, squeeze bag to pipe batter into prepared donut pan, dividing evenly among 6, donut molds., 7.\t\t Bake for 13 to 15 minutes, or until golden brown. Let pan cool until it can be, handled; remove donuts to a wire rack to cool completely., NUTRITIONAL INFORMATION (per serving): Calories: 231  Total Fat: 13 g  Saturated Fat: 8 g  Cholesterol: 36 mg  Sodium: 191 mg  Carbohydrates: 23 g, Fiber: 1 g  Sugars: 2 g  Protein: 6 g, Bob’s Red Mill is a trademark of Bob’s Red Mill Natural Foods, Inc., Old Bay Seasoning is a trademark of McCormick & Company, Inc., RECIPES, © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., © 2020 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 2, Instructions: ",
        "Vegan Quiche Muffins with Sun dried tomatoes": "Ingredients: , (Looking for a traditional, full-size vegan quiche recipe? I’ve got you covered:, Easy Vegan Quiche, !), , , , , Extra-firm tofu, – You’ll need to press the tofu so it can absorb the flavours you add to it. Learn more:, How To Cook Tofu 101 + Best Tips on Making the Most Delicious Tofu, Coconut oil, – Or use another oil you like or have on hand., Mushrooms, Spinach, Garlic, Onions, Salt and pepper, Sun-dried tomato halves, Almond milk, – Or another unflavoured plant milk., Nutritional yeast, cheesy flavour in this recipe. Don’t skip it!, Turmeric, – You only use a pinch of turmeric, as it’s added for its colour, not its flavour., Chives, – These can be fresh or dried., Baking powder, Kala namak, – No worries if you can’t find this! You can omit it., , Does Kala Namak Taste Like Eggs?, , Kala namak is a black salt from India that has a sulphur flavour reminiscent of eggs. Also known as Himalayan black salt, kala namak is used in a number of vegan egg dishes because of its eggy taste and aroma., , How to Make Vegan Quiche Muffins, , You’ll find that swapping the eggs with tofu makes vegan quiche much easier to whip up, with less room for error. Here’s what you’ll need to do., , Prepare, . Preheat your oven to 375°F/190°C and grease a 12-cup muffin pan., , , Cook the vegetables, . In a skillet set over medium-high heat, melt the coconut oil, then add the mushrooms, spinach, garlic, onions, and 6 of the 7 sun-dried tomato halves. Stir and season with salt and pepper to taste. Cook until the onions are translucent, the spinach is wilted, and the mushrooms have shrunken, about 5 to 8 minutes. Remove from heat., , , Make the tofu “egg” mixture, . In a high powered, blender, or food processor, combine the tofu, almond milk, nutritional, yeast, , sea salt and black pepper, turmeric, baking powder, and kala namak. Blend on high until the mixture is smooth., , , , , , Add the vegetables and chives, . Stir the vegetables and chives into the tofu mixture. Season to taste., , , Bake, . Divide the mixture into 12 greased muffin cups, then top each cup with the remaining chopped sun-dried tomato. Bake for 35 minutes, or until a toothpick inserted in the centre comes out mostly clean., , , Rest and serve, . Let the quiches cool for 5 minutes in pan, then loosen them with a butter knife and transfer them to a wire rack. Serve warm or cold., , Can I Add Crusts to This Recipe?, , These vegan quiches are crustless, but if you want something more traditional, you can definitely add crusts! Use my, Best Vegan Pie Crust, recipe and after rolling out the dough, 1, , (16 ounce) block, , extra firm tofu, , , pressed (1 lb.), 1, , tablespoon, , coconut oil, , , or any oil, ¼, , cup, , mushrooms, , , (68g) chopped, 2, , cups, , spinach, 4, , cloves, , garlic, , , minced, 3, , tablespoons, , chopped onions, Salt and pepper to taste, , , for the veggies, 7, , sundried tomato halves, , , (49g) diced, 1, , cup, , almond milk, , , or any vegan milk, 3, , tablespoons, , nutritional yeast, ½, , teaspoon, , sea salt, ¼, , teaspoon, , black pepper, pinch of turmeric, , , for colour, 1, , teaspoon, , dried chives, , , or 1 tablespoon freshly chopped chives, ½, , teaspoon, , baking powder, pinch, , black salt, , , kala namak – totally optional,  Instructions: , , Tips for Success, , Here are some simple hints and tips for perfect vegan quiche muffins., , Don’t press all the liquid out, . You want to drain the tofu enough that it can absorb the flavours you add, but it needs to retain, some, liquid for that eggy consistency. If you’re using a, tofu press, , press the tofu for about 15 minutes., Use the right tofu, . You’ll need refrigerated tofu, not shelf-stable silken tofu. Silken tofu has a different consistency that won’t work for this recipe., Knowing when it’s done, . The beauty of a tofu quiche is that there are no food safety issues with undercooked egg. If you want a creamier consistency, you can pull the quiches out of the oven a little bit sooner; leave them in longer if you want your quiches firm., , Variations, , You can customize these quiches with your own favorite add-ins, or try some of these:, , Your favorite vegan cheese, Plant-based bacon bits or crumbled sausage, Steamed broccoli and vegan cheddar, Caramelized onions, Asparagus, Sautéed leeks, Arugula, kale, or chard, , , How to Store and Reheat Leftovers, , Leftover mini vegan quiches can be stored in an airtight container in the refrigerator for up to a week. They’re great for meal prep breakfasts and lunches!, , The quiches can be served cold, at room temperature, or warm. Reheat them in a 350ºF oven for about 10 minutes, or heat them in the microwave until warmed through., , Can This Recipe Be Frozen?, , You can freeze these quiches for up to 3 months in an airtight storage container or freezer bag. If you’re stacking them, simply place parchment paper between the layers to keep them from sticking to each other. Let them thaw in the refrigerator before serving or reheating., , Enjoy friends! If you make this vegan quiche muffin recipe, please snap a photo and tag, #jessicainthekitchen, on, Instagram, ! We’d also love it if you would leave a comment below, and give the recipe a rating! Thanks so much!, , , Save This Recipe Form, , , , Contact, , , , , , , Want to save this recipe?, , Enter your email below & I’ll send it straight to your inbox., Plus you’ll get new recipes from me every week!, SEND IT!, , , , , Vegan Quiche Muffins with Sun-dried Tomatoes and Spinach, , , Servings:, 12, , servings, , Prep Time:, 15, minutes, , mins, Cook Time:, 35, minutes, , mins, Total Time:, 50, minutes, , mins, , , These Vegan Quiche Muffins with Sun-Dried Tomatoes and Spinach are loaded with protein and so much flavour!, , 5, (from, 39, ratings), , , Print Recipe, , Pin Recipe, , Leave a Review, , , , , Cook Mode, Prevent your screen from going dark, , Preheat oven to 375°F/190°C. Begin to press your tofu and set aside until you are ready for it. Grease a 12-cup muffin container and set aside., In a pan over medium high heat, heat the coconut oil. Add in the mushrooms, spinach, garlic, onions, and 6 of the 7 sun-dried tomato halves, stirring to combine with the oil. Season lightly with salt and pepper to taste. Allow to cook through until the onions are translucent, spinach is shrivelled and mushrooms shrunken, about 5 to 8 minutes, stirring occasionally. Remove from heat and set aside., In a high powered blender, add the tofu, almond milk, nutritional yeast, sea salt and black pepper, turmeric, and baking powder. If you have any kala namak, add it now. Blend on high until everything is completely smooth and there are no lumps. I blended mine twice to ensure this., Stir in with a wooden spoon all of the fillings from the pan, plus the chives to combine. You can taste here and decide if you want any more nutritional yeast, or sea salt., Spoon out the mixture into 12 greased muffin cups, trying to get an even amount of toppings in each. Top each cup with the last of the sun-dried tomato half., Bake for 35 until quiche muffins until a toothpick stuck in the middle comes out mostly clean. Remove from oven and allow to rest for 5 minutes on the counter in pan. Then, loosen edges with a knife and remove onto a wire rack, so that they can cool completely without getting soggy., Serve while still warm, or while cold, and enjoy!, , , Notes, *If you have a tofu press, you only want to press for about 15 minutes, not much longer., , , , Kala Namak is an Indian spice that adds a lovely eggy sulphur flavour to any vegan egg dishes. It is very powerful so only add a small pinch into your recipes. If you don’t have any, that’s also fine – it’s optional., , , , How to store:, Leftover mini vegan quiches can be stored in an airtight container in the refrigerator for up to a week., The quiches can be served cold, at room temperature, or warm. Reheat them in a 350ºF oven for about 10 minutes, or heat them in the microwave until warmed through., , , , How to freeze:, You can freeze these quiches for up to 3 months in an airtight storage container or freezer bag. If you’re stacking them, simply place parchment paper between the layers to keep them from sticking to each other. Let them thaw in the refrigerator before serving or reheating., , Calories:, 30, kcal, , , Carbohydrates:, 3, g, , , Protein:, 2, g, , , Fat:, 2, g, , , Saturated Fat:, 1, g, , , Sodium:, 198, mg, , , Potassium:, 143, mg, , , Fiber:, 1, g, , , Sugar:, 1, g, , , Vitamin A:, 760, IU, , , Vitamin C:, 5, mg, , , Calcium:, 46, mg, , , Iron:, 1, mg, , Disclaimer: Although jessicainthekitchen.com attempts to provide accurate nutritional information, kindly note that these are only estimates. Nutritional information may be affected based on the product type, the brand that was purchased, and in other unforeseeable ways. Jessicainthekitchen.com will not be held liable for any loss or damage resulting for your reliance on nutritional information. If you need to follow a specific caloric regimen, please consult your doctor first., , , , Cuisine:, American, Course:, Breakfast, Lunch, Snacks, Author:, Jessica Hylton, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , American, , Appetizers, , Breakfast, , Dairy Free, , Egg Free, , Fall, , Gluten Free, , Low Carb, , Lunch, , Nut Free, , Recipes, , Snacks, , Spring, , Summer, , Vegan, , Vegetarian, , Winter, , , , originally published on, Apr 22, 2022, (last updated, Jul 26, 2022, ), , , , 83 comments, , , Leave a comment », , , , , , , , , « Previous Post, Vegan Sugar Cookie Bars, , Next Post », , Vegan Cinnamon Rolls, , , , , , , 5 from 39 votes (, 19 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , 83 comments on “Vegan Quiche Muffins with Sun-Dried Tomatoes and Spinach”, , , , , , Gina, —, March 12, 2024 @ 9:26 am, , Reply, , , , , , LOVE these! I’m new to the vegan, eggless world and I’m very impressed how much this resembles an egg! I didn’t have much on hand so I used onion and red peppers instead. Very tasty!, , , , , , , Susan, —, August 1, 2024 @ 12:26 pm, , Reply, , , Hi, Jessica–Eager to make these for a baby shower! I want to use my oil pie crust recipe with these, and make mini quiches (as in using the mini muffin tins). Do you have a recommendation about how long I should bake them? Say, instead of making 12 quiches, I make 24? Thanks, Jessica. This is my first encounter with your website, and am excited to explore it more and try that ginger recipe you recommend above, too!, , , , , , , Jessica Hylton, —, August 22, 2024 @ 5:59 pm, , Reply, , , Hi Susan,, , I’ve been away on summer break so just seeing this! I don’t want to give a recommendation that may spoil them so please follow this only as a guide – I would probably bake them for about 3 minutes at 350F (the mini pie crusts) since they’re so small to pre bake them. Then let them cool completely. Then proceed with baking for half the amount of time. You may want to cover them with foil halfway so the crusts don’t burn., , I hope you continue to enjoy the recipes so much!, , , , , , , , , Juliette, —, November 5, 2024 @ 12:40 am, , Reply, , , , , , I have been making these nearly weekly for meal prep breakfasts for the past year or so. There’s so few easy to make ahead savory breakfast option for vegans. This, by far, is the BEST, , , , , , , Jessica Hylton, —, November 11, 2024 @ 2:44 pm, , Reply, , , So happy to hear this Juliette!! Thanks so much for sharing!, , , , , , , , , Anna, —, November 7, 2024 @ 11:03 am, , Reply, , , Any reason why these didn’t hold together at all for me 🙁 they taste amazing but I literally have to spoon them out of the muffin tins because they’re completely like not solid at all. Idk what I did wrong I didn’t replace anything or do anything different, , , , , , , Jessica Hylton, —, November 11, 2024 @ 2:38 pm, , Reply, , , Hi Anna,, , Couple things – you might’ve used the wrong kind of tofu. You want to use the refrigerated kind of tofu, not the shelf stable silken tofu., You might’ve used the right kind but didn’t press them so the amount of liquid might be affecting their ability to stay together., , I’m really happy you loved the flavour though and hopefully this helps you to troubleshoot!, , , , , , , , , Sarah, —, December 15, 2024 @ 6:14 am, , Reply, , , I’m hoping to make this recipe this week but was wondering if the fresh spinach could be substituted for frozen spinach instead?, , , , , , , Jessica Hylton, —, December 16, 2024 @ 10:22 am, , Reply, , , Hi Sarah,, , Yes you can ! Just let it thaw first and squeeze out the extra liquid first so it doesn’t make the quiche liquid-y. Enjoy!, , , , , , , , , Alice, —, January 24, 2025 @ 7:38 pm, , Reply, , , Question: I would like to have a flaky crust at the bottom. Is there a crust I can use before putting in the filling?, Thank you, , , , , , , Jessica Hylton, —, January 27, 2025 @ 4:16 pm, , Reply, , , Hi Alice,, , Of course – you can use my pie crust recipe (can’t link it here, but should easily found in the search bar of my site or puff pastry! I would recommend pre-baking it at 350F/180C for about 5 minutes first to ensure the bottom isn’t soggy. Then continue with the rest of the recipe., , I hope you enjoy so so much!, , , , , , , , , « Older Comments, , 1, , 2, , 3, , 4, , , , Leave a comment », , , , , , , , , , , , , Welcome!, Hi, I’m Jessica!, , Jessica is an award-winning photographer, videographer and home chef who is also now a new mom! Her mission is to provide thoroughly-tested simple and delicious meals from her kitchen to yours., , Jessica has been featured in The Washington Post, Essence Magazine, Google for Creators, The Oprah Magazine, Country Living and many more publications., , More About Jessica, , , Follow me:, , , Instagram, , , , Facebook, , , , Pinterest, , , , Twitter, , , , , , , , , Search Recipes:, , , , Submit, , , , , , , , , Get Jessica’s recipes directly to your inbox:, , Plus receive a FREE Weeknight Vegan Dinners Cookbook!, , , , , SEND ME:, new post updates, weekly roundup, , , , , Recent Posts, , , , , , Almond Milk, , , , , , , Chili Cornbread Casserole, , , , , , , Vegan Burritos, , , , , , , Carrot Cake Muffins, , , , , , , Kale Soup, , , , , , , Oatmeal Breakfast Cookies, , , , , , , , , , , As Seen In…, As Seen In…, , , , , , Get Jessica’s recipes directly to your inbox:, , Plus receive a FREE Weeknight Vegan Dinners Cookbook!, , , , , SEND ME:, new post updates, weekly roundup, , , , , , , ^ Back to Top, , Home, , About, , Press, , FAQ, , Privacy Policy, , Contact, , Accessibility Statement, , , , , , ©2025 Jessica in the Kitchen, ., Design by, , Purr, ., , , , , , , , , , , Submit, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , ,",
        "Vegetable oats muffins": "Ingredients: 2 cups Regular Oats, 3/4 cup Besan/Chickpea flour, 1/4 cup carrot grated ( 1 carrot grated ), 1/2 cup grated Zucchini ( 1 medium size zucchini ), 1/2 cup grated Cabbage or finely chopped cabbage, 1/2 cup finely chopped Spinach  ( or can use methi leaves or Cilantro leaves too, any of choice ), 2 tbsp ginger, garlic,cilantro & green chilly paste ( In a blender add in 4-5 cloves of garlic, 1 inch piece of ginger, about 4-5 green chilly, a few cilantro leaves, and blend to a smooth paste by adding 2 tbsp of water ), Salt as per taste, 2-3 tbsp crushed peanuts/peanuts powder, ​1/2 cup yogurt, 1 tbsp white sesame seeds, 1 tsp Eno/Baking Soda, 1 tsp of Red chilly powder ( optional, add if you like spicy or can skip ), 1 tbsp of melted butter or cooking oil for greasing the pan, Can add any veggies like Bottlegourd, bell peppers, green beans, cauliflower etc., as per availability and taste preference. Instructions: In a blender or mixer, add in the oasts and powder that. Then In a mixing bowl add in the powdered oats/oats flour, besan and salt, mix altogether, then all the grated /chopped vegetables, next  add in the yogurt and little water as needed to make a thick batter. ( the batter should not be thin and watery and also it shouldn't be too dense, like too thick, it should be thick but poring consistency, not very dense nor very watery ).Also add in the salt, Crushed peanuts, red chilly powder if using that, ginger chilly paste, and mix nicely and cover., Cover and keep this batter aside for an 20-30 minutes, this is optional, you can make it instantly too but I always like to rest the batter for a few minutes for the perfect fluffiness and taste., Just 5 minutes before making, add in the eno or baking soda, any of this will give good results, I used eno., Grease a cupcake pan/tray with cooking oil or melted butter, or can use cupcake liners, Then add the prepared batter, fill only upto 3/4 level. Sprinkle a few sesame seeds on top., Then can be, baked, or, Air-fry., Baking, in a preheated oven, for about 25-30 minutes at 400 F or until done, which can be checked by inserting a tooth pick in it and it comes out non sticky then done, if batter sticks to it then needs a bit more time. Also the top will get nice golden brown color., If, Airfrying, , then airfry at 375 F  in a preheated air fryer for about 16-18 minutes or until done,which can be checked by inserting a tooth pick in it and it comes out non sticky then done, if batter sticks to it then needs a bit more time. Also the top will get nice golden brown color. If you like the crust crunchy and not soft then airfry for about 20-22 minutes., Enjoy them with tea/chai/coffe as a snack, or a good lunch box option, for outdoor picnics and get together or just for breakfast also. Can be had with chutney or sauce or ketchup or just as is., ​, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Powered by, , , Create your own unique website with customizable templates., , , Get Started, , , , , , , , , , , , , , , , , Home, , , , Festival Specials, , , , Breakfast, , , , Flat Breads, , , , Indian Curries, , , , Rice Recipes, , , , Regional Dishes, , , , No Onion Garlic Recipes, , , , Soups and Salads, , , , Fusion Recipes, , , , Fasting Recipes, , , , Instant Pot Recipes, , , , Air Fryer Recipes, , , , Snacks/Appetizers, , , , Chutney/Sauce/Dips, , , , Dessert, , , , Refreshing Drinks, , , , Contact, , , , , , , , , , , , , , ,",
        "Vegan Spinach Artichoke cups": "Ingredients: US Customary, Metric, ▢, 30, , mini phyllo shells, ▢, 3, , cups, , frozen spinach, , (measured frozen) thawed, squeezed of excess water & chopped finely, ▢, 1, , 14 oz can, , artichoke hearts, , , drained & finely chopped, ▢, ¼, , cup, , vegan mayonnaise, ▢, ⅓, , cup, , vegan cream cheese, , , softened, ▢, 2, , teaspoons, , lemon juice, , , fresh squeezed, ▢, ⅓, , cup, , panko breadcrumbs, ▢, 2-3, , tablespoons, , nutritional yeast, , (or vegan parmesan), ▢, 1, , teaspoon, , granulated garlic, , (use ½ if using garlic powder), ▢, ¾, , teaspoon, , granulated onion, ▢, ½, , teaspoon, , paprika, ▢, ½, , teaspoon, , crushed red pepper, , (optional), ▢, ¾, , teaspoon, , salt, , , more to taste, ▢, , fresh cracked pepper, , , to taste, , Recommended Equipment, Baking Tray, Mixing Bowl, , Cook Mode, Prevent your screen from going dark,  Instructions: Preheat oven to 375° F (190° C)., To a large mixing bowl, add the spinach, artichoke hearts, mayonnaise, cream cheese, lemon juice, breadcrumbs, nutritional yeast, garlic, onion, paprika, crushed red pepper, salt, and pepper. Combine well. Taste for seasoning and add as needed., Fill the mini phyllo shells using a small spoon. Place each one on a large baking tray., Place in the oven and bake for 10-12 minutes, until filling is heated throughout. Serve immediately. Sprinkle with vegan parmesan if desired., , , Notes, , Prep time, doesn't include thawing time for spinach., , Make ahead:, make the dip 1-2 days before and place in an airtight container then store in the fridge. When ready, just fill up the frozen phyllo shells and bake as usual. You can also assemble them completely and store them covered in the fridge on a tray., , Freeze:, Fill up the phyllo shells and place them back in the trays they came in. Once frozen, they can be stored in an airtight container. Freeze for 2-3 months. Baking time may need to be increased by 5-10 minutes., , The amount of spinach going, into the bowl should be about 1 cup (a little more is fine). This is after it has been thawed and squeezed of excess water. If you use fresh spinach, just cook it down to that amount as well., , The, phyllo shells, do not need to be thawed first. Just fill and bake., , , Nutrition, Serving:, 5, pieces, |, Calories:, 277, kcal, |, Carbohydrates:, 24, g, |, Protein:, 7, g, |, Fat:, 17, g, |, Saturated Fat:, 2, g, |, Sodium:, 707, mg, |, Potassium:, 163, mg, |, Fiber:, 3, g, |, Sugar:, 1, g, |, Vitamin A:, 3840, IU, |, Vitamin C:, 16.3, mg, |, Calcium:, 69, mg, |, Iron:, 1.7, mg, , , , Tried this recipe?, Follow me, @veganhuggs, and mention, #veganhuggs, !, , , , , , , , , , , Vegan Huggs Weekly Newsletter, , Receive the tastiest vegan recipes straight to your inbox! Join now and get my Fan Favorites ebook FREE!, , , SUBSCRIBE, , , , , , , , , , , , , , , , , , , , , , , , , , , , , More Vegan Appetizer Recipes, Vegan Nacho Cheese, Vegan Soft Pretzels, Vegan Cornbread, Creamy Tomato Butter Beans, , , , , , , , Pinterest, , , , , , , Facebook, , , , , , , Twitter, , , , , , , Yummly, , , , , , About Melissa, I’m Melissa Huggins – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, Read more..., , , , , , , , Reader Interactions, Comments, , , , 5 from 33 votes (, 18 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , Manisha Shah, , , January 13, 2025 at 1:59 pm, , , , HI, Can would this work in a vol au vant puff. I would need to pre bake the vol au vont, for them to puff, How would the mix work for this?, , , Reply, , , , , , , , Melissa Huggins, , , January 13, 2025 at 2:31 pm, , , , Hi Manisha, I haven't tried it this way yet, but I would bake the cups first, then let them cool. Then I would add the filling to the cups and warm in the oven. Maybe reduce the heat slightly so you don't burn the pastry. I hope this helps. I'd love to hear how they turn out if you try it. 🙂, , , Reply, , , , , , , , , , Christina, , , December 29, 2024 at 10:45 am, , , , Delicious and easy to make.  I used fresh spinach instead because that was what I had, it was great., , , Reply, , , , , , , , Melissa Huggins, , , January 07, 2025 at 8:54 am, , , , Hi Christina, thank you for giving them a try. Fresh spinach is the best! 🙂, , , Reply, , , , , , , , , , Lori Williams, , , November 09, 2024 at 11:41 am, , , , These Vegan Spinach Artichoke Cups were wonderful! I made them for a church gathering in honor of a family who is vegan and they rapidly disappeared! (The snack, not the family!) Lots of positive feedback too. It was my first attempt at a vegan recipe and I will make them again! Thank you Melissa, you have made it easier to make everyone happy!, , , Reply, , , , , , , , Melissa Huggins, , , December 19, 2024 at 12:32 pm, , , , Hi Lori, this is such a wonderful compliment! I'm so happy they were a hit with everyone and you will make them again. Thank you so much!, , , Reply, , , , , , , , , , Kathy, , , May 13, 2024 at 12:56 pm, , , , questions:  recipe says it serves 6.  It calls for 30 mini shells.  Does this recipe fill all 30 shells?  I want to make my own mini phyllo shells.   Is recipe assuming each serving is 5 mini shells?, , , Reply, , , , , , , , Melissa Huggins, , , May 14, 2024 at 4:42 pm, , , , Hi Kathy, yes, the mixture will fit into 30 mini shells perfectly. And yes, each serving is 5 filled shells. I'm so glad you'll try them. Thank you 🙂, , , Reply, , , , , , , , , , Anne, , , March 13, 2024 at 3:18 pm, , , , This recipe looks yummy.  Can't wait to make it -- and I'd prefer to make it ahead.  However, I can't get phyllo tart shells, and am wondering, if I make the shells from prepared phyllo sheets, should I fill them with the filling and then freeze them, or should I make the shells, freeze them, and then make the filling and add it to the frozen shells?  I don't want the bottoms to get soggy., , , Reply, , , , , , , , Melissa Huggins, , , March 15, 2024 at 10:54 am, , , , Hi Anne, I'm so glad you'll try the recipe. Fully bake the shells without the filling and let them cool completely before filling and baking. You can also freeze the shells after they are fully baked and you can fill them too. I hope this helps. Feel free to reach out with any other questions., , , Reply, , , , , , , , , , Nicole L Milsap, , , January 15, 2024 at 2:45 pm, , , , This recipe is great, I took it to a baby shower a couple years ago and made it again last night. Yummy it's a keeper., , , Reply, , , , , , , , Melissa Huggins, , , February 15, 2024 at 1:49 pm, , , , So glad everyone loved it, Nicole! Thanks for trying it and sharing feedback. 🙂, , , Reply, , , , , , , , , , Vicki, , , December 23, 2023 at 10:01 am, , , , Making these tomorrow for Christmas Eve.  The Athens Phyllo cups I bought are already prefaced and stored a room temp.  It is ok to just fill and serve these or do you think they still should be heated through?  Many thanks and Happy Holidays!!, , , Reply, , , , , , , , Melissa Huggins, , , December 23, 2023 at 11:02 am, , , , Hi Vicki, I prefer to serve them warm, but you can also serve them as a cold appetizer. They will be just as delicious! Let me know if you have any other questions. Have a Merry Christmas!, , , Reply, , , , , , , , , , Melanie, , , December 24, 2022 at 12:00 pm, , , , Recipe so easy and yummy my vegan sister in law thought I bought them from the store thank you!!!!!, , , Reply, , , , , , , , Melissa Huggins, , , December 27, 2022 at 3:10 am, , , , Thanks, Melanie! I am glad you both enjoyed it. 🙂, , , Reply, , , , , , , , , , Sue, , , December 02, 2022 at 12:15 pm, , , , These are so good and easy to make! Thank you for the recipe!, , , Reply, , , , , , , , Melissa Huggins, , , December 04, 2022 at 4:59 am, , , , You are very much welcome Sue., , , Reply, , , , , , , , , , Nicole, , , November 19, 2022 at 8:49 pm, , , , This is my go to recipe for parties! It’s always a hit. I do not use the shells since I can never find them in my area and I am too lazy to make my own (lol) I just cook the mixture in a 9x9 glass dish and lay out an assortment of crackers. Thank you so much for creating and sharing such a wonderful dip! It’s even non-vegan approved which is always a plus 😊, , , Reply, , , , , , , , Melissa Huggins, , , November 24, 2022 at 7:29 pm, , , , That is actually a great idea Nicole! I am happy you all enjoy this. 😊, , , Reply, , , , , , « Older Comments, Primary Sidebar, , , , I’m Melissa Huggins, – the creator of Vegan Huggs. I started this blog to share delicious vegan recipes that everyone will love. Yep, that includes carnivores, too!, , More about me →, , , Search, Search, , vegan huggs facebook, , vegan huggs Instagram., , vegan huggs pinterest, , YouTube, , My Most Popular, , Vegan Crab Cakes, Easy Vegan Quiche, Sticky Sesame Cauliflower, Creamy Vegan Potato Leek Soup, Cheesy Vegan Cauliflower Casserole, Grilled Portobello Mushroom Steaks, Footer, , SEEN ON, , , ^ back to top, , , , About, , About Me, Privacy Policy, Recipe Index, , , , Newsletter, , Sign Up!, for emails and updates, , , Contact, , Contact, Subscribe, , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2020, Vegan Huggs, , We use cookies to ensure that you have the best experience possible on our website. By continuing on the site you agree to the use of your cookies by www.veganhuggs.com, , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Healthy Bread Rolls": "Ingredients:  Instructions: ",
        "Vegan Garlic Doughballs": "Ingredients: Dough:, 500, , g (4 cups), , white bread flour, 10, , g (3 teaspoons), , fast action (instant) yeast, 1, , teaspoon, , salt, 1, , teaspoon, , sugar, 3, , Tablespoons, , olive oil, 160, , ml (⅔ cup), , unsweetened non-dairy milk (I use soy), , lukewarm, 160, , ml (⅔ cup), , water, , lukewarm, Cheese Dip:, 75, , g (2 + ⅔ oz / ½ cup), , raw cashews, 2, , cloves, , garlic, , peeled, 1 ½, , teaspoons, , tapioca starch, ½, , teaspoon, , salt, 2, , Tablespoons, , nutritional yeast, 1, , teaspoon, , cider vinegar, 160, , ml (⅔ cup), , water, Garlic Butter:, 85, , g (rounded ⅓ cup), , vegan butter/spread, 4, , cloves, , garlic, , peeled and crushed, 1, , Tablespoon, , finely chopped fresh parsley, 1, , heaped teaspoon, , dried oregano,  Instructions: , Olive oil:, A bit of olive oil in the dough helps to make the dough balls soft and adds flavour. Go for a mild one, not extra virgin. You can also swap the olive oil for any other neutral oil., , Non-dairy milk:, Soy milk is always my favourite for baking as it has the highest protein content so most closely resembles dairy milk. Any variety of non-dairy milk will work however, but go for an unsweetened one if you can, and definitely soy milk if you have it., , Salt:, You simply cannot make good bread without salt. Don’t omit it., , Sugar:, Just a teaspoon to help feed the yeast, making the dough rise., , Vegan butter:, To make the garlic butter. Either a block or tub variety is fine. I used Flora original., , Garlic:, Lots of it! You will need some for the garlic butter and some for the cheese dip. I go for 4 large cloves in the garlic butter; reduce it to 3 if you prefer a less pungent flavour!, , Herbs:, I use oregano and parsley in my garlic butter topping, but feel free to use whatever finely chopped herbs you like. Rosemary and thyme would work well., , For The Cheese Dip:, , Cashews:, Soaked and blended cashews form the base of the cheese. I don’t recommend swapping them for another kind of nut., , Tapioca flour:, This thickens the ‘cheese’ and helps to give it a slightly gooey, stretchy texture. I don’t recommend swapping it for another type of starch as you won’t get quite the same texture., , Nutritional yeast:, This provides the ‘cheesy’, savoury flavour., , Cider vinegar:, Adds a bit of tang to better replicate the flavour of cheese. You could use lemon juice instead but you may need to use a bit more of it., , , How To Make Vegan Garlic Dough Balls:, , , Place the bread flour in a large bowl (or the bowl of a stand mixer fitted with a dough hook), add the yeast to one side and the salt and sugar to the other., , Pour in the olive oil, milk and water and mix to form a rough dough., , Knead, either by hand on an unfloured surface or with the stand mixer on a medium/high speed, for 5-10 minutes until the dough is smooth and elastic. It should be slightly tacky to the touch but should pull away from the sides of the bowl cleanly., , , Place the dough in an oiled bowl, cover and set aside to rise in a warm spot until doubled in size, about 1-2 hours., , , Punch down the risen dough and give it a brief knead to knock out any air bubbles., , Divide the dough into small pieces, about 30g each. I use a scale for accuracy. You should have around 29 pieces., , , Shape each piece into a ball by gathering the edges up and pinching them together. Keep going until you have a neat, well-sealed ball., , Flip the ball over, cup it with your hand over the top and roll it until it is smooth., , , Line a baking sheet with baking parchment. Grease both the inside and outside of an approximately 11cm wide, 4cm deep ramekin and place it in the middle of the baking sheet., , Arrange the dough balls slightly spaced apart in two circles around the ramekin., , Loosely cover the baking sheet and set aside to rise for about 30-40 minutes until the dough balls are puffy and spring back slowly most of the way if you poke one gently with a finger., , , While the dough balls are rising make the garlic butter and cheese dip - melt the butter, crushed garlic and herbs in a pan., , , For the cheese dip, blend the soaked cashews, tapioca starch, nutritional yeast, garlic, vinegar, salt and water until very smooth., , Pour the mixture into a pan over a medium heat. Whisk constantly until it comes up to a simmer and thickens. Remove from the heat and cover with parchment directly on the surface to prevent it from forming a skin., , , When the dough balls are ready to bake, pour the cheese mixture into the ramekin and spread it level. Drizzle a little extra virgin olive oil over the top if you like and sprinkle with fresh thyme leaves. Gently brush the dough balls with about ⅔rds of the garlic butter., , , Bake for 20 minutes until golden. Brush the balls with the rest of the garlic butter then serve warm., , , Top Tips:, , All of my recipes are developed using grams, and as with all of my baking recipes I really do recommend using the metric measurements with a digital scale rather than the cup conversions. Cups are a wildly inaccurate measuring system and you will get far better, more consistent results using a scale, not to mention that it is also easier and less messy than cups!, , Make sure that your yeast isn’t out of date! Old yeast can lead to bread that doesn’t rise., , Don’t be tempted to add more flour to the dough, it is supposed to be a bit soft and sticky. If you add too much flour the dough balls will end up being dry and dense, not light and fluffy., , The rising time of the dough will vary depending on how warm it is; on hot days it will rise much faster than on cold ones., , You can make these vegan garlic dough balls all in one day, or you can make the dough in the evening and place it (covered) in the fridge to rise overnight then continue with the rest of the recipe in the morning. In this case the second rise may take longer as the dough will be cold., , The dough balls are best eaten on the day they are baked, preferably still warm; but they will keep in an airtight container at room temperature for up to 2 days., , , What Kind Of Yeast?:, , I always use instant yeast (also called easy bake yeast) when I am baking bread as it doesn’t need to be activated in liquid first, you can just add it straight to the flour. I highly recommend buying instant yeast if possible., , , Stir 12g of active dry yeast and the sugar into the lukewarm milk and water. Let it sit for 10-20 minutes until it has become bubbly then proceed with the rest of the recipe as written., , How To Tell When Bread Is Baked:, , The best way to tell if bread is baked properly is to check the internal temperature with a probe thermometer. It should reach at least 90°C/194°F., , Overbaked bread will be dry and if it is under-baked then you will be eating raw dough, yuck! It is impossible to give a one-size-fits-all baking time as all ovens vary., , I really do recommend investing in a probe thermometer, it is an incredibly handy kitchen tool!, , If you don’t have a thermometer then a toothpick inserted into the centre of a dough ball should go in and out smoothly with little resistance and come out clean., , Can I Freeze These Vegan Garlic Dough Balls?:, , Yes, any leftover dough balls can be frozen. Freeze them on the day that they are baked to preserve freshness but make sure that they have cooled completely first., , Freeze them in an airtight container or ziplock bag. Allow to defrost at room temperature then refresh them in a low oven before serving., , Can I Make Them In Advance?:, , The dough balls really need to be eaten on the day they are baked, preferably while they are still warm from the oven. So I don't recommend baking them in advance., , You can make the dough the evening before you want to bake them and let it rise (covered) in the fridge overnight; then continue with the recipe as written the following day., , Can I Make Them Gluten-Free?:, , No, I’m afraid that you cannot use gluten free flour. Making gluten free bread is tricky and the entire recipe would need reworking. Gluten free baking is not my area of expertise so I cannot advise you., , It is best to use a recipe that is designed to be gluten free rather than trying to adapt a non gluten free recipe., , What To Serve With Vegan Garlic Dough Balls:, , The dough balls go great with the cheesy dip, but you could also serve them with hummus, pate, marinara sauce, just as they are or with anything else you can think of really!, , More Vegan Sharing Bread Recipes:, , Vegan pretzel bites, Vegan beer pretzels, Vegan garlic pull-apart bread, Vegan pesto bread, Easy flatbreads, Vegan garlic naan bread, Easy vegan cornbread, Pumpkin bread rolls, , , If you tried this recipe let me know how it went! Rate it, leave a comment or tag, @domestic_gothess, on Instagram and hashtag it #domesticgothess, , All images and content on Domestic Gothess are copyright protected. If you want to share this recipe then please do so by using the share buttons provided. Do not screenshot or post the recipe or content in full., , , , , , Print, , 5, from 1 vote, , , Vegan Garlic Dough Balls, , , Vegan garlic dough balls – these incredible dough balls with garlic butter are easy to make and so very moreish! Served with a cheesy cashew dip they make a great centrepiece for a celebration, and are perfect party food too., , , , Course, Appetizer, Snack, , Cuisine, vegan, , Keyword, bread, , , , Prep Time, 45, minutes, , minutes, , Cook Time, 20, minutes, , minutes, , Rising Time, 1, hour, , hour, , 40, minutes, , minutes, , , , Servings, 29, , dough balls, , , Author, Domestic Gothess, , Place the bread flour in a large bowl (or the bowl of a stand mixer fitted with a dough hook), add the yeast to one side and the salt and sugar to the other (if salt comes into direct contact with the yeast it can kill it)., Pour in the olive oil, milk and water and mix to form a rough dough., Knead, either by hand on an unfloured surface, or with the stand mixer on a medium/high speed for 5-10 minutes until the dough is smooth and elastic. It should be tacky to the touch but should pull away from the sides of the bowl cleanly. If it feels too wet you can add a little more flour as needed, don't add too much though or the bread will be dry., Place the dough in a ,ightly oiled bowl, cover and set aside to rise in a warm spot until doubled in size, about 1-2 hours., While the dough is rising, place the cashews for the cheese dip in a bowl, pour over enough boiling water to generously cover them and set aside to soak., Line a baking sheet with baking parchment. Grease both the inside and outside of an approximately 11cm wide, 4cm deep ramekin and place it in the middle of the baking sheet., Punch down the risen dough and give it a brief knead to knock out any air bubbles., Divide the dough into small pieces, about 30g each. I use a scale for accuracy. You should have around 29 pieces., Shape each piece into a ball by gathering the edges up and pinching them together. Keep going until you have a neat, well-sealed ball. Flip the ball over, cup it with your hand over the top and roll it until it is smooth., Arrange the dough balls slightly spaced apart in two circles around the ramekin. About 11 on the inner circle and 18 on the outer circle (depending on how many balls you have)., Loosely cover the baking sheet and set aside to rise for about 30-40 minutes until the dough balls are puffy and spring back slowly most of the way if you poke one gently with a finger. If they spring back quickly then they need a little longer., While the dough balls are rising preheat the oven to 210°C/190°C fan/425°F/gas mark 7., Make the garlic butter - place the vegan butter, crushed garlic, parsley and oregano in a pan and heat gently until melted. Set aside., Make the cheese dip - drain the soaked cashews well and place them in a blender with the garlic, tapioca, salt, nutritional yeast, vinegar and water. Blend until very smooth, scraping down the sides as necessary., Pour the mixture into a pan over a medium heat. Whisk constantly until it comes up to a simmer and thickens. Remove from the heat and cover with parchment directly on the surface to prevent it from forming a skin, set aside., When the dough balls are ready to bake, pour the cheese mixture into the ramekin and spread it level. Drizzle a little extra virgin olive oil over the top if you like and sprinkle with fresh thyme leaves. Gently brush the dough balls with about ⅔ rds of the garlic butter., Bake for 20 minutes until golden. A probe thermometer inserted into the centre of one of the balls should reach at least 90°C/194°F. Brush the balls with the rest of the garlic butter then serve warm., , , Notes, , See post above for tips, details and step-by-step photos. If you have a question I may have already answered it above!, , As with all of my baking recipes I really do recommend using the metric measurements with a digital scale rather than the cup conversions. Cups are a wildly inaccurate measuring system and you will get far better, more consistent results using a scale, not to mention that it is also easier and less messy than cups!, , Cheese dip adapted from Bish, Bash, Bosh by Henry Firth and Ian Theasby., , , , , More Bread, Buns and Yeasted Bakes, Hot Cross Bun Loaf (vegan), Vegan Semlor, Apple Cinnamon Pull-Apart Bread (vegan), No-Knead Olive Bread (vegan), Never Miss A Post!, , Subscribe to get all the latest recipes delivered to your inbox., , , , , , , , , , Reader Interactions, Comments, , , , , , Anthe, , , December 28, 2022 at 6:09 pm, , , , I made them for Christmas and they turned out amazing!! Fluffy and tasty!! This is definitely a keeper!, , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., , , , Δ, , , Primary Sidebar, , , , Hi, I'm Hannah!, I'm a UK based vegan food blogger, recipe developer and food photographer specialising in the best vegan baking. Welcome to Domestic Gothess!, , More about me →, , , Popular, , Curried Vegetable Pasties (Vegan), Vegan Fruit And Nut Flapjacks, Vegan Chocolate Fudge Cake, Vegetable Tagine With Almond And Chickpea Couscous, , , , , , , , , , , , , , , , , , , , Buy Me a Coffee, , , , , Never Miss A Post!, , Subscribe to get all the latest recipes delivered to your inbox., , , , , , , , , , Footer, , ↑ back to top, , , , About, , , About Hannah, , Disclosure and Privacy, , , , , Newsletter, , , Sign Up!, for emails and updates, , , , , Contact, , , Contact, , Work With Me, , , , , Copyright © 2025 Domestic Gothess. All rights reserved., , , , , , , , , , , , , , , , , ,",
        "Vegan Sausage Rolls": "Ingredients: , , , , Blend briefly until just combined - you'll want it to be easy to stick together but still retaining some texture., , , , , Taste, and adjust seasoning if necessary., , , For the pastry:, , , Combine the, coconut oil, , , ground almonds, , , flour, and, salt, in a, glass mixing bowl, with about, 7 tablespoons, of water, until it forms a firm dough., , , Tip:, Add the water a few tablespoons at a time so that you don’t add too much!, , , , Lay out a sheet of, baking paper, on a counter. Sprinkle the surface of the paper and a, rolling pin, with a generous amount of flour., , Take half of the pastry dough and use the, rolling pin, to roll it into an even rectangular shape, as thin as you can without it breaking., , , , , Use a knife to cut this dough, vertically in half, and then cut it, horizontally into 5 pieces, , so that you have, 10 mini rectangles, in total., , , , , Take a, heaped teaspoon, of the filling and place into the centre of each mini rectangle, then roll one side of the pastry on top of the filling and roll over onto the other side to create a ‘blanket’ of pastry., , , , , Lay out the sausage rolls on a, rectangular baking tray, lined with, baking paper, ., , Repeat until the rest of the pastry dough has been used up., , Mix together the, agave syrup, and, almond milk, in a small bowl, and use your fingertips, a pastry brush or a small spoon to spread it over the tops of all of the sausage rolls., , , , , Sprinkle over, poppy seeds, or, sesame seeds, ., , , , , Bake in the oven for around, 20 minutes, , until the pastry crust is firm to the touch and golden brown., , , , How long do these keep for?, , These Sausage Rolls taste best, eaten on the day, they're made, but they can be stored covered in the, fridge, for up to a, couple of days, ., , Can they be made ahead or frozen?, , These sausage rolls are, delicious hot or cold, , so they can be, made ahead, . For best results, I would recommend making them, on the day, , they're going to be eaten, ., , However, they can be frozen and keep in the, freezer, for up to a, couple of months, . For best results, I'd recommend freezing them as soon as they've cooled down from the oven., , How do you reheat them?, , To reheat frozen vegan sausage rolls, leave them to partly thaw at room temperature for, one hour, , then bake them in an oven preheated to, 180 degrees Celsius (350 degrees Fahrenheit), for, 15-20 minutes, . Keep an eye on them to make sure they don't burn!, , Substitutions you can make, , , You can use, any type of mushrooms, - I used, chestnut/button mushrooms, ., , You can replace the, white beans, with, green lentils, , or puy lentils, ., , You can replace the, gluten-free flour, with, rice flour, ., , You can replace the gluten-free flour with, plain flour, if you, don't need them to be gluten-free, ., , You can use, shop-bought puff pastry, instead of the homemade pastry., , You can use my, vegan chorizo recipe, to make, chorizo sausage rolls, !, , You can replace the, agave syrup, with, any other sweetener, ., , You can replace the, almond milk, with, any other plant-based milk., , , Serving suggestions, , , They can be enjoyed as a, picnic, or, packed lunch, with a, salad, or, sandwiches, ., , They also make a great, appetiser, , and can be served alongside other appetisers such as, Vegan Mushroom Pâté, , a, Vegan Cheese Ball, , , Candied Nuts, or, French Onion Dip, !, , , , More vegan appetisers, , , Muffin Tin Sushi Cups, , Crackers, , Vegan Mushroom Pâté, , , Italian Hummus, , Vegan Cheese Ball, , , Vegan French Onion Dip, , Candied Nuts, , Vegan “Crispy Duck” Lettuce Wraps, , , If you try out this recipe or anything else from my blog, I’d really love to hear any feedback! Please give it a, rating, , leave a, comment, , or tag a photo, @rhiansrecipes #rhiansrecipes, on, Instagram, ! Thank you., , Watch how to make this recipe, , , , , , Vegan Sausage Rolls (Gluten-Free), , , These Vegan Sausage Rolls are crispy and flaky, with a flavourful sausage meat filling made using onions, mushrooms, walnuts and beans. They're also gluten-free and much healthier than traditional sausage rolls!, , , 4.25, from, 62, votes, , , Print, , Pin, , Rate, , , Course:, Main Course, Snack, Cuisine:, British, Keyword:, gluten-free sausage rolls, vegan pigs in blankets, vegan sausage rolls, , Prep Time:, 20, minutes, , minutes, Cook Time:, 35, minutes, , minutes, Total Time:, 55, minutes, , minutes, , Servings:, 20, , sausage rolls, , Calories:, 98, kcal, , Author:, Rhian Williams, , , For the sausage:, ▢, 1, , tablespoon, , , , coconut oil, , (or sub olive, vegetable or rapeseed oil), ▢, 1, , , , onion, , , diced, ▢, 2, , , , garlic cloves, , , minced, ▢, 70, , g, , , (, 2.5, , oz, ), , mushrooms, , , sliced (I used chestnut/button mushrooms), ▢, 50, , g, , , (, ½, , cup, ), , walnuts, ▢, 400, , g, , , (, 14, , oz, ), , tin of white beans, , , drained and rinsed (cannellini, haricot or butter beans), ▢, 2, , tablespoons, , , , nutritional yeast, ▢, , Few sprigs, , , (, ½, , teaspoon, ), , fresh rosemary, , (you can use dried, but fresh has so much more flavour!), ▢, 1, , teaspoon, , , , miso, , (ensure gluten-free if necessary), ▢, , , Salt + pepper, , to taste, For the pastry:, ▢, 30, , g, , , (, ⅛, , cup, ), , coconut oil, ▢, 75, , g, , , (, ⅔, , cup, ), , gluten-free flour blend, , plus more for rolling (or sub rice flour, or plain all-purpose flour if not gluten-free), ▢, 75, , g, , , (, ⅔, , cup, ), , ground almonds (almond meal), , *, ▢, Pinch, , , , salt, , to taste, ▢, 7, , tablespoons, , , , water, ▢, 1, , teaspoon, , , , agave syrup, , (or sub any other sweetener), ▢, 1, , teaspoon, , , , unsweetened almond milk, , (or any other plant-based milk), ▢, 1, , teaspoon, , , , poppy or sesame seeds, , (optional), , and blend briefly until just combined - you'll want it to be easy to stick together but still retaining some texture., Taste and adjust seasoning if necessary., For the pastry:, Preheat the oven to 180 degrees Celsius (350 degrees Fahrenheit)., Combine the coconut oil, ground almonds, flour and salt in a bowl, along with about 7 tablespoons of water, until it forms a firm dough - add the water a few tablespoons at a time so that you don’t add too much!, Lay out a sheet of baking paper on a counter. Sprinkle the surface of the paper and a rolling pin with a generous amount of flour., Take ½ of the pastry dough and use the rolling pin to roll it into an even rectangular shape, as thin as you can without it breaking., Use a knife to cut this dough vertically in half and then cut it horizontally into 5 pieces, so that you have 10 mini rectangles in total., Take a heaped teaspoon of the filling and place into the centre of each mini rectangle, then roll one side of the pastry on top of the filling and roll over onto the other side to create a ‘blanket’ of pastry., Lay out the sausage rolls on a baking sheet lined with baking paper., Repeat until the rest of the pastry dough has been used up - any leftover filling makes a delicious pâté!, Mix together the agave syrup and almond milk in a small bowl, and use your fingertips, a pastry brush or a small spoon to spread it over the tops of all of the sausage rolls., Sprinkle over poppy seeds or sesame seeds., Bake in the oven for around 20 minutes, until the pastry crust is firm to the touch and golden brown., Tastes best when fresh, but keeps covered in the fridge for up to a couple of days., , Video, , Notes, *You can alternatively use, almond flour, ., , , You can use shop-bought puff pastry instead of the homemade pastry. Most shop-bought puff pastry is naturally vegan, and many supermarkets stock gluten-free puff pastry too., , They can be frozen and keep in the freezer for up to a couple of months. For best results, I'd recommend freezing them as soon as they've cooled down from the oven., , To reheat frozen vegan sausage rolls, leave them to partly thaw at room temperature for one hour, then bake them in an oven preheated to 180 degrees Celsius (350 degrees Fahrenheit) for 15-20 minutes. Keep an eye on them to make sure they don't burn!, , , , Nutrition Facts, , Vegan Sausage Rolls (Gluten-Free), , , Amount Per Serving, , , Calories, 98, , Calories from Fat 45, , , , , % Daily Value*, , , Fat, 5g, 8%, Saturated Fat 2g, 10%, Sodium, 13mg, 1%, Potassium, 135mg, 4%, Carbohydrates, 9g, 3%, Fiber 2g, 8%, Sugar 1g, 1%, Protein, 3g, 6%, , , Vitamin C, 0.6mg, 1%, Calcium, 29mg, 3%, Iron, 1mg, 6%, , * Percent Daily Values are based on a 2000 calorie diet., , , , , , , Made the recipe?, Tag, @rhiansrecipes, on instagram and use the hashtag, #rhiansrecipes, !, , , Disclosure: This posts contains affiliate links to Amazon. If you purchase any of these products, a small percentage will come to me with no extra cost to you! This income will go towards the running of this blog – thank you., , More Lunch & Dinner Recipes, Gluten-Free Dinner Rolls (Vegan + No Yeast), Tofu Burger (Vegan + Gluten-Free), Gluten-Free Vegan Irish Soda Bread, Vegan Mushroom Pâté (GF), , , , , , , , Pin, , , , , , , Share, , , , , , , Tweet, , , , , , , , , , , Reader Interactions, Comments, , , , 4.25 from 62 votes (, 47 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, , , Email, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , , , , , Sue, , , December 28, 2022 at 2:28 pm, , , , Gorgeous! Swapped walnuts for extra mushrooms. uses gf soy sauce not miso, used mixed herbs..no rosemary, plus salt and black pepper. Ah and a little mild chilli powder. cooked all in olive oil.. Used soy beans for extra protein Deeeeeeelicious! 💕💖💝, , , Reply, , , , , , , , Rhian Williams, , , December 29, 2022 at 4:39 am, , , , Thank you so much, so happy to hear that! And thank you for sharing all your substitutions!, , , , , , , , , , , Anonymous, , , August 12, 2023 at 2:25 pm, , , , Great recipe popular with all the family, , , Reply, , , , , , , , Rhian Williams, , , August 14, 2023 at 3:30 pm, , , , Thanks you so much!, , , , , , , , , , , Jo, , , November 07, 2023 at 3:29 pm, , , , Can I use the mix as a replacement sausage? If so, would you fry or oven bake?, , , Reply, , , , , , , , Rhian Williams, , , November 09, 2023 at 10:47 am, , , , Yes you can! I would recommend frying, but oven baking should work too! Hope that helps!, , , , , , , , , , , Donna, , , September 06, 2024 at 4:55 am, , , , Can you suggest a substitute for the nuts in this recipe that is also seed free please? My daughter has anaphylactic allergy to ALL nuts and most seeds. Pepitas are ok but she hates them., , , Reply, , , , , , , , Rhian Williams, , , September 06, 2024 at 6:40 am, , , , Hello - the ground almonds in the pastry can be substituted for 1/5 of the amount coconut flour. For the walnuts for the \"sausage\" mixture, you can just add more beans or some vegetables, for example some boiled carrots. I hope that helps!, , , , , , , , , , , Tracy Peel, , , December 26, 2024 at 6:26 pm, , , , 2nd time I've made these. First time with almonds, second time with walnuts, soy sauce as didn't have any miso. Also added sage that makes it taste sausagy. Both times delicious! Thank you, , , Reply, , , , , , , , Rhian Williams, , , December 27, 2024 at 5:58 am, , , , Thank you so much, so happy to hear that!, , , , , , , « Older Comments, Primary Sidebar, , , , , , Hi, I’m Rhian!, I make easy, undetectably vegan + gluten-free recipes, , More about me →, , , , Popular Recipes, , , , , , , , Gluten-Free Vegan Yogurt Cake, Vegan Blueberry Muffins (Gluten-Free), Coconut Flour Bread (Vegan + Gluten-Free), Flaxseed Pancakes (Vegan + Gluten-Free), Vegan Baked Cheesecake (Gluten-Free), Quinoa Bread (Vegan + Gluten-Free), Vegan Coconut Flour Pancakes (Gluten-Free), Wagamama Wok-Fried Greens (Vegan + GF), , , , , , , , , , , , , , , Footer, , ↑ back to top, , , , About, , About, Privacy Policy & Disclosure, Copyright Notice, , , , Newsletter, , Subscribe, for free updates, , , , Contact, , Contact, Work With Me, , , , As an Amazon Associate I earn from qualifying purchases., , , Copyright © 2025 ·, Foodie Pro Theme, On, Genesis Framework, ·, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , Instructions: For the sausage:, Heat up the oil and add the onion and garlic once hot., Fry for around 10 minutes until softened., Add the mushrooms and fry for a further 5 minutes until softened., Place the cooked onion",
        "Caramelised Onion and Spinach Puff Patries": "Ingredients: , , , , , 2 tbsp, olive oil (+, 1 tbsp, for glaze), , 6, –, 7, , cups, spinach  (chopped), , 1, medium onion, , 2, –, 3, garlic cloves (grated), , 1/2 tsp, thyme, , 1, –, 3/4, , cup, nutritional yeast, , salt (to taste), , chilli flakes (to taste), , sheet of puff pastry, , 1/8 tsp, nutmeg (or a pinch ), , 1/8 tsp, black pepper (or a pinch ), , 1/2, –, 1, tsp maple syrup  (optional ), , , , , , ,  Instructions: , , , , In a pan heat olive oil over low-medium heat., , Add in your onions and saute until caramelised. Stirring frequently to prevent burning., , Mix in your garlic. chilli flakes and thyme and cook for 1 minute., , Add your chopped spinach on top and cover your pan with a lid. Cook for 6-10 minutes or until your spinach has wilted., , Continue cooking until most of the water has been cooked off., , Take off heat and mix in your nutritional yeast. Allow mixture to cool., , Preheat your oven to 220C/200C fan., , Flour your clean workspace with some flour. And divide your pre-rolled puff pastry into 6 squares., , Add your spinach and caramelised onion mixture on one-half of your pastry squares. Fold over and with a floured fork seal the edges together and create 2-3 slits on top for air to escape., , Refrigerate for 10 minutes., , Combine your 1 tbsp of olive oil, nutmeg and black pepper. Glaze over your puff pastry., , Bake for 30-35 minutes or until puffed and golden., , Drizzle with maple syrup and enjoy warm!, , , , , , Nutrition, , , Calories:, , 193, , , , , , Did you make this recipe?, , Tag, @paritakansagra, on Instagram and hashtag it, #cookingwithparita, , , , , , , , , , 2, comments /, , , , Leave a comment, , , , , Filled Under:, , American, , Appetizers, , Baking, , Brunch, , Christmas, , Diwali, , Easter, , Fall, , Father's Day, , Game Day, , Gluten Free, , Mother's Day, , New Years, , Nut Free, , Puff Pastry, , Quick & Easy, , Sides, , Snacks, , Soy Free, , Spring, , Stove Top, , Summer, , Thanksgiving, , Valentine's Day, , Vegan, , Winter, , , , , posted by, , Parita Kansagra, on, January 8, 2021, , (updated June 28, 2024), , , , , , , , , Explore More, , , , , « Previous Post, , Cheesy Garlic Pav Bhaji Sliders, , , , Next Post », , Aloo Tofu Tikki, , , , , , , Leave a Comment, Cancel, Your email address will not be published., , Required fields are marked, *, , , Recipe rating, , , , , , , , , 5 Stars, , , , , , , , , , 4 Stars, , , , , , , , , , 3 Stars, , , , , , , , , , 2 Stars, , , , , , , , , , 1 Star, , , , , , , , , Save my name, email, and website in this browser for the next time I comment., , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., , , , , , , , , , , , , , Jodie, , says:, , , , June 8, 2021 at 11:03 AM, , , I loved this soooo much..i did the same measurements but with 2 onions. Next time I’m going to double the recipe., , , Reply, , , , , , , , , , , , , , , , Parita Kansagra, , says:, , , , June 15, 2021 at 8:56 PM, , , Hey Jodie! I’m thrilled you enjoyed this recipe, thank you for your feedback. Parita xx, , Reply, , , , , , , , , , , , , , , , , , , , , , , meet, Parita, , , , , , , , Welcome to Cooking With Parita! Since becoming vegan I often get asked ‘what do vegans\r\n        eat?’. So here, on my blog you’ll find easy + delicious vegan recipes that I love! Whether you’re vegan, plant\r\n        based or even plant-curious I hope these recipes inspire you to cook mindfully + with love., , , , , , , , , , , , , , , reader, favorites, , , , , , , , Moonglet Bites, , , , , , , , , Sheet Pan Pecan Crusted Chik’n, , , , , , , , , Hazelnut Broccoli Tarts, , , , , , , , , Chocolate Pecan Scones, , , , , , , , , Masala Smashed Potatoes, , , , , shop the, CWP, kitchen, , , , , , , , shop now, , , , , Parita's, favorites, , , , , , , , get the recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , STAY, , IN, the, LOOP, , , , , , Sign up & be the first to know when I share a new vegan recipe., , , , , , , , , Email address, , , , , , , , Subscribe, , , , , , Thank you for subscribing!, , , , , , , , , , , , More, , About Me, , Contact Me, , Privacy Policy, , Terms and Conditions, , , , , Recipe Index, , Summer, , Spring, , Fall, , Winter, , , , , Recipe\r\n                Catalog, , Indian, , Healthyish, , Breakfast, , One Pan, , , , , , , , , ©, 2025          Cooking With Parita. All Rights Reserved., , , , , , , , , , , , , , , , , , , , ,"
    }
}