{
    "ingredients": {
        "Baked Veg Pakoda": "besan,cauliflower,spinach",
        "Kanda Aloo Pakoda": "coriander,potato,",
        "Cabbage Pakoda": "besan,cabbage,coriander,",
        "Air Fried Bread Pakoda": "besan,sooji,tomato ketchup,green chutney,potatoes",
        "Poha Pakoda": "coriander,poha,potato,rice,tomato,",
        "Air fried bread pakora": "besan,sooji,brown bread slices,green and tamarind chutney,potatoes",
        "Appe Pan Egg Pakoda": "boiled eggs,besan",
        "Air fried rava Bonda": "rava,curd",
        "Air Fryer Onion Bhajis": "white onions, red onion,garlic paste,ginger,panch poran,rice flour,besan",
        "Aloo Tuk": "small potato,vegan butter,tamarind and green chutney,onion,tomato",
        "Onion Bonda with spicy chutney": "onion,ginger,besan,rice flour,baking soda,dried red chili,garlic,garlic,lemon juice",
        "Potato Bhajia": "coriander,potato,tomato,",
        "Bajra corn bhajjis": "bajra,coriander,curd,yogurt,millet,",
        "Corn Fritters": "corn kernels,zucchini, onion,ginger,corn flour/besan",
        "Appe Pan Aloo Bonda": "potatoes,garlic,lemon juice,besan",
        "Appe Pan Aloo Appe": "potatoes,egg,spring onion,atta",
        "Appe Pan Mysore Bonda": "urad dal, coconut shredded,ginger",
        "Zucchini and onion fritters": "zucchini,onions,besan,rice flour",
        "Zucchini Tots in Appe Pan": "zucchini,green onion,avocado,garlic,rice flour,vegan cheese"
    },
    "recipe_url": {
        "Baked Veg Pakoda": "https://veggiedesserts.co.uk/cauliflower-spinach-pakoras/",
        "Kanda Aloo Pakoda": "https://www.tarladalal.com/kand-aloo-pakoda--faraal-recipe-32555r",
        "Cabbage Pakoda": "https://www.tarladalal.com/cabbage-pakoda-41124r",
        "Air Fried Bread Pakoda": "https://www.secondrecipe.com/bread-pakora/",
        "Poha Pakoda": "https://www.tarladalal.com/poha-pakoda-poha-pakora-42408r",
        "Air fried bread pakora": "https://www.secondrecipe.com/bread-pakora/",
        "Appe Pan Egg Pakoda": "https://thebellyrulesthemind.net/2015/02/egg-pakodas-egg-fritters-made-in-appe-pan/",
        "Air fried rava Bonda": "https://www.airfryerbook.com/2018/11/air-fried-ravasujisemolina-bonda.html?view=mosaic",
        "Air Fryer Onion Bhajis": "https://greatcurryrecipes.net/2020/11/17/air-fryer-onion-bhajis/",
        "Aloo Tuk": "https://hebbarskitchen.com/aloo-tuk-recipe-sindhi-tuk-recipe/",
        "Onion Bonda with spicy chutney": "https://hebbarskitchen.com/onion-bonda-recipe-vengaya-bonda-eerulli/",
        "Potato Bhajia": "https://www.tarladalal.com/crispy-potato-bhajias-aloo-bhajiya-recipe-36933r",
        "Bajra corn bhajjis": "https://www.tarladalal.com/bajra-khichu-with-masala-dahi-41294r",
        "Corn Fritters": "https://www.cookclickndevour.com/corn-fritters-recipe-no-deep-fry-sweet-corn-fritters-recipe/?fbclid=IwAR2zuP6tYAK4-qQrVtOHwoBCj6JQ46wMXibyDAaqob3KATqpLFVz0d_UCXU",
        "Appe Pan Aloo Bonda": "https://thebellyrulesthemind.net/batata-vada-aloo-bonda-appe-pan/",
        "Appe Pan Aloo Appe": "https://www.youtube.com/watch?v=HOBeJWVZDdk",
        "Appe Pan Mysore Bonda": "https://simplyvegetarian777.com/mysore-bonda-in-appe-abelskiever-pan/",
        "Zucchini and onion fritters": "https://youtu.be/WU79GykkVkA",
        "Zucchini Tots in Appe Pan": "https://thebellyrulesthemind.net/zucchini-tots/"
    },
    "Recipe": {
        "Baked Veg Pakoda": "Ingredients: , , Recipe sponsored by e-Visa., , These Baked Spinach Cauliflower Pakoras are really easy to make and taste great!, , Simply combine the veggies with garam masala spice, turmeric and gram (chickpea) flour and then bake them to create fritters with the vegetables., , The traditional Indian snacks are normally deep-fried, but these ones are baked, so they are a healthier version of the vegan, gluten-free snack or side dish., , I absolutely love making them as they're quick, easy and delicious. Perfect alongside a curry., , Turn your curry into something special by serving these cauliflower pakora on the side. Try them with some mango chutney or a cucumber raita., , Why you'll love this recipe, , Cauliflower pakora are a tasty Indian snack., , A great way to each cauliflower and spinach., , Vegan and gluten-free., , Only 39 calories each., , These cauliflower pakoras are baked, not fried, making them healthier., , A great side dish alongside an Indian recipe., , The pakora are not only a quick and healthy snack, but they're also a great way to reduce waste by using up vegetables., , FAQs, , How many, calories, are in spinach pakora? These vegetable pakoras have just 39 calories each!, , Can I cook the cauliflower pakoras in an, airfryer, , ¾, , cup, , (100g) gram flour (chickpea flour), ½, , teaspoon, , baking powder, ½, , teaspoon, , ground turmeric, ½, , teaspoon, , garam masala, ½, , teaspoon, , salt, ½, , teaspoon, , ground pepper, ¼, , cup, , (50ml) water, 2, , cups, , (250g) cauliflower, , roughly chopped, 1, , cup, , (50g) spinach, chopped, , Add the chopped cauliflower and spinach to the batter and mix thoroughly., Drop tablespoonfuls of the mixture onto a baking sheet, or spoon into muffin cups. Cook for 10 minutes then flip and cook for 7-10 minutes on the other side or until golden. Watch frequently so they don’t burn., , , Notes, They are as lovely dipped in a cooling cucumber and mint raita or sweet mango chutney, as they are eaten on their own or alongside a curry., , Try them with my popular, Red Lentil Dahl, alongside, Easy Naan Bread, ., , Enjoy with, Tofu Curry, or, Chickpea Curry, ., , Pakoras are fantastically adaptable, so you could add in other vegetables., , Try substituting with frozen peas, aubergine, onions or grated carrot., , Make them in an air fryer instead of oven baking., , Make them spicier with added finely chopped chilli peppers, chilli powder or dried chilli flakes., , Nutrition, Calories:, 39, kcal, Carbohydrates:, 6, g, Protein:, 2, g, Sodium:, 112, mg, Potassium:, 177, mg, Fiber:, 1, g, Sugar:, 1, g, Vitamin A:, 390, IU, Vitamin C:, 11.2, mg, Calcium:, 21, mg, Iron:, 0.7, mg, , , The nutritional information provided is approximate and can vary depending on several factors, so is not guaranteed to be accurate. Please see a registered dietician for special diet advice., , , , , , Tried this recipe?, Mention, @kateveggiedesserts, or tag #veggiedesserts! I love seeing your recreations., More Side Dish Recipes, Roasted Beetroot Sweet Potato Salad, Christmas Couscous, Gorgonzola Brussels Sprouts, Brussels Sprout Slaw, , , , , , Pin, , , , , Tweet, , , , , Share, , , , , Email, , , Reader Interactions, Comments, , , , 4.87 from 22 votes (, 8 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , , Jonathan S., , , March 17, 2023 at 10:58 pm, , , , I wasn't able to find chickpea flour at my market, nor did I have time to make my own from scratch, so I tried making my pakoras using a mixed almond flour/coconut flour substitute. It didn't hold together very well. I think I might try it with an egg in the mix next time. In spite of my loose results with the wrong flours, they tasted amazing., , , Reply, , , , , , , , Christine, , , July 20, 2020 at 1:04 am, , , , Thank you so much for posting this recipe! I'm always looking for healthier versions of my family's favorite foods, and this one was a hit! My husband, 19 year old and 12 year old sons loved it!, , , Reply, , , , , , , , Chen, , , July 19, 2020 at 2:03 am, , , , So delicious and easy to make! My family and I love them., , , Reply, , , , , , , , Amna, , , March 06, 2019 at 9:31 pm, , , , If I'm making a large batch, should I freeze them after baking or before?, , Thanks!, , , Reply, , , , , , , , Kate Hackworthy, , , March 07, 2019 at 9:51 am, , , , Hi Amna, It would be best to freeze them after they've been baked and cooled. I hope you enjoy the recipe!, , , Reply, , , , , , , , , , Linda, , , November 11, 2018 at 2:24 pm, , , , Oh, this was the perfect side to our curry. I love the fact that they're baked and also kicked them up a notch with a little more spice. Great healthy treat to have on hand., , , Reply, , , , , , , , Justine Howell, , , October 11, 2018 at 5:22 pm, , , , WAs looking for something new to try to make with my kids and this is perfect! Looks amazing., , , Reply, , , , , , , , Marjory, , , October 11, 2018 at 4:30 pm, , , , These are absolutely stunning! I love that they are baked and you don't have to deal with messy oil!, , , Reply, , , , , , , , Lauren, , , October 11, 2018 at 3:05 pm, , , , I can't believe these are only 39 calories each! I've been wanting to experiment with chickpea flour and I will definitely be trying these!, , , Reply, , , , , , , , Jill, , , October 11, 2018 at 3:03 pm, , , , I have never heard of pakoras but they sound tasty and healthy!, , , Reply, , , , , , , , Chris, , , October 11, 2018 at 2:40 pm, , , , So yummy looking! I know this sounds like a crazy question, but does it matter whether using baby spinach or not? I want mine to come out with that nice green colour, , , Reply, , , , , , , , Julia, , , October 11, 2018 at 1:45 pm, , , , My mom would make something like this when I was a kid but with different spices. These are definitely more flavorful though 🙂 Delish!, , , Reply, , , , , , , , Claudia Lamascolo, , , October 11, 2018 at 1:17 pm, , , , I love that these are baked.  I try and bake just about eveyrthing or air fry now. Its a change a way of healthy foods for our future looks great!, , , Reply, , , , , , , , Becca Talbot, , , August 30, 2018 at 7:36 pm, , , , These sound delicious! I really like pakoras - when I visited India back in 2016 with my grandma we did an Indian cookery lesson and learnt how to make them there ☺ x, , , Reply, , , , , , , , Marisa Franca @ All Our Way, , , April 13, 2016 at 3:16 pm, , , , We love to try new cuisines and their recipes. This sounds delicious -- guess we're off to a new adventure and I'm glad they are baked instead of fried., , , Reply, , , , , , , , fabfood4all, , , April 13, 2016 at 2:39 pm, , , , I love that these are baked and not deep fried, must try them as my family would love these:-), , , Reply, , , , , , , , peter @feedyoursoultoo, , , April 13, 2016 at 2:32 pm, , , , Love this idea.  Love working with cauliflower.  It is the perfect vehicle to absorb the wonderful spices in your reicpe., , , Reply, , , , , , , , Kristen, , , April 13, 2016 at 2:12 pm, , , , I just got some turmeric and am looking for ways to use it!   Thank-You!, , , Reply, , , , , , , , Ali @ Home & Plate, , , April 13, 2016 at 1:48 pm, , , , I've never had Pakoras but they look great. Wish you lived closer so I would just pop over to give them a try. Looks delish!, , , Reply, , , , , , , , Mark, Compass & Fork, , , April 13, 2016 at 12:48 pm, , , , I love pakoras. I often order them at my local Indian restaurant. However, I have not tried cauliflower and spinach. It looks lovely and I will be trying this., , , Reply, , , , , , , , Charlotte, , , April 13, 2016 at 12:08 pm, , , , You make these seem so easy to make! I love the colour pop of the spices on the spoon too 🙂 a beautiful post as always lovely., , , Reply, , , , , , , , Rhiannon at VegBurge, , , April 13, 2016 at 12:08 pm, , , , These look so amazing. I am bookmarking this for next time I make a curry!, , , Reply, , , , , , , , Hannah - Budding Smiles, , , April 08, 2016 at 11:44 pm, , , , These look utterly delicious! I adore pakoras and actually haven't had an Indian meal in ages so I feel one coming on!xx, , , Reply, , , , , , , , unicornsinthekitchen, , , April 08, 2016 at 7:06 pm, , , , Anything with turmeric and spinach makes me drool! great recipe for a simple weeknight dinner or light lunch! Thanks!, , , Reply, , , , , , , , annalisanuttall, , , April 08, 2016 at 6:32 pm, , , , That look and taste amazing - i might have to try this. xx, , , Reply, , , , , , , , Sara- The Organic Dietitian, , , April 08, 2016 at 6:22 pm, , , , Cauliflower has quickly become one of my favorite vegetables to cook with.  Another great recipe to add to my rotation., , , Reply, , , , , , , , yourcooktoria, , , April 08, 2016 at 6:11 pm, , , , I've never tried anything like it, but these pakoras look so tasty. I am saving this recipe for later!, , , Reply, , , , , , , , Tracy | Baking Mischief, , , April 08, 2016 at 4:54 pm, , , , I've never tried pakoras before. They look delicious! I love that they are so packed full of different flavors and baked instead of deep fried (though I'm sure deep fried is delicious too 😉 )., , , Reply, , , , Primary Sidebar, , , , , , Hi, I'm Kate, , a journalist, author and multi-award-winning food blogger. Here you'll, find vegetarian recipes, and vegan recipes celebrating vegetables, from dinner to dessert! If you love, vegetables, , you've come to the right place., About Me, , , , , Popular recipes, , Easy Naan Bread Recipe (yeast-free), The BEST Easy Red Lentil Dahl, Easy Lentil Soup, Cane's Sauce Recipe (copycat), , Easter Recipes, , Hot Cross Bun Ice Cream Sandwiches, Easter Rice Krispie Nests, Italian Easter Bread (Pane di Pasqua), Mushroom Wellington, , My cookbook, , , , Check out my, Veggie Desserts Cookbook, ,, full of tasty desserts with vegetables!, , , , , Footer, , ↑ back to top, , , , About, , , About me, , Contact, , Work with me, , Press, , Veggie Desserts Cookbook, , , , , Newsletter, , , Sign Up, for newsletter updates, , , Partner Sites, , , You Say Potatoes, , , , , Disclaimers, , , Disclosures & Affiliate Policies, , Privacy Policy, , Cookie Policy, , Accessibility Policy, , , , , , As an Amazon Associate, I earn from qualifying purchases., , Copyright © 2025, Kate Hackworthy / Veggie Desserts, , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Let us know what you thought of this recipe:, , , This recipe worked out perfectly!, , The whole family loved this recipe!, , Easy and tasty!, , I'm sure we'll be making this recipe again and again!, , , Or write in your own words:, , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , How can I make pakora, healther, ? By following this recipe for baked vegetable pakora - they're baked, not fried., , Can I, freeze, baked pakora? These pakoras can be frozen in a bag or container for up to 1 month. If freezing a large batch, place baking paper between layers., , , Serving suggestions, , Cauliflower pakora (also known as cauliflower pakoda) are as lovely dipped in a cooling cucumber and mint raita or sweet mango chutney, as they are eaten on their own or alongside a curry., , Serve with this, Bombay Potatoes Recipe, as another curry side dish., , Try a side of pakora with my popular, Lentil Dahl, alongside, Easy Naan Bread, ., , Enjoy with, Tofu Curry, , Rajma Masala (kidney bean curry), , Carrot Curry, , , Paneer Butter Masala, , , Vegan Butter Chicken, or, Chickpea Curry, ., , Try one of these other, curry recipes, with your pakora., , Variations, , Pakora are fantastically adaptable, so you could add in other vegetables., , Try substituting with frozen peas, aubergine, onions or grated carrot in your pakoda., , Make your cauliflower pakora in an air fryer instead of oven baking., , Make them spicier with added finely chopped chilli peppers, chilli powder or dried chilli flakes., , , Disclosure: This Cauliflower Pakoda recipe was sponsored by e-visa. All opionions are my own. Thanks for supporting the brands that make it possible for me to write Veggie Desserts., , Are you planning a trip to India?, , e-Visa.co.uk, is a modern visa bureau with a clear mission, they want to use streamline the visa process through strong customer service and a great customer experience. Many travellers dread having to arrange their travel documents, and Visa procedures can be cumbersome, however, e-Visa can help with your, India Visa, ., , , Sign up, for our free newsletter and never miss a recipe!, , Plus, you'll get a free eBook: 15 Minute Vegan Dinners!, , , , Check out the, Veggie Desserts + Cakes cookbook, on Amazon, , , 📖 Recipe, , , , Vegetable Pakoras, , , Kate Hackworthy | Veggie Desserts, , , These aromatic Spinach Cauliflower Pakoras combine vegetables, Indian spices and gram (chickpea) flour to create tasty baked fritters. Vegan and gluten-free., , , 4.87, from, 22, votes, , , , Print Recipe, , Pin Recipe, , , , Cook Mode, Prevent your screen from going dark, , Save, Saved!, , , , Prep Time, 5, minutes, , mins, Cook Time, 20, minutes, , mins, Total Time, 25, minutes, , mins, , , , , , , Course, Side Dish, Cuisine, Indian, , , , , , Servings, 12, Calories, 39, , kcal, , , , , Preheat oven to 425F / 220C. Lightly grease a baking sheet or muffin tin with cooking oil., In a large bowl, whisk the flour, baking powder, turmeric, garam masala salt and pepper. Slowly whisk in the water",
        "Kanda Aloo Pakoda": "Ingredients: , , , , , , , , drop spoonfuls of the mixture in it and deep-fry on a medium flame till the pakodas are golden brown in colour from all sides. Drain on absorbent paper. Serve, kand aloo pakoda, immediately with green chutney., , The peanuts not only add an exciting flavour to these, yam pakodas, , they also make the texture more cheery. The best part is that this, aloo bhajiya for fasting, can be enjoyed at any time of the day on fasting days., , These pakodas must be enjoyed off the pan to enjoy their crispy texture. Green chutney with, upvas aloo kand pakora, is all you need for serving., , Tips for, kand aloo pakoda, . 1. Drain the water from parboiled purple yam very well so there is no difficulty in binding the mixture. 2. Grate the raw potatoes just before mixing, else they will discolour. 3. If you notice that the mixture disintegrates in oil, add a tbsp of arrowroot flour, mix well and continue deep-frying. 4. Do not keep turning the pakodas frequently once immersed in oil or it may lose its shape and disintegrate., , Enjoy, kand aloo pakoda recipe, |, navratri, vrat ka khana, |, upvas aloo kand pakora, |, aloo bhajiya for fasting, | with video and recipe below., , , , , , , Tags, , , , , Deep Pan, , Indian Comfort Foods, , Starters / Snacks, , Deep-fried Indian Starters, , Evening Tea Snacks, , Pakora Pakoda, , , , , , , , , , , , , , , , , , , , Preparation Time, , 20 Mins, , , , , , , Cooking Time, , 10 Mins, , , , , , , Total Time, , 30 Mins, , , , , , , Makes, , 2 servings, , , , , , , , , , , , , , , For Kand Aloo Pakoda, , , 1 cup, parboiled and grated purple yam (kand), , , 1 cup, grated potatoes, , , 1 tbsp, arrowroot (paniphal) flour, , , 2 tsp, roasted and powdered peanuts, , , 2 tsp finely, chopped coriander (dhania), , , 1 tsp finely, chopped green chillies, , , , rock salt (sendha namak), to taste, , , oil, for deep-frying, , , For Serving With Kand Aloo Pakoda, , , , readymade kesar-flavoured shrikhand, , , , , , , Heat the oil in a non-stick kadhai, drop spoonfuls of the mixture in it and deep-fry on a medium flame till the pakodas are golden brown in colour from all sides. Drain on absorbent paper., Serve the, kand aloo pakoda, immediately with green chutney., , , , , , , , , , , , , , Kand Aloo Pakoda ( Faraal Recipe) Video by Tarla Dalal, , , , , ×, , , , , , Kand Aloo Pakoda ( Faraal Recipe) recipe with step by step photos, , , , , , , , , , , , , , , , , , , like kand aloo pakoda recipe, , , , , , , , , , like kand aloo pakoda recipe |, navratri, vrat ka khana | upvas aloo kand pakora | aloo bhajiya for fasting |, , see other, pakora recipes, we love., Pakoda or bhajiya, are crispy, deep-fried fritters that can be relished for, breakfast, ,, evening snack, or even along with meals. The most commonly used flour is besan but, the addition of rice flour, corn flour or refined flour adds a crispy texture to the fried pakora. You can make use of any vegetable or even bread or fruit to make fried pakoras. The fried bhajiya can be eaten as it is with, sweet chutney, or, green chutney, along with a cup of chai. You can even stuff them between pav and make a wholesome snack. See below some of the pakora recipes., , poha pakoda recipe, , | poha pakora | Punjabi poha aloo pakoda | with 14 amazing images., , pumpkin pakora recipe, | kaddu pakoda | bhopla pakoras | red pumpkin fritters | with 13 amazing images., , pakora recipe, | veg pakora | vegetable pakora Mumbai street food | mix vegetable pakora | with amazing 20 amazing images., , , , , , , , , , , , , , , , , , what is kand aloo pakoda made off?, , , , , , , , , , what is kand aloo pakoda made off? upvas aloo kand pakora, is made from, 1 cup parboiled and grated purple yam (kand), 1 cup raw potatoes, peeled and grated, 1 tbsp arrowroot (paniphal) flour, 2 tsp roasted and powdered peanuts, 2 tsp finely chopped coriander (dhania), 1 tsp finely chopped green chillies, rock salt (sendha namak) to taste and oil for deep-frying., kand aloo pakoda., , , , , , , , , , , , , , , , , how to parboil and grate kand ?, , , , , , , , , Chop the kand into large chunks and pressure cook with enough water for 3 whistles. Let it cool completely before opening the lid., , , , , , Let the cooked kand cool slightly, then use a knife to gently scrape away the loosened peels., , , , , , After peeling the kand, grate it with a box grater . Use the grated kand throughout your recipe as needed., , , , , , , , , , , , , , , , , , , , how to peel and grate raw potatoes ?, , , , , , , , , peel and grate raw potatoes., , , , , , , , , , , , , , , , , , , , batter for kand aloo pakoda, , , , , , , , , In a deep bowl, put, 1 cup, parboiled and grated purple yam (kand), ., , Add, 1 cup, raw potatoes, peeled and grated, ., , Add, 1 tbsp, arrowroot (paniphal) flour, ., During vrat, , , Add, 2 tsp, roasted and powdered peanuts, ., We have used this as peanuts are perfect for fasting., , , Add, 2 tsp finely, chopped coriander (dhania), ., Note that some people don't have coriander during upvas, so then omit coriander., , , Add, 1 tsp finely, chopped green chillies, ., This will give the spice to the pakora., , , Add, rock salt (sendha namak), to taste., Rock salt is perfect for vrat., You can use regular salt if not fasting., , Mix well., As soon as you mix, make the pakora or else the aloo will release water. Press down a bit while mixing so that the binding happens., , , , , , , , , , , , , , , , , making kand aloo pakoda, , , , , , , , , Heat the oil in a non-stick kadhai., , Drop spoonfuls of the mixture in it., , Deep-fry on a medium flame till the pakodas are golden brown in colour from all sides., , extra step., , , Drain on an absorbent paper., , , Serve the kand aloo pakoda immediately., , , , , , , , , , , , , , , , pro tips for kand aloo pakoda, , , , , , , , , Do not keep turning the pakodas frequently once immersed in oil or it may lose its shape and disintegrate., , , Serve, kand aloo pakoda | navratri, vrat ka khana | upvas aloo kand pakora | aloo bhajiya for fasting |, , , immediately with, green chutney, and, tomato ketchup., , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 385 cal, Protein, 3 g, Carbohydrates, 31.7 g, Fiber, 4.1 g, Fat, 27.6 g, Cholesterol, 0 mg, Sodium, 12.7 mg, , , , , , , Click here to view, Calories for Kand Aloo Pakoda ( Faraal Recipe), , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , todaythinking.com, , March 13, 2025, midnight, , best recipe website forever, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Happy to know you like our web site. Do try more and more recipes and share with us your feedback. Happy Cooking!, , , , , , , , , , , , , Jasmine Shah, , March 13, 2025, midnight, , Can we make this pakodas in Paniyaram  pan???, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi, yes you can try making in those moulds., , , , , , , , , , , , , Priyanka, , March 13, 2025, midnight, , what can be substituted for peanuts in this recipe, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , You can omit the peanuts if you don''t like. If the mixture doesn''t bind well, add a little more arrowroot flour., , , , , , , , , , , , , Delwar Hussain, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! keep reviewing recipes and articles you loved., , , , , , , , , , , , , Gita, , March 13, 2025, midnight, , Hello,\ncan you please send me recipes for Acid Reflux.I am suffering from Hiatus Hernia.I am pure Lacto vegetarian.\nThanks., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , pari, , March 13, 2025, midnight, , great post, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thanks for the feedback !!! Keep reviewing recipes and articles you loved., , , , , , , , , , , , , juhi, , March 13, 2025, midnight, , Wooww !! these pakodas turned out so tasty !!!!, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Gandhi Dhwani, , March 13, 2025, midnight, , I had 1 pakoda, and after that it was so difficult to stop. A new and unique combination of kand and potato makes great bhajiyas. They are so crispy and just perfect to taste. Perfect spiciness too. Once you have this, i am sure you will leave aloo pakoda, kanda pakoda and all behind.., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Juhi Danani, , March 13, 2025, midnight, , Wooww!! the pakodas turned out so tasty. YUM, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Yup Thank You !!, , , , , , , , , , , , , Kalyan Food Lover, , March 13, 2025, midnight, , Will try this during Fasting...., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , harshadsheth, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi Harsha, We are happy to know you liked the Kand Aloo Pakoda   recipe. Do try more and more recipes and let us know how they turned out.. Happy Cooking !!, , , , , , , , , , , , , Payal Parikh 86, , March 13, 2025, midnight, , I always make this recipe on faraal days, It is so easy and quick to make and taste great.. The combination of potatoes with kand and spiciness make it taste wow, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Rajani Arora, , March 13, 2025, midnight, , Mast..., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi Rajani,\nWe are happy to know you liked the recipe. \nDo try more and more recipes and let us know how they turned out..\nHappy Cooking !!, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Bhavnagari Chillies (  Faraal Recipe), , , 76 Calories, , , , , , , , , , , , , , , , , buckwheat khichdi recipe | kutto khichdi | farali kutto khichdi | healthy kutto khichdi |, , , 444 Calories, , , , , , , , , , , , , , , , , Dahiwale Aloo Ki Subzi with Rajgira Puris recipe, , , 446 Calories, , , , , , , , , , , , , , , , , Farali Dosa, How To Make Farali Dosa, Faral Foods, Faraal Dosa, , , 70 Calories, , , , , , , , , , , , , , , , , farali idli sambar recipe | vrat sambar | navratri, vrat idli chutney |, , , 532 Calories, , , , , , , , , , , , , , , , , farali pahadi tikka recipe | paneer, sweet potato, potatoes fasting tikka | Ekadashi vrat upvas tikka |, , , 160 Calories, , , , , , , , , , , , , , , , , Faraali Pattice (  Faraal Recipe), Upvaas ki Kachori, Sweet Kachori, , , 139 Calories, , , , , , , , , , , , , , , , , Green Chutney (Faral Recipe), Phalahari vrat ki chutney, Vrat ki chatni, , , 13 Calories, , , , , , , , , , , , , , , , , Kand Aloo Pakoda ( Faraal Recipe), , , 385 Calories, , , , , , , , , , , , , , , , , kand wafers recipe | kand chips | purple yam chips for vrat upvas |, , , 233 Calories, , , , , , , , , , , , , , , , , khamang kakadi recipe | Gujarati khaman kakadi | farali kachumber |, , , 132 Calories, , , , , , , , , , , , , , , , , Khandvi (  Faraal Recipe), , , 228 Calories, , , , , , , , , , , , , , , , , farali handvo recipe |  kand potato handvo for vrat | aloo kand handvo with paneer stuffing |, , , 269 Calories, , , , , , , , , , , , , , , , , farali potato wafers recipe | fasting potato chips | vrat potato chips |, , , 416 Calories, , , , , , , , , , , , , , , , , peanut curd chutney | faral chutney | farali  chutney for sabudana vada |, , , 64 Calories, , , , , , , , , , , , , , , , , peanut kadhi recipe | farali mungfali kadhi | vrat ki kadhi | healthy peanut kadhi |, , , 112 Calories, , , , , , , , , , , , , , , , , Piyush | Faral Piyush Recipe | homemade Gujarati piyush |, , , 236 Calories, , , , , , , , , , , , , , , , , rajgira paneer paratha | farali paratha recipe | vrat ka paratha | upvas ka paratha |, , , 145 Calories, , , , , , , , , , , , , , , , , upvas sabudana vada recipe | Maharashtrian style faral sabudana vada | Gujarati, , , 126 Calories, , , , , , , , , , , , , , , , , sama panki recipe | farali sama panki | rajgira, arrowroot, sama panki with curds |, , , 48 Calories, , , , , , , , , , , , , , , , , Shakarkand Ka Halwa, Faraal Sweet Potato Halwa Recipe, , , 200 Calories, , , , , , , , , , , , , , , , , singhada halwa, sheera recipe | farali singhare atte ka halwa | vrat, fasting, , , 300 Calories, , , , , , , , , , , , , , , , , Kand Sandwich, Faraali Purple Yam Sandwich Recipe, , , 49 Calories, , , , , , , , , , , , , , , , , farali pancakes recipe | sweet farali pancake | buckwheat pancake for upvas |, , , 119 Calories, , , , , , , , , , , , , , , , , Thandai (faraal Recipe), Sardai Cool Drink, , , 271 Calories, , , , , , , , , , , , , , , , , upvaas thalipeeth recipe| rajgira faraali thalipeeth | Maharashtrian upvaas thalipeeth |, , , 149 Calories, , , , , , , , , , , , , , , , , yam raita recipe |  farali suran raita | senai pachadi |, , , 245 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like kand aloo pakoda recipe, , , , , , , , , What is kand aloo pakoda made off?, , , , , , , , , How to parboil and grate kand ?, , , , , , , , , How to peel and grate raw potatoes ?, , , , , , , , , Batter for kand aloo pakoda, , , , , , , , , Making kand aloo pakoda, , , , , , , , , Pro tips for kand aloo pakoda, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , kand aloo pakoda recipe, |, navratri, vrat ka khana, |, upvas aloo kand pakora, |, aloo bhajiya for fasting, |, , kand aloo pakoda, is a sumptuous snack for fasting days which is very easy to prepare. Learn how to make, upvas aloo kand pakoda, ., , Crispy and flavourful pakodas made of purple yam (kand), potatoes and crushed peanuts, this, navratri, vrat ka khana, are a perfect snack time treat. It is interesting to know that these pakodas are held together by the starch in yam and potatoes along with peanuts and needs very little arrowroot flour., , To make, kand aloo pakoda, , , , , For kand aloo pakoda, To make, kand aloo pakoda, ",
        "Cabbage Pakoda": "❌ Error scraping https://www.tarladalal.com/cabbage-pakoda-41124r: 404 Client Error: Not Found for url: https://www.tarladalal.com/cabbage-pakoda-41124r",
        "Air Fried Bread Pakoda": "Ingredients: More air fryer recipes, , , Besan, /gramflour/chickpea flour (red lentil flour for air fryer version), , Slices of brown/white bread slices, , Mashed potato mix with salt and spices, , Green chutney, , Tomato Ketchup/Tamarind chutney/spicy pickle masala, , Baking soda, , Turmeric powder, , Red chili powder, , Salt as per taste, , Oil for frying, , , Equipment, , , Whisk, , Kadai for traditional frying, , or Air fryer for low oil option, , , More air fryer recipes, , If you are looking for more Indian air fryer recipes, read few of them there, , , Air fryer Sabudana Vada, , Air fryer Dahi vada, , onion pakora, , namak pare, , Air Fryer Samosa, , paneer pakora in air fryer, , , Read the full list of our, air fryer Indian vegetarian recipes, here., , 1, , cup, , besan/gramflour/chickpea flour, , red lentil flour for airfryer variant gives better results, 6, , slices, , of brown/white bread slices, 1, , Pinch, , of baking soda, 1, , cup, , of mashed boiled potatoes, , with salt and half of spices below, ¼, , teaspoon, , turmeric powder, ¼, , teaspoon, , red chilli powder, , or as per taste, 1, , teaspoon, , salt, water, , same quantity as besan, Tomato Ketchup/Tamarind chutney/Pickle masala, Green chutney, Oil for frying,  Instructions: How to make bread pakora in air fryer?, Traditional Bread Pakora | Air fryer Bread pakora recipe, , Pakode, is a crowd favorite. People of all age groups love it. We make lots of, pakoras, in India. Be it, double fried, , onions, potatoes or mixed veg. These days non vegetarians even make chicken pakoda. Basically anything dunked in a gram flour batter and fried to perfection makes people happy.If you are travelling, you can just have fritters with bread.My mum even serves them with roti as a meal., , Onion fritters can later be dunked in a, kadhi, for main course. Just serve it with rice. Punjabi, kadhi pakoda, makes lunch easy, if you like your yogurt. Just have some, kadhi, and sleep is guaranteed. Some people love the, baked version, too. If you have nothing at home and guests are coming over ,just go on and make some. Everyone loves it especially in rains and winter. Nothing like fritters and tea. Thus, this recipe will always be special to me. They are my pick-me up when I am down. As each plate comes with so many fond memories! Sharing this recipe so that you can make some too., , , How to make bread pakora in air fryer? (video recipe), , , , air fryer bread pakora, , , , , Spread chutney on the bread slices. (Make sure you do not keep them for long before frying else it gets soggy), , , , 2. Add the potato mix on slice. Cover with another slice. Cut them diagonally so that it looks like triangles., , , 3. Meanwhile, keep 2 tbsp. gram flour aside in a plate. Mix ¾ cup of besan with spices, baking soda and water to make a thick batter. Dip the bread sandwich in dry besan first and then in the, besan, batter., , , 4. Deep fry them in hot oil until golden brown, evenly on both sides.(for air fryer, refer steps below), , , 5. Serve them hot with chutney, , How to make bread pakora in air fryer?, , Can we make bread pakora in air fryer ? if you are looking for any answer to this questions, then below are the steps to make the fritter in air fryer., , One feedback that I received was to use, roasted besan,, i think that might help remove any rawness if you feel any., , If you can get, red lentil flour, (masoor dal flour), then it works much better, you can replace besan with red lentil flour for airfryer recipe and it does not leave the uncooked taste., , Another feedback was to use, little sooji(semolina, ) for more crispy texture, I tried that and it did help., , , Follow 1-3 to make the bread pakoras. Make a thin batter (equal quantity of besan and water) and dip the bread pakoda in the batter, , , , 2. Allow the excess batter to drip by placing it on a wire rack., , , 3. Pre heat the air fryer for 5 minutes at 180 deg C| 355 deg f. Place all the slices in a pre heated air fryer on top of a perforated baking sheet (baking sheet with holes) . Air fry for 8-9 minutes, , , 4. Remove the parchment paper/baking sheet,Flip the fritters ,brush with oil and continue to cook for 5-6 minutes or until cooked., , , 5. Serve bread pakora hot with chutney or sauce., , bread pakora in air fryer, , , , , Print Recipe, , 4.34, from, 9, votes, , , Traditional Bread Pakora | Air fryer Bread pakora recipe, , , Bread pakora is best served hot with some chutney. Whether you like them fried or make them in air fryer, they are perfect for tea time.Learn to make it here., , , Prep Time, 10, minutes, , mins, Cook Time, 16, minutes, , mins, , , Course:, Appetizer, Cuisine:, Indian, Keyword:, air fryer bread pakora, bread fritters, bread pakoda, bread pakora, fritters, , Servings:, 2, , Author:, bhavana bhatia, , Equipment, air fryer for low oil version, whisk, , Spread chutney on the bread slices., Add the potato mix on slice,cover with another slice., Cut the bread sandwich diagonally in 2 equal sizes., Meanwhile,keep 2 tbsp. besan aside in a plate., Mix remaining  besan with spices,baking soda and water to make a thick batter., Dip the bread sandwich in dry besan first and then in the besan batter., Fry in hot oil on both sides., For low oil air fryer version, Make a thin batter (equal quantity of chickpea flour/besan and water) with little sooji (semolina), Dip the bread slices in batter, Allow the excess batter to drip by placing it on a wire rack., Place the pakora on the air fryer basked which is already lined with parchment paper. The baking paper should have holes in it., Pre heat the air fryer at 180C for 5 minutes., Place all the slices on the air fryer basket,spray/brush oil, Air fry the bread pakora for 8-9 mins at 180 deg C., Remove the parchment paper/baking sheet, flip the fritters ,brush with oil and continue to cook for 5-6 minutes or until cooked., Cut the pakoda from center to check for any rawness, if there is still some rawness, cut all of them in 2 pieces, brush oil and cook for few minutes., Serve hot with mint chutney and tomato ketchup., , Video, , Notes, Tip: To make it extra spicy you can replace sauce with spicy pickle masala., , , The batter for air fryer pakora, should not be too, , thick, ,else they might taste raw., , , Another feedback that I received was to use roasted besan, I think that might help remove any rawness if you feel any,, , I made a batter little thin(equal ratio of water and besan) and was able to cook these in 11-12 minutes, if you batter is little thick, it will take more time(4-5 minutes more), , , Nutrition, Serving:, 2, g, , Variation, , You can make the fritters without the chutneys. Add a pickle masala on one side if you like it hot and spicy. You may only add a tomato sauce on the bread if making for kids who cannot handle too much spice. You may even omit sauce. It depends on what you like, these fritters can be customized. You may omit the potato stuffing too if in a rush. Just dip bread in chickpea batter and fry it. Add a teaspoon of garam masala powder, amchur or dry mango powder instead to the batter so that you get the tangy flavor.They are perfect when it rains or when its cold or when you are just not in a mood to cook something elaborate., , FAQ, , , What are pakoras served with?, , Mint chutney,, tamarind, date chutney, and even, tomato ketchup, ., , , Why my pakoda is not crispy?, , If the oil is too hot, it will not cook from inside. If it is too cold, it will soak a lot of oil. Always cook on medium flame., , , , , , More Appetizers/Starters, Air fryer veg seekh kebab | vegan seekh kebab, Air fryer hara bhara kebab, tikha gathiya recipe | air fryer gathia recipe, Top Holi Recipes, , , , 135, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4.34 from 9 votes (, 9 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , Hi,I am Bhavana & this is my wonderland of recipes.I have been in IT for 15+ years have always loved writing.My husband Gaurav & I,love to cook, click & host people, , More, about me →, , , Easy Air fryer recipes, , Air fryer accordion potatoes recipe, Air fryer smashed potatoes | smashed potatoes recipe, Crispy and easy Ninja Air fryer potato wedges recipe, Easy air fryer french Fries | air fryer home fries, , Popular posts, , Air fryer onion pakora | Crispy Onion bhajiya recipe, Air fryer potato cakes | Potato cakes in air fryer, authentic Indian curry sauce recipe, Curried chana saag | Spinach Chickpeas curry recipe, , , , , , Footer, , ^ back to top, , , , Our Recipe collections, , , , Useful links, , , Contact Us, , Recipes, , Web Stories, , Privacy Policy, , , , , Copyright © 2025, Secondrecipe, , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , ,",
        "Poha Pakoda": "Ingredients: , , , , , , , , so you do not have to think twice about making it even after a busy day. After all, some days are worth celebrating, with or without a reason, and who wants to have just biscuits with their tea on such days?, Notes on, poha pakoda recipe, . 1. To make, Poha Pakoda, , first clean and wash the rice flakes in a sieve in enough water. We have used the thick variety of poha for this recipe. 2. Transfer the poha into a deep bowl. Ensure you do not soak the poha in water, just rinse them or else they will absorb a lot of moisture which will make it difficult to make the, Poha Pakoda, . 3.add finely chopped coriander. They not only add a colour to the, Poha Pakoda, but also, enhance the taste., So, go for this crispy and tasty, poha pakoda snack, that is sure to steal your heart with its unique mouth-feel, which combines the crunch of poha with the succulence of potatoes. Over all, a sure-shot hit with the entire family!, You can also try other, Pakodas, like, Moong Dal and Rice Mini Pakodas, or, Methi Pakoda, ., See step by step photos and video of, poha pakoda recipe, |, poha pakora, |, Punjabi poha aloo pakoda, | below., , Poha Pakoda, Poha Pakora recipe - How to make Poha Pakoda, Poha Pakora, , , , , , , , Tags, , , , , Starters / Snacks, , Evening Tea Snacks, , Pakora Pakoda, , Indian Veg Recipes, , North Indian Vegetarian Food, , Punjabi, , Punjabi Breakfast, , Kitty Party, , Kitty Party Snacks, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 20 Mins, , , , , , , Total Time, , 35 Mins, , , , , , , Makes, , 15 pakodas, , , , , , , , , , , , , , , For Poha Pakoda, , , 1 1/4 cups, thick beaten rice (jada poha), , , 1/2 cup boiled and, mashed potatoes, , , 2 tbsp finely, chopped coriander (dhania), , , 1 tsp finely, chopped green chillies, , , 1 tsp, chilli powder, , , 1/2 tsp, sugar, , , 1/2 tsp, lemon juice, , , 1/2 tsp, cumin seeds (jeera), , , , salt, to taste, , , oil, for deep-frying, , , For Serving With Poha Pakoda, , , , green chutney, , , , tomato ketchup, , , , , , , Divide the mixture into 15 equal portions., Roll each portion into a ball., Heat the oil in a deep non-stick pan and deep-fry a few poha pakodas at a time till they turn golden brown in colour from all the sides. Drain on an absorbent paper., Serve the poha pakodas immediately with green chutney and tomato ketchup., , , , , , , , , , , , , , poha pakoda recipe | poha pakora | Punjabi poha aloo pakoda | Video by Tarla Dalal, , , , , ×, , , , , , Poha Pakoda, Poha Pakora recipe with step by step photos, , , , , , , , , , , , , , , , , , , How to make poha pakora recipe, , , , , , , , , To make, poha pakoda recipe | poha pakora | Punjabi poha aloo pakoda |, first  clean and wash the rice flakes in a sieve in enough water. We have used the thick variety of poha for this recipe., , , , , , Transfer the poha into a deep bowl. Ensure you do not soak the poha in water, just rinse them or else they will absorb a lot of moisture which will make it difficult to make the, Poha Pakoda, ., , , , , , , , , , , Then add finely chopped coriander. They not only add a colour to the, Poha Pakoda, but also, enhance the taste., , , , , , For spice add finely chopped green chillies. You can increase or decrease the quantity as per your requirement., , , , , , We are also adding chilli powder. You can skip this completely and increase the amount of green chillies., , , , , , Now add sugar and lemon juice. They provide a very nice chatpata flavour to the, Poha Pakoda, mixture., , , , , , Finally add cumin seeds to the, Poha Pakoda mixture, and salt to taste., , , , , , Mix very well using your hands and your poha aloo pakoda mixture is ready., , , , , , Divide the, Poha Pakoda, mixture into 15 equal portions. Roll each portion into a ball., , , , , , Heat the oil in a deep non-stick pan and deep-fry a few pakodas at a time till they turn golden brown in colour from all the sides. Depending upon the size of your pan, you can deep fry the pakoda in batches or all of them together., , , , , , Turn, poha pakodas | poha pakora | Punjabi poha aloo pakoda |, occasionally. We want them to be crunchy and golden brown in colour., , , , , , Drain, Poha Aloo Pakoda, on an absorbent paper., , , , , , Serve, poha pakoda | poha pakora | Punjabi poha aloo pakoda |, immediately with green chutney and tomato ketchup. They are a perfect snack to accompany a cup of tea/coffee when it is raining outside. I love eating, Poha Pakoda, with khajur imli ki chutney, you can also try eating with it., , , , , , Similarly, you can make, Palak Pakoda, , , Shingdana Bhajiya, and, Suran Pakoda, ., , Pakoda can also be added to kadhi to make sumptuous preparations like, Palak pakoda kadhi, ., , Using kanda and batata bhajji, you can prepare popular Mumbai roadside snacks like, Bhajji Pav, and, Kaanda Bhajji Pav, ., , , , , , , , , , , , , , , , What are Pakodas?, , , , , , , , , What are Pakodas?, Pakora or Pakodas are fondly called Bajjias (Bhajias) and are generally deep friend Indian snacks made using besan, . Besan is mixed with Indian spices and herbs to get different flavors and taste. Sometimes, even rice flour or hot oil is added to the batter to increase the crispiness of pakoda., Come, monsoon, and our hearts start yearning for something spicy and crunchy to munch on, that’s when pakodas come into the picture. The ever popular combination of piping hot pakoda and cutting, chai, is a famous street food of Mumbai. Given below is the, Poha Aloo Pakoda, image., , , , , , , , , , , , , , , , , , , , Tips for poha pakoda, , , , , , , , , To make Poha Pakoda, first clean and wash the rice flakes in a sieve in enough water. We have used the thick variety of poha for this recipe., , , , , , Transfer the poha into a deep bowl. Ensure you do not soak the poha in water, just rinse them or else they will absorb a lot of moisture which will make it difficult to make the Poha Pakoda., , , , , , Add finely chopped coriander. They not only add a colour to the Poha Pakoda but also, enhance the taste., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per pakoda, Energy, 66 cal, Protein, 0.4 g, Carbohydrates, 4.8 g, Fiber, 0.1 g, Fat, 5.1 g, Cholesterol, 0 mg, Sodium, 1.1 mg, , , , , , , Click here to view, Calories for Poha Pakoda, Poha Pakora, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Deepti, , March 13, 2025, midnight, , I tried them and they are simply awesome. Perfect for evening snacks. Thank you so much, ma''am, for such delicious & easy munchies _x0001F60A__x0001F60A_, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Akila, , March 13, 2025, midnight, , Hi, Would love to try this. Just wanted to know whether the poha should be rinsed till becomes super soft or just twice rinse?? Thanks in advance, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Hi,\nrinse the poha once and put it in a strainer and then use it., , , , , , , , , , , , , Tazin Farhad Vandrewala, , March 13, 2025, midnight, , It was so delicious that my husband gobbled them up, everyone liked it _x0001F64F_, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Tazin, thanks for the feedback., , , , , , , , , , , , , rajiv, , March 13, 2025, midnight, , I could never imagine that this pakoda recipe would taste soo good until I made it and decided to share it with my friends, they also enjoyed it..., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Foodie #664602, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Glad you Poha Pakoda recipe., , , , , , , , , , , , , Winnie, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , aloo pakora recipe | Punjabi style aloo pakora | potato bhajji |, , , 487 Calories, , , , , , , , , , , , , , , , , Bharwan Paneer Chilli Pakoda ( Paneer Snacks ) recipe, , , 132 Calories, , , , , , , , , , , , , , , , , Bread Pakora recipe, Mumbai Bread Pakora with Aloo Stuffing | Punjabi bread pakora, , , 257 Calories, , , , , , , , , , , , , , , , , Kand Aloo Pakoda ( Faraal Recipe), , , 385 Calories, , , , , , , , , , , , , , , , , khichdi pakora recipe | leftover khichdi pakoda |Â GujaratiÂ khichdi na bhajiya |Â, , , 86 Calories, , , , , , , , , , , , , , , , , Methi Pakoda Kadhi recipe, Pakoda Kadhi Recipes, , , 467 Calories, , , , , , , , , , , , , , , , , peanut pakoda recipe | shingdana bhajiya | peanut pakora | peanut fritters |, , , 413 Calories, , , , , , , , , , , , , , , , , Rice and Peanut Pakoda recipe, , , 357 Calories, , , , , , , , , , , , , , , , , Stuffed Methi Paneer Pakoda recipe, , , 219 Calories, , , , , , , , , , , , , , , , , Stuffed Spinach Pakoda recipe, , , 135 Calories, , , , , , , , , , , , , , , , , Veg Pakora, Mixed Vegetable Pakora recipe, , , 315 Calories, , , , , , , , , , , , , , , , , yam fritters recipe | suran pakoda | Indian yam and onion fritters |, , , 275 Calories, , , , , , , , , , , , , , , , , yellow moong and urad dal pakoda recipe | moong and urad dal pakoda |, , , 206 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , 1 Likes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , How to make poha pakora recipe, , , , , , , , , What are Pakodas?, , , , , , , , , Tips for poha pakoda, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , poha pakoda recipe, |, poha pakora, |, Punjabi poha aloo pakoda, | with 14 amazing images., The, poha pakoda, is a scrumptious snack that you can quickly and easily prepare in the, evenings, to serve with, Tea, or, coffee, ., poha pakoda, , , , For poha pakoda, , Clean and wash the rice flakes in a sieve in enough water., Transfer the poha into a deep bowl",
        "Air fried bread pakora": "Ingredients: More air fryer recipes, , , Besan, /gramflour/chickpea flour (red lentil flour for air fryer version), , Slices of brown/white bread slices, , Mashed potato mix with salt and spices, , Green chutney, , Tomato Ketchup/Tamarind chutney/spicy pickle masala, , Baking soda, , Turmeric powder, , Red chili powder, , Salt as per taste, , Oil for frying, , , Equipment, , , Whisk, , Kadai for traditional frying, , or Air fryer for low oil option, , , More air fryer recipes, , If you are looking for more Indian air fryer recipes, read few of them there, , , Air fryer Sabudana Vada, , Air fryer Dahi vada, , onion pakora, , namak pare, , Air Fryer Samosa, , paneer pakora in air fryer, , , Read the full list of our, air fryer Indian vegetarian recipes, here., , 1, , cup, , besan/gramflour/chickpea flour, , red lentil flour for airfryer variant gives better results, 6, , slices, , of brown/white bread slices, 1, , Pinch, , of baking soda, 1, , cup, , of mashed boiled potatoes, , with salt and half of spices below, ¼, , teaspoon, , turmeric powder, ¼, , teaspoon, , red chilli powder, , or as per taste, 1, , teaspoon, , salt, water, , same quantity as besan, Tomato Ketchup/Tamarind chutney/Pickle masala, Green chutney, Oil for frying,  Instructions: How to make bread pakora in air fryer?, Traditional Bread Pakora | Air fryer Bread pakora recipe, , Pakode, is a crowd favorite. People of all age groups love it. We make lots of, pakoras, in India. Be it, double fried, , onions, potatoes or mixed veg. These days non vegetarians even make chicken pakoda. Basically anything dunked in a gram flour batter and fried to perfection makes people happy.If you are travelling, you can just have fritters with bread.My mum even serves them with roti as a meal., , Onion fritters can later be dunked in a, kadhi, for main course. Just serve it with rice. Punjabi, kadhi pakoda, makes lunch easy, if you like your yogurt. Just have some, kadhi, and sleep is guaranteed. Some people love the, baked version, too. If you have nothing at home and guests are coming over ,just go on and make some. Everyone loves it especially in rains and winter. Nothing like fritters and tea. Thus, this recipe will always be special to me. They are my pick-me up when I am down. As each plate comes with so many fond memories! Sharing this recipe so that you can make some too., , , How to make bread pakora in air fryer? (video recipe), , , , air fryer bread pakora, , , , , Spread chutney on the bread slices. (Make sure you do not keep them for long before frying else it gets soggy), , , , 2. Add the potato mix on slice. Cover with another slice. Cut them diagonally so that it looks like triangles., , , 3. Meanwhile, keep 2 tbsp. gram flour aside in a plate. Mix ¾ cup of besan with spices, baking soda and water to make a thick batter. Dip the bread sandwich in dry besan first and then in the, besan, batter., , , 4. Deep fry them in hot oil until golden brown, evenly on both sides.(for air fryer, refer steps below), , , 5. Serve them hot with chutney, , How to make bread pakora in air fryer?, , Can we make bread pakora in air fryer ? if you are looking for any answer to this questions, then below are the steps to make the fritter in air fryer., , One feedback that I received was to use, roasted besan,, i think that might help remove any rawness if you feel any., , If you can get, red lentil flour, (masoor dal flour), then it works much better, you can replace besan with red lentil flour for airfryer recipe and it does not leave the uncooked taste., , Another feedback was to use, little sooji(semolina, ) for more crispy texture, I tried that and it did help., , , Follow 1-3 to make the bread pakoras. Make a thin batter (equal quantity of besan and water) and dip the bread pakoda in the batter, , , , 2. Allow the excess batter to drip by placing it on a wire rack., , , 3. Pre heat the air fryer for 5 minutes at 180 deg C| 355 deg f. Place all the slices in a pre heated air fryer on top of a perforated baking sheet (baking sheet with holes) . Air fry for 8-9 minutes, , , 4. Remove the parchment paper/baking sheet,Flip the fritters ,brush with oil and continue to cook for 5-6 minutes or until cooked., , , 5. Serve bread pakora hot with chutney or sauce., , bread pakora in air fryer, , , , , Print Recipe, , 4.34, from, 9, votes, , , Traditional Bread Pakora | Air fryer Bread pakora recipe, , , Bread pakora is best served hot with some chutney. Whether you like them fried or make them in air fryer, they are perfect for tea time.Learn to make it here., , , Prep Time, 10, minutes, , mins, Cook Time, 16, minutes, , mins, , , Course:, Appetizer, Cuisine:, Indian, Keyword:, air fryer bread pakora, bread fritters, bread pakoda, bread pakora, fritters, , Servings:, 2, , Author:, bhavana bhatia, , Equipment, air fryer for low oil version, whisk, , Spread chutney on the bread slices., Add the potato mix on slice,cover with another slice., Cut the bread sandwich diagonally in 2 equal sizes., Meanwhile,keep 2 tbsp. besan aside in a plate., Mix remaining  besan with spices,baking soda and water to make a thick batter., Dip the bread sandwich in dry besan first and then in the besan batter., Fry in hot oil on both sides., For low oil air fryer version, Make a thin batter (equal quantity of chickpea flour/besan and water) with little sooji (semolina), Dip the bread slices in batter, Allow the excess batter to drip by placing it on a wire rack., Place the pakora on the air fryer basked which is already lined with parchment paper. The baking paper should have holes in it., Pre heat the air fryer at 180C for 5 minutes., Place all the slices on the air fryer basket,spray/brush oil, Air fry the bread pakora for 8-9 mins at 180 deg C., Remove the parchment paper/baking sheet, flip the fritters ,brush with oil and continue to cook for 5-6 minutes or until cooked., Cut the pakoda from center to check for any rawness, if there is still some rawness, cut all of them in 2 pieces, brush oil and cook for few minutes., Serve hot with mint chutney and tomato ketchup., , Video, , Notes, Tip: To make it extra spicy you can replace sauce with spicy pickle masala., , , The batter for air fryer pakora, should not be too, , thick, ,else they might taste raw., , , Another feedback that I received was to use roasted besan, I think that might help remove any rawness if you feel any,, , I made a batter little thin(equal ratio of water and besan) and was able to cook these in 11-12 minutes, if you batter is little thick, it will take more time(4-5 minutes more), , , Nutrition, Serving:, 2, g, , Variation, , You can make the fritters without the chutneys. Add a pickle masala on one side if you like it hot and spicy. You may only add a tomato sauce on the bread if making for kids who cannot handle too much spice. You may even omit sauce. It depends on what you like, these fritters can be customized. You may omit the potato stuffing too if in a rush. Just dip bread in chickpea batter and fry it. Add a teaspoon of garam masala powder, amchur or dry mango powder instead to the batter so that you get the tangy flavor.They are perfect when it rains or when its cold or when you are just not in a mood to cook something elaborate., , FAQ, , , What are pakoras served with?, , Mint chutney,, tamarind, date chutney, and even, tomato ketchup, ., , , Why my pakoda is not crispy?, , If the oil is too hot, it will not cook from inside. If it is too cold, it will soak a lot of oil. Always cook on medium flame., , , , , , More Appetizers/Starters, Air fryer veg seekh kebab | vegan seekh kebab, Air fryer hara bhara kebab, tikha gathiya recipe | air fryer gathia recipe, Top Holi Recipes, , , , 135, , shares, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , 4.34 from 9 votes (, 9 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , Hi,I am Bhavana & this is my wonderland of recipes.I have been in IT for 15+ years have always loved writing.My husband Gaurav & I,love to cook, click & host people, , More, about me →, , , Easy Air fryer recipes, , Air fryer accordion potatoes recipe, Air fryer smashed potatoes | smashed potatoes recipe, Crispy and easy Ninja Air fryer potato wedges recipe, Easy air fryer french Fries | air fryer home fries, , Popular posts, , Air fryer onion pakora | Crispy Onion bhajiya recipe, Air fryer potato cakes | Potato cakes in air fryer, authentic Indian curry sauce recipe, Curried chana saag | Spinach Chickpeas curry recipe, , , , , , Footer, , ^ back to top, , , , Our Recipe collections, , , , Useful links, , , Contact Us, , Recipes, , Web Stories, , Privacy Policy, , , , , Copyright © 2025, Secondrecipe, , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , ,",
        "Appe Pan Egg Pakoda": "❌ Error scraping https://thebellyrulesthemind.net/2015/02/egg-pakodas-egg-fritters-made-in-appe-pan/: 404 Client Error: Not Found for url: https://thebellyrulesthemind.net/2015/02/egg-pakodas-egg-fritters-appe-pan/",
        "Air fried rava Bonda": "❌ Error scraping https://www.airfryerbook.com/2018/11/air-fried-ravasujisemolina-bonda.html?view=mosaic: HTTPSConnectionPool(host='www.airfryerbook.com', port=443): Max retries exceeded with url: /2018/11/air-fried-ravasujisemolina-bonda.html?view=mosaic (Caused by NameResolutionError(\"<urllib3.connection.HTTPSConnection object at 0x000001CE8F154110>: Failed to resolve 'www.airfryerbook.com' ([Errno 11001] getaddrinfo failed)\"))",
        "Air Fryer Onion Bhajis": "Ingredients: , I also added Kashmiri chilli powder but that is optional. If you like your food spicy though, it is a nice touch., , You'll find the complete written recipe at the bottom of this page., , Is there a trick to making the perfect air fryer onion bhajis?, , I have tried so many onion bhaji recipes over the year but always return to the recipes from my books., , It is important to finely slice the onions and then sprinkle a bit of salt over them. Not everyone does this., , By sprinkling salt over your sliced onions, in helps release the water from them. This becomes the water you need to make the batter., , No additional water is used. Add water and your air fryer onion bhajis will be a bit stodgy., , How did you come up with this recipe for air fried onion bhajis?, , Trial and error., , I found that air frying them for 15 minutes at 380f/176c was perfect., , You will find that these onion bhajis are not only lighter but also just as crispy and delicious as, deep fried onion bhajis, ., , Are air fried onion bhajis as good as deep fried onion bhajis?, , I wasn't expecting to say yes when I started but yes!, , In fact my family prefer them., , Air fried onion bhajis are deliciously crispy and cooked through to perfection., , I know I already mentioned that it is a lot less messy to air fry than deep fry but I'll say it again now., , It's so much nicer to take the onion bhajis out to serve and not have that deep frying mess to clean up., , Just in case you like to cook from photographs, I included a few photos below., , , Form the bhajis into loose balls., , Place the onion bhajis in the Instant pot air fryer., , Air fry for 15 minutes at 176c/380f., , Dig in to your super crispy air fryer onion bhajis. These are so good., , Looking for a good curry house style curry to go with your air fryer onion bhajis? Try a few of these!, , Tikka masala sauce, , Korma sauce, , Pasanda sauce, , Chasni sauce, , Chilli garlic sauce, , Pathia sauce, , Jalfrezi sauce, , Keema sauce, , Bhuna sauce, , Methi sauce, , Madras sauce, , Vindaloo sauce, , Phaal sauce, , , , , Continue to Content, , , , , , , , Yield: 12, , Air Fryer Onion Bhajis, , , , , , , , , Print, , , , , , , Prep Time, , 15 minutes, , , , , Cook Time, , 15 minutes, , , , , Additional Time, , 4 hours, , 1 second, , , , , Total Time, , 4 hours, , 30 minutes, , 1 second, , , , , , , , , 2 white onions slightly larger than tennis balls, , 1 red onion slightly larger than a tennis ball, , 1 teaspoon fine sea salt, , 1 tablespoon garlic paste, , 1 x 2.5cm (1 inch) ginger - julienned, , 3 green chillies - pounded to a paste, , 1 tablespoon panch poran*, , 1 tsp Kashmiri chilli powder (optional), , 2 tbsp rapeseed (canola) oil, , 1/2 tsp turmeric, , 4 tbsp rice flour, , 140g (approx) sifted gram flour, , 3 tablespoons finely chopped coriander leaves, , , , , , being careful not to add to much gram flour. You should easily be able to pick up a ball of the onion mixture., Divide the mixture in to small bhajis., Heat your air fryer to 176c/380f. Spray the basket with oil spray generously., Place the bhajis in the basket. You will need to cook these in batches., After 15 minutes, your first batch will be cooked to perfection., Serve hot or at room temperature., * equal measures of cumin seeds, onion seeds, fenugreek seeds, fennel seeds and black mustard seeds or use shop bought, , , , , , , , , , , Did you like this recipe?, , Please join me on Facebook where I share all my latest recipes and videos. Just click that Facebook icon on the left and let's get to know each other!, , , , , , , © Dan Toombs, , , , Cuisine:, Bir Indian, , , , , , , By the way, I recently made this, chicken coconut curry, and it goes perfectly with these air-fryer onion bhajis! Give it a try., , , More Starter, Homemade Poppadom Recipe From Scratch, Haggis Pakora Recipe, Chaat Aloo, Bhel Puri, Comments, , , , , , Mrs. Marie Calzolari, , says, , , January 19, 2021 at 1:22 pm, , , , Howevr I am sure that I cn put logic into this recipe and will try my best.  Thankyou, , , Reply, , , , , , , , Dan Toombs, , says, , , January 20, 2021 at 11:23 am, , , , Great - good luck., Thanks, Dan, , , Reply, , , , , , , , , , Sue, , says, , , February 11, 2021 at 3:07 pm, , , , I’m going to try these this evening.  Do I keep the rotator blade in or take it out for air frying?, Thank you, , , Reply, , , , , , , , Dan Toombs, , says, , , February 12, 2021 at 10:54 am, , , , I don't know what sort of air fryer you have so could not advise about that. Mine doesn't have rotator blades., Thanks, Dan, , , Reply, , , , , , , , James Goacher, , says, , , May 15, 2024 at 10:57 am, , , , @Sue, Having once owned a Tefal Air Fryer, with a paddle (expired sadly) I can say that you would not want the paddle to be in. Ideal for Chips but not for these I think., , , Reply, , , , , , , , , , Wayne, , says, , , March 02, 2021 at 8:04 am, , , , Hi, you've got an * after panch poran but I can't see anywhere that explains why?, , , Reply, , , , , , , , Dan Toombs, , says, , , March 02, 2021 at 8:59 am, , , , Thanks for noticing, I have just added an explanation to the recipe., * equal measures of cumin seeds, onion seeds, fenugreek seeds, fennel seeds and black mustard seeds or use shop bought, Dan, , , Reply, , , , , , , , , , Keith, , says, , , March 12, 2021 at 5:25 pm, , , , Hi Dan, is the Panch Poran crushed, or just left as whole seeds?  Thanks, Keith, , , Reply, , , , , , , , Dan Toombs, , says, , , March 15, 2021 at 11:03 am, , , , Use whole seeds., Thanks, Dan, , , Reply, , , , , , , , , , Nizzyman, , says, , , March 15, 2021 at 1:18 pm, , , , Well done Dan. I've been with you since the daily mail printed your success.  And I have your books.    Definately a nice curry. And your curry.  Sauce.    Fantastic.    Keep up the good work.  It is appreciated., , , Reply, , , , , , , , Dan Toombs, , says, , , March 16, 2021 at 9:43 am, , , , Thank you very much for your support, that Daily Mail article seems like a lifetime away!, Dan, , , Reply, , , , , , , , , , Louise, , says, , , March 23, 2021 at 4:24 pm, , , , I have no rice flour, leave it out? Thanks, , , Reply, , , , , , , , Dan Toombs, , says, , , March 25, 2021 at 10:40 am, , , , I have never tried but I know others have successfully used coconut flour or corn flour - same measurements as rice flour., Thanks, Dan, , , Reply, , , , , , , , , , Paul Kostnadin, , says, , , April 16, 2021 at 2:42 am, , , , I really liked how you salted the onions to pull out moisture and then used that as a base for the batter. It really steps up the onion flavor, I can't wait to make these again!, , , Reply, , , , , , , , Dan Toombs, , says, , , April 16, 2021 at 10:23 am, , , , Yes - that really helps, I am glad you enjoyed the recipe., Thanks, Dan, , , Reply, , , , , , , , , , andrew wells, , says, , , April 19, 2021 at 9:06 pm, , , , How did you cook perfectly cooked Basmati rice in the air fryer? This recipe looks great, I will try it very soon!, , , Reply, , , , , , , , Dan Toombs, , says, , , April 22, 2021 at 6:42 am, , , , Thank you but I have never tried to cook rice on an air fryer., Dan, , , Reply, , , , , , , , , , Sianzilla, , says, , , June 03, 2021 at 3:15 am, , , , Tried this and it turned out a bit stodgy (and I only had bog standard yellow onions).  I think I will add a few TSP of water next time and see if it comes out better, but in principle a great recipe - thanks!, , , Reply, , , , , , , , Dan Toombs, , says, , , June 03, 2021 at 7:06 am, , , , Hi, Good luck next time then, everyone seems to love the recipe so I am sure you will manage to perfect it., Dan, , , Reply, , , , , , , , , , Michelle, , says, , , September 20, 2021 at 2:10 pm, , , , Hi,, U mentioned using the onion liquid for batter, but then in the recipe u said to squeeze out liquids, and didn't mention them again., Slightly confused🙄, Thanx, , , Reply, , , , , , , , Dan Toombs, , says, , , September 24, 2021 at 10:32 pm, , , , Thanks, Dan, , , Reply, , , , , , , , , , Carl DENVER, , says, , , September 25, 2021 at 9:58 am, , , , , , Reply, , , , , , , , Dan Toombs, , says, , , October 01, 2021 at 4:49 am, , , , Thank you for your comment, I will change the recipe to make it more apparent the onion water should be retained., Dan, , , Reply, , , , , , , , , , Jessica, , says, , , April 09, 2022 at 3:51 pm, , , , Wow what can I say? I made these Bhajis yesterday and can honestly say they taste better than the restaurant/take away ones., , My husband even said he was super impressed with them. I worked it out and made 8 onion Bhajis and they were 165 cals each which is so good and not using oil in a deep fryer using the air fryer even tasted better, , , Reply, , , , , , , , Dan Toombs, , says, , , April 12, 2022 at 3:04 pm, , , , Great to hear, thank you for letting me know., Dan, , , Reply, , , , , , , , , , Sue, , says, , , September 18, 2022 at 1:47 pm, , , , Hi Dan these look good but can you suggest an alternative to Garam flour - we have a family member with an allergy to legumes, so can’t use anything chick pea based 🙁, , , Reply, , , , , , , , Dan Toombs, , says, , , September 23, 2022 at 5:57 pm, , , , You could use plain flour but you would get a very different flavour. Give it a go and let me know., Dan, , , Reply, , , , , , , , , , DaveD, , says, , , September 27, 2022 at 8:08 am, , , , I didn't have any rice flour so substituted for coconut flour... OMG it actually worked. Was slightly messy creating bhaji balls might try cake cups next time and also include chilli powder., , , Reply, , , , , , , , Dan Toombs, , says, , , September 30, 2022 at 6:06 am, , , , I'm glad the substitution worked., Thanks, Dan, , , Reply, , , , , , , , Dave D, , says, , , October 01, 2022 at 9:50 am, , , , @Dan Toombs, made more today, onions 30 sec in microwave seemed to do the same as waiting 2hrs.  Used cupcake cases, turned over and remove cases after 8 min, much less mess., , , Reply, , , , , , , , Dan Toombs, , says, , , October 13, 2022 at 6:03 am, , , , Great ideas, glad it worked., Thanks, Dan, , , Reply, , , , , , , , , , , , Calum, , says, , , September 28, 2022 at 8:20 am, , , , Hi there Instructions: , Cut the onions in half and then finely slice them. Mix the salt into them and set aside for an hour or up to four hours., , , Reply, , , , , , , , Dan Toombs, , says, , , September 30, 2022 at 6:06 am, , , , Thanks for your message. I don't have any more instant pot recipes at the moment but plan on working on that next year., Dan, , , Reply, , , , , , , , , , Katy, , says, , , January 03, 2023 at 6:50 am, , , , These were great, thank you!, , , Reply, , , , , , , , Dan Toombs, , says, , , January 06, 2023 at 9:21 am, , , , Glad you enjoyed them., Thanks very much., Dan, , , Reply, , , , , , , , , , Stuart, , says, , , January 19, 2023 at 11:15 pm, , , , Hi Dan, going to give this recipe a go at the weekend. I have lots going on so was wondering if I could make the bhajis then keep in the fridge for a day? Or are they likely to dry out? Many thanks, love all your recipes, , , Reply, , , , , , , , Dan Toombs, , says, , , January 23, 2023 at 12:45 pm, , , , Yes I see no reason why you couldn’t keep the bhajis in the fridge for a day or two., Thanks, Dan, , , Reply, , , , , , , , Mark, , says, , , May 06, 2024 at 10:17 am, , , , @Dan Toombs,, , , Reply, , , , , , , , Mark, , says, , , May 06, 2024 at 10:21 am, , , , @Dan Toombs, Hi Dan, can you clarify whether you can pre-prepare the mixture, refrigerate and cook, or do you need to precook and reheat. Thank you, , , Reply, , , , , , , , Dan Toombs, , says, , , May 14, 2024 at 4:49 pm, , , , You can definitely prepare the mixture, refrigerate then cook. That would be the best thing to do if you don’t want to eat them straight after making them., Thank you, Dan, , , Reply, , , , , , , , , , , , Mark Smith, , says, , , January 24, 2023 at 11:14 am, , , , Hi mate, slightly confused about the specified 140gm of gram flour, then you say not to use too much?, , , Reply, , , , , , , , Dan Toombs, , says, , , February 07, 2023 at 3:19 pm, , , , Hi Mark, That is correct - just don’t add any more than that. The recipe should work really well as I have always had fantastic feedback from it., Thanks very much., Dan, , , Reply, , , , , , , , , , Michelle conaghan, , says, , , January 24, 2023 at 12:11 pm, , , , Just made me onion bahjis … DELICIOUS !!! AND so easy to make !!! Thanks Dan .. again … I regularly make your curries !!! 👏👏👏👏, , , Reply, , , , , , , , Dan Toombs, , says, , , February 07, 2023 at 3:18 pm, , , , Thank you so much for letting me know. Really glad you are enjoying my recipes., Dan, , , Reply, , , , , , , , , , Johnno Johnson, , says, , , August 09, 2023 at 6:29 pm, , , , I have been meaning to make these for ages, but had a minor issue in that we didn’t have an air fryer! That has now been resolved and we have caught up with the rest of the world! Substituted the rice flour with corn flour as suggested by Dan, and they were gorgeous! Absolutely brilliant recipe (obviously) and so much helpful advice along the way. As there are only 2 of us we had enough for the meal that night and plenty to freeze. Thank you for this recipe and all the other fantastic ones we have tried and loved., , , Reply, , , , , , , , Dan Toombs, , says, , , August 11, 2023 at 4:37 pm, , , , it’s certainly been a popular recipe and I’m really glad you enjoyed it too., Thanks very much., Dan, , , Reply, , , , , , , , , , Kate Armstrong, , says, , , September 27, 2023 at 11:54 am, , , , I normally deep fry mine.Just made these onion bhajis  in my air fryer. Absolutely delicious and so much better for you. Thank you, , , Reply, , , , , , , , Dan Toombs, , says, , , September 28, 2023 at 4:15 pm, , , , That’s really good to hear, thanks very much., Dan, , , Reply, , , , , , , , , , Andy, , says, , , October 03, 2023 at 3:09 pm, , , , On these now as I type this!, And I’ve added too much flour so they’re a bit ‘cakey’!, Need to try again haha, , , Reply, , , , , , , , Dan Toombs, , says, , , October 04, 2023 at 12:36 pm, , , , Good luck next time then, You'll get there!, Thanks, Dan, , , Reply, , , , , , , , , , Deb Pettit, , says, , , December 20, 2023 at 1:36 pm, , , , Hi Dan, just come back to this recipe again as I am making some to take to a drinks party later.  They are one of those things that people don’t try, for whatever reason ….but then when they see others eating them can’t stop and they then tell all the others and whoosh they’re gone!😂😂  I’ve shared your recipe so many times.  I now have a couple of your books and am really happy with them.  Thank you, , , Reply, , , , , , , , Dan Toombs, , says, , , January 02, 2024 at 7:10 pm, , , , Thanks so much and I’m really glad you’re inspiring people to try the onion Bhajis., Dan, , , Reply, , , , , , , , , , andrew jones, , says, , , January 18, 2024 at 7:30 pm, , , , Banging fair play mr toombs, , , Reply, , , , , , , , Dan Toombs, , says, , , January 19, 2024 at 11:33 am, , , , Thank you!, Dan, , , Reply, , , , , , , , , , Lesley, , says, , , January 29, 2024 at 3:52 pm, , , , Can I use regular flour instead of rice flour?, , , Reply, , , , , , , , Dan Toombs, , says, , , February 01, 2024 at 4:52 pm, , , , You can’t use regular flour but maybe try cornflour. Rice flour and cornflour to an extent give them a nice crispness., Thanks, Dan, , , Reply, , , , , , , , , , Serena, , says, , , May 09, 2024 at 5:33 pm, , , , Love this recipe, Dan!  Can you freeze them please?, , , Reply, , , , , , , , Dan Toombs, , says, , , May 14, 2024 at 4:42 pm, , , , Yes, they freeze well. Fry them once then freeze. Once defrosted give them another quick fry to serve., Thank you, Dan, , , Reply, , , , , , , , , , Claire, , says, , , January 12, 2025 at 6:16 pm, , , , I’m making these next weekend, how many does it make please? Just want to make sure I don’t make them too big or small for the cooking time given, thank you!, , , Reply, , , , , , , , Dan Toombs, , says, , , January 13, 2025 at 7:42 pm, , , , This should make around 8 average sized bhajis but make them as big or small as you like., Thanks, Dan, , , Reply, , , , , , , , , , Rosie, , says, , , January 24, 2025 at 7:27 pm, , , , Am I using the squeezed juice from the onions that's in the bowl or chucking the it so more of a dry mix with the and onions, , , Reply, , , , , , , , Dan Toombs, , says, , , February 02, 2025 at 11:14 pm, , , , You use all the liquid from the onions that makes the batter., Thanks, Dan, , , Reply, , , , , , , , , , becktato, , says, , , March 14, 2025 at 11:48 am, , , , Apologies if someone's asked already, but what is that amazing looking bright red sauce in your pictures? 🤤, , , Reply, , , , , , , , Dan Toombs, , says, , , March 24, 2025 at 1:20 pm, , , , It’s this pakora sauce with a little extra red food colouring added., Thanks, Dan, , https://greatcurryrecipes.net/2024/03/25/pakora-sauce/#growSource=search&growReferrer=true, , , Reply, , , , , , , , , , Diane, , says, , , March 22, 2025 at 5:53 pm, , , , Hi Dan, thank you so much for this great recipe! I’m just curious as to what the red sauce is in the picture please, and do you have a recipe for that please? Thank you in advance, you have a new fan!, , , Reply, , , , , , , , Dan Toombs, , says, , , March 24, 2025 at 1:21 pm, , , , It’s this pakora sauce with a little extra red food colouring added., Thanks very much for your support., Dan, , https://greatcurryrecipes.net/2024/03/25/pakora-sauce/#growSource=search&growReferrer=true, , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , Δ, , , , , , , Welcome!, , I’m the author of 10 cookbooks and this is where I test my recipes before they go into print. I started this blog in 2010 with a focus solely on curry recipes but it has since evolved to feature spicy dishes from around the world., , , More about me, , , , Popular, , Honey Roasted Chicken, Slow Cooker Saag, Slow Cooker Rajma Curry, Slow Cooker Lamb Raan, , , , , Footer, , , Subscribe for weekly updates!, , , Subscribe, , , , , , , , Contact, , Privacy Policy, , , , ↑ back to top, , , , , , , Copyright © 2025, The Curry Guy, , , , , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Sharing is Caring, Help spread the word. You're awesome for doing it!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Aloo Tuk": "Ingredients: , , , , 4, , how to make aloo tuk with step by step photo:, , , , , 5, , sindhi style aloo tuk preparation:, , , , , 6, , how to make chaat using aloo tuk:, , , , , 7, , notes:, , , , , , aloo tuk recipe | sindhi tuk recipe | alu tuk ka chat | sindhi aloo tuk, with step by step photo and video recipe. potatoes are an ideal source of snacks recipe across the globe. it is made as chips, wedges, fries, pakora’s, and even served as salads with mashed potatoes or boiled potatoes. one such easy and simple snack recipe from the sindhi cuisine is the aloo tuk or potato tuk chaat recipe known for its spice and flavour offering., , well, many would easily embrace and cherish this recipe, but back in your mind, you would get this question? like how is this different from the normal aloo chaat or any other deep-fried potato snack. well, it mainly differs from the potatoes used and also the way it is deep-fried and tossed with the spices. firstly the baby potatoes are deep-fried as a whole without any chopping or slicing. later it is smashed and deep-fried again to make it crisp like chips. once it is crisp, it is tossed with a blend of spices which gives it a unique taste, colour and flavour to it. at this stage, it can be served as it is or it can be extended as a chaat recipe with toppings like finely chopped onions, tomatoes and mixture sev. you can serve these as a snack or as an appetizer or even as a side to your lunch or dinner meal., , , furthermore, some more additional tips, suggestions and variants to the sindhi, aloo tuk recipe, . firstly, i haven’t used baby potatoes for this recipe as i was not able to get it for this recipe. having said that i would heavily recommend using the baby potatoes if you get access to it. small potatoes would do the trick, but baby potatoes are just perfect. secondly, the chaat recipe is just an extension to the traditional alu tuk. it is not mandatory to prepare it as the plain spiced aloo’s should do the trick. moreover, you can also add, ragda, , channa or any chaat gravies to make it more interesting. lastly, if you prefer to have mild or less spicy aloo, you can reduce or even skip the spice tossing step. you can just toss it with butter and, pepper, for some heat., , finally, i request you to check my other, snacks recipes collection, with this post of, aloo tuk recipe, . it mainly includes my other related recipe collection like, spring rolls, , , maggi pizza, , , bread paneer pakora, , , rasam vada, , , pizza cutlet, , , methi ka nashta, , , tomato bajji, , , chilli garlic breadsticks, , , aloo aur besan ka nasta, , , pav bhaji, . further to these i would also like to mention my other related recipe categories like,, , , chaat recipes, , sandwich recipes, , paratha recipes, , , aloo tuk video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for sindhi tuk recipe:, , , , , aloo tuk recipe | sindhi tuk recipe | alu tuk ka chat | sindhi aloo tuk, , , HEBBARS KITCHEN, , , easy aloo tuk recipe | sindhi tuk recipe | alu tuk ka chat | sindhi aloo tuk, , , 5, from, 182, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 5, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 20, minutes, , mins, , , , , , , Course, Snack, Cuisine, sindhi, , , , , , Servings, 2, , Servings, Calories, 45, , kcal, , , , , , , 1x, 2x, 3x, ▢, 10, , small potato, , , peel and halves, ▢, oil, , , for frying, ▢, 1, , tsp, , butter, ▢, ¼, , tsp, , turmeric, ▢, ½, , tsp, , chilli powder, ▢, ½, , tsp, , cumin coriander powder, ▢, ¼, , tsp, , aamchur, ▢, ¼, , tsp, , pepper powder, ▢, ¼, , tsp, , salt, for chaat:, ▢, 3, , tsp, , tamarind chutney, ▢, 3, , tsp, , green chutney, ▢, 2, , tbsp, , curd, ▢, 2, , tbsp, , onion, , , finely chopped, ▢, 2, , tbsp, , tomato, , , finely chopped, ▢, 2, , tbsp, , mixture, ▢, 1, , tbsp, , coriander, , , finely chopped,  Instructions: , sindhi style aloo tuk preparation:, firstly, peel the skin of small-sized potato and cut into half., rinse in cold water making sure to remove excess starch., now wipe off with a clean towel and deep fry in hot oil., stir occasionally, and fry on medium flame., fry until the aloo turns soft from the centre and not crisp from outside. use a toothpick to prick and check., drain off the aloo and cool slightly., using a small cup, flatten slightly making sure the aloo is in intact., for second frying, drop the aloo into hot oil., fry until the aloo turns golden brown and crisp., drain off the aloo to remove excess oil. keep aside., to prepare the masala, heat 1 tsp butter., add ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin-coriander powder, ¼ tsp amchur and ¼ tsp pepper powder and ¼ tsp salt., saute on low flame until the spices turn aromatic., now add in fried aloo and mix gently., finally, aloo tuk is ready to enjoy with masala tea., how to make chaat using aloo tuk:, firstly, take the fried aloo in the plate., add 2 tsp tamarind chutney, 2 tsp green chutney and 2 tbsp curd., also, garnish with 2 tbsp onion, 2 tbsp tomato, 2 tbsp mixture and 1 tbsp coriander., finally, enjoy masaledar aloo chaat or aloo tuk chaat., , , , , Nutrition, Calories:, 45, kcal, Carbohydrates:, 3, g, Protein:, 2, g, Fat:, 3, g, Saturated Fat:, 1, g, Trans Fat:, 1, g, Cholesterol:, 5, mg, Sodium:, 321, mg, Potassium:, 116, mg, Fiber:, 1, g, Sugar:, 1, g, Vitamin A:, 497, IU, Vitamin C:, 9, mg, Calcium:, 38, mg, Iron:, 1, mg, , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make aloo tuk with step by step photo:, , sindhi style aloo tuk preparation:, , , firstly, peel the skin of small-sized potato and cut into half., , , rinse in cold water making sure to remove excess starch., , , now wipe off with a clean towel and deep fry in hot oil., , , stir occasionally, and fry on medium flame., , , fry until the aloo turns soft from the centre and not crisp from outside. use a toothpick to prick and check., , , drain off the aloo and cool slightly., , , using a small cup, flatten slightly making sure the aloo is in intact., , , for second frying, drop the aloo into hot oil., , , fry until the aloo turns golden brown and crisp., , , drain off the aloo to remove excess oil. keep aside., , , to prepare the masala, heat 1 tsp butter., , , add ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin-coriander powder, ¼ tsp amchur and ¼ tsp pepper powder and ¼ tsp salt., , saute on low flame until the spices turn aromatic., , , now add in fried aloo and mix gently. finally, aloo tuk is ready to enjoy with masala tea., , , , how to make chaat using aloo tuk:, , , firstly, take the fried aloo in the plate. add 2 tsp tamarind chutney, 2 tsp green chutney and 2 tbsp curd., , , also, garnish with 2 tbsp onion, 2 tbsp tomato, 2 tbsp mixture and 1 tbsp coriander., , , finally, enjoy, masaledar aloo chaat, or, aloo tuk chaat, ., , , , notes:, , , make sure to fry aloo on medium flame, else the aloo will not turn crunchy., , also, double frying helps to make potato super crispy and tasty., , additionally, adjust the amount of spices to your preference., , finally, , aloo tuk recipe, tastes great when prepared crispy and spicy., , , , , , , , , Related Recipes, , , , , , , , , , appetizer, , , Pizza Puff Recipe | Mcdonald’s Veg Pizza McPuff, , , , Hebbars Kitchen, , -, , , April 1, 2025, , , , , , , , , , , , snacks recipes, , , Aloo Cutlet Recipe | Crispy Potato Cutlet –..., , , , Hebbars Kitchen, , -, , , March 31, 2025, , , , , , , , , , , , , 00:01:33, , , , side dish, , Aloo Pakora Recipe | Aloo Bajji | ..., , , , Hebbars Kitchen, , -, , , March 17, 2025, , , , , , , , , , , , , snacks recipes, , Alasanda Vada Recipe | Black Eyed Peas Fritters, , , , Hebbars Kitchen, , -, , , March 12, 2025, , , , , , , , , , , 00:01:49, , , , chaat recipes, , Ragda Recipe – Multipurpose Curry for Chaat Recipes, , , , Hebbars Kitchen, , -, , , March 3, 2025, , , , , , , , , , , 00:02:11, , , , appetizer, , Honey Chilli Potato Recipe – Street Style with..., , , , Hebbars Kitchen, , -, , , February 18, 2025, , , , , , , , , , , 00:01:32, , , , breakfast recipes, , Medu Vada Recipe in Mixer Grinder | Medhu..., , , , Hebbars Kitchen, , -, , , February 13, 2025, , , , , , , , , , , 00:02:48, , , , snacks recipes, , Aloo Chop Recipe | Alur Chop | Aloor..., , , , Hebbars Kitchen, , -, , , February 7, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 5 from 182 votes (, 182 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , appetizer, , , 00:02:05, , , , Chilli Mushroom Recipe | Mushroom Chilli..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , dessert, , mug cake | microwave cake recipe | brownie & red velvet mug cake, , , , , , , , What's New, , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli – Healthy & Tasty, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Onion Bonda with spicy chutney": "Ingredients: , , , , 4, , how to make onion bonda with step by step photo:, , , , , 5, , how to make crispy onion boda:, , , , , 6, , how to make red chutney:, , , , , 7, , notes:, , , , , , , onion bonda recipe | vengaya bonda | eerulli bonda & red chutney recipe, with step by step photo and video recipe. bonda recipes are generally made with a choice of flour like maida or urad dal with a crisp texture. but it is not limited to these flours and can be made with other flours with a combination of vegetables. one such recipe is the onion bonda recipe made with the combination of sliced onions with gram flour coating for a crisp and tasty snack., , street food and deep-fried snacks are very much synonymous with indian cuisine. especially with the south indian cuisine, it is mostly bonda, bajji’s and pakora’s. but the, onion bonda, is the new entry which is very much influenced by the crispy, onion pakora, or pakoda from the, kadhi pakoda recipe, . the uniqueness of this recipe is the crispiness it has to offer from the outer surface and the softness on the inside. hence this bonda can also be served between a pav bread-like vada pav. moreover, with this recipe, i have specifically chosen a spicy red chatni recipe which is very much inspired by, schezwan chutney, . it makes an ideal dip to this crispy bonda snack, but can also be served with many other deep-fried snacks., , , furthermore, some more additional tips, suggestions and variations to the, onion bonda recipe, . firstly, the most critical part of this recipe is the chopping of onions. it shouldn’t be finely chopped, at the same time it shouldn’t be diced. i have sliced these onions thinly, and cut it into 3 equal parts. in this way, it would easily hold the besan batter to form a round ball. secondly, if you wish to have crisper, you can either add more rice flour or cornflour with gram flour. in addition, you can also add other vegetables like capsicum, or any leafy vegetables. lastly, make sure the dough is tight with less water content so that it does not absorb more oil. also deep fry these in small batches and do not overcrowd them in your deep frying, pan, ., , finally, i would like to mention my other related, street food recipes collection, with this post of, onion bonda recipe, . it includes my other similar recipes like, masala mirchi bajji, , , kanda bhaji pav, , , onion samosa, , , stuffed onion rings, , , pyaz ki kachori, , , onion rings, , , mysore bonda, , , tomato bajji, , , veg bonda, , , aloo bonda, . further to these i would also like to mention my other related recipe categories like,, , , snacks recipes, , chutney recipes, , chaat recipes, , , onion bonda video recipe:, , , , , Must Read:, , , , , , , , , , , , sweets recipes, Gulab Jamun Recipe – Soft with..., , , , , , , , , , , , , paneer recipes, Matar Paneer Pulao Recipe | Kaju..., , , , , , , , , , , , , starters or entree, Cheesy Garlic Bread Recipe – Dominos..., , , , , , , , , , 00:02:12, , , , dal recipes, Dal Makhani Recipe Restaurant Style in..., , , , , , , , , , , , , curry recipes, Matar Paneer Recipe | Dhaba Style..., , , , , , , , , , , , , paneer recipes, Dahi Ke Kabab Recipe | Hung..., , , , , recipe card for vengaya bonda recipe:, , , , , onion bonda recipe | vengaya bonda | eerulli bonda & red chutney recipe, , , HEBBARS KITCHEN, , , easy onion bonda recipe | vengaya bonda | eerulli bonda & red chutney recipe, , , 5, from, 23, votes, , , , , , , Email, , Tweet, , Share, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved!, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 25, minutes, , mins, , , , , , , Course, Snack, Cuisine, south india, , , , , , Servings, 4, , Servings, Calories, 396, , kcal, , , , , , , 1x, 2x, 3x, for onion bonda:, ▢, 3, , onion, , , sliced, ▢, 1, , inch, , ginger, , , finely chopped, ▢, 2, , chilli, , , finely chopped, ▢, few curry leaves, , , chopped, ▢, 2, , tbsp, , coriander, , , finely chopped, ▢, ¼, , tsp, , turmeric, ▢, ¼, , tsp, , ajwain, ▢, ½, , tsp, , salt, ▢, 2, , cup, , besan / gram flour, ▢, ¼, , cup, , rice flour, ▢, ¼, , tsp, , baking soda, ▢, ¼, , cup, , water, ▢, oil, , , for frying, for red chutney:, ▢, 13, , dried red chilli, ▢, 2, , cup, , water, , , hot, ▢, 2, , tbsp, , oil, ▢, 2, , inch, , ginger, , , finely chopped, ▢, 5, , clove, , garlic, , , finely chopped, ▢, 1, , tsp, , sugar, ▢, ¾, , tsp, , salt, ▢, 1, , tsp, , garam masala, ▢, 2, , tbsp, , lemon juice,  Instructions: , how to make crispy onion boda:, firstly, in a large bowl take 3 onion, 1 inch ginger, 2 chilli, few curry leaves and 2 tbsp coriander., also add ¼ tsp turmeric, ¼ tsp ajwain and ½ tsp salt., squeeze and mix well making sure the onion loses its crunchiness and everything is well combined., add 1 cup besan, ¼ cup rice flour and ¼ tsp baking soda., mix well making sure everything is well combined., again add 1 cup besan and ¼ cup water., mix well forming a soft dough. add water in small quantity to avoid from batter turning runny., now greases hands with oil, pinch a ball sized hand and make a round shape., deep fry in hot oil keeping the flame on medium., stir occasionally, and fry on medium flame until the pakoda turns golden brown and crisp., drain off and onion bonda is ready to serve., how to make red chutney:, firstly, in a small bowl take 13 dried red chilli and soak in 2 cup hot water for 30 minutes., transfer the soaked chilli along with water to a blender., blend to smooth paste making sure there are no lumps. keep aside., in a large pan heat 2 tbsp oil. add 2 inch ginger, 5 clove garlic., saute on low flame until the ginger and garlic turn aromatic., now add prepared chilli paste and cook well., further add 1 tsp sugar, ¾ tsp salt and 1 tsp garam masala., mix well making sure everything is well combined., also, add 2 tbsp lemon juice and give a good mix balancing the flavour., finally, onion bonda is ready to enjoy with spicy red chutney., , , , , Nutrition, Calories:, 396, kcal, Carbohydrates:, 57, g, Protein:, 16, g, Fat:, 12, g, Saturated Fat:, 1, g, Trans Fat:, 1, g, Sodium:, 854, mg, Potassium:, 807, mg, Fiber:, 9, g, Sugar:, 13, g, Vitamin A:, 396, IU, Vitamin C:, 48, mg, Calcium:, 76, mg, Iron:, 4, mg, , , , , , , , , Tried this recipe?, Mention, @HebbarsKitchen, or tag, #hebbarskitchen, !, , how to make onion bonda with step by step photo:, , how to make crispy onion boda:, , , firstly, in a large bowl take 3 onion, 1 inch ginger, 2 chilli, few curry leaves and 2 tbsp coriander., , , also add ¼ tsp turmeric, ¼ tsp ajwain and ½ tsp salt., , , squeeze and mix well making sure the onion loses its crunchiness and everything is well combined., , , add 1 cup besan, ¼ cup rice flour and ¼ tsp baking soda., , , mix well making sure everything is well combined., , , again add 1 cup besan and ¼ cup water., , , mix well forming a soft dough. add water in small quantity to avoid from batter turning runny., , , now greases hands with oil, pinch a ball sized hand and make a round shape., , , deep fry in hot oil keeping the flame on medium., , , stir occasionally, and fry on medium flame until the pakoda turns golden brown and crisp., , , drain off and, onion bonda, is ready to serve., , , , how to make red chutney:, , , firstly, in a small bowl take 13 dried red chilli and soak in 2 cup hot water for 30 minutes., , , transfer the soaked chilli along with water to a blender., , , blend to smooth paste making sure there are no lumps. keep aside., , , in a large pan heat 2 tbsp oil. add 2 inch ginger, 5 clove garlic., , , saute on low flame until the ginger and garlic turn aromatic., , , now add prepared chilli paste and cook well., , , further add 1 tsp sugar, ¾ tsp salt and 1 tsp garam masala., , , mix well making sure everything is well combined., , , also, add 2 tbsp lemon juice and give a good mix balancing the flavour., , , finally,, onion bonda, is ready to enjoy with spicy, red chutney, ., , , , notes:, , , firstly, make sure to add besan as required, else the mixture will turn dry., , also, you can skip adding garlic to the chutney and make a variation., , additionally, make sure to fry the bonda on medium flame, else there are chances for bonda to remain raw from inside., , finally, , onion bonda recipe, tastes great with spicy, red chutney, or can be served with chai., , , , , , , , , Related Recipes, , , , , , , , , , appetizer, , , Pizza Puff Recipe | Mcdonald’s Veg Pizza McPuff, , , , Hebbars Kitchen, , -, , , April 1, 2025, , , , , , , , , , , , snacks recipes, , , Aloo Cutlet Recipe | Crispy Potato Cutlet –..., , , , Hebbars Kitchen, , -, , , March 31, 2025, , , , , , , , , , , , , 00:01:33, , , , side dish, , Aloo Pakora Recipe | Aloo Bajji | ..., , , , Hebbars Kitchen, , -, , , March 17, 2025, , , , , , , , , , , , , snacks recipes, , Alasanda Vada Recipe | Black Eyed Peas Fritters, , , , Hebbars Kitchen, , -, , , March 12, 2025, , , , , , , , , , , 00:02:11, , , , appetizer, , Honey Chilli Potato Recipe – Street Style with..., , , , Hebbars Kitchen, , -, , , February 18, 2025, , , , , , , , , , , 00:01:32, , , , breakfast recipes, , Medu Vada Recipe in Mixer Grinder | Medhu..., , , , Hebbars Kitchen, , -, , , February 13, 2025, , , , , , , , , , , 00:02:48, , , , snacks recipes, , Aloo Chop Recipe | Alur Chop | Aloor..., , , , Hebbars Kitchen, , -, , , February 7, 2025, , , , , , , , , , , 00:01:30, , , , bakery recipes, , Murmura Snack Recipe | Spicy Murmura Chivda –..., , , , Hebbars Kitchen, , -, , , January 31, 2025, , , , , , , [/vc_column], , , , , , , , , , , , Facebook, Twitter, WhatsApp, Pinterest, Email, , , , , Hebbars Kitchen, , , , , , , , , , 5 from 23 votes (, 23 ratings without comment, ), , , , , , , , , , , , OUR OTHER LANGUAGES, , , , , , हिन्दी, (, Hindi, ), , , , Kannada, , , , , , STAY CONNECTED, 9,052,334, Fans, Like, 3,257,846, Followers, Follow, 7,880,000, Subscribers, Subscribe, BROWSE BY CATEGORIES, BROWSE BY CATEGORIES, , Select Category, , appetizer, , baby food, , bakery recipes, , beverages recipes, , biryani, , breakfast recipes, , celebrations, rituals & traditions, , chaat recipes, , chutney recipes, , cookies or biscuits recipes, , cooking tips, tricks, , curry recipes, , dal recipes, , dessert, , diabetic, , dinner recipes, , diwali snacks, , diwali sweets, , dosa recipes, , eggless cakes recipes, , Featured, , gluten free, , idli recipes, , indian street food, , indo chinese, , instant recipes, , international recipes, , junkfood, , low carbs, , low fat, , lunch ideas or thali recipes, , lunch recipes, , masala recipes, , no onion no garlic, , paneer recipes, , paratha recipes, , pickle recipes, , product review, , pulao recipes, , raita recipes, , rasam recipes, , recipes collection, , rice recipes, , roti recipes, , salad recipes, , sambar recipes, , sandwich recipes, , sauce and dips, , side dish, , snacks recipes, , soup recipes, , starters or entree, , sweets recipes, , tambli recipes, , Uncategorized, , vegan, , vrat recipes, , , , , , , , SUBSCRIBE TO OUR RECIPES, , , , , , , , , , , , , POPULAR RECIPES, , , , , diwali sweets, , , 00:02:17, , , , Holige Recipe | Bele Obbattu |..., , , , , , , , breakfast recipes, , , , , Sabudana Idli Recipe | Instant Sago..., , , , , , , , dessert, , , 00:02:50, , , , Moong Dal Payasam Recipe | Pasi..., , , , , , , , side dish, , , 00:01:33, , , , Aloo Pakora Recipe | Aloo Bajji..., , , , , , , , snacks recipes, , , , , Alasanda Vada Recipe | Black Eyed..., , , , , , , , breakfast recipes, , , , , Tomato Sevai Recipe | Thakkali Semiya..., , , , , , , , cookies or biscuits recipes, , , , , Kaju Biscuits Recipe | Cashew Cookies..., , , , , , , , appetizer, , , 00:02:05, , , , Chilli Mushroom Recipe | Mushroom Chilli..., , , , , , , , POPULAR CATEGORIES, gluten free, 470, vegan, 419, snacks recipes, 340, no onion no garlic, 309, breakfast recipes, 298, indian street food, 249, side dish, 202, curry recipes, 190, sweets recipes, 185, lunch recipes, 159, , , , , , , , , , , , , , , , , , Stay in Touch, , , Please subscribe to our newsletter to get the latest news in your domain of interest. Don't forget to follow us on social networks!, , , , Facebook, Instagram, Mail, Pinterest, RSS, Twitter, Youtube, , , , , , , Subscribe, , , , , Hebbars Kitchen, Indian Veg Recipes, , , , , , Popular, , , , , , , , appetizer, , cocktail samosa recipe | party samosa recipe with samosa sheets, , , , , , , , , , , cooking tips, tricks, , top 5 curd benefits | diy home remedies with curd – health & beauty, , , , , , , , , , , cooking tips, tricks, , top 6 coconut oil benefits | diy home remedies with coconut oil, , , , , , , , , , , dinner recipes, , kashmiri pulao recipe | saffron rice recipe | how to make kashmiri pulav, , , , , , , , , , , chutney recipes, , dosa chutney recipe | chutney for mysore masala dosa, , , , , , , , What's New, , , , , , , , curry recipes, , Sagu Recipe | Mixed Vegetable Saagu – Hotel Style, , , , , , , , , , , breakfast recipes, , Lemon Rice | South Indian Chitrannam & Gojju Premix in 1 min, , , , , , , , , , , breakfast recipes, , Akki Roti Recipe | Masala Akki Rotti – Karnataka Style, , , , , , , , , 00:02:17, , , , diwali sweets, , Holige Recipe | Bele Obbattu | Bobbatlu Recipe, , , , , , , , , , , breakfast recipes, , Sabudana Idli Recipe | Instant Sago Idli – Healthy & Tasty, , , , , , , Search Recipes, , Search, , , , Recipes Collection, , Video Recipes, , Contact Us, , Privacy, , , , , , ©, Hebbars Kitchen, Indian Veg Recipes | All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , , , , , , , ,",
        "Potato Bhajia": "Ingredients: , , , , , , , , drop spoonfuls of the mixture in the oil and deep-fry till they turn crisp and golden brown in colour from all the sides. Drain on an absorbent paper. Repeat step 2 to make more bhajias. Serve immediately with, green chutney, and tomato ketchup., It is interesting to note that this Indian bhajia with potato is held together purely by the starch in the grated potatoes and does not use any other binder like boiled potatoes, plain flour or cornflour. This makes it all the more crispier. Indeed, a perfect snack to have garma garam with a hot cup of, Masala Chai, !, With no use of any flour for binding, this Indian bhajia with potato also qualifies as a fasting or vrat recipe. You can enjoy them during Janmashtami, Navratri and even during Sankrant and Holi. Serve with green chutney and not tomato ketchup then., Tips for aloo bhajia. There are some things you need to take care of to make sure the bhajias don’t disintegrate. 1. Firstly, you need to add the salt only at the very end, just before you deep-fry the bhajias because the mixture will start letting out water after you add the salt. So, to save time, so that by the time oil is hot enough, Enjoy aloo bhajia recipe | quick potato bhajiya | crispy potato bhajia | Indian bhajia with potato | with step by step photos and video below., , , , , , , , Tags, , , , , Advanced Starters, , Starters / Snacks, , Deep-fried Indian Starters, , Evening Tea Snacks, , Pakora Pakoda, , Indian Veg Recipes, , Maharashtrian recipes, , Maharashtrian Snacks recipes, Nashta, , , , , , , , , , , , , , , , , , , , Preparation Time, , 10 Mins, , , , , , , Cooking Time, , 25 Mins, , , , , , , Total Time, , 35 Mins, , , , , , , Makes, , 4 servings, , , , , , , , , , , , , , , For Crispy Potato Bhajias, , , 3 cups peeled and thickly, grated potatoes, , , 1 tbsp finely, chopped green chillies, , , 3 tbsp finely, chopped coriander (dhania), , , , salt, to taste, , 3 tbsp, besan (Bengal gram flour), , , 3 tbsp, rice flour (chawal ka atta), , , , oil, for deep-frying, , , For Serving, , , , 1 recipe eggless vanilla sponge cake, , , , tomato ketchup, , , , , , , Once the oil is hot enough, drop spoonfuls of the mixture in the oil and deep-fry till they turn crisp and golden brown in colour from all the sides. Drain on an absorbent paper., Repeat step 2 to make more bhajias., Serve the, crispy potato bhajiyas, immediately with green chutney and tomato ketchup., , , , , , , , , , , , , , aloo bhajia recipe | quick potato recipe | crispy potato bhajia | Video by Tarla Dalal, , , , , ×, , , , , , Crispy Potato Bhajias, Aloo Bhajiya Recipe recipe with step by step photos, , , , , , , , , , , , , , , , , , , like potato bhajia recipe, , , , , , , , , , aloo bhajia recipe | quick potato bhajiya | crispy potato bhajia | Indian bhajia with potato |, then do try other bhajiya recipes also:, , pyaz ke pakode recipe, , | kanda bhaji | kanda bhajiya | onion pakora |, , moong dal pakoda recipe, | moong dal bhajiya | Mumbai street moong dal pakora | roadside pakora |, , , , , , , , , , , , , , , , , , what is potato bhajia made of?, , , , , , , , , , aloo bhajia recipe | quick potato bhajiya | crispy potato bhajia | Indian bhajia with potato |, 1 tbsp finely chopped green chillies, 3 tbsp finely chopped coriander (dhania), salt to taste, 3 tbsp besan, 3 tbsp rice flour and Oil for deep-frying., , , , , , , , , , , , , , , , , , , , , how to make mixture for potato bhajia, , , , , , , , , In a deep bowl, add 3 cups peeled and thickly, grated potatoes, ., , , , , , Add 1 tbsp finely, chopped green chillies, ., , , , , , Add 3 tbsp finely, chopped coriander (dhania), ., , , , , , Add salt to taste., , Add 3 tbsp besan., , , , , , Add 3 tbsp rice flour., , , , , , Mix well., , , , , , Heat oil in a deep pan, drop spoonfuls of the mixture in the oil., , , , , , Deep-fry till they turn crisp and golden brown in colour from all the sides., , , , , , Drain on an absorbent paper., , , , , , Serve, potato bhajias, immediately with, green chutney, and, tomato ketchup, ., , , , , , , , , , , , , , , , , , , , tips to make potato bhajia, , , , , , , , , Deep fry the bhajiya on medium flame so that they get cooked properly from inside. If you deep fry the bhajiya on high flame quickly they will get brown from outside and remain raw from inside., , , , , , Gently flip the bhajia otherwise they will break in the oil., , , , , , Adding rice flour makes the bhajias crispy., , , , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per bhajia, Energy, 319 cal, Protein, 2.8 g, Carbohydrates, 25.2 g, Fiber, 2.4 g, Fat, 23 g, Cholesterol, 0 mg, Sodium, 13.3 mg, , , , , , , Click here to view, Calories for Crispy Potato Bhajias, Aloo Bhajiya Recipe, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Indira pancholi, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Gandhi Dhwani, , March 13, 2025, midnight, , This crispy bhajias are really difficult to resist. The most important thing while making thsese bhajias is tha the oil has to be really hot before you make the bhajia mixture. \nThe coriander and green chillies impart a really good flavour. Also it is very quick and ready in minutes., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Swati, , March 13, 2025, midnight, , I tried this recipe and the potatoes didn?t stick together at all, the mixture totally disintergrated once I put it on hot oil for frying.. are we supposed to add a water to this potato mixture before deep frying in oil?, , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Swati, , March 13, 2025, midnight, , I gave my review one star but don?t know how it changed to 5stars. Also I forgot to add, I have no idea why the grated Alu pakodas were tasting bitter., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Bharwan Paneer Chilli Pakoda ( Paneer Snacks ) recipe, , , 132 Calories, , , , , , , , , , , , , , , , , Bread Pakora recipe, Mumbai Bread Pakora with Aloo Stuffing | Punjabi bread pakora, , , 257 Calories, , , , , , , , , , , , , , , , , Cheel Pakodas ( Know Your Green Leafy Vegetables ), , , 0 Calories, , , , , , , , , , , , , , , , , corn pakora recipe | corn pakoda | sweet corn pakoda | corn bhajiya |, , , 24 Calories, , , , , , , , , , , , , , , , , Kand Aloo Pakoda ( Faraal Recipe), , , 385 Calories, , , , , , , , , , , , , , , , , khichdi pakora recipe | leftover khichdi pakoda |Â GujaratiÂ khichdi na bhajiya |Â, , , 86 Calories, , , , , , , , , , , , , , , , , palak bhajiya recipe | palak pakode | spinach fritters |, , , 128 Calories, , , , , , , , , , , , , , , , , Stuffed Methi Paneer Pakoda recipe, , , 219 Calories, , , , , , , , , , , , , , , , , Stuffed Spinach Pakoda recipe, , , 135 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , 1 Likes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Like potato bhajia recipe, , , , , , , , , What is potato bhajia made of?, , , , , , , , , How to make mixture for potato bhajia, , , , , , , , , Tips to make potato bhajia, , , , , , , , , Nutrient values, , , , , , , , , , , , , , , aloo bhajia recipe | quick potato bhajiya | crispy potato bhajia | Indian bhajia with potato |, aloo bhajia is a delight for the Indian diner. It is a flavoursome delicacy which can be enjoyed at any time of the day. Learn how to make crispy potato bhajia., Crispy bhajias made with grated potatoes, perked up with green chillies and coriander! Ensure to grate the potatoes thinly, so they bind well. This quick potato recipe makes a good snack treat for kids who come hungry after school., To make aloo bhajia, keep the oil to heat in a non-stick kadhai, , , , For crispy potato bhajiyas, , To make, crispy potato bhajiyas, , keep the oil to heat in a non-stick kadhai",
        "Bajra corn bhajjis": "Ingredients: , , , , , , , , , , For Bajra Khichu, , , 1/2 cup, bajra (black millet) flour, , , a pinch of, baking soda, , , 1/2 tsp, cumin seeds (jeera), , , 1/2 tsp finely, chopped green chillies, , , , salt, to taste, , 1 tbsp, oil, , , , For The Masala Dahi, , , 1/2 cup, thick curds (dahi), , , 1 tsp, powdered sugar, , , , salt, to taste, , 2 tsp, oil, , , 1/2 tsp, cumin seeds (jeera), , , 1/2 tsp finely, chopped green chillies, , , 4, curry leaves (kadi patta), , , , leftover rotlas (7”) each, broken into pieces, , , 1/4 tsp, chilli powder, , , a pinch of, turmeric powder (haldi), , , 1 tbsp finely, chopped coriander (dhania), , , , , , , 63 recipes, , Quick Indian Desserts, 18 recipes, , 41 recipes, , 41 recipes, , , , , , , , , , , , , , By Cuisine, , , , , , Indian Veg Recipes, 2379 recipes, , Chinese Vegetarian, 246 recipes, , Italian Vegetarian, 394 recipes, , Mexican Vegetarian, 150 recipes, , Lebanese Vegetarian, 65 recipes, , Thai Vegetarian, 104 recipes, , French style Indian, 6 recipes, , American, 264 recipes, , , , , , , , , , , , , , By Kids Recipes, , , , , , Kids Tiffin Box, 318 recipes, , Recipes for Toddlers (1-3 Years), 31 recipes, , Sweet Recipes for Kids, 453 recipes, , Recipes for Baby (10 to 12 Months), 14 recipes, , Quick Indian recipes for Kids, 72 recipes, , Indian Breakfast Recipes for Kids, 192 recipes, , Recipes for Weaning (8 to 9 months), 20 recipes, , Healthy Foods for Kids, 195 recipes, , Snack Recipes for Kids, 619 recipes, , Recipes Kids can make, 36 recipes, , Kids After School, 794 recipes, , Kids Jar Snacks, 66 recipes, , Finger Foods for Babies, Toddlers and Kids, 76 recipes, , Kids Weight Gain, 43 recipes, , Kids Wraps and  Rolls, 23 recipes, , Kids Veg Pasta, 27 recipes, , Kids Brain Boosting, 68 recipes, , Protein rich food for kids, 69 recipes, , Recipes for Weaning, 13 recipes, , Kids Pizzas, 30 recipes, , Babies, Toddler and Kids Iron Rich Foods, 31 recipes, , High Fiber Foods for Kids, 39 recipes, , Kids Noodles, 37 recipes, , Kids High Energy Indian Foods, 103 recipes, , Kids Calcium Rich Indian recipes, 91 recipes, , Kids Recipes for Increasing Immunity, 10 recipes, , Babies recipes, 6 to 18 months, 31 recipes, , Kids Weight Loss, 58 recipes, , Teething Recipes for Babies, 10 recipes, , Cereals and Pulses for 8 to 9 months Baby, 5 recipes, , Weaning foods at 7 months, 8 recipes, , Indian Teen, 315 recipes, , , , , , , , , , , , , , By Course, , , , , , Starters / Snacks, 2137 recipes, , Indian Breakfast Recipes, 819 recipes, , Main Course Recipes, 925 recipes, , Indian Salads, 385 recipes, , Indian Desserts, Sweets, 985 recipes, , Indian Soups, 249 recipes, , Indian Beverages, Indian Drinks, 483 recipes, , Indian Dinner, 903 recipes, , Indian Dinner1, 0 recipes, , Indian Lunch, 830 recipes, , Side Dishes, 449 recipes, , Indian Travel Food, 433 recipes, , Indian Barbeque1 recipes, 22 recipes, , Frozen Foods, Indian Freezer Recipes, 67 recipes, , Whole Wheat Recipes, 56 recipes, , Indian Comfort Foods, 212 recipes, , Dinner Menus, 56 recipes, , Easy Indian Veg, 70 recipes, , No Cook Indian, 37 recipes, , Innovative Indian Recipes, 27 recipes, , Advanced Recipes, 10 recipes, , Cakes with Eggs, 13 recipes, , , , , , , , , , , , , , By Equipment, , , , , , Microwave, 230 recipes, , Oven, 619 recipes, , Indian Steamer Recipes, 102 recipes, , Kadai Veg, 406 recipes, , Indian Barbeque Recipes, 43 recipes, , Sizzler tray, 15 recipes, , Mixer, 566 recipes, , Pressure Cooker, 315 recipes, , Tava, 646 recipes, , Non-stick Pan, 1394 recipes, , Appe Mould, 17 recipes, , Pan, 223 recipes, , Indian Freezer recipes, meals, 56 recipes, , Deep Pan, 148 recipes, , Non Stick Kadai Veg, 203 recipes, , Refrigerator, 176 recipes, , Waffle Indian recipes, 6 recipes, , Handi, 12 recipes, , Juicer and Hopper, 64 recipes, , Grill, 30 recipes, , Toaster, 21 recipes, , Gas Toaster, 7 recipes, , , , , , , , , , , , , , By Cooking Basics, , , , , , Steam, 72 recipes, , No Cooking Veg Indian, 335 recipes, , Vegetarian baked Indian recipes, 380 recipes, , Boiled Indian recipes, 129 recipes, , Deep Fry, 259 recipes, , Indian Tawa, 266 recipes, , Shallow Fry Indian, 25 recipes, , Microwave1, 173 recipes, , Saute, 274 recipes, , Indian Pressure Cooker, 171 recipes, , Stir-fry, 100 recipes, , Roasting, 0 recipes, , , , , , , , , , , , , , By Occasion & Party, , , , , , Sankashti Chaturthi Recipes, 45 recipes, , Party, 3710 recipes, , Kitty Party, 1035 recipes, , Monsoon, 387 recipes, , Occasion, 1667 recipes, , Karwa Chauth, 33 recipes, , Indian Foods to cook in different months, 117 recipes, , Indian Birthday Party Cakes, 22 recipes, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Tarla Dalal's recipe website is a go-to destination for vegetarian Indian recipes., , , , , , , , , , , , What's New, , , Latest Recipes, , Recipes List, , Calories List, , Recipe Using List, , Newest Videos, , , , , , What's Latest, , , Recipe Categories, , Recipe Categories Hindi, , Recipe Categories Gujarati, , Glossary, , , , , , Fine Print, , , Terms of Use, , About Copyrights, , Privacy Policy, , , , , Associate with us, , , About Tarla Dalal, , Tribute to Tarla Dalal, , FAQs, , Advertise With Us, , Work With Us, , Contact Us, , Site Feedback, , , , , , , , , Copyright © 2025 Tarla Dalal All Rights Reserved, , , , , , , , , , , , , Search, , , , , , , , , , Latest, Recipes, , , , , , , , , , , , , , , , Date and Walnut Fudge recipe | healthy chocolate fudge | dates, cocoa powder and walnut squares | no sugar Indian fudge |, , , , , , , , , , , , , , , , , , Guava raw mango drink | healthy Peru mango panna |  amrud aam pudina drink |, , , , , , , , , , , , , , , , , , Banana Cucumber Raita recipe |  Banana Cucumber  Pomegranate Raita | healthy Sweet and Savoury Banana Raita |, , , , , , , , , , , , , , , , , , carrot and spinach soup recipe | carrot spinach soup for anorexia | kids, , , , , , , , , , , , , , , , , , Paneer Bhurji Panini, Cottage Cheese Panini recipe, , , , , , , , , , , , , , , , , , dalia paratha recipe | broken wheat paratha recipe | fada vegetable roti for weight loss |, , , , , , , , , , , , , , , , , , poha yellow moong dal dosa recipe |  moong dal dosa |, , , , , , , , , , , , , , , , , , Tava Chana Dal Vadas | Bengal Gram Fritters | Healthy Savoury Chana Dal Patties |, , , , , , , , , , , , , , , , , , dahi bhindi recipe | healthy dahi bhindi recipe | Rajasthani dahi bhindi | okra with yogurt |, , , , , , , , , , , , , , , , , , moong dal seekh kebab recipe | healthy Mughlai moong dal kebab | moong dal ke kebab |, , , , , , , , , , , , , , , , , , rajma brown rice recipe | low salt rajma chawal | healthy rajma pulao | instant one pot Indian rajma brown rice |, , , , , , , , , , , , , , , , , , cashew chikki | cashew nut chikki | cashew nut brittle | kaju chikki |, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , , , , , , , Nutrient values, , , , , , , , , , , , , , Khichu is a quick and easy snack, which never fails to sort out a sudden hunger pang! This all-time favourite, Gujarati, snack has a dough-like consistency and a semi-spicy taste, which is very pleasing to the palate when had hot and fresh., , Here is a fabulous khichu made with bajra flour. It has a nice, homely taste that combines beautifully with curds, flavoured with spice powders and an aromatic tempering., , Serve the Bajra Khichu with Masala Dahi immediately after preparation as it tends to thicken very fast., , Have a go at other bajra based snacks like the, Bajra Onion Muthia, and, Bajra, Rice and Sprouts Moong Puda, ., , , , , , , Tags, , , , , Non-stick Pan, , Indian Breakfast Recipes, , Jain Breakfast, , Quick breakfast, , Innovative Indian Recipes, , Innovative Snacks, , Indian Veg Recipes, , Gujarati, , Gujarati Farsans, , , , , , , , , , , , , , , , , , , , Preparation Time, , 15 Mins, , , , , , , Cooking Time, , 4 Mins, , , , , , , Total Time, , 19 Mins, , , , , , , Makes, , 2 servings, , , , , , , , , , , , , , , , For bajra khichu, Heat ¾ cup of water in a deep non-stick pan, add the baking soda, cumin seeds, green chillies, salt and oil, mix well and cook on a medium flame for 1 minute., Add the bajra flour, mix well and cook on a medium flame for 1 to 2 minutes, while stirring continuously with help of a rolling pin., Serve immediately topped it with masala dahi., For the masala dahi, Combine the curds, sugar and salt in a deep bowl, mix well using a whisk., Heat oil in a small non-stick pan, add cumin seeds, green chillies and curry leaves and sauté on a medium flame for a few seconds., Switch off the flame, add the garam masala, chilli powder and turmeric powder and mix well., Pour it over the curd mixture and coriander and mix well. Keep aside., , , , , , , , , , , , , , , , Bajra Khichu with Masala Dahi recipe with step by step photos, , , , , , , , , , , , , , , , , , , , , , , , , , , Nutrient values (Abbrv)per plate, , Nutrient values (Abbrv) per serving, Energy, 264 cal, Protein, 5 g, Carbohydrates, 20.3 g, Fiber, 2.8 g, Fat, 17 g, Cholesterol, 8 mg, Sodium, 13 mg, , , , , , , Click here to view, Calories for Bajra Khichu with Masala Dahi, , , The Nutrient info is complete, , , , , , , , , , , , , , , , , , , , , Your Rating*, , , , , , ☆, , , ☆, , , ☆, , , ☆, , , ☆, , , , , , , , , , , , , , , , , , , , , , , , , , , , Submit Reviews, , , , , , , , , , , , , , , , Faty, , March 13, 2025, midnight, , , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Seema, , March 13, 2025, midnight, , Being a Sindhi I always wanted to try this popular Gujrati snack. Using bajra has made it so healthy too. The recipe is so easy to follow and Masala Dahi makes it even more delicious., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Mita Majmundar, , March 13, 2025, midnight, , My husband loves rice flour khichu but he cannot have it because he?s diabetic. I tried this recipe and we both loved it., , , , , , , , , Post Reply, , , , , 5, , , , , , , , , , , , , Tarla Dalal, , March 13, 2025, midnight, , Thank you for your feedback. Kindly review the recipes and articles you love., , , , , , , , , , , , , , , , , Related, Recipes, , , , , , , , , , , , , Chola Dal Panki recipe | healthy split cow peas pancake |, , , 59 Calories, , , , , , , , , , , , , , , , , Green Pea Pankis recipe, Indian Low Fat Recipes, , , 21 Calories, , , , , , , , , , , , , , , , , moong dal panki recipe | Gujarati dal panki | healthy split yellow gram panki |, , , 65 Calories, , , , , , , , , , , , , , , , , rice panki recipe | Gujarati rice flour panki | rice flour pancake cooked on banana leaf |, , , 34 Calories, , , , , , , , , , , , , , , , , sama panki recipe | farali sama panki | rajgira, arrowroot, sama panki with curds |, , , 48 Calories, , , , , , , , , , , , , , , , , Jowar Khichu ( Non- Fried Snacks ) recipe, , , 174 Calories, , , , , , , , , , , , , , , , , pizza khichu recipe | Indian khichu pizza | pizza flavoured khichu |, , , 78 Calories, , , , , , , , , , , , , , , , , Poha Khichu ( Non- Fried Snacks ) recipe, , , 187 Calories, , , , , , , , , , , , , , , , , rice khichu | gujarati rice khichu | rice flour khichu, , , 169 Calories, , , , , , , , , , , , , , , , , Whole Rice Khichu recipe, , , 239 Calories, , , , , , , , , , , , Follow US, , , , , , , , , , , , , , , , , , , , Recipe Categories, , , , , , , , , , By Healthy Indian Recipes, , , , , , Vitamin B12 Cobalamin Rich Recipes, 33 recipes, , Low Calorie, Weight Loss  Indian Recipes, 421 recipes, , Low Cholesterol Indian Recipes, 307 recipes, , Healthy Indian Breakfast, 372 recipes, , Indian Diabetic recipes, 558 recipes, , Indian Pregnancy recipes, 461 recipes, , Zero Oil Indian Recipes, 133 recipes, , Iron Rich Indian recipes, 267 recipes, , Healthy Indian Acidity recipes, 132 recipes, , Healthy Sabzis, 108 recipes, , Indian Healthy Veg Snack, 275 recipes, , Healthy Heart Recipes, 415 recipes, , Healthy Veg Indian Soups, 74 recipes, , Calcium Rich Indian Recipes, 373 recipes, , High Blood Pressure Indian Recipes, 100 recipes, , Healthy Indian Salads Recipes, 137 recipes, , Low Carb Indian Diet, recipes, 160 recipes, , Hypothyroidism Diet, 59 recipes, , Arthritis Diet, 68 recipes, , Vitamin K Diet, 41 recipes, , High Protein Indian recipes, 93 recipes, , Fatty Liver Diet, 30 recipes, , PCOS, 131 recipes, , Gluten Free Veg Indian, 193 recipes, , High Fiber, 328 recipes, , Indian Cancer Patients, 275 recipes, , Jaundice Diet, 45 recipes, , Sprouts, 61 recipes, , Typhoid, 43 recipes, , Irritable Bowel Syndrome (IBS), 20 recipes, , Kidney Stone Diet, 9 recipes, , Home Remedies, 213 recipes, , Senior Citizen, 195 recipes, , Diet for Dialysis, 10 recipes, , Healthy Indian Drinks and Juices, 213 recipes, , Gout Indian Recipes, 17 recipes, , Potassium Rich, 80 recipes, , Vegan, 194 recipes, , Forever Young Diet, Anti Aging Indian Diet, 255 recipes, , Indian recipes to treat Vomiting, 7 recipes, , High in Omega 3 Fatty Acids, 31 recipes, , Zinc Rich Foods, 55 recipes, , Malaria Diet, 17 recipes, , Vitamin B1 Rich Indian Foods, Recipes, 101 recipes, , Vitamin A Rich, Beta Carotene, Retinol, 87 recipes, , Antioxidant Rich Indian, 445 recipes, , Low Veg Glycemic Index, 86 recipes, , Lower Blood Pressure Salads, 7 recipes, , Healthy Indian Dinner, 85 recipes, , Magnesium Rich, 94 recipes, , Vitamin C Rich Indian recipes, 118 recipes, , Healthy Indian Lunch Recipes, 29 recipes, , Lactation, 25 recipes, , Hyperthyroidism Diet, 46 recipes, , Vitamin E Rich, 50 recipes, , Vitamin B3, Niacin Rich, 41 recipes, , Post Surgery Diet, 42 recipes, , Lower Blood Pressure Desserts  Sweets, 14 recipes, , Selenium, 27 recipes, , Phosphorus Rich Indian Recipes, Foods, 74 recipes, , Copper, 15 recipes, , Foods Rich in Vitamin B2 Riboflavin, 22 recipes, , Vitamin B6 Diet, 36 recipes, , Vitamin B9 Rich Folate, 50 recipes, , B Vitamins, 231 recipes, , Manganese Diet, 32 recipes, , Thalassemia, 18 recipes, , Marathoners, Endurance Athletes, Triathlete, 225 recipes, , Detox Water, Fruit Infused Water, 42 recipes, , Lactose Free Dairy Free, 22 recipes, , Omega 6 Fatty Acids, 32 recipes, , Phytonutrients, 51 recipes, , Chronic Kidney Disease Indian recipes, 12 recipes, , Selenium1, 0 recipes, , , , , , , , , , , , , , By Quick Recipe, , , , , , Quick Snacks / Quick Starters, 385 recipes, , Quick Breakfast Indian, 132 recipes, , Quick Sabzis, 117 recipes, , Quick Rotis / Parathas, 46 recipes, , Quick Indian Sweets, 139 recipes, , Quick Stir-Fries, 51 recipes, , Quick Vegetarian Indian Soups, 72 recipes, , Quick Chutneys, 67 recipes, , Quick Vegetarian Rice, khichdi Recipes, 56 recipes, , Indian snacks under 10 minutes, 44 recipes, , Quick Indian Dips, Gravies &  Sauces, 103 recipes, , Quick Veg Indian Pizza, 17 recipes, , Quick Veg Pasta, 25 recipes, , Quick Pickles / Aachar, 25 recipes, , Quick Dals / quick Kadhis, 29 recipes, , Snacks under 5 minutes, 33 recipes, , Quick Healthy Recipes, 43 recipes, , Quick Pressure Cooker, 46 recipes, , Quick Desserts, 48 recipes, ",
        "Corn Fritters": "Ingredients: , , 4.09, from, 36, votes, , , Print Recipe, , Pin Recipe, , , Prep Time, 15, minutes, , mins, Cook Time, 20, minutes, , mins, Total Time, 35, minutes, , mins, , , , , , , Course, Snack, Cuisine, Indian, , , , , , Servings, 18, Calories, 94, , kcal, , , , , 1 CUP = 250 ml, , , 1x, 2x, 3x, ▢, 1.5, , cups, , boiled sweet corn kernels, ▢, 1/2, , cup, , grated zucchini, ▢, 1, , onion, , thinly sliced, ▢, 3, , tablespoons, , chopped cilantro leaves, ▢, 3-4, , green chilies, ▢, 1, , teaspoon, , crushed ginger and garlic, ▢, 3, , tablespoons, , corn flour/gram flour/rice flour, ▢, Salt, ▢, Oil, , 3. You can grated veggies like carrot, cabbage too., , Nutrition, Calories:, 94, kcal, , , , , , , , , Tried this recipe? Snap a pic and share 🙂, Mention cookclickndevou or tag cookclickndevour, , , , , , , 3333, , shares, , , , , , , , Share, , , , , , , Pin, 3333, , , , , , , Yummly, , , , , , , Flipboard, , , , , , , Twitter, , , Shared by, Harini, , About, Harini, I am Harini. The recipe developer, food photographer and chef behind cook click n devour. My aim behind this blog is to provide easy, tried and tested recipes that beginners can cook with confidence. I took keen interest in cooking and took courses on cooking, baking during teens purely out of passion. With a decade of cooking experience I am glad to share my recipes and culinary knowledge with you all here. Stay tuned and happy cooking!, Harini :), , Comments, , , , , , The Girl Next Door, , says, , , September 21, 2017 at 10:34 am, , , , Hi, lovely recipe! Would love to try this corn fritters recipe out. I don’t have cornflour, though. Could I use rice flour or whole wheat flour instead? Or maybe besan?, , , , , , , , , Beth, , says, , , March 4, 2021 at 1:07 am, , , , Could I oven bake these in a muffin tray?, , , , , , , , , Harini, , says, , , March 6, 2021 at 5:36 pm, , , , hi, yes you can., , , , , , , , , Keri, , says, , , March 15, 2021 at 4:29 am, , , , How would I cook these in an air fryer? They look absolutely delicious!, , , , , , , , , Sarkuna Malar, , says, , , March 20, 2021 at 10:04 am, , , , Hi Harini, thank you for the lovely recipe. Just tried it. Turn out real good and tasty. Keep up your good work🥰❤💪, , , , , , , , , Chicky, , says, , , January 6, 2022 at 7:47 pm, , , , Can you do it in an air fryer?, , , , , , , Leave a Reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , Website, , , , Save my name, email, and website in this browser for the next time I comment., , , , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed, ., , Hello, I am Harini, , , , , , The chef, author and photograper of cook click n devour. Here you'll find tried & tested vegetarian recipes with step by step photos and videos to make cooking a pleasure and fulfilling experience. Happy cooking!, , , Read More, , , , , Popular Recipes, , , , As Seen In, , , About, Contact, Privacy, Copyright ©2025, Cook Click N Devour!!!. All Rights Reserved., , , , , , , , , , , , , Instructions: , Pressure cook sweet corn kernels with enough water for upto3 whistles. Drain and keep the cooked corn closed until use., In a mixing bowl, add chopped onions and cooked sweet corn., Add grated zucchini, chopped cilantro leaves, crushed ginger garlic and chopped green chilies. Mix well and set aside for 5 minutes., Add 3 tablespoons corn flour, salt to taste. Mix well., Heat a paniyarakal and add few drops of oil in each mould., Spoon in the prepared batter and cook in medium flame for 3-4 minutes., Flip and cook the other side. Flip again and cook till golden brown. Repeat the same with remaining batter. Serve corn fritters hot., , Notes, 1. You can deep fry or shallow fry the fritters too.",
        "Appe Pan Aloo Bonda": "Ingredients: , , For the stuffing, , 3 medium potatoes, boiled & peeled, , 5-6 curry leaves, chopped (optional), , 1/2 teaspoon black mustard seeds / rai, , 1/4 teaspoon turmeric / haldi, , 5-6 garlic pods, , 3 green chilies, finely chopped / as per taste., , 2 tablespoon cilantro, chopped / dhaniya, , 1 lemon, juice, , , , For the batter, , 2 cups chickpea flour / besan, , 1/2 teaspoon cumin / zeera, , 1/2 teaspoon salt to taste, , 1 tablespoon oil, , , , , , , To this mixture add the mashed potatoes and again mix thoroughly.Let the potato stuffing cool for a few minutes., , , , In the meantime prepare the batter. Add 1/2 cup water to besan, salt, cumin to make it a thick batter, , Now make equal portions of the potato stuffing. Roll them each into the shape of a ball., , Heat the appe pan with a few drops of oil in each cavity., , , Add a small amount of batter into each cavity, just enough to make a scoop like cavity. Sorry I realize the picture is over exposed and will replace it with a better picture soon, I promise., , , Place the potato stuffing into each cavity., , Top off the cavity again with the batter, making sure the entire potato stuffing is covered., , Cook for approx. 4-5 minutes on each side on slow - medium heat., , , , Serve them with either pav / bread or mini dinner rolls as mini sliders with green chutney, garlic chutney or sweet tamarind chutney or even ketchup., , , If you liked this recipe and need some ideas and inspiration to enjoy guilt-free cooking, check out our most popular post on the blog :, , 30 Appe Pan Recipes, Tips & Video, , . If you would like to buy the, Appe pan, , we recommend buying the, Tabakh brand from Amazon., , , , , , , Continue to Content, , , , , , , , Batata Vada / Aloo Bonda made in Appe pan, , , , , Print, , , , , , , , For the stuffing, , 3 medium potatoes, boiled & peeled, , 5-6 curry leaves, chopped (optional), , 1/2 teaspoon black mustard seeds / rai, , 1/4 teaspoon turmeric / haldi, , 5-6 garlic pods, , 3 green chilies, finely chopped / as per taste., , 2 tablespoon cilantro, chopped / dhaniya, , 1 lemon, juice, , , , For the batter, , 2 cups chickpea flour / besan, , 1/2 teaspoon cumin / zeera, , 1/2 teaspoon salt to taste, , 1 tablespoon oil, , , , , , To this mixture add the mashed potatoes and again mix thoroughly.Let the potato stuffing cool for a few minutes., In the meantime prepare the batter. Add  1/2 cup water to besan, salt, cumin to make it a thick batter, Now make equal portions of the potato stuffing. Roll them each into the shape of a ball., Heat the appe pan with a few drops of oil in each cavity., Add a small amount of batter into each cavity, just enough to make a scoop like cavity., Place the potato stuffing into each cavity., Top off the cavity again with the batter, making sure the entire potato stuffing is covered., Cook for approx. 4-5 minutes on each side on slow - medium heat., Serve them with either pav / bread or mini dinner rolls as mini sliders with green chutney, garlic chutney or sweet tamarind chutney or even ketchup., , , , , , , , , , , Follow us for more delicious Recipes !, , Did you make recipe? don’t forget to come back and leave your feedback and star rating., , , , , , , © Soniya Saluja, , , , Cuisine:, Indian, , , , , , , , , , More Appe Pan, How to Make Sabudana Vada in Appe Pan, Malai Kofta - Restaurant Style Recipe, No Fry Veg Manchurian Recipe, No fry Dahi Vada / Dahi Bhalla Chaat, Comments, , , , , , Parul, , says, , , September 07, 2020 at 10:28 am, , , , Very innovative---Too Good., , , Reply, , , , , , , , Soniya Saluja, , says, , , September 07, 2020 at 12:26 pm, , , , Thanks.. hope you try our other recipes  too., , , Reply, , , , , , , , , , Pongodhall, , says, , , October 06, 2018 at 5:03 am, , , , I've never looked back since I had my appe/paniyaram pan. And doing recipes like this are now so easy. I really appreciate the variaty you do., , , Reply, , , , , , , , Mabel Erevelles, , says, , , March 15, 2018 at 4:08 pm, , , , Brilliant recipes for all one can do with the appe pan !No deep frying ! So good Thank you for the recipes ., , , Reply, , , , , , , , freda, , says, , , March 15, 2016 at 12:17 pm, , , , Very innovative ! Will try this soon dear :), , , Reply, , , , , , , , Soniya Saluja, , says, , , March 15, 2016 at 3:35 pm, , , , Glad you liked it :D Do share your feedback with us., , , Reply, , , , , , , , , , Lydia, , says, , , March 11, 2016 at 2:31 pm, , , , Hi Soniya,, , Thank you for your posting.  Like you I am always trying to reinvent soggy oily goodies.  Just a thought.  If the batter were slightly thick, the bondas could be dipped in the batter and then placed in a well greased/brushed aebelskiver pan.  Basically, the coating should serve as a casing to hold the potato mixture.  Pouring batter over seems a bit of a messy process, though your bondas look gorgeous.  I've ordered a pan and will experiment and post my comments.  Another way.  Put the batter in a squirt bottle (ketchup bottle found at fast foods) and drizzle batter on top like pouring fondant on petit fours.  That should work.  Perhaps one would have more control with that., , , Reply, , , , , , , , Soniya Saluja, , says, , , March 11, 2016 at 3:07 pm, , , , Hello Lydia, Thanks you for your suggestions :) I had made these 1st time in 2014, made them countless times after that with different techniques.. Like you have mentioned above . What worked for me was putting the batter in a Ziplock bag ,snip the end and pour it in the cavities . Do share in your feedback with us when you try it ., , , Reply, , , , , , , , Lydia, , says, , , March 31, 2016 at 2:12 pm, , , , Hello Sonija,, , I tried the Vadas but did the batter slightly different -- 1 cup chickpea flour, 1/2 cup rice flour, 1 tbs. oil, 1/2 tsp. baking soda and 1/2 tsp. baking powder (to lighten batter since they were not being deep fried).  I brushed the cavaties with oil and pore the batter to fill 1/3rd.  Then, I quickly insert the balls of potato mixture and pored batter sparingly over ONLY to cover.  A technique that needs practise.  I pushed the excess batter around the sides with a small wooden knife then twirled the vadas using 2 wooden skewers.   Here's what I will do next time.  After I have formed the golf sized balls of the potato mixture, I will chill them awhile.  I think that will help.  They came very nice, got easier as I did them.  Wish I could add a picture., , , Reply, , , , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , Welcome!, , A vegetarian & vegan food blog where we (Anvita & Soniya) share everyday healthy-ish recipes, some occasional treats, and even-you-can-do-this ideas., , , Read more, , , , Popular Recipes, , Instant Pot 2 Ingredient Homemade Yogurt !, Instant Pot Vegetable Chowmein Recipe, Date & Walnut Loaf Cake, Minestrone Soup (Copycat Olive Garden), , , Trending Now, , , , , , Footer, , , , freebie alert!, , Download our Vegetarian Grazing Table Grocery List, , Download our, FREE, Vegetarian Grazing Table Grocery List so you can start setting up an Instagram worthy spread for your next gathering., , , Get the list!, , , , , , , , , About Us, , Privacy Policy, , Contact, , ↑ back to top, , , , , , , Copyright © 2024, The Belly Rules The Mind, •, Powered by Feast+, , , , , Skip to Recipe, , , , , , , , , , , Instructions: », Appe Pan, No Fry Batata Vada / Aloo Bonda  Appe, , Modified:, Apr 5, 2022, · Published:, Feb 6, 2015, by, Soniya Saluja, · This post may contain affiliate links ·, 12 Comments, Jump to Recipe, My love for street food, makes me want to try almost every high calorie snack / appetizer on my appe pan. So here I am yet again, sharing how to make Batata Vada / Aloo bonda in an appe pan. Since it has a batter coating, most people wonder how can you make it in an appe pan. So here is my step by step recipe for the famous Batata Vada / Aloo bonda., , [avatar user=\"soniyasaluja\" size=\"thumbnail\" align=\"right\" link=\"https://thebellyrulesthemind.net/about-us/\" target=\"_blank\" /], , , , , What I love about this version of batata vada / Aloo bonda is that, who are always looking for healthy  no fry recipes & low in calories., , , , For the stuffing, , Mash the boiled potatoes., , In a chopper, prepare a green mixture of chop green chilies, garlic and cilantro. Make sure they are chopped finely., , Prepare the potato stuffing in a wok or a pan. Heat the utensil, add 1 teaspoon oil. for tempering add mustard seeds, turmeric, , For the stuffing, Mash the boiled potatoes., In a chopper, prepare a green mixture of chop green chilies, garlic and cilantro. Make sure they are chopped finely., Prepare the potato stuffing in a wok or a pan. Heat the utensil, add 1 teaspoon oil. for tempering add mustard seeds, turmeric",
        "Appe Pan Aloo Appe": "Ingredients:  Instructions: ",
        "Appe Pan Mysore Bonda": "Ingredients: Urad Dal dhuli, , Black gram split and husked - 1 cup, Salt to taste, Black pepper powder - 1/2 tsp, Coconut flakes, , shredded & unsweetened - 4 tbsp, Hing, , Asafetida powder  - a fat pinch, Ginger - 1 tsp, , chopped into small pieces, Curry leaves - 8 to 10, , chopped roughly, Oil - for greasing, Water - 2 cups,  Instructions: Wash and rinse the dal till water runs clear. Now soak it in 2 cups of water for 2-3 hrs., Drain off excess water and make a smooth batter in an electric blender. If required, stop the blender in between to stir the batter and add 1-2 tsp of water to loosen up, just slightly., Add salt, black pepper powder, hing, ginger, coconut flakes, curry leaves to the dal batter. Mix well., Prepare the appe pan or paniyaram pan or abelskiever pan by oiling all the holes generously. Heat the pan on medium heat after oiling., Once the pan is hot, take 1 tbsp of batter and drop in each hole, evenly., Cover the pan with the lid for 2 minutes., Now remove the lid and cook further for 1 minute. It will be golden brown from the bottom by now., Brush the top of the Bonda with little oil and gently flip it with a wooden stick., Cook further for 2-3 minutes on medium heat till the bottom becomes golden too., Take out the Mysore Bonda from the pan and serve immediately hot with sambhar and chutney., It might take 2 to 3 rounds of making the bonda out of the batter., , , Notes, You may alternatively deep fry these as well., , , , , These make the perfect snack for tea time or weekend brunch and breakfast. You may serve these with chutney alone. Mysore Bonda is glutenfree and vegan, a great recipe, filled with protein, complex carbs and good fiber. The Bondas are good for a game night or a cozy get together with your friends., , Can’t make it now? Pin Mysore Bonda in Appe / Abelskiever Pan for later!, , Mysore Bonda in Appe / Abelskiever Pan, , Do you agree when I say that – in my kitchen, you will always, EAT HAPPY & STAY HAPPY, !!, , Sonal, , &amp;amp;amp;amp;amp;lt;br /&amp;amp;amp;amp;amp;gt;, &amp;amp;amp;amp;amp;lt;br /&amp;amp;amp;amp;amp;gt;, , , , Related, , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, , Email, , , , Notify me of follow-up comments by email., , Notify me of new posts by email., , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 6 Comments, , , , , , , Loretta, , says:, , , , November 28, 2016 at 11:03 am, , , , , That looks so good Sonal.  I see that pan used in a lot of Indian cooking.  Love that blue tray you use in your photo shoots., , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , November 28, 2016 at 5:33 pm, , , , , Loretta, This is a blessing. Even koftas come out good., , , Reply, , , , , , , , , , Preethi's Cuisine, , says:, , , , November 28, 2016 at 4:33 am, , , , , Love the bonda made in Appr Pan!! Awesome !!, , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , November 28, 2016 at 5:32 pm, , , , , Thank you, , , Reply, , , , , , , , , , sarabjeet, , says:, , , , November 27, 2016 at 10:24 pm, , , , , Hi..which appe pan did tou use..brand name pls, , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , November 28, 2016 at 5:32 pm, , , , , I use prestige appe pan, , , Reply, , , , , , , , , , , , , , Top Posts, , , , , , , , , , Easy Chocolate Cheesecake in a Jar, , , , , , , , , , , , , , Gujiya Pinwheels Puff Pastry Recipe, , , , , , , , , , , , , , Rabdi Gulabjamun Cups No Cook Recipe, , , , , , , , , , , , , , Air Fryer Puff Pastry Pizza Recipe, , , , , , , HELLO!! THANKS FOR BEING HERE!, , , , I am a born & raised Indian, now living in USA since last 20 years. Raising 2 beautiful girls and a puppy with my amazing husband., Read More About Sonal, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Copyright © 2025 • Simply Vegetarian 777 • All Rights Reserved •, Privacy Policy, , , , , , , , , , , , , , Scroll to top, , Scroll to top, , , , , , , , , , , , , , , , Home, , About, , Recipe Index, , Contact, , Subscribe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , ,",
        "Zucchini and onion fritters": "Ingredients:  Instructions: ",
        "Zucchini Tots in Appe Pan": "Ingredients: , , 2 zucchini/medium/ grated, , 1/2 green onion/ chopped, , 1/2 Avocado/Mashed or potato/boiled, , 2 garlic cloves/ minced, , 1/2 cup yellow corn / frozen, , green chili or to taste, , 1/2 cup Dill leaves(optional  if you like it), , 2-3Tbsp coriander leaves/chopped, , 1/2 teaspoon chaat masala, , 1/2 teaspoon mint leaves /Pudina/chopped, , 3 tablespoon rice flour, , 2 string cheese/cut it in small cubes( for vegan zucchini tots skip the cheese), , 2 tablespoons oil, , salt to taste, , , , , , 2 zucchini/medium/ grated, , 1/2 green onion/ chopped, , 1/2 Avocado/Mashed or potato/boiled, , 2 garlic cloves/ minced, , 1/2 cup yellow corn / frozen, , green chili or to taste, , 2-3Tbsp coriander leaves/chopped, , 1/2 teaspoon chaat masala, , 1/2 teaspoon mint leaves /Pudina/chopped, , 3 tablespoon rice flour, , 2 string cheese/cut it in small cubes( for vegan zucchini tots skip the cheese), , 2 tablespoons oil, , salt to taste, , , , ,  Instructions: », Appe Pan, No Fry Zucchini Tots, , Modified:, Apr 5, 2022, · Published:, Sep 9, 2015, by, Soniya Saluja, · This post may contain affiliate links ·, 10 Comments, Jump to Recipe, No Fry Zucchini Tots - a way healthier alternative to tater tots, and much tastier too .I have being using the appe pan for quit some time now. Its amazing how i can make most of the fried stuff in this magic pan with few drops of oil. Loved the end result !! I think this is my new favorite way to eat Zucchini. If this doesn’t get the kids to eat their veggies, I don’t know what will., , [avatar user=\"soniyasaluja\" size=\"thumbnail\" align=\"right\" link=\"https://thebellyrulesthemind.net/about-us/\" target=\"_blank\" /], , No Fry Zucchini Tots is a fun recipe to get your kids to eat their veggies with this delicious dish., These are perfectly crunchy and delightful! My kids R2 and R3 gobbled them up :), , , , , , Finely grate zucchini ., , In a chopper add the green onions,garlic, avocado,cilantro, mint leaves ,Dill leaves and pulse it, , Now add crushed mixture to the grated zucchini ., , Also add corn ,rice flour salt and chat masala and mix everything nicely., , , Take the mixture of a size of a lemon ball ,(If you do not have a appe pan make patties and cook them on a pan)., , Add in the string cheese (for vegan version do not add the cheese), , Heat the appe pan ,add oil on medium heat. Once the oil is hot place the zucchini tots in the pan., , Cook for 2-4 minutes on each side or till it's light golden brown in color and then flip to cook the other side., , , Enjoy No Fry Zucchini Tots hot or room temperature with green chutney or ketchup., , Note:, , You can use Boiled potato if Avocado is not available., , For vegan Zucchini tots skip the cheese., , If you do not have a appe pan make patties and cook them on a pan., , If there is lot of water in the Zucchini .try to squeeze out as much water as you can., , , , Continue to Content, , , , , , , , Zucchini Tots, , , , , Print, , , , , , , Finely grate zucchini ., In a chopper add the green onions,garlic, avocado,cilantro, mint leaves and pulse it, Now add crushed mixture to the grated zucchini ., Also add corn ,rice flour salt and chat masala and mix everything nicely., Take the mixture of a size of a lemon ball ,(If you do not have a appe pan make patties and cook them on a pan)., Add in the string cheese (for vegan version do not add the cheese), Heat the appe pan ,add oil on medium heat. Once the oil is hot place the zucchini tots in the pan., Cook for 2-4 minutes on each side or till it’s light golden brown in color and then flip to cook the other side.Enjoy Zucchini tots hot or room temperature with green chutney or ketchup., Note: You can use Boiled potato if Avocado is not available., For vegan Zucchini tots skip the cheese., If you do not have a appe pan make patties and cook them on a pan., if there is lot of water in the Zucchini .try to squeeze out as much water as you can., , , , , , , , , , , Follow us for more delicious Recipes !, , Did you make recipe? don’t forget to come back and leave your feedback and star rating., , , , , , , © Soniya Saluja, , , , Cuisine:, Indian, , , , , , , , , , , , , This is the Appe pan we use for making all our appe recipes, , More Appe Pan, How to Make Sabudana Vada in Appe Pan, Malai Kofta - Restaurant Style Recipe, No Fry Veg Manchurian Recipe, No fry Dahi Vada / Dahi Bhalla Chaat, Comments, , , , , , Shalini, , says, , , February 13, 2018 at 2:03 am, , , , Hello Sonia . Awesome appe pan recipes. U ladies r really superwoman. Innovative cooking and then passionately sharing them.  Today I tried the zucchini tots. Thanks a ton., , , Reply, , , , , , , , Soniya Saluja, , says, , , February 13, 2018 at 4:51 pm, , , , Thank you Shalini for your kind words!! It's very encouraging ?glad to hear that you like our zucchini tots recipe !, , , Reply, , , , , , , , , , Sunita, , says, , , March 16, 2016 at 2:19 pm, , , , Hi Soniya..This looks like a great and healthy recipe. Will definitely try it. May I know what food processor you are using? Thanks, Sunita, , , Reply, , , , , , , , Soniya Saluja, , says, , , March 16, 2016 at 8:17 pm, , , , Hello Sunita, Glad you liked it  and wanna try it  :) I  was using Cuisinart DLC-1RD Mini-Prep Processor., , , Reply, , , , , , , , , , Sravanthi, , says, , , September 12, 2015 at 2:26 pm, , , , Hi Soniya,, , The dough came out very soft and watery. How do I fix it? Please help!!, , -Sravanthi., , , Reply, , , , , , , , Soniya Saluja, , says, , , September 12, 2015 at 2:36 pm, , , , Hello Sravanthi,, I guess the reason could be the water in the zucchini, add some more rice flour ., while making them next time try to squeeze out as much water as you can its  mentioned in the notes., Hope it helps ., Thanks, , , Reply, , , , , , , , , , Rekha, , says, , , September 09, 2015 at 7:06 pm, , , , Very healthy and yummy recipe ,will try it.., , , Reply, , , , , , , , Soniya Saluja, , says, , , September 09, 2015 at 7:17 pm, , , , Thank you Rekha... glad you liked it ., Do share your feed back when you try them., , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , Welcome!, , A vegetarian & vegan food blog where we (Anvita & Soniya) share everyday healthy-ish recipes, some occasional treats, and even-you-can-do-this ideas., , , Read more, , , , Popular Recipes, , Instant Pot 2 Ingredient Homemade Yogurt !, Instant Pot Vegetable Chowmein Recipe, Date & Walnut Loaf Cake, Minestrone Soup (Copycat Olive Garden), , , Trending Now, , , , , , Footer, , , , freebie alert!, , Download our Vegetarian Grazing Table Grocery List, , Download our, FREE, Vegetarian Grazing Table Grocery List so you can start setting up an Instagram worthy spread for your next gathering., , , Get the list!, , , , , , , , , About Us, , Privacy Policy, , Contact, , ↑ back to top, , , , , , , Copyright © 2024, The Belly Rules The Mind, •, Powered by Feast+, , , , , Skip to Recipe, , , , , , , , , , ,"
    }
}