{
    "ingredients": {
        "Avocado Egg Samosa Roll": "spring roll wrapper,eggs,avocado,flour paste",
        "Oven Baked Samosas": "spring roll wrappers,tofu,cabbage,zucchini,green beans,garlic,egg",
        "Potato and peas samosa muffins": "potatoes,coconut oil,onion,garlic,ginger,green peas",
        "AirFried Samosa": "maida,ajwain,potatoes,peas,ghee",
        "Air Fried Healthy Samosas": "All purpose flour,oil.potato,peas",
        "Air Fryer Samosa Chaat Phyllo Cups": "frozen phyllo shells,potatoes,onion,ginger,frozen peas,cilantro and tamarind chutney",
        "Baked Curry Puffs": "vegan puff pastry,potato,onion,garlic,frozen peas,curry powder,sambal,veggie stock,pandan leaves,oat milk,maple syrup"
    },
    "recipe_url": {
        "Avocado Egg Samosa Roll": "https://www.savorybitesrecipes.com/2018/01/avocado-egg-samosa-roll.html",
        "Oven Baked Samosas": "http://www.joannasoh.com/foods/recipes-1/oven-baked-veggie-spring-rolls-samosas-healthy-party-snacks",
        "Potato and peas samosa muffins": "https://healthiersteps.com/recipe/potato-and-peas-samosa-muffins/",
        "AirFried Samosa": "https://rachnacooks.com/samosa-made-in-an-airfryer/",
        "Air Fried Healthy Samosas": "https://urbanfarmie.com/healthy-samosas/",
        "Air Fryer Samosa Chaat Phyllo Cups": "https://spicecravings.com/samosa-chaat-phyllo-cups",
        "Baked Curry Puffs": "https://woonheng.com/baked-curry-puffs/#recipe"
    },
    "Recipe": {
        "Avocado Egg Samosa Roll": "Ingredients: , , 8, , Samosa Patti /, Spring Roll Wrapper, , 2, , Eggs,hard boiled,peeled,sliced vertically, , 1/2, , Avocado,Large,sliced, , , , For Stuffing:, , 1 Tablespoon, , Vegetable Oil, , 1 Tablespoon, , Ginger-Garlic Paste, , 1, , Onion,browned, , as per need, , Salt, , 1/4 Teaspoon, , Turmeric Powder, , 1 Teaspoon, , , Coriander Powder, , 1/2 Teaspoon, , , Red Chili Powder, , 1 Tableapoon, , Tomato Ketchup, , , , Additional:, , , , Flour Paste,to seal the samosa edges, , , , Oil to deep fry, , , , , , Meanwhile thaw the samosa sheets., , Cook the stuffing for about 2 mins,then switch off the gas/heat., To this add sliced egg and chopped avocado., , Mix well and keep aside., Heat oil in a deep frying pan., , Arrange the samosa sheets /Spring Roll sheets,place a spoonful stuffing on each sheet or more as per need., , Fold the edges of the sheet to form a triangle/samosa and seal the edges with flour paste., Here is the link to Pinterest image where you can get idea how to fold the samosa :, Image, , Slowly drop them in hot oil to fry till crisp., Fry on medium flame and drain on kitchen tissue paper., Serve hot with sauce,chutney and tea!, Enjoy, , , , , Details, , Prep time:, 15 mins, Cook time:, 15 mins, Total time:, 30 mins, Yield:, 8 No, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Note:This post contains Affiliate links., , , , Share this, , , , , , , , Labels:, , wraps-and-rolls, ,, , , Hi, I'm, , Prasanna, !, I will be the first one to admit that I am an accidental food blogger. I love trying out new recipes and giving them a twist of my own. Hope you enjoy trying out the recipes ... do leave me your valuable feedback 😊, , Read More, , , , Don't miss out!, Get, New Posts, straight to your inbox!, YES! I WANT IN!, We respect your privacy. Unsubscribe at anytime., , , Related recipes, , , , , , , Comments, , , , , , , Kushi, January 4, 2018 at 3:45 PM, Great idea.  Looks so crispy and yummg, Reply, Delete, Replies, Reply, Sandi, January 4, 2018 at 9:15 PM, Those would be a big hit in our house., Reply, Delete, Replies, Reply, Brian, January 4, 2018 at 11:04 PM, I do love samosas so much although I am definitely not as coordinated as you as mine always end up looking a bit ropey!, Reply, Delete, Replies, Reply, Adrianas Best Recipes, January 4, 2018 at 11:15 PM, samosas are my favorite snacks. Every time I go to the Indian restaurant I order one. But making it with avocado which is another of my favorites makes it so special yummy!, Reply, Delete, Replies, Reply, Unknown, January 5, 2018 at 12:30 AM, I absolutely love samosas, but I've never had them stuffed with eggs or avocado before! What a fab idea!, Reply, Delete, Replies, Reply, Natalie, January 5, 2018 at 2:56 AM, Looks absolutely delicious!, Reply, Delete, Replies, Reply, Helene Dsouza, January 5, 2018 at 5:17 AM, Which spring roll wrappers do you get in the shops here? They did have some at some point but I can't remember the brand. That was 3 years ago... I love egg in samosas and I can see why you added avocado to your filling. Must be not only flavorful but also nutritious!, Reply, Delete, Replies, Reply, Karyl Henry, January 5, 2018 at 7:17 AM, This sounds really delicious. I love avocado as well, and eat it almost every day. I'm going to have to try this recipe too, Reply, Delete, Replies, Reply, veenaazmanov, January 5, 2018 at 12:41 PM, OH I love the sound of avocado in my samosa!! Yum! The spring roll wrapers are always perfect for samosa., Reply, Delete, Replies, Reply, Gina, January 5, 2018 at 6:07 PM, This looks AMAZING! ANYTHING wit avocado is a winner!, Reply, Delete, Replies, Reply, Sharon Glascoe, January 6, 2018 at 8:26 AM, Can't think of a better way to enjoy avocado. You hit the jackpot with these fried appetizers., Reply, Delete, Replies, Reply, Ben Myhre, January 6, 2018 at 12:05 PM, Boy, these look like great little appetizers!, Reply, Delete, Replies, Reply, Ashley, January 6, 2018 at 2:37 PM, Oooh I bet the texture of the filling here is soooo creamy and delicious. Really nice paired with the crispy exterior!, Reply, Delete, Replies, Reply, Julie @ Bunsen Burner Bakery, January 7, 2018 at 12:54 PM, Ooooh I can see why your family loved this so much - I bet that avocado gets super creamy when it is fried!, Reply, Delete, Replies, Reply, Cleo, January 7, 2018 at 6:18 PM, Avocados and eggs go together so well!  Such a wonderful snack or a light meal or they could even be used as appetizers.  I think this was a great idea!, Reply, Delete, Replies, Reply, Tatiana, January 7, 2018 at 8:08 PM, Never had a samosa with avocado! Sound intriguing!, Reply, Delete, Replies, Reply, Unknown, January 8, 2018 at 2:33 PM, This look so perfectly crispy and delicious! My hubby would love these as a grab and go breakfast treat...if I left any for him, that is. :), Reply, Delete, Replies, Reply, Add comment, Load more..., , , , , , , Post a Comment, , Please leave your feedback!, , , , , , , , , , ‹ Next Recipe, , , Previous Recipe ›, , , , , , , , , , , , , , , Find your recipe, , , , , , , , , , , , , , , , , Hey, I am Prasanna!, , I will be the first one to admit that I am an accidental food blogger. I love trying out new recipes and giving them a twist of my own. Hope you enjoy trying out the recipes ... do leave me your valuable feedback 😊, Read more, , , , Popular recipes, , , , , , , , , Make This Best Asian Chicken Lettuce Wraps Recipe, , , , , , , , , Make This Spicy Chicken Noodle Stir Fry, , , , , , , , , The Best Christmas Punch Recipe {of all time}, , , , , , , , , The Best Chicken Ramen Noodles [Of All Time], , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Privacy Policy, , , , Copyright, , , , Get in Touch with me!, , , , , , © 2012 -, ·  Savory Bites Recipes - A Food Blog with Quick and Easy Recipes, Design by Code&Blog, , , , , , , , , Back to top ↑, , , , , , , , , , , , , Instructions: , , To prepare the stuffing,in a pan,add oil., When oil is hot,add ginger-garlic paste., Let it cook till raw smell goes",
        "Oven Baked Samosas": "Ingredients:  Instructions: ",
        "Potato and peas samosa muffins": "❌ Error scraping https://healthiersteps.com/recipe/potato-and-peas-samosa-muffins/: Exceeded 30 redirects.",
        "AirFried Samosa": "Ingredients: Why You'll Love This Recipe, , , 1., All-purpose flour (Maida):, 1 cup flour is used here., , 2., Spices, : ½ tsp. of Carom seeds or Ajwain gives it a nice flavor and helps with digestion too., , 3., Vegetable oil:, 2 tbsp. is used for a flaky dough. You may use ghee as well if you consume dairy., , 4., Cold, , water:, Helps in making the dough firm., , 5., Salt:, ½ teaspoon or as per taste, , , 1., Potatoes:, 3 medium-sized potatoes are boiled, peeled, and mashed. I like them to retain some shape., , 2., Peas:, ½ cup boiled green peas. I have used frozen ones here., , 3., Oil:, 2 tsp. oil is used for sauteing the filling., , 4., Spices, : This filling is quite flavorful and uses all these spices: ½ tsp. cumin seeds, asafoetida ⅛ tsp. (optional), turmeric powder ½ tsp., cayenne ½ tsp., , garam masala, ½ tsp., amchur ½ tsp. and coarsely, ground coriander, 1 tsp., , 5., Ginger and green chilies, : 2 finely chopped green chillies and 1-inch piece of grated ginger is used to flavor the filling., , 6., Salt, : It is used as per taste., , , Why You'll Love This Recipe, , 1., Healthier Option, : A traditionally deep fried samosa could range from 300 to 400 Calories., , Samosas made in the air fryer will be about 150 to 200 Calories. It will vary depending upon the size of your samosa and the oil used overall., , 2., Flaky, : Despite not deep frying, the outer crust is flaky and slightly crisp. It is delicious., , 3., Mess free, : I avoid deep frying due to the mess of hot oil and also what to do with the leftover oil., , , Assemble all the spices along with processed flour or maida., , To make outer shell or pastry of samosa:, , Take 1 cup maida or refined flour or all-purpose flour., , Sieve it with ½ tsp. salt. Add ½ tsp. ajwain or carrom seeds or use dried oregano., , , Add 2 tbsp. of vegetable oil. I have used mustard oil here that is why it looks so yellow., , You can use any vegetable oil like peanut oil or olive oil., , You can also use melted, ghee or clarified butter, ., , , , This is important so that the pastry turns out flaky and not crispy., , , Now slowly add 1-2 tbsp. of cold water  at a time and knead a stiff dough while using as little water as possible., , Again, this is important as we want the outer shell to be flaky., , , Keep this dough covered with a damp kitchen cloth or towel and keep aside for 20 minutes., , , To prepare the samosa filling:, , Take 1 tbsp. oil in a hot pain., , Add ½ tsp. cumin seeds along with finely chopped green chillies and grated ginger. Cook for a minute., , , Add fresh or frozen peas., , If needed add a little water and cook till peas are done which takes about 4 minutes., , , Now add in the mashed or chopped potatoes., , Add salt, asafoetida, cayenne or red chilli powder, ground coriander, garam masala powder and, amchur, or dried mango powder., , Mix well and cook till the filling mixture is dry., , , Keep aside to cool down., , , To assemble\nthe samosa:, , The outer pastry is made by rolling out a ball of dough and then cutting it into half., , , 2. Seal the straight end of the half oval by using water to form a conical pocket., , , Add filling into the conical pocket leaving place at the ends to seal., , , Seal by applying water and shut it tight. Your samosa with filling is ready., , Make all samosas in this manner., , , How to Make Samosas in Air fryer, , Pre-heat the air fryer at 160 C or 320 F for 5 minutes., , Now brush samosas with oil and place them in the Air fryer. Make sure that they are not overlapping., , Air fry at 160C or 320 F for about 8 minutes. Flip once midway for even cooking., , Now Air fry at 200 C or 390 F for about another 6-8 minutes till the samosas look done and golden., , , Serve hot with, green chutney, or ketchup., , Your air fried samosa is ready to serve. It is super flaky and delicious., , , To Deep fry\nsamosa, , Take oil in a pan and heat the oil on a low flame., , Now slowly slide the samosas in making sure not to crowd the pan., , Cook on low flame for about 6-8 minutes. This ensures that the samosas stay flaky and do not develop air bubbles., , Now increase the temperature to medium temperature. Fry further for about 6 minutes till the samosas are golden brown. Serve hot., , Overall, this samosa is a tasty, much-healthier version of this much-loved Indian snack., , Try it. Your delicious samosa is ready to be had with adrak chai., , FAQs, , 1. Can you air fry frozen samosas?, , Yes, it is easy to air fry frozen samosas. Preheat air fryer at 360 F or 180 C for 5 minutes. Cook frozen samosas for about 8-10 minutes, flipping them once midway. Keep checking to ensure that they are done., , , 2. Can you warm a samosa in the air fryer?, , Yes you can. Preheat air fryer at 360 F or 180 C for 5 minutes. Place cold samosas and air fry for 2-3 minutes till they are hot to touch., , , , Variations, , 1., Dairy free, : This recipe is is dairy free (if you use oil). For dairy eaters, you can use ghee in place of oil for a buttery taste., , 2., Outer pastry, : You could use wholewheat flour or a combination of wholewheat flour and millet flour for the outer pastry., , 3., Use puff pastry, : Instead of making outer crust from scratch, you can use readymade puff pastry dough or crescent roll as a substitute., , Fillings Alternatives, , While, potato and peas, is a traditional filling for this samosa, you can use pretty much any filling of choice., , 1., Cabbage, carrots and onion, : Saute onions. Add grated cabbage and carrots. Use seasonings or sauces of choice., , Cook. Cool down and use as filling., , 2., Lentils, : Cooked lentils or beans make for an excellent high protein complex carbohydrate filling., , 3., Tofu or Paneer, : Crumbled tofu or paneer cooked with onions and spices make for an excellent filling., , 4., Meat, : In case you eat meat, minced chicken or other meat cooked with spices make for a good filling., , , Expert Tips, , 1. Your dough must be stiff but not so stiff that you are not able to roll it out. Don’t use any flour to roll out dough., , It’s okay if when rolling out your shape is not perfect. The taste will be good., , 2. Using cold water makes the dough nice and stiff that helps with flakiness., , 3. You must rest the dough as mentioned so that the samosa shell turns out flaky., , 4. You can add other veggies too or add chicken or mutton mince if you like to make meat samosa., , 5. You must keep the filling very dry to avoid the samosas going soggy after you fry them and keep., , 6. Once filled and sealed, you can keep the samosas in the fridge for up to 3 days to fry later., , 7. You can also freeze the prepared samosas for upto 3 months and then air fry when ready to eat. This way you can make a large batch., , 8. Your pastry will turn out flaky when you incorporate your shortening eg. Ghee or oil in your dough., , Don’t skimp on this or your samosa will not be flaky but hard and dry., , Here's the recipe card:, , 📖 Recipe Card, , , , , , Air fryer Samosa, , , Rachna Parmar, , , This samosa recipe in an airfryer is a delightful snack and popular street food made healthier by making it in air fryer. Try this version to have this tasty snack guilt free., , , 4.97, from, 141, votes, , , , Print Recipe, , Pin Recipe, , , Save Recipe, Saved Recipe, , , , , , Prep Time, 20, minutes, , mins, Cook Time, 25, minutes, , mins, Resting times, 40, minutes, , mins, Total Time, 1, hour, , hr, , 25, minutes, , mins, , , , , , , Course, Snack, Cuisine, North Indian, North Indian | Uttar Pradesh | Punjabi, , , , , , Servings, 6, , samosa, Calories, 175, , kcal, , samosa, , , , Equipment, Philips Airfyer, , , 1x, 2x, 3x, To make outer Shell, 1, , cup, , maida, , or refined flour, ½, , tsp., , salt, ½, , tsp., , ajwain, , or carrom seeds or use dried oregano, 2, , tbsp., , vegetable oil, To make the filling, 3, , potatoes, , boiled, ½, , cup, , peas, , boiled, Spices, ½, , tsp., , cayenne, , or chilli powder, ⅛, , tsp., , asafoetida, , optional, 1, , tsp., , ground coriander, 1, , tsp., , amchur powder, ½, , tsp., , garam masala, 1, , tsp., , amchur, , or dried mango powder, 2, , chillies, , finely chopped, 1, , tbsp., , ginger, , grated, 2, , tsp., , vegetable oil, ½, , tsp., , salt, , , Do you want to save this recipe?, Enter your email below & we’ll send it straight to your inbox. Plus you’ll get more great recipes and tips from us each week!, , , Send It, , Invalid email address. Please enter again., , , , , Awesome! Check your email for your saved recipe., , , Now slowly add 1-2 tbsp. of water and knead a stiff dough while using as little water as possible., Keep this dough covered with a kitchen cloth and keep aside for 20 minutes., To prepare the filling:, Take 2 tsp. oil in a hot pain. Add ½ tsp. cumin seeds along with grated ginger and finely chopped green chillies. Saute for a minute., Add fresh or frozen peas. If needed add a little water and cook till peas are done or for 4 minutes., Now add in the mashed or chopped potatoes. Add salt, cayenne or red chilli powder, ground coriander, garam masala powder, asafoetida (optional) and amchur or dried mango powder. Mix well and cook till the filling mixture is dry. Keep aside to cool down., Keeping coriander seeds coarsely powdered gives the filling a nice texture., To assemble the samosa:, Divide the shell dough into round balls. Roll them out using a rolling pin. Make them oval in shape. Now cut them into halves., Use water on the straight cut side to seal the shell in the shape of an open cone., Now add the filling in the cone and leave enough space on top to seal the samosa., Add a little water along the lining to seal the samosa firmly shut., Make all samosas in this manner and keep aside for 15 minutes. Instructions: FAQs, Variations, Fillings Alternatives, Expert Tips, 📖 Recipe Card, 💬 Reviews, , What is Samosa?, , Samosa is a much-loved Indian snack that is traditionally vegan., , The most popular version has a spiced mashed potato and peas filling in a flaky outer pastry., , These are traditionally deep fried on a medium flame., , They are very popular evening snack with a nice cup of chai., , , , To make outer shell of samosa:, Take 1 bowl maida or refined flour. Sieve it with ½ tsp. salt. Add 1 tsp. ajwain or carrom seeds., Add 2 tbsp. of melted ghee or clarified butter. You could use oil too., Pre-heat the air fryer at 160 C or 320 F for 5 minutes., Now brush samosas with oil and place them in the air fryer., Air fry at 160 C or 320 F for about 8 minutes. Flip them once in the middle of the cook., Now Air fry at 200 deg C or 390 F for about another 6-8 minutes till the samosas look done and golden., Serve hot with green chutney or ketchup. Your air fried samosa is ready to serve. It is super flaky and delicious., To Deep fry samosa, Take oil in a pan and heat the oil on a low flame., Now slowly slide the samosas in making sure not to crowd the pan., Cook on low flame for about 6-8 minutes. This ensures that the samosas stay flaky and do not develop air bubbles., Now increase the temperature to medium temperature. Fry further for about 6 minutes till the samosas are golden brown. Serve hot., , Video, , Notes, 1. Your dough must be stiff but not so stiff that you are not able to roll it out. Don’t use any flour to roll out dough. It’s okay if when rolling out your shape is not perfect. The taste will be good., , 2. Using cold water makes the dough nice and stiff that helps with flakiness., 3. You must rest the dough as mentioned so that the samosa shell turns out flaky., 4. You can add other veggies too or add chicken or mutton mince if you like to make meat samosa., 5. You must keep the filling very dry to avoid the samosas going soggy after you fry them and keep., 6. Once filled and sealed, you can keep the samosas in the fridge for up to 3 days to fry later. 7. You can also freeze the prepared samosas for upto 3 months and then air fry when ready to eat. This way you can make a large batch., 8. Your pastry will turn out flaky when you incorporate your shortening eg. Ghee or oil in your dough. Don’t skimp on this or your samosa will not be flaky but hard and dry., , Nutrition, Calories:, 175, kcal, Carbohydrates:, 36, g, Protein:, 6, g, Fat:, 1, g, Saturated Fat:, 0.1, g, Polyunsaturated Fat:, 0.3, g, Monounsaturated Fat:, 0.2, g, Sodium:, 328, mg, Potassium:, 581, mg, Fiber:, 5, g, Sugar:, 3, g, Vitamin A:, 414, IU, Vitamin C:, 48, mg, Calcium:, 29, mg, Iron:, 2, mg, , , , , , , Tried this recipe?, Let me know on Instagram, @rachna.parmar, or tag, #rachnacooks, , , , Check out our Food videos, , Subscribe, to our Food channel for recipe videos, , If you liked this recipe, I request you to leave a * star rating for this recipe either in the recipe card or in the comments. Thanks., , 836, shares, , Facebook, , Pinterest, , Flipboard, , Reddit, More Air Fryer Indian Recipes, Rajma Cutlets, Air Fryer Eggplant Slices or Begun Bhaja, Air Fryer Chana Dal, Air Fryer Rava Fried Fish, Reader Interactions, Comments, , , , , , Sharmila, , says, , , May 25, 2015 at 4:01 pm, , , , Great post Rachna!It has been ages since I had my last Samosa! I want to buy an Airfryer but I am confused between Philips Airfryer and Usha Halogen Oven with airfryer attachment.Heard this oven is good. Any idea?, , , Reply, , , , , , , , Rachna, , says, , , May 25, 2015 at 4:29 pm, , , , Thanks, Sharmila. I dislike the market samosa too. So much fat and loaded with unhealthy stuff like Dalda. Makes me sick. I have cursorily read about Usha Halogen Oven. It does not have airfryer attachment. It uses the same airfrying technique. Since it is glass, it looks nicer. It does the same baking, grilling, airfrying that an airfryer does. It has some extra features like cleaning and sterilizing which don't seem spectacular to me. My experience this far with Philips Airfryer has been really good. I should be putting up a review in a few days. Usha seems nice too. I guess, you will have to wait for someone who has actually used the product to review it. 🙂 Both these products are much faster than our conventional ovens., , , Reply, , , , , , , , , , CookieCrumbs Inc., , says, , , May 25, 2015 at 4:15 pm, , , , Oh, the airfryer sounds too good to be true :/ Does it really banish all the calories that accumulate due to deep frying? Does it cook properly?, , , Reply, , , , , , , , Rachna, , says, , , May 25, 2015 at 4:26 pm, , , , I will be doing a review of my airfryer soon and will be covering all the aspects of taste, calories etc. in that. To answer your questions: It does reduce calories because you are only brushing the fat instead of deep frying.  Most dishes I've tried so far taste great. There are exceptions that I'll mention in the post. This samosa is wonderfully tasty but the texture of the outer covering is very different from a conventional samosa. Considering that those are achieved by excessive Dalda, I think this is an option worth exploring., , , Reply, , , , , , , , , , Bikramjit, , says, , , May 25, 2015 at 5:03 pm, , , , What a coincidence ha ha ha ha guess what .., , I just came back home and I bought some samosa and channa.., , No other way than to buy from the shop..but we have a great shop and they make yum samosa. .., , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 7:27 am, , , , It is quite a time consuming affair. If you have it once in a while, makes sense to just buy it from the halwai and consume. 🙂, , , Reply, , , , , , , , , , Ravish Mani, , says, , , May 25, 2015 at 7:12 pm, , , , Healthy & tasty! Wonderful 🙂, , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 7:26 am, , , , Thanks, Ravish. 🙂, , , Reply, , , , , , , , , , Dagny, , says, , , May 25, 2015 at 8:31 pm, , , , Try adding some extra 'moyen' in the maida next time. I think the pastry will come out flakier., , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 7:26 am, , , , Yep, I thought 4 tbsp. oil was already quite a bit but I guess it needs more. 🙂, , , Reply, , , , , , , , , , Tales of a Traveler, , says, , , May 26, 2015 at 12:18 am, , , , I love samosa <3 <3, , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 7:26 am, , , , Me too. But the traditional samosa is really so heavy to be had more often., , , Reply, , , , , , , , , , shanayatales, , says, , , May 26, 2015 at 5:08 am, , , , Thanks for the recipe. Will try the baked version of this as I don't have an airfryer. Have heard a lot about this Philips one. Will look forward to your review. Or have u done one already?, Just curious. Have u tried baked samosas?  If yes, , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 7:25 am, , , , No, I haven't tried the baked version but I have a feeling that they must be tasting similar. I will be doing the review soon. Haven't done it yet. Good to see you after a while. Shantala. How was your India trip?, , , Reply, , , , , , , , shanayatales, , says, , , May 27, 2015 at 9:41 pm, , , , Oh Mumbai was terribly hot, but we still had loads of fun. Met a lot of family and eat a lot of yummy food. 🙂, , , Reply, , , , , , , , Rachna, , says, , , May 28, 2015 at 10:05 am, , , , That sounds like fun. 😀, , , Reply, , , , , , , , , , , , , , Shilpa Garg, , says, , , May 26, 2015 at 11:44 am, , , , I love Samosas and these are such a healthy version of the ones that I usually eat!!, , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 11:45 am, , , , That these are and they taste good too, Shilpa. 🙂, , , Reply, , , , , , , , , , Indywrites, , says, , , May 26, 2015 at 2:00 pm, , , , This is good, I am a fan of fried food and have been trying to use the air fryer feature in my microwave. Hope to make these samosas soon. 🙂, I am now very motivated. Thanks Rachna., , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 2:23 pm, , , , Thanks, Inderpreet. Glad you liked the recipe. Just increase the oil in your dough to make the pastry flakier. Hope you enjoy them., , , Reply, , , , , , , , , , Sid Balachandran, , says, , , May 26, 2015 at 2:03 pm, , , , Your 'Airfryer' posts have almost got me convinced to invest in one 🙂, , , Reply, , , , , , , , Rachna, , says, , , May 26, 2015 at 2:23 pm, , , , You will like it. It is really quite simple and fast. Wait for my review post. 😉, , , Reply, , , , , , , , Sid Balachandran, , says, , , May 26, 2015 at 2:24 pm, , , , Waiting 🙂, , , Reply, , , , , , , , , , , , Saru (@BaawriBasanti), , says, , , May 26, 2015 at 6:49 pm, , , , I think we have a similar product here. Your samosas like healthier. Do share your tips to make pasty more flaky., , , Reply, , , , , , , , parulthakur24, , says, , , May 27, 2015 at 1:43 pm, , , , Good to know that the air fryer was effective. I don't eat deep fried stuff but using an air fryer seems possible. Thank you for sharing!, , , Reply, , , , , , , , Rachna, , says, , , May 27, 2015 at 1:55 pm, , , , I like pakoras and samosas but eat them very rarely. Now I will eat them more for sure. 🙂, , , Reply, , , , , , , , , , Mithila Menezes, , says, , , May 27, 2015 at 3:40 pm, , , , I clearly remember the advertisements made by this chef on YouTube through his cooking shows.. Heard of Vaah Chef? He's the one., I've been bugging my mum to buy this super awesome device since then. To no avail. Coz dad is the one holding the purse-strings!, , Maybe after they read this blog post I might get to devour some Crispy samosas and still manage to stay on my diet? Maybe!, , , Reply, , , , , , , , Rachna, , says, , , May 28, 2015 at 10:06 am, , , , Yes, I love that colorful chef. He is quite funny too. hahaha For your sake, Mithila, I hope mummy and daddy buy the device. It is quite good actually., , , Reply, , , , , , , , , , Sreesha, , says, , , May 28, 2015 at 1:32 am, , , , I was curious to find out if this works ever since I saw the ad on TV! Glad to know it does., I used to try the microwave-baked versions of deep fried foods. But they are, to be honest, not nearly as tasty as their deep fried, unhealthy counterparts!, , , Reply, , , , , , , , Rachna, , says, , , May 28, 2015 at 10:07 am, , , , Yes, Sreesha. I waited for a few months because I had my doubts too. But now that I have been trying it for weeks, it is coming up trumps. I am doing a review of the airfryer where I will explore the pros and cons in further detail., , , Reply, , , , , , , , , , Sabyasachi Patra, , says, , , May 28, 2015 at 6:04 pm, , , , I don't understand a thing about air friers. However, talk of samosas and I can walk that extra mile to have it. There have been times when I have parked my safari near road side stalls to savour the samosas and some gravy curry. It serves as a quick lunch without wasting time as I don't drive during night. So saving time during daytime is very important for me while driving. And I enjoy driving, so I don't drive too fast - just about 100 or 120 kmph. So invariably I keep a watch out for outlets selling samosas. 🙂, , , Reply, , , , , , , , Rachna, , says, , , May 29, 2015 at 7:43 am, , , , That is an interesting ode to our favorite snack, Sabyasachi. During my last trip to Rajasthan, we ended up having a lot of kachoris and puris for breakfast. They fill you up nicely and keep hunger pangs at bay. But, at home, I prefer to have them very rarely., , , Reply, , , , , , , , , , John, , says, , , February 03, 2016 at 4:36 pm, , , , , , Reply, , , , , , , , Rachna, , says, , , June 02, 2020 at 2:25 pm, , , , Thanks John, , , Reply, , , , , , , , , , Beena Anil, , says, , , October 24, 2016 at 10:31 am, , , , Thanks for the airfryer infromation. May I know which airfryer  you purchased? what was the capacty and cost?. I would like to bake,grill and airfry different stuff. Which is best suitable, a convection microwave oven, air fryer or an OTG?, , , Reply, , , , , , , , Rachna, , says, , , June 02, 2020 at 2:24 pm, , , , I have both an Air fryer and OTG. I definitely prefer Air fyrer for shorter cooking times and crisper food. Here is the review of the Air fryer I currently use:, https://www.rachnacooks.com/2015/05/28/philips-airfryer-user-review/, , , Reply, , , , , , , , , , Luana, , says, , , October 30, 2016 at 2:14 pm, , , , Wao, crispy samosa is really perfect along with tea,i love the recipe., , , Reply, , , , , , , , Rachna, , says, , , June 02, 2020 at 2:23 pm, , , , Thanks Lunana, , , Reply, , , , , , , , , , Rashmi Mahajan, , says, , , December 15, 2016 at 8:45 pm, , , , Cook this at 80 temp for 40mins.. Then it doesn't dries out the pasty... Won't be flaky but won't be too hard to bite as well., , , Reply, , , , , , , , Rachna, , says, , , December 19, 2016 at 11:29 am, , , , Thanks for the tip., , , Reply, , , , , , , , , , fatty, , says, , , May 12, 2018 at 3:18 am, , , , hi, was wondering if you knew how long to airfry somosas from the freezer?, thanks, , , Reply, , , , , , , , Rachna, , says, , , May 14, 2018 at 7:20 am, , , , , , Reply, , , , , , , , , , Ashlie Lou Rianna, , says, , , July 31, 2020 at 11:06 pm, , , , Superb blog!, , , Reply, , , , , , , , Nart at Cooking with Nart, , says, , , September 10, 2020 at 2:20 pm, , , , I love samosa but have never made it before. Luckily I have an air fryer so I can use this recipe and I reckon it'll be much healthier than the restaurant version!, , , Reply, , , , , , , , Rachna, , says, , , September 13, 2020 at 9:38 pm, , , , I do hope you enjoy making it., , , Reply, , , , , , , , , , Shashi at SavorySpin, , says, , , September 10, 2020 at 2:48 pm, , , , I haven't made samosa in the air fryer yet and cannot wait to try your recipe out - I especially love the ajwain or carrom seeds in the crust!, , , Reply, , , , , , , , Rachna, , says, , , September 13, 2020 at 9:38 pm, , , , Good to know. Thanks Shashi., , , Reply, , , , , , , , , , Dannii, , says, , , September 10, 2020 at 2:56 pm, , , , I love finding new ways to use my slow cooker, and I never would have thought to make samosas in it. These look great., , , Reply, , , , , , , , Rachna, , says, , , September 13, 2020 at 9:38 pm, , , , Oh yes! This is so perfect to cook in Air fryer. Thanks., , , Reply, , , , , , , , , , Alexandra, , says, , , September 10, 2020 at 3:24 pm, , , , What a delicious and flavoursome recipe - I love samosa, and I love how delicious they work in the air fryer., , , Reply, , , , , , , , Rachna, , says, , , September 13, 2020 at 9:37 pm, , , , Thanks Alexandra, , , Reply, , , , , , , , , , Danielle Wolter, , says, , , September 10, 2020 at 4:08 pm, , , , I don't have an airfryer, , , Reply, , , , , , , , Rachna, , says, , , September 13, 2020 at 9:37 pm, , , , Glad to know that the recipe worked for you. Thanks., , , Reply, , , , , , , , , , Pat, , says, , , October 15, 2023 at 8:47 am, , , , This was my first time making samosas and they turned out perfectly! The samosas came out super crispy in the air fryer and I liked that they were healthier than deep-fried., , , Reply, , , , , , , , Blaine, , says, , , October 16, 2023 at 8:50 pm, , , , Never thought I can cook a delicious samosa using my air fryer. Love it!!, , , Reply, , , , , , , , Rena, , says, , , October 20, 2023 at 2:21 am, , , , When we used to have potlucks at work, one guy would bring in samosas made by his wife. They are awesome! I never wanted to make them myself until I saw your recipe. The air fryer makes it so easy! The results were outstanding. Now I'll be making these on repeat!, , , Reply, , , , , , , , Jenn, , says, , , October 21, 2023 at 9:12 pm, , , , will be making this again it was a hit with the teenagers!, , , Reply, , , , , , , , Emilie, , says, , , October 31, 2023 at 8:27 pm, , , , Love excuses to use my air fryer. I've never had anything like this before. Yum!, , , Reply, , , , , , , 4.97 from 141 votes (, 131 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , Primary Sidebar, , , Hi and welcome!, , I am Rachna, a Certified Nutritionist and Health Coach. I help you eat healthy. I specialize in healthy recipes especially Air fryer recipes., , I offer Health and Nutrition Coaching aimed at helping you achieve fat loss, healthy eating habits and more stamina and flexibility., , More about me →, , , HEALTHY RECIPES, , Air fryer Corn on the Cob, Air fryer Mushrooms, Air fryer Beet Chips, Air fryer Chickpeas, Air fryer Zucchini No Breading, Air fryer Peanuts, , LATEST RECIPES, , Air Fryer Teriyaki Salmon, Air Fryer Shoestring Fries, Who Knew Vegetables Could Taste THIS Good? Try These Irresistible Sides!, 11 Air Fryer Recipes So Addictive, You'll Wonder How You Lived Without Them!, Air fryer Chicken Recipes So Good, It’ll Ruin Restaurant Takeout for You Forever!, So Crispy, So Healthy—These Air Fryer Snacks Will Blow Your Mind!, Footer, , ↑ back to top, , , , POLICIES, , , Privacy Policy, , Disclaimer, , Accessibility Policy, , , , , NEWSLETTER, , , Sign Up, for emails and updates, , , , , ABOUT, , , About, , Contact, , Media Kit, , , , , As an Amazon Associate I earn from qualifying purchases. This blog earns income from affiliate links and ads., , Copyright © Rachna cooks 2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Air Fried Healthy Samosas": "Ingredients: , To make this recipe, you'll need potatoes, all purpose flour, turmeric, red chili powder, salt, frozen peas and cilantro. You'll also need water for the dough and some vegetable oil to coat the samosa for baking or air-frying. Other spices are totally optional!, , , water, and oil for the samosa dough. Potatoes, peas and some spices for the filling. Technically, you can use almost anything for the filling. My recipe uses the traditional, masala, (potatoes, peas, turmeric, salt and chili powder). The best thing about this is that you can always use any leftover filling on bread as a sandwich and any leftover dough to make Indian flatbread. I'm also working on a cheesy samosa, so stay tuned for that!, , , How to make the perfect baked samosas, , , First, you start by making the potato filling. Have leftover mashed potatoes? Use them right up. Or else, make some, mashed potatoes, , and then add them to a pan with turmeric, red chili powder, salt. Finish with some frozen peas and cilantro. If you want a restaurant style samosa, For Samosa Dough, 2, , cups, , all purpose flour, ¼, , teaspoon, , salt, 2, , tablespoons, , oil, , , can be substituted with ghee, ¾, , cup, , water, , Save This Recipe form, Δ, , , , Contact, , , , , , , Save This Recipe!, , Enter your email below & we'll send it straight to your inbox., Plus you’ll get great new recipes from us every week!, Save, , , For Samosa Filling, 2, , tablespoon, , vegetable oil, , , divided: 1 tablespoon for masala, 1 tablespoon for baking or air frying, 2, , potatoes, , , medium to large size, prefer Yukon Gold, 1, , teaspoon, , salt, 1, , teaspoon, , turmeric powder, 1, , teaspoon, , red chili powder, 1, , cup, , frozen peas, 1, , teaspoon, , chopped cilantro, , , optional, , Note, : You can add baking soda if you'd like to make it crispier!, Dab the rolled dough with a little bit of oil, and set aside for at least 15-20 minutes so the dough can rest while the potatoes are boiling., Prepare the samosa filling, Once the potatoes have boiled, drain the water, remove the peels and then mash the potatoes with a spatula or masher, In a medium skillet, add 1 tablespoon of cooking oil and turn the stove to medium heat, Add the mashed potatoes, salt, pepper, turmeric, and red chili powder. Stir the spices to evenly coat the potatoes and cook for 2-3 minutes, tasting and adjusting along the way for your preference., Add peas and stir them into the mix for about 30-45 seconds. Turn off the heat, and add a few sprigs of cilantro (if you choose to include them). Transfer to a bowl and set aside., Folding the Samosa (aka, the fun part!), Take the kneaded dough and roll it out into a long cylinder, roughly as long as your two hands side-to-side (~7-8 inches long), Using a knife or sharp edge, portion this cylinder into 8-9 smaller pieces. Take one of the pieces and roll into a smooth ball (while you set the others aside), Now, dust this ball with a bit of flour, and then using a rolling pin, roll it into a circular shape, roughly 6-7 inches in diameter (for reference, the rolled out dough should be slightly larger than the size of your hand), Slice this dough diagonally so you get two (roughly) semi-circular pieces. Pick up one of these pieces and lay it on your left hand so the straight edge lines up against the left side of your hand (it should look like the letter D on your hand)., Wet the straight edge with some water and form a cone so that the top is wider and also open for you to stuff the filling. Add ~2 heaped teaspoons of filling per samosa and push it in so it evenly fills out (but only till about ¾ of the cone). You might end up adding a bit more depending on how big you rolled the dough out., Note, which you can find in most Indian grocery stores) as well as a half teaspoon of garam masala. Mix that all together, and finish with some cilantro. Restaurant-style samosas are ready!, , , Nutrition, Calories:, 147, kcal, |, Carbohydrates:, 18, g, |, Protein:, 3, g, |, Fat:, 7, g, |, Saturated Fat:, 3, g, |, Sodium:, 187, mg, |, Potassium:, 157, mg, |, Fiber:, 2, g, |, Sugar:, 1, g, |, Vitamin A:, 106, IU, |, Vitamin C:, 9, mg, |, Calcium:, 8, mg, |, Iron:, 1, mg, , , , , Tried this recipe?, Tag, @urbanfarmie, or, #urbanfarmie, to let me know – I would LOVE to see your creations!, , «, Mushroom Stroganoff, Peach Cobbler with Pie Crust, », Download your seasonal eating guide!, , , , , , , , Reader Interactions, Comments, , , , , , HT, , , February 06, 2025 at 7:43 am, , , , How much baking soda do you add to make the extra crispy dough?, , , Reply, , , , , , , , Shruthi Baskaran-Makanju, , , February 06, 2025 at 8:42 pm, , , , About 1/2 teaspoon should be more than sufficient!, , , Reply, , , , , , , , , , S, , , February 15, 2024 at 5:32 am, , , , I'm so excited to continue making these! I think I will experiment with adding cooked red or brown lentils to give it a bit of a protein boost - then I can justify eating it as a meal, right? 😉, , , Reply, , , , , , , , Shruthi Baskaran-Makanju, , , February 18, 2024 at 3:45 am, , , , Haha, for sure! I love adding lentils to samosas (they're called sambusas in Ethiopia, and are quite similar that way!), , , Reply, , , , , , , , , , Eskimo, , , January 05, 2024 at 10:14 pm, , , , Made these a couple weeks ago for the first time. Turned out ABSOLUTELY AMAZING!! The family LOVED them so much that im making them again this weekend by request lol, Excellent recipe! Thanks for sharing! <3, , , Reply, , , , , , , , Shruthi Baskaran-Makanju, , , January 09, 2024 at 7:51 pm, , , , Thank you so much, so glad you loved it!, , , Reply, , , , , , , , , , Gina, , , November 12, 2023 at 5:16 pm, , , , Can theses be made ahead and/or frozen? Can I substitute GF flour?, , , Reply, , , , , , , , Shruthi Baskaran-Makanju, , , November 12, 2023 at 5:20 pm, , , , Hi Gina - yes, you can make ahead and freeze for sure! Just make sure to flash freeze them first to avoid them sticking to each other. I've used a 1:1 gluten free mix in place of regular AP flour and it turns out quite well. Another alternative would be to use rice paper wrappers! Not the same texture, but it also tastes delicious!, , , Reply, , , , , , , , Kay, , , April 09, 2024 at 7:03 pm, , , , Hello, there!  I have a question, please. Can these also be deep-fried like traditional samosas? BTW, your \"restaurant-style\" recipe seems very authentic, which I really like. I can't wait to try your recipe!, , , , , , , , , Shruthi Baskaran-Makanju, , , June 02, 2024 at 10:29 pm, , , , Yes! You can definitely fry the samosas!, , , , , , , , , , , , , Shruthi Baskaran-Makanju, , , September 03, 2023 at 8:28 am, , , , It would roughly be 2 cups of mashed potatoes - please do let me know how this works out for you!, , , Reply, , , , , , , , Jemma, , , February 16, 2023 at 10:44 am, , , , My son and I just made these, they're so easy and delicious! My son has been a fussy eater recently and he's wolfing these down! Thank you, , , Reply, , , , , , , , Shruthi Baskaran-Makanju, , , February 18, 2023 at 12:58 pm, , , , That's so great to hear, thank you so much for sharing back., , , Reply, , , , , , , , , , Brooke, , , February 08, 2023 at 4:24 pm, , ,  Instructions: , , , , , , , Fold those samosas!, , , Step-by-step listed below as well., , , , Dust  dough with flour, , Roll into a circle, , Slice into two semi circles, , , , , , , Dot the straight edge with water and fold the top part perpendicular to the semi circle, , Then fold the bottom part on top of it to make a cone, , Stuff with potato filling, , Dot the edge of the cone with water and fold over to seal the cone, , Coat the samosa with oil, , , , , How do you bake samosas? Can you make them in an air-fryer?, , It's so easy to bake or air-fry samosas. Three things to keep in mind:, , , Use a slightly higher fat to flour ratio. For instance, here, I use 2 tablespoon of oil per cup of flour, , Add a bit of baking soda to the dough when you knead if you want it ultra crispy (I haven't done that here, but it's an easy option), , Coat them fully with oil and then bake at 400°F for 35 to 40 minutes, turning over halfway through. Or, to air-fry, put them in at 380°F for 15 minutes, also turning halfway through., , , What is the difference between air fryer or baked ones and deep fried ones?, , The main difference I noticed between air-fryer or baked samosas and deep fried ones is that the pastry is often not as flaky in the former. A simple trick to ensure extra crispiness is to add a pinch of baking soda when you make the dough. I've also found that AP produces flakier results than using, atta, (i.e. whole wheat flour). That said, you're trading off 5-6 cups of oil for a tablespoon or two when you bake or air-fry samosas. Totally worth it., , , I honestly didn't notice any difference between the baked and air-fried versions. In the picture below, the top part is the baked samosas and the bottom part is the air-fryer samosas. They both tasted just as delicious!, , , , , Can you make gluten-free samosas?, , Yes, you can! So, you can do one of two things to make these gluten free:, , , Use a gluten free flour mix instead of the all purpose flour when making the samosa dough (this gives the closest texture), , Use rice paper wrapper instead of using any flour at all. This obviously has the added advantage of being a lot faster to make, but might not be available in all grocery stores, , , When this quarantine is over, I'll pick up both of these options, and test the recipe again and post any adaptation tips. In the meantime, please let me know if you try a gluten free version and how it goes!, , , , I tend to keep my samosas for a day or two after I've made them. Just like any other pastry, the longer you keep it, the less flaky it gets. I don't recommend eating a samosa 1-2 days after it's been made., , To store,, I wrap them in foil and then reheat them in the oven at 350F for 5-10 minutes if I intend to eat them soon thereafter., , I don't recommend freezing samosas after you've baked them. Instead, make them all the way until the baking step, and then freeze them by placing them on a baking sheet first to flash freeze them. Then you can place them all in a freezer safe container., , , When you have leftover samosas (which I honestly give you props for, we never have any left) - you can break them up and make, samosa chaat, , a delightful Indian street snack., Chaat, uses broken samosas as a base, layered on with yogurt, mint dressing, and if you're in the mood for it, chickpeas (like this delicious, Indian chickpea dip, ). Wins all around. Oh, and if you want to check out another easy Indian street snack, check out my, savory Bombay French Toast, !, , , , If you tried this recipe, don't forget to comment and rate! ⭐⭐⭐⭐⭐, , , 📖 Recipe, , , , Print Recipe, , 5, from, 75, votes, , , Easy Baked Samosas, , , Craving samosas but want a lighter, hassle-free version? These baked (or air-fried) samosas are crispy, packed with flavor, and super easy to whip up at home. No frying needed!, , , Prep Time, 30, minutes, , mins, Cook Time, 40, minutes, , mins, Total Time, 1, hour, , hr, , 10, minutes, , mins, , , Course:, Appetizer, Cuisine:, Indian, Diet:, Vegan, , Servings:, 16, , samosas, , Calories:, 147, kcal, , Author:, Shruthi Baskaran-Makanju, , , Save This Recipe form - Recipe Card, Δ, , , , Contact, , , , , , , Save This Recipe!, , Enter your email below & we'll send it straight to your inbox., Plus you’ll get great new recipes from us every week!, Save, , , Boil potatoes, Bring a pot of water to a rolling boil on a high heat. In the meantime, quarter the potatoes. Once the water has boiled, turn down to medium heat, add potatoes and cover with a lid. Cook for 20-25 minutes until fork inserted goes in smoothly and comes out clean., While potatoes are boiling, prepare samosa dough, Add flour, salt, 1 tablespoon of oil to a mixing bowl and mix using a fork., Slowly add water and knead slowly into a ball. Add ¼ cup at a time, until the dough falls into a neat ball. If you have a stand mixer, Add a bit of water to the edge of the cone and seal it shut (either by pressing together or folding one edge over the other), If you’re air-frying, after you’re done folding the first samosa, pre-heat to 425 °F. Depending on the size of your air-fryer, you might need to make a couple of batches – take care not to overcrowd the samosas since that will prevent the dough from cooking properly, Option 2: Baking Samosa!, If you’re baking samosas, after you're done folding the first samosa, preheat oven to 400, °F, ., Coat with enough oil to cover all the sides and place aside. Repeat for the rest of the samosas., On a sheet pan lined with a silicon liner or parchment paper, place each samosa roughly 2 inches away from each other, Bake for 20 minutes and check on the color – if golden brown, flip to the other side and bake for another 10-15 minutes, Remove and serve with ketchup, a nice aioli or a chutney!, Option 1: Air Frying Samosa!, Place the samosas carefully in the air fryer and cook for 10 to 12 minutes, and then flip the sides and cook for another 5 to 7 minutes. Depending on your air fryer, you might need to add a few extra minutes. When it's done, the samosas should be crisp on the outside and a nice golden brown color on both sides., Note, : Air fryers are quite different, so the temperatures might vary. Mine takes 18 minutes total to cook. But yours might take longer or shorter depending on the size, power, etc. I suggest checking after 10 minutes to see if one side is done, and then checking again after the 5-7 minutes. You might need to add 5-10 more minutes depending on the fryer!, , Video, , Notes, , Timing is everything for this recipe. Make sure to start by boiling the potatoes; once they’re in the pot, knead the dough and set aside. Once the potatoes are out, make the filling; and by the time the filling is done, you won't regret it!), , You can use phyllo pastry sheets instead of the dough as the base if you don’t want to make the dough from scratch. Also, if you want your samosas to be extra crispy, you can add a pinch of baking soda to the dough., , Depending on the size of your cone, you might need more than just 2 teaspoons of filling. Go with the flow!, , To make a more \"restaurant\" style samosa (versus the version in the main recipe card, which is quite simple and super easy) - I suggest the following spice modifications: once your potatoes are cooked, heat some oil in a skillet and add half a teaspoon each of cumin seeds and black mustard seeds. When they splutter, add a teaspoon each of ginger and garlic paste as well as finely chopped Indian green chili peppers (or jalapenos!) Then, potatoes along with red chili powder, I am sure they would not have turned out as good. I loved your details on how to stuff them and what to exactly do with the dough. Great recipe!, , , Reply, , , , , , , , Michelle, , , February 08, 2023 at 3:58 pm, , , , Loved this much healthier version of samosas -- made it for a potluck and it was such a hit! Thanks for sharing your recipe., , , Reply, , , , « Older Comments, , , , 5 from 75 votes (, 54 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , Notify me of followup comments via e-mail. You can also, subscribe, without commenting., , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., Primary Sidebar, , , I am Shruthi, the recipe developer, photographer and blogger behind Urban Farmie. I have two graduate degrees from Stanford, one focused on food systems. And I hope to bring you everything you need for healthy-ish, comforting, nourishing vegetarian cooking., , Read more →, , , , Recipe Key, , , , , , , , , , , , , Get Every Recipe To Your Inbox!, , , , , , , , As Seen On, , , , , , , , , , , Footer, , , ↑ back to top, , , , , About, , Seasonal, global, vegetarian recipes and the stories behind them. Inspired by life and travels to 60+ countries. Always authentic, never boring., , , , Newsletter, , , Privacy Policy, , Disclosure Policy, , Cookie Policy, , Accessibility Policy, , , , , Most Popular Posts, , , Nigerian Jollof, , Ethiopian Cabbage, , Indian Dal Tadka, , Stuffed Acorn Squash, , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright Black Bicycle LLC. © 2024, , , , , , 16.9K, , shares, , , , , , , 349, Facebook, , , , , 16.6K, Pinterest, , , , , Print, , , , , Reddit, , , , , Flipboard, , , , , Threads, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , ,",
        "Air Fryer Samosa Chaat Phyllo Cups": "Ingredients: , , but we are taking a bit of help from the grocery store with frozen phyllo cups. You will need:, , Frozen Phyllo Shells:, You can easily find pre-made frozen phyllo shells in the freezer section of most grocery stores today. It's like a ready-made samosa pastry. Each box comes with 15 shells, the amount required for this recipe., Potatoes:, I specify two gold potatoes for their creamy, buttery texture, but feel free to use one large russet potato if that is all you have on hand. Note, the potato filling will be a bit more starchy., Avocado Oil:, Either avocado or olive oil will do. You want a mild-flavored vegetable oil., Cumin Seeds:, Whole cumin seeds impart a natural, smokey flavor that makes a classic samosa filling. When you, begin to, hear the cumin seeds sizzle in the oil, you know they're ready., Onion:, Either a white or yellow onion will do. You will only need about ⅓ of the onion, so store the remaining onion in an airtight container in the fridge and save for another recipe., Jalapeno:, Make sure to deseed the jalapeno prior to chopping. However, if you would like the potato filling a bit spicy, leave the seeds and ribs intact., Ginger:, Fresh ginger works best for this recipe.  Peel the ginger root with the edge of a spoon and grate the 2 teaspoons needed for this recipe. If you can't find fresh ginger, you can also use thawed frozen ginger cubes from the frozen food section., Tip:, If you're not going to use the fresh ginger for another recipe soon, peel the whole root, place the remaining ginger in a ziptop freezer storage bag, seal tight, label, date and store in your freezer. Whenever you have a recipe that calls for fresh ginger, simply grate from frozen., Frozen Peas:, Cilantro:, Fresh cilantro is needed in both the filling and the garnish. Chop extra and reserve it for sprinkling at the end., Spices for the Samosa Filling:, Salt, Ground Coriander, Garam Masala, Red Chili Powder (or cayenne), Amchur (dried mango powder), Chaat Masala, Garnish:, This includes both, Cilantro, and Tamarind chutneys, thin sev (bhujiva), fresh cilantro + pomegranate seeds., Tamarind chutney, and, thin Sev, can be bought from an Indian grocery store, or Amazon.  Here's an easy, recipe for Cilantro Chutney., , What Can I Substitute For Amchur?, , Amchur, also known as, Amchoor, or, Aamchur, , is a, fruity spice powder, made from dried, unripe, green mangos. Today, you can find it in the global section of most supermarkets, any specialty Indian or Pakistani market or, online, ., , If amchur is not available, to make up for it's bright, citrusy flavor, use 1 ½ tablespoons fresh lemon or lime juice in place of the ½ teaspoon needed for this recipe., , How To Make Samosa Chaat Phyllo Cups in the Oven, AirFryer or Crisplid, , Here is a breakdown of how to make these phyllo cups stuffed with samosa chaat in either the, Oven, AirFryer or Crisplid., , Each begins with the, same process of boiling the potatoes and preparing the potato filling, , , 1x, 2x, 3x, ▢, 15, , phyllo cups, , (frozen phyllo shells), Samosa Filling, ▢, 2, , gold potatoes (medium), , (about 1.5 cups), 1 large russet potato, ▢, 1, , tablespoon, , avocado oil, , or olive oil, ▢, ½, , teaspoon, , cumin seeds, ▢, ½, , cup, , onion, , finely chopped, about ⅓ an onion, ▢, 2, , teaspoon, , jalapeno, , de-seeded and finely chopped, ▢, 2, , teaspoon, , ginger, , finely chopped, ▢, ⅓, , cup, , frozen peas, , thawed, ▢, 2, , tablespoon, , chopped cilantro, Spices for Samosa Filling, ▢, ½, , teaspoon, , salt, ▢, 1, , teaspoon, , ground coriander, ▢, ¼, , teaspoon, , garam masala, ▢, ¼, , teaspoon, , Red Chili Powder, , or cayenne, ▢, ½, , teaspoon, , amchur, , (dry mango powder)(see notes for substitute), ▢, ½, , teaspoon, , Chaat Masala, Garnish, ▢, Cilantro chutney, ▢, Tamarind chutney, ▢, Thin sev, , (or bhujiya, I like Haldiram brand), ▢, cilantro, , chopped, ▢, pomegranate seeds, , Cook Mode, Prevent your screen from going dark,  Instructions: , , How To Make the Samosa Chaat Potato Filling, , Step 1: Boil Potatoes, , First, you must boil the potatoes in either the, Instant Pot or Microwave., , Instant Pot:, Place trivet in the inner pot. Pour 1 cup water and place potatoes on the trivet.  Pressure cook for 6 mins, high pressure. If using russet potato, increase time to 8-10 mins, depending on size. You can find a more detailed process, here, ., Microwave:, Poke potatoes with a fork. In a microwave-safe bowl, add the potatoes and fill the bowl halfway through with water. Cook the potatoes using the 'Potatoes preset\", or for 7 minutes at HIGH temperature. Check for doneness. If still not done, microwave for another 2 minutes., When potatoes are cool enough to handle, peel and mash them. Keep aside., , Step 2: Prepare Filling, , Once the potatoes are cooked, begin by making the samosa chaat filling:, , , Heat a non-stick pan on medium-high heat for 30-45 seconds. Add oil and cumin seeds (steps 1 & 2)., When you hear the cumin seeds begin to sizzle, add chopped onion and jalapeno (steps 3 & 4). Saute for 2-3 minutes., , , Stir in finely chopped ginger, salt, coriander, garam masala, red chili powder and Amchur Turn off the heat. (steps 5 & 6)., Add mashed potatoes and mix everything to combine (step 7). Then, add thawed peas and chopped cilantro (step 8)., , , Finally, add Chaat Masala. Mix well and set aside (steps 9 & 10).  At this point, the filling is ready., , Step 3: Fill and Bake, , , Remove the phyllo cups from the freezer, fill each one with 1.5-2 teaspoons of filling (pic 1) and, bake them in one of three ways until golden brown., , , Samosa Chaat Phyllo Cups in the Oven, , Preheat the oven to 350 degrees F. Place the prepared phyllo cups on a parchment-lined baking sheet. Bake for 8 minutes.  (Pic 2), , , Spread them in the fryer basket in a single layer and air fry at 350°F for 5-6 mins. (Pic 3), , Samosa Chaat Phyllo Cups in Instant Pot with the Crisplid, , Place the tall trivet in the Instant Pot or Multipot's inner pot. Then, place the mesh basket and spread chaat cups in one even layer. Cover with the Crisplid and set it to 360 degrees F for 8 minutes. (pic 4), , How To Serve This Recipe For a Crowd, , , , I typically account for, 3 phyllo cups per person, , if there is another appetizer on the menu.  As a standalone appetizer, consider 4-5 per person., , How Many Calories Does One Serving Have, , One phyllo cup is 40 calories,, but keep in mind this does not include garnishes, so each samosa may be a few calories more., , Oh, and they're too good to have just one!, , Recipe Tips for Samosa Chaat Phyllo Cups, , Preheat the skillet for 30-45 seconds., A hot skillet ensures the cumin seeds release their natural oils and the onions and jalapeno release all those delicious juices., Turn off the heat before you add the ground spices., The residual heat in the skillet is enough to bloom the spices so that you release the natural oils without burning them., If substituting amchur,, add 1 ½ tablespoons lemon or lime juice instead., Keep the phyllo cups frozen until ready to fill., If the phyllo cups become too warm, the butter between the layers will melt, preventing a delicate, light, flaky texture., Do not overfill the phyllo cups., You will get the best results if you fill each phyllo cup as even as possible. I fill mine with about 1.5 teaspoons of the potato filling., Serving Size:, I account for, 3 phyllo cups per person, , if there is another appetizer on the menu.  As a standalone appetizer, consider 4-5 per person., Easily double or triple the recipe., This recipe makes 15, as this allows you to bake multiple batches at one time., , More Indian Snack Food Recipes From My Kitchen, , Chicken Tikka Recipe - Oven/AirFryer/Crisplid, Spicy Bombay Potatoes - Instant Pot/AirFryer/Oven, Tandoori Fish Tikka - AirFryer/Oven/Crisplid, Oven-Roasted Chickpeas, Dahi-Bhalla Chaat, Matar Chaat (Pigeon Peas Dip), , , , Tried this recipe?, I’d love to hear how it turned out! Please leave a ⭐ star rating and a comment below to share your experience; it helps other readers too! Find more easy EVERYDAY recipes on, Instagram, , , Facebook,, , Pinterest, , and, YouTube, ., , , 📖 Recipe, , , , Samosa Chaat Phyllo Cups, , , Aneesha Gupta, , , These Samosa Chaat Phyllo Cups are a bite-size version of popular Indian street food baked until crisp in the Oven, AirFryer or Crisplid!, , , 4.79, from, 14, votes, , , , Print Recipe, , Pin Recipe, , Add to Collection, Go to Collections, , , , , , Prep Time, 15, minutes, , mins, Cook Time, 8, minutes, , mins, Total Time, 23, minutes, , mins, , , , , , , Course, Appetizer, Cuisine, Indian, , , , , , Servings, 15, , cups, Calories, 40, , kcal, , , , , , , Want to save this recipe?, , We'll email this post to you, so you can come back to it later!, , , , , , , , , , Equipment, ▢, Frying Pan, ▢, Air Fryer, ▢, Mealthy Crisplid, ▢, Instant Pot, , , Boil Potatoes (Instant Pot or Microwave), Instant Pot:, Place trivet in inner pot. Pour 1 cup water and place potatoes on the trivet. Close the lid (sealing position) and pressure cook for 6 mins at HIGH pressure. If using russet potato, increase time to 8-10 mins, depending on size., Microwave:, Poke potatoes with a fork. In a microwave-safe bowl, add potatoes and fill the bowl halfway through with water. Cook potatoes using the 'Potatoes preset', or for 7 mins at HIGH temperature. Check for doneness. If still not done, microwave for another 2 mins., When potatoes are cool enough to handle, peel and mash them. Keep aside., Samosa Filling, Heat a non-stick pan on medium-high heat (takes 30-45 seconds). Add oil and cumin seeds., When cumin seeds begin to sizzle, add chopped onion and jalapeno. Saute for 2-3 minutes., Stir in finely chopped ginger and spices, including salt, coriander, garam masala, red chili powder and amchur, and turn off the heat. The residual heat is enough to bloom the spices and ginger., Add mashed potatoes and mix everything to combine. Add thawed peas and chopped cilantro. Add Chaat Masala. Mix well and set aside., Fill Chaat Cups, Remove the phyllo cups from the freezer. Fill each cup with about 1.5-2 teaspoons of the samosa filling. Cook them with, one of the following three ways, until the phyllo chaat cups are golden brown:, Oven:, Place the cups on a lined baking sheet. Bake in a pre-heated oven at 350°F for 8 mins., Air Fryer:, Spread them in the fryer basket and bake at 350°F for 5-6 mins., Crisplid:, Place the tall trivet in the Instant Pot or Multipot's inner pot. Place the mesh basket and spread chaat cups on that. Place the Crisplid and set to 360°F for 8 mins., Garnish, Add cilantro chutney and tamarind chutney to your taste (I add about ¼ teaspoon of both in each chaat cup)., Sprinkle thin sev and chopped cilantro. Top with a few pomegranate seeds. Even though this is optional, it adds a great sweet and tart touch to the samosa chaat cups. Enjoy!, , Video, , Notes, Recipe Tips for Samosa Chaat Phyllo Cups:, , , Preheat the skillet for 30-45 seconds., A hot skillet ensures the cumin seeds release their natural oils and the onions and jalapeno release all those delicious juices., , Turn off the heat before you add the ground spices., The residual heat in the skillet is enough to bloom the spices so that you release the natural oils without burning them., , If substituting amchur, , add 1 ½ tablespoons lemon or lime juice instead., , Keep the phyllo cups frozen until ready to fill., If the phyllo cups become too warm, the butter between the layers would melt, preventing a delicate, light, flaky texture., , Do not overfill the phyllo cups., You will get the best results if you fill each phyllo cup as even as possible. I fill mine with about 1.5-2 teaspoons of the potato filling., , Serving Size:, I account for, 3 phyllo cups per person, , if there is another appetizer on the menu. As a standalone appetizer, consider 4-5 per person., , Easily double or triple the recipe., This recipe makes 15, as this allows you to bake multiple batches at one time., , , , , Note: The nutrition facts below are my estimates and do not include the garnishes.  If you are following any diet plan, I recommend cross-checking with your preferred nutrition calculator., , , , Nutrition, Calories:, 40, kcal, |, Carbohydrates:, 6, g, |, Protein:, 1, g, |, Fat:, 2, g, |, Saturated Fat:, 1, g, |, Sodium:, 88, mg, |, Potassium:, 109, mg, |, Fiber:, 1, g, |, Sugar:, 1, g, |, Vitamin A:, 45, IU, |, Vitamin C:, 5, mg, |, Calcium:, 9, mg, |, Iron:, 1, mg, , , , , , , Did you try this recipe?, Share a photo and tag, @spicecravings, or, #spicecravings, , , More Appetizers & Snacks, Matar Kachori Pinwheels, Samosa Chaat, High Protein Granola, Chutney Sandwich, , , , , , 142, , , , , , , , , 2204, , , , , , , Comments, , , , , , Sarah, , says, , , December 16, 2023 at 5:15 am, , , , Just wondering if I could make these ahead and bake them, then freeze them and reheat on Christmas Eve?, , , Reply, , , , , , , , Aneesha, , says, , , December 21, 2023 at 4:32 pm, , , , Hi Sarah, sure, you can do that. I recommend defrosting them overnight in the fridge then reheating in the air fryer or oven to restore the crisp texture. I hope you enjoy these!, , , Reply, , , , , , , , , , mothers day cake in Kolkata, , says, , , April 05, 2022 at 12:00 am, , , , It was nice to go through your post. Thanks for sharing the recipe here. Keep up the good work., , , Reply, , , , , , , , Aneesha, , says, , , April 09, 2022 at 9:26 pm, , , , Thank you! Appreciate your kind words., , , Reply, , , , , , , , , , janki, , says, , , March 19, 2022 at 4:45 pm, , , , Hi, My Air fryer has different options . Which option should i use for this phyllo cups to make it crispy ?, , Thanks, , , Reply, , , , , , , , Aneesha, , says, , , March 21, 2022 at 5:39 pm, , , , Hi, you can manually set the temperature to 350°F and air fry it., , , Reply, , , , , , , , , , Sandhya, , says, , , March 13, 2022 at 5:27 am, , , , I am planning on making these it is not for a party though, I make them 2 hours before serving for an even would that be okay or the Phyllo cups will get too soggy?, , , Reply, , , , , , , , Aneesha, , says, , , March 13, 2022 at 6:25 pm, , , , Hi sandhya, if you assemble them 2 hours before, they will get soggy. I recommend assembling it 10-15 mins before serving. Enjoy!, , , Reply, , , , , , , , , , Kamal, , says, , , August 08, 2021 at 6:32 pm, , , , It was such a hit at my dinner party... So easy to make and everyone loved them. Thank you  for sharing your recipe., , , Reply, , , , , , , , Aneesha, , says, , , August 10, 2021 at 5:22 pm, , , , Hi Kamal, that's wonderful! I'm so glad your guests enjoyed it., , , Reply, , , , , , , , , , Sindoora, , says, , , February 05, 2021 at 3:16 pm, , , , Hi,, Can you please tell me what kind of the frying pan/skillet that was using ?, Is it a regular non-stick pan ?, , , Reply, , , , , , , , Aneesha, , says, , , February 06, 2021 at 2:54 pm, , , , Hi sindoora, I used a non-stick pan which is similar to hexclad., , , Reply, , , , , , , , , , Vidya, , says, , , November 30, 2020 at 10:38 am, , , , These were amazing!  I made these for thanksgiving!  I will say, you are wrong about serving size....3 cups per person is DEFINITELY not enough.  Our four adults devoured 30 of them in a matter of minutes, they were so good!  I have extra potato filling, so I’m going to use some puff pastry I have in the freezer to create another version of this.  Thank you!!!!, , , Reply, , , , , , , , Aneesha, , says, , , December 03, 2020 at 8:28 pm, , , , Hi Vidhya, thank you! That's the best compliment once can ask for. I'll mention a note about the serving size. Thanks again, so glad your family enjoyed them!, , , Reply, , , , , , , , , , Kalyani, , says, , , September 24, 2020 at 11:27 pm, , , , Can we make samosa chaat cups one day before the party, , , Reply, , , , , , , , Aneesha, , says, , , September 25, 2020 at 9:06 am, , , , Hi Kalyani, you can make the filling the day before, but assemble them just before the party otherwise the phyllo cups will get soggy. It takes under 10 minutes to bake them., , , Reply, , , , , , , , , , Katisha G., , says, , , March 14, 2020 at 10:10 am, , , , Hi - do you mind sharing the name of the song in the video?, , , Reply, , , , , , , , Aneesha, , says, , , March 18, 2020 at 9:18 pm, , , , Hi Katisha, I'm trying to look for the file, but unfortunately cannot find it. Sorry., , , Reply, , , , , , , , , , Uma, , says, , , March 04, 2020 at 6:10 pm, , , , Awesome recipe. It was a hit at the party!! Thanks, , , Reply, , , , , , , , Aneesha, , says, , , March 04, 2020 at 8:27 pm, , , , Hi Uma, thank you much, I'm glad you enjoyed it!, , , Reply, , , , , , , , , 4.79 from 14 votes (, 11 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , , , , , Hey, I'm Aneesha!, , I'm a foodie by birth and the mind, body, and soul behind Spice Cravings, where I share easy-to-make and simplified everyday food. These recipes are inspired by my love for spices, Indian roots, world travels, and life as a working mom! I am also the author of \"Pressure Cooker Curry Cookbook.\", , , More about me →, , , , , Top 6 Weeknight Dinners, , Chicken Kathi Roll, Moroccan Chickpea Soup, Air Fryer Chicken Fajitas, Instant Pot Butter Chicken and Saffron Rice, Paneer Kathi Roll (Paneer Frankie), Cheesy Bean and Rice Burrito, , Trending Holi Recipes!, , Thandai, Baked Gujiya (Indian Dessert Empanadas), Gujiya (Indian Sweet Pastry), Rabdi Gulab Jamun, , , Love Curry?, , , , , Get my Cookbook, , , , , , , , Footer, , , , as seen in:, , , , , , , , , , , , , ↑ back to top, , , , , , About, , , About Aneesha, , Privacy Policy, , Contact, , Accessibility, , , , , Recipes, , , Sign up for recipes!, , Recipe Index, , Recipe Collections, , , , , Resources, , , Instant Pot, , Air Fryer, , Cooking 101, , , , , As an Amazon Associate, I earn from qualifying purchases., , Copyright © 2025 • SPICE CRAVINGS • All Rights Reserved, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Baked Curry Puffs": "Ingredients: onion, and garlic. I like to cut them into tiny bits so they cook down faster plus you can fill more into the pastry., Heat a non-stick pan with oil, and sauté onion until translucent. I used red onion for the extra sweetness but regular onion or shallots work just as great. Then, continue to sauté carrot and garlic for about 30 seconds or so., Then, stir in the sambal, water or stock and a knotted pandan leaves. Bring the mixture to a rolling boil and lower heat to simmer., Cook until the potatoes are fork-tender and turn off the heat. By this time, the sauce will be slightly thickened and will get thicker when it’s cooled. Then, remove the pandan leaves and stir in the frozen peas. I like to add the frozen peas last to keep the vibrant green., Thaw puff pastry as directed. Mine came with 2 sheets of 9X9 puff pastry. I divided mine into 9 squares on each. Place a heaping spoonful filling in the middle and wrap to seal. You can either pleat to seal or use a fork to press the opening together., Brush the top with a vegan ‘egg’ wash. I used a mixture of plant-based milk and sugar gave these pastries a golden brown layer with a touch of sweetness. If you prefer a more savory ‘egg’ wash, melted vegan butter is great option as well. Bake 425°F (220°C) until golden brown. Time varies depending on pastry’s brand, so please bake as directed., Potato, – I used Russet but any other potatoes such as gold potatoes or sweet potatoes can be used as well., Sambal, – This, Easy Vegan Sambal, or store-bought sambal works perfectly for this recipe. If you can’t find sambal, you can try subbing with chili sauce and adjust the taste accordingly., Frozen vegetables, – gave this dish a great color but you can substitute with other vegetables such as chopped broccoli., Puff pastry, – there are a few brands that do not contain butter, These, baked, curry puffs are, Simple to make and delicious, Easily customizable such as subbing it with a mild potato curry without any heat, Kid’s friendly meal, Perfect for snacks or parties, TASTY!!, Baked Curry Puffs – 咖喱角, , woonheng, A delicious Malaysian snack that are filled with spicy potato filling and wrapped in a flaky puff pastry. This baked version is easy and perfect for potluck., 5, from, 3, votes, , Print Recipe, , Pin Recipe, Prep Time, 15, minutes, , mins, Cook Time, 40, minutes, , mins, Total Time, 55, minutes, , mins, Course, Appetizer, Dessert, Snack, Cuisine, Asian, malay, Servings, 4, , 1x, 2x, 3x, 1, , pack, , [1.1lbs or 490g] vegan puff pastry of your choice, 1, , medium-sized potato (about 500g), , cubed and soak in water to remove starch, drain well, 1, , medium onion or 2 shallots, , diced, 4, , cloves garlic, , finely minced, 1, , small carrot, , diced into small cubes, ⅓, , cup, , frozen peas, 2, , tablespoons, , curry powder, 1, , tablespoon, , sambal, 2, , teaspoons, , coconut sugar, , adjust accordingly, 2, , cups, , veggie stock, a few pandan leaves, , tie to a knot (optional), oil for cooking, salt to taste, Vegan 'Egg' wash, 1, , tablespoon, , unsweetened plant-based milk, ⅓, , tablespoon, , maple syrup, Add the sambal paste and enough water or veggie broth to cover all the potatoes, about 2 cups along with a knotted pandan leaves, if using., Bring the mixture to a rolling boil, add in the sugar (if using) then let it simmer until potatoes are fork-tender., Turn off the heat, then remove pandan leaves, stir in frozen peas, and season as preferred. Let the mixture cool down. The mixture will turn starchy like a paste once cooled down., Preheat oven to 425°F or 220°C (some brands have a different baking time, please adjust accordingly) Instructions: , Prepare the potato by removing the skin, then cut into small cubes., To make the filling, heat a non-stick pan with 3 teaspoons of oil. Then, sauté onion until translucent and add in carrot, garlic, and sauté for about 30 seconds., Then, add the curry powder and potatoes, Place 1-2 tablespoons of potato mixture and pleat to seal into your desired shapes., Brush each puff pastry with vegan 'egg' wash and bake until golden brown. It took me about 20-25 minutes. (Cooking time and oven temperature varies)., Serve warm with a cup of ‘teh tarik’ – pull ‘milk’ tea., Video, Notes, This recipe is updated on August 28, 2020. My original recipe made 12 big curry puffs and called for cumin seed which was listed as optional., For a less sweet ‘egg’ wash, please use melted vegan butter as my original recipe called for it., If using frozen carrot, add them in along with the peas once you removed the pandan leaf., , , Keyword, Puffpastry, Snacks, , , Tried this recipe?, Let us know, how it was!, Feel free to pin the below picture on your, Pinterest, Board for easy reference., Pinterest, Yummly, Facebook, Twitter, Filed Under:, Appetizers, , , Savory, Subscribe, to more tasty meals, , , Previous Post:, « How to Make Vegan Sweet and Sour ‘Pork’ (素咕噜肉), Next Post:, Edamame and Mushrooms Stir-Fry ‘毛豆炒杏鲍菇’ », Reader Interactions, Comments, , Jaime, August 31, 2024 at 1:39 pm, This is so good!!, Reply, , singam, September 29, 2023 at 3:08 am, Hi, Do you do class., Thanks., Reply, , Lisa, March 22, 2024 at 1:45 pm, so delicious. I also added some cilantro cuz I love that. Are there any suggestions for dipping sauces? I sucked real bad at folding the puff pastry…but it tasted great., Reply, , Louisa van der Merwe, October 30, 2022 at 1:57 am, I adjusted the recipe slightly and I added 1 tablespoon of sugar. It was delicious. Louisa, Reply, , Lisa, March 26, 2022 at 11:27 pm, These curry puffs are very tasty and incredibly easy to make. I had 4, In one sitting! Will be making these again 🙂 Thanks Woon Heng!, Reply, Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , , , Primary Sidebar, Hello and Welcome, friends, , My name is WoonHeng and I share Asian plant-based deliciousness that you can make in your kitchen. My goal is to inspire you to try a meatless dish, one meal at a time. Let's get cooking with these, recipes!, , , , , , , xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" aria-hidden=\"true\" preserveAspectRatio=\"xMidYMid meet\" viewBox=\"0 0 24 24\">, Categories, Categories, Select Category, Appetizers, Curry, Dumplings, Gluten-Free, Noodles, Rice, Sauces, Savory, Stir Fry, Tofu, , , Sign up, For more plant-based deliciousness, , , , Copyright © 2025 WoonHeng, , , , , , , , Terms and Conditions, -, Privacy Policy"
    }
}