{
    "ingredients": {
        "Garlic Vegan Almond Cheese spread": "almonds,lemon juice,nutritional yeast,herbs",
        "Vegan Spinach and artichoke dip": "artichoke hearts,spinach,avocado,lemon juice,nutritional yeast,onion powder"
    },
    "recipe_url": {
        "Garlic Vegan Almond Cheese spread": "https://delightfuladventures.com/garlic-herb-vegan-almond-cheese-spread/#recipe",
        "Vegan Spinach and artichoke dip": "fixate_recipes\\Side and Snack\\FXR_Vegan_Spinach_and_Artichoke_Dip_R_03.19.18.pdf"
    },
    "Recipe": {
        "Garlic Vegan Almond Cheese spread": "Ingredients: (simple like my, easy kale chips, !)., , What is Nutritional Yeast?, , The one ingredient you may not have tried before is the nutritional yeast. If you haven't used it before, it can be used in many ways and is used in many vegan recipes, so buy a bag and put it in everything you want to give a little \"cheesy\" flavour to., , This recipe is also very easy and straightforward. The hardest part is being patient while the almonds soak. They need to soak for 24-hours, so be sure to plan ahead., , After the almonds have soaked, I don't peel the skin off, but you can if you'd like., , I skip that step because the skin becomes so soft after being soaked that it makes no difference to the recipe since it doesn't change the taste or the texture., , , , The only way you know the skin is still there is because you see the light brown specks in the finished spread (, look at the pictures above and below to see what I mean, )., , If you prefer to not have the almond skin as part of the spread, you can do one of two things:, , , You can either start out by using blanched raw, natural almonds, , You can peel the skin off yourself after the almonds have been soaked. The skin comes off really easily at that point, it's just a little time-consuming. It's totally up to you and whichever way you go, your result will be the same and of course, delicious!, , , Customize by Using Your Favourite Herbs, , Another good thing about this recipe is that you can alter the flavour based on your favourite herbs., , While testing, I tried making it with chives, and then with dill, and they were both so delicious, but the parsley is my favourite., , The spread is soft enough to also be used as a veggie dip., , See how versatile it is?, There are probably many other ways it can be used that I haven't tried yet!, , , , If you make my, garlic herb vegan almond cheese spread, , tell me your favourite way to use it!, , Leave a comment below, or even better, show me! Post a picture to, Instagram, and be sure to tag me, I'm, @delightfuladventures, over there and my hashtag is #delightfuladventures., , Craving a little something sweet after making this recipe? How about checking out one of these?, , , Coconut Mango Chia Pudding, , Key Lime Cups, , Vegan Lemon Strawberry Cheesecake Bites, , Vegan Gluten Free Blueberry Crisp, , , And here are some other easy vegan recipes you may also like:, , , Vegan Pinwheels, , Vegan Veggie Dip, , Vegan Dill Dip, , Vegan Aioli, , Vegan Parmesan, , , About those crackers..., , So many of you have asked about the crackers in the first few pictures! They are by a brand called \"Mary's Gone Crackers.\" They are delicious and also happen to be vegan and gluten-free. You can look for them at Costco, your grocery or natural foods store, or you can also, find them on Amazon, . (I always have a box in my cupboard!), , How to Make Vegan Almond Cheese Spread, , , , , Print Recipe, , Pin Recipe, , Save, Saved!, , 5, from, 16, ratings, , , Garlic Herb Vegan Almond Cheese Spread, , , This garlic herb vegan almond cheese spread is bursting with flavour and can be used in so many ways. It's great on crackers, sandwiches, as a veggie dip, and more!, , , , Prep Time:, 10, minutes, , minutes, Total Time:, 10, minutes, , minutes, , , Author:, Gwen Leron, , Course:, Appetizer, Snack, Cuisine:, Gluten-Free, Vegan, Diet:, Vegan, , Servings:, 7, , , , Cook Mode, Prevent your screen from going dark, , 0.5x, 1x, 2x, , ▢, 1, , cup, , whole raw almonds, , (see notes below), ▢, ½, , cup, , water, ▢, 2, , tablespoons, , lemon juice, ▢, 2, , tablespoons, , nutritional yeast, ▢, 1, , tablespoon, , olive oil, ▢, ½, , teaspoon, , garlic powder, ▢, ½, , teaspoon, , salt, ▢, ¼, , cup, , finely chopped fresh herbs, , (see note below), , , , Reply, , , , , , , , , , Amy, , says, , , July 12, 2023 at 12:34 am, , , , I love this recipe. Thank you this is my first time making an almond cheese and it turned out great. Can you freeze this cheese?, , , Reply, , , , , , , , Gwen Leron, , says, , , July 12, 2023 at 11:30 am, , , , I'm so glad you love it, Amy! I have not tried freezing it yet but the next time I make it, I will test doing that and I will update with that information (but I do think that it will freeze just fine). Enjoy!, , , Reply, , , , , , , , Amy, , says, , , July 26, 2023 at 11:15 pm, , , , Yup it works, tried it😉🙏, , , , , , , , , Gwen Leron, , says, , , July 27, 2023 at 9:52 am, , , , Great news! Thanks for the update, Amy!, , , , , , , , , , , , , Olivia, , says, , , July 11, 2022 at 8:45 pm, , , , What can you add to this if it’s turned out too liquidy?, , , Reply, , , , , , , , Gwen Leron, , says, , , July 12, 2022 at 10:05 am, , , , Hi Olivia, what changes did you make to the recipe for it to turn out that way? I haven't had this happen to me before, but to fix this, think I would blend up some more almonds with a little less water and mix it into the existing mixture. You'll then have to adjust the spices to account for the extra almonds. Let me know how things turn out!, , , Reply, , , , , , « Older Comments, Primary Sidebar, , , , Hi, I'm Gwen!, if you’re looking for easy-to-make, delicious vegan desserts & baking recipes you’ll want to make over and over again, you’ve landed in the right place!, , More about me →, , , Search, , , , READER FAVOURITES, , Easy Strawberry Sauce, Slow Cooker Lentil Sweet Potato Chili, Mini Gluten-Free Vegan Apple Muffins, Vegan Gluten-Free Sugar Cookies, , Banana Favourites, , Vegan Banana Cookies, Easy Vegan Banana Cake, Vegan Banana Baked Oatmeal, Vegan Gluten-Free Chocolate Banana Muffins, Footer, , ↑ back to top, , , , QUICK LINKS, , , ABOUT, , CONTACT, , WEB STORIES, , , , , NEWSLETTER, , , SIGN UP FOR EMAILS AND UPDATES!, , , , , INFO, , , ACCESSIBILITY, , CCPA POLICY, , DISCLOSURE & POLICIES, , EDITORIAL POLICIES, , DO NOT SELL MY PERSONAL INFORMATION, , PRIVACY, , , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2014–2025 Delightful Adventures, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Click to Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: Place the raw almonds into a glass container and cover with water. Cover, and place in the refrigerator. Soak for 24 hours., Drain and rinse the soaked almonds after the 24 hours have passed., Place the soaked almonds, water, lemon juice, nutritional yeast, olive oil, garlic powder, and salt into a high speed blender. Blend until smooth., Empty mixture into a bowl, add chopped herbs and mix until everything is combined., Place in an airtight container and refrigerate for a few hours so the flavour can develop., Store unused spread in the refrigerator in an airtight container for 4-5 days., , , , Recipe Notes:, , Be sure that you are using a high-speed blender for this recipe. A regular blender will not work. (I use my, Nutri Bullet, or, Vitamix, and both work very well.), , Use only blanched or natural whole, raw, unsalted almonds for this recipe, , NOT, slivered almonds or roasted almonds., , Blanched almonds come with the skins off to make things a bit easier for you, but if you cannot find them, you can also use almonds with the skins on BUT, be sure to peel the skins after they have been soaked. This step is  a little time consuming, so be sure to factor this into your prep time., , Use your favourite herb and be sure to chop it up really well. My favourite is parsley and I also love using dill or chives (but not at the same time!)., , After soaking your 1 cup of almonds, they will expand a little. The soaked almonds will equal 1 ½ cups., , Spread will keep in the fridge for 4-5 days., , Recipe makes 1 ¾ cups of spread. Nutrition info is for 1 serving of 7 (¼ cup) and is only to be used as a rough guide., Click to learn, how nutrition info is calculated on this website., , , Nutrition Info:, Serving:, 4, tablespoons, |, Calories:, 114, kcal, |, Carbohydrates:, 4, g, |, Protein:, 4, g, |, Fat:, 10, g, |, Saturated Fat:, 1, g, |, Polyunsaturated Fat:, 2, g, |, Monounsaturated Fat:, 7, g, |, Sodium:, 113, mg, |, Potassium:, 136, mg, |, Fiber:, 2, g, |, Sugar:, 1, g, |, Vitamin A:, 200, IU, |, Vitamin C:, 6.6, mg, |, Calcium:, 50, mg, |, Iron:, 0.9, mg, , , , , , , Did You Make This Recipe?, If so, please share a picture with me on Instagram! Tag, @delightfuladventures, and hashtag, #delightfuladventures., I can't wait to see!, Appetizers, Snacks, Gluten-Free, Lemon, Christmas, Easter, Thanksgiving, More Vegan Appetizers, , Vegan Dill Dip, Vegan Pinwheels, Zucchini Fritters with Avocado Crema, Vegan Veggie Dip, Reader Interactions, Comments, , , , 5 from 16 votes (, 2 ratings without comment, ), , , , Did You Make This Recipe or Have a Question About It?, Cancel reply, If you’ve made this recipe and loved it, I’d be so grateful if you left a comment and star rating. Your ratings help others discover my recipes so they can enjoy them, too. If you haven’t tried the recipe yet but have a question, feel free to ask, and I’ll get back to you as soon as I can. Thank you so much for your support!, , Sincerely,, Gwen, Your email address will not be published., , Required fields are marked, *, Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , Notify me if there is a reply to my comment, , , , , I have read and accepted the, Privacy Policy, *, , , , , , , , Δ, , , , , , , Rachelle Wallis, , says, , , November 04, 2024 at 6:29 pm, , , , Can you do this recipe with almond flour to save time?, , , Reply, , , , , , , , Gwen Leron, , says, , , November 06, 2024 at 8:29 am, , , , Hi Rachelle",
        "Vegan Spinach and artichoke dip": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PF, OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., VEGAN SPINACH AND ARTICHOKE DIP, O, SERVES: 8 (approx. ¼ cup each)  Prep Time: 10 min.  Cooking Time: 6 min.., CONTAINER EQUIVALENTS (per serving):, 1, ½, Going into this recipe, we were skeptical about whether or not we could make an artichoke dip that was not only, Fix-approved but also vegan, since the original is all mayo, and cheese. But, using avocado to mimic the creaminess, of cream cheese and mayo and nutritional yeast to give it that cheesy kick, this recipe has all the yum factor without, the guilt! And, with just two simple steps, it couldn’t be easier to prepare!, , , Hot water, 1 (15-oz.) can, \u0007artichoke hearts, packed in, water, drained, 3 packed cups, raw spinach, 1, , medium ripe avocado, 2 Tbsp., , fresh lemon juice, 1⁄3 cup, , nutritional yeast, 1 clove, , garlic, ½ tsp., , sea salt (or Himalayan salt), ¼ tsp., , ground black pepper, ½ tsp., , onion powder, 1. \t Bring medium saucepan of water to a boil over high heat., 2. \t Add artichoke hearts and spinach; cook for 1 minute. Remove from heat, and drain well., 3. \t Place artichoke mixture in food processor. Add avocado, lemon juice, yeast, , garlic, salt, pepper, and onion powder; process until smooth., RECIPE NOTE:, You can substitute 1½ cups frozen artichoke hearts for canned., NUTRITIONAL INFORMATION (per serving): Calories: 77  Total Fat: 4 g  Saturated Fat: 1 g   Cholesterol: 0 mg  Sodium: 192 mg  Carbohydrates: 9 g  Fiber: 5 g, Sugars: 1 g  Protein: 4 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: "
    }
}