{
    "ingredients": {
        "Thai Biscuit Mini Sandwiches": "cucumber,carrots,vegan fish sauce,vegan mayo,vegan butter,all purpose flour,baking soda,coconut oil,thai red curry paste,thai basil,coconut milk,tofu/onion"
    },
    "recipe_url": {
        "Thai Biscuit Mini Sandwiches": "https://www.godairyfree.org/recipes/thai-biscuit-mini-sandwiches"
    },
    "Recipe": {
        "Thai Biscuit Mini Sandwiches": "Ingredients: egg-free, nut-free, peanut-free, optionally soy-free, vegan / plant-based, and vegetarian. To keep these mini sandwiches soy-free, select the mayonnaise that works for you (there are many soy-free options!), and opt for rice wine vinegar (it’s what I tested with, and I’m not sure if the vegan fish sauce is soy-free., , , Thai Biscuit Mini Sandwiches with Quick Pickled Vegetables and Garlic Aioli, , , , , , , Print, , , , , , Prep time, , , 20 mins, , , , , Cook time, , , 12 mins, , , , , Total time, , , 32 mins, , , , , , , , Author:, Betsy DiJulio, , Serves:, 8 biscuit mini sandwiches, , , , , Pickled Veggies, , , 8 thin slices cucumber, , ⅓ cup shredded or grated carrots, , 2 teaspoons rice wine vinegar or vegan fish sauce (sold as “vegetarian” in Asian markets), , , Garlic Aioli, , , 3 tablespoons vegan mayonnaise, , ⅛ teaspoon garlic powder, , , Thai Red Curry Biscuits, , , 1 tablespoon + 2 tablespoons dairy-free buttery spread, divided, , 1 cup all-purpose or white-wheat flour, , ½ teaspoon baking soda, , ¼ teaspoon sea salt, , 1 tablespoon shortening or coconut oil (solid), , 1 tablespoon prepared Thai red curry paste, , 1 teaspoon rice wine vinegar or vegan fish sauce (sold as “vegetarian” in Asian markets), , 6 to 8 fresh basil or Thai basil leaves, minced* + 8 whole leaves, , ⅓ cup, So Delicious Dairy Free Original Coconut Milk Creamer, , ⅓ cup caramelized onions or 8 2-inch grilled tofu squares (optional), , , , , , processes and products are subject to change by a manufacturer at any time. All foods and products should be considered at risk for cross-contamination with milk and other allergens. Always contact the manufacturer prior to consumption., Disclaimer, -, All Rights Reserved, -, Privacy Policy, Go Dairy Free © 2005-2024 Fleming Marrs Inc., , , , , , , , , , , , Submit, , Type above and press, Enter, to search. Press, Esc, to cancel., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: , , To make the biscuits,, preheat your oven to 450ºF. Melt 1 tablespoon of the buttery spread in a 6-inch (or larger) cast iron skillet placed in oven. Remove from the oven., , (The following can be done in a food processor, if desired). Whisk the flour, baking soda and salt together in a large bowl. Whisk in the solid 2 tablespoons of buttery spread and shortening or coconut oil until well-distributed and sandy. Add the curry paste, vinegar or fish sauce, and basil and stir to combine. Drizzle in the coconut creamer and stir until the dough comes together in a ball., , Turn the dough onto a lightly floured surface and pat into a ¾-inch tall disk. Working quickly, fold in the sides like you are folding a business envelope, pat into a ¾-inch tall disk, turn a quarter turn and repeat 4 more times. Cut the dough with a 2-inch biscuit or cookie cutter or sturdy glass., , Place each biscuit into the prepared skillet, right side down, and then flip right side up to coat both sides with butter. Bake for 10 to 12 minutes, or until risen and golden., , While the biscuits cook, , make the pickled veggies and garlic aioli, . Toss the cucumbers, carrot, and rice wine vinegar or fish sauce together in a small non-reactive bowl or carton and let soak until ready to use. In a separate small bowl, whisk the mayonnaise and garlic powder together., , When cool enough to handle, cut each biscuit in half horizontally and spread each with ⅛th of the garlic aioli, ⅛th of the caramelized onions or a slice of tofu, and ⅛th of the pickled veggies. Serve immediately, garnishing each with a fresh basil leaf., , , , , 3.4.3177, , , , , , , , , , Alisa Fleming, , , , , Website, , , , Alisa is the founder of, GoDairyFree.org, , Food Editor for, Allergic Living, magazine, and author of the best-selling dairy-free book, , Go Dairy Free: The Guide and Cookbook for Milk Allergies, Lactose Intolerance, and Casein-Free Living, , and the new cookbook, , Eat Dairy Free: Your Essential Cookbook for Everyday Meals, Snacks, and Sweets, . Alisa is also a professional recipe creator and product ambassador for the natural food industry., , , , , , , , 6, Comments, , , , , Pingback:, Vegan Finger Food Recipes for your next party!, , , , , , , , , Jessica @ Nutritioulicious, on, , September 30, 2015 12:18 pm, , , , , , oh my goodness, those biscuits look amazing!, , , Reply, , , , , , , , , , , , Rebecca @ Strength and Sunshine, on, , September 30, 2015 8:04 am, , , , , , That’s such an inventive unique idea!! Fantastic!, , , Reply, , , , , , , , , , , , Laura @MotherWouldKnow, on, , September 30, 2015 5:37 am, , , , , , What a great idea for an appetizer as well as a snack. These would look adorable passed on a tray and they would be easy to pick up because they’re “sandwiches.” If I had a couple of biscuits leftover, I could munch as I made them:), , , Reply, , , , , , , , , , , , Kristina, on, , September 29, 2015 6:43 pm, , , , , , I love the sound of these, and I have not had a biscuit in forever!!, , , Reply, , , , , , , , , , , , Alisa Fleming, on, , September 30, 2015 7:46 am, , , , , , I’m quickly becoming a biscuit addict with this contest – they are SO easy!, , , Reply, , , , , , , , , , Leave A Reply, , Cancel Reply, , , , , , , , , Save my name, email, and website in this browser for the next time I comment., , , , Notify me of follow-up comments by email., , Notify me of new posts by email., , , , , Rate this recipe:, , , , , , Δ, , , , , , , , , , , , , , , LET ME KNOW ABOUT NEW POSTS 🔔, , , , , Enter your email address to subscribe and receive notifications of new posts by email., , , , Email Address, , , , , , , , , , Subscribe, , , , , , , , , , , , , , , , , , , , , , Dad’s Dairy-Free Hot Cross Buns: A Good Friday Tradition, , , , , , , , , , , The Dairy-Free Chocolate Easter Bunny, Egg & More Round-Up, , , , , , , , , , , , , , , , , , , , , , , , , Go Dairy Free is the leading website for information on the dairy-free diet. We share dairy-free recipes, product reviews, news, recommendations and health guides to aide those with milk allergies, lactose intolerance or a general need or desire to live without dairy. Dairy-free does include milk-free, lactose-free, casein-free and whey-free, too! We also offer ample resources for gluten-free, soy-free, food allergy"
    }
}