{
    "ingredients": {
        "Spicy Buffalo Tofu Wings": "tofu,tapioca flour,breadcrumbs,vegan butter, hot sauce, garlic powder,paprika",
        "Baked Tofu Sticks": "firm tofu,all purpose flour,almond milk,garlic powder,breadcrumbs,buffalo sauce,oil,vegan mayo,dill,parsley",
        "Crispy Baked Buffalo Tofu Wings": "tofu,cornstarch,plant milk,bread crumbs,red hot sauce",
        "Chickpea Chicken Nuggets": "chickpeas,oat flour,onion powder,aquafaba,bread crumbs",
        "Crispy Baked Tofu Nuggets": "tofu,dill pickle juice,vegetable broth,yeast",
        "Chickpea Nuggets": "chickpeas,oat flour,onion powder,breadcrumbs,ketchup",
        "Chickpea Veggie Nuggets": "chickpeas,onions,garlic,eggs,oat flour",
        "Crispy Chickpeas": "chickpeas",
        "Crispy Air fried chickpeas": "chickpeas",
        "Smoky Baked Beans": "sweet onion,tomato sauce,worcestershire sauce vegan,dijon mustard,molasses blackstrap,cannellini beans",
        "Vegan Buffalo Quinoa Bites": "white beans,shallot,garlic,vegan buffalo sauce,quinoa,besan,tahini,hemp hearts,nutritional yeast,onion powder,dried dill,lemon",
        "Deviled Eggs Three Ways": "mayo,eggs,dijon mustard,lemon peel,sesame infusion,thai fish sauce OR greek yogurt,dijon mustard,lemon peel,lemon juice,salmon/tofu,dill OR greek yogurt,lime zest,lime juice,ghee,green onion,curry powder,chili,kaffir lime leaves AND sesame oil,garlic,ginger"
    },
    "recipe_url": {
        "Spicy Buffalo Tofu Wings": "https://www.pinterest.com/pin/496592296424257028/",
        "Baked Tofu Sticks": "https://veganheaven.org/all-recipes/baked-tofu-sticks/",
        "Crispy Baked Buffalo Tofu Wings": "https://www.thecuriouschickpea.com/crispy-baked-buffalo-tofu-wings/",
        "Chickpea Chicken Nuggets": "https://www.pinterest.com/pin/496592296424217110/",
        "Crispy Baked Tofu Nuggets": "https://nosweatvegan.com/vegan-chick-fil-a-style-nuggets-with-vegan-honey-mustard-dipping-sauce-oil-free/",
        "Chickpea Nuggets": "https://healthygirlkitchen.com/recipes/crispy-chickpea-nuggets-oil-free/",
        "Chickpea Veggie Nuggets": "https://thenaturalnurturer.com/chickpea-vegetable-nuggets/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=980088616_43756762_163858",
        "Crispy Chickpeas": "https://simplyvegetarian777.com/vegan-air-fryer.../.",
        "Crispy Air fried chickpeas": "https://www.myforkinglife.com/crispy-air-fryer-chickpeas/",
        "Smoky Baked Beans": "fixate_recipes\\Side and Snack\\FXR_Smoky_Baked_Beans_R_03.19.18.pdf",
        "Vegan Buffalo Quinoa Bites": "https://www.simplyquinoa.com/vegan-buffalo-quinoa-bites-ranch/",
        "Deviled Eggs Three Ways": "fixate_recipes\\Side and Snack\\FXR_Deviled_Eggs_Three_Ways_R_03.19.18.pdf"
    },
    "Recipe": {
        "Spicy Buffalo Tofu Wings": "Ingredients:  Instructions: ",
        "Baked Tofu Sticks": "Ingredients: For the Baked Tofu Sticks:, ▢, 21, , oz, , very firm tofu, ▢, 3/4, , cup, , all-purpose flour, ▢, 3/4, , cup, , unsweetened almond or soy milk, ▢, 1/4, , cup, , water, ▢, 2, , teaspoons, , garlic powder, ▢, 2, , teaspoons, , paprika powder, ▢, 1, , cup, , panko bread crumbs, ▢, 1, , cup, , Frank's Red Hot Buffalo Wings sauce, ▢, 1, , tablespoon, , olive oil, For the Vegan Ranch Dip:, ▢, 1/2, , cup, , vegan mayonnaise, ▢, 1, , teaspoon, , dried or freshly chopped dill, ▢, 1, , teaspoon, , dried or freshly chopped parsley, ▢, black pepper, to taste, , but instruction #2 says to add the salt and the black pepper to the flour mixture along with the garlic powder and paprika. How much salt and pepper do you recommend? I just added a dash of each but I’m not sure it even needs any, as Frank’s Red Hot already contains plenty of both., , , Reply, , , , , , , , Lisa, , , June 02, 2023 at 3:09 am, , , , This is by far the best crunchy batter ever. I love tofu, the rest of the family does not so I use it with chicken and everyone loves it. Cannot stress enough, this recipe is easy and efficient, so good, thank you and sorry that I use it for evil…., , , Reply, , , , , , , , Brooke, , , January 09, 2023 at 5:45 am, , , , These were awesome but the batter before you dip into the panko is super thick and hard to work with! Any tips? I’d love to make them again!, , , Reply, , , , , , , , Lisa, , , November 12, 2022 at 3:24 am, , , , Ok, these were amazing! I made the buffalo and teriyaki and just so good. I will definitely be making these again. I did use my air fryer but followed everything else. Just super good!!!, , , Reply, , , , , , , , Jacki, , , January 15, 2022 at 2:48 am, , , , So good! Cooked in the air fryer with great results. Spicy and crispy, , , Reply, , , , , , , , Stacie, , , September 17, 2021 at 12:10 am, , , , Loved these! I put on extra hot sauce at the end. I had them heated up severs, Days later and they were still delicious!!, , , Reply, , , , , , , , Bridget, , , September 16, 2021 at 3:47 am, , , , Omg, I made these they are amazing, and this is my first time eating Tofu, I will be making these again, , , Reply, , , , , , , , Ashley, , , January 21, 2021 at 11:52 pm, , , , You can also make these low carb/keto by substituting the flour for almond flour and the Pablo for nutritional yeast! Yummmmmm :), , , Reply, , , , , , , , Mojoblogs, , , November 20, 2020 at 8:46 am, , , , I personally love tofu and so I will definitely try this one., , , Reply, , , , , , , , Larry, , , October 26, 2020 at 11:43 pm, , , , I just became a vegan (pescatarian) about 9 weeks ago and I was a huge buffalo chicken fan.  I love tofu and I was really skeptical about this. I cooked it a little longer then what was in the recipe. WOW, these blew my socks off. Really really good. I will be making this again and again!, , , Reply, , , , , , , , Jenny, , , August 02, 2020 at 7:53 pm, , , , My family had a mixed reaction- I made half with the buffalo sauce and half with BBQ sauce- My teenagers liked the BBQ better, my husband and I liked the buffalo.  they are a bit time consuming but I would make again., , , Reply, , , , , , , , Sarah, , , May 27, 2020 at 8:01 pm, , , , We have made these multiple times. My meat eating husband loves them too, , , Reply, , , , , , , , MR, , , May 26, 2020 at 9:55 pm, , , , they were amazing and blew my mind, , , Reply, , , , , , , , Sarah, , , April 12, 2020 at 6:19 pm, , , , Very good! Will make these again, , , Reply, , , , , , , , Dale, , , April 11, 2020 at 2:28 pm, , , , These were amazing! A nice relatively healthy treat once in a while., , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , Current ye@r, *, , , , , , Leave this field empty, , , , , , Primary Sidebar, Facebook, Instagram, Pinterest, RSS, Tumblr, Twitter, , , , Hi, I'm Sina and this is my recipe blog where I share heavenly simple and sinfully delicious vegan recipes., , , Popular Recipes, , Lemon Spaghetti with Spinach (One Pot), One Pan Mexican Quinoa, Roasted Chickpeas, Thai Pineapple Fried Rice Recipe (Vegan), Vegan Meatballs with Spaghetti, Creamy Vegan One Pot Pasta (Asian Style), , , , Grilling, , Vegetable Kabobs, Vegan Black Bean Burgers (Grillable!), Vegan Potato Salad, Creamy Vegan Dip with Dates, Tofu Vegetable Skewers, Lentil Burgers, , , , , , , , , About Sina, , As a mom of twins, I know how busy life can be. So if you're looking for easy and quick vegan recipes the whole family loves, this is the right place for you!, , Learn more about me →, , , , Popular Recipes, , Lemon Spaghetti with Spinach (One Pot), One Pan Mexican Quinoa, Roasted Chickpeas, Thai Pineapple Fried Rice Recipe (Vegan), Vegan Meatballs with Spaghetti, Creamy Vegan One Pot Pasta (Asian Style), , Healthy Recipes, , Greek Pasta Salad with Easy Greek Vinaigrette, Quinoa Black Bean Salad, Sofritas, Vegan Chickpea Salad, Vegan Pad Thai, Easy Vegan Chickpea Curry, Footer, , , , , Impressum/Legal Notice, , , Privacy Policy, , Facebook, Instagram, Pinterest, RSS, Tumblr, Twitter, , Search, , Affiliate Disclaimer:, , Some posts may contain affiliate links, which means that if you click on one of the product links and actually decide to buy it, I’ll receive a small percentage of the total price - of course this does not cause any extra costs for you. I only recommend products that I personally love and use regularly., , , , , , Copyright © 2025 by Vegan Heaven, ·, Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: printable recipe box at the end of this post., , , How To Make The Tofu Sticks:, , The recipe takes some time in the oven, but the preparation is super easy!, , , 1. STEP, : Drain the tofu and pat it dry with a paper towel. Cut it into sticks., , 2. STEP, : In a large bowl, combine the all-purpose flour, the plant-based milk, the water, the garlic power, the paprika powder, the salt, and the black pepper. Stir until well combined., , , 3. STEP, : Dip the tofu sticks into the batter, so they’re completely coated., , 4. STEP, : Then roll them in the panko breadcrumbs., , 5. STEP, : Line a baking sheet with parchment paper and lay the tofu fingers on the baking sheet. Don’t put them on top of each other. Bake for 25 minutes at 350 °F., , 6. STEP, : Combine Frank’s Red Hot Buffalo Wings sauce with a tablespoon of olive oil and pour it over the baked tofu fingers. Evenly coat them from all sides by carefully stirring them a few times., , , 7. STEP, : Put the coated sticks back on a baking sheet lined with parchment paper. Bake again for 20 minutes at 350 °F., , , 8. STEP, : For the vegan ranch dip, combine the vegan mayonnaise with fresh or dried dill and parsley and stir until well combined. Serve the freshly baked vegan tofu sticks with the vegan ranch and enjoy! Also sprinkle some chopped green onions and freshly chopped parsley on top if you want., , Recipe Notes:, , , Make sure to use very firm tofu for this recipe. It won’t work well with soft tofu., , Don’t omit the panko breadcrumbs. They’re essentiell to this recipe and without them the tofu fingers won’t get as crispy. You can usually find them next to the traditional bread crumbs in most supermarket. Sometimes they’re in the Asian food aisle., , If you don’t like spicy food, this recipe is not for you! But you could replace the Frank’s Red Hot Buffalo Wing sauce with BBQ sauce if you want. This way they’re a lot less spicy!, , , , Other Recipes You Might Like:, , , Cauliflower Buffalo Hot Wings with Vegan Ranch, , Tofu Tacos, , Cauliflower Hot Wings with BBQ Sauce, , Broccoli Wings, , Vegan Cauliflower Tacos, , , Vegan Chicken Fingers, , , I LOVE TO HEAR FROM YOU GUYS!, , I hope you like these crispy baked tofu fingers as much as we do around here., , If you give them a try, I’d love to know what you think about them. Just, leave me a comment and a star rating, below. Your comments really make my day!, , You like my recipes and want to see more? Then follow me on, Facebook, ,, Instagram, , or, Pinterest, !, , Sina, , , , , Baked Tofu Sticks, , , These vegan baked tofu sticks are the perfect comfort food! They're crispy, spicy, and super easy to make! We like them best with homemade vegan ranch sauce., , , 4.97, from, 31, votes, , , Print, , Pin, , Rate, , , Course:, Appetizer, Entrées, Cuisine:, American, , Prep Time:, 15, minutes, , mins, Cook Time:, 45, minutes, , mins, , Servings:, 4, , people, , Calories:, 449, kcal, , Author:, Sina, , , Drain the tofu and pat it dry with a paper towel. Cut it into sticks., In a large bowl, combine the all-purpose flour, the plant-based milk, the water, the garlic power, the paprika powder, the salt, and the black pepper. Stir until well combined., Dip the tofu sticks into the batter, so they’re completely coated., Then roll them in the panko breadcrumbs., Line a baking sheet with parchment paper and lay the tofu fingers on the baking sheet. Don’t put them on top of each other. Bake for 25 minutes at 350 °F., Combine Frank’s Red Hot Buffalo Wings sauce with a tablespoon of olive oil and pour it over the baked tofu fingers. Evenly coat them from all sides by carefully stirring them a few times., Put the coated sticks back on a baking sheet lined with parchment paper. Bake again for 20 minutes at 350 °F., For the vegan ranch dip, combine the vegan mayonnaise with fresh or dried dill and parsley and stir until well combined. Serve the freshly baked vegan tofu sticks with the vegan ranch and enjoy! Also sprinkle some chopped green onions and freshly chopped parsley on top if you want., , , , Notes, , Make sure to use very firm tofu for this recipe. It won't work well with soft tofu., , Don't omit the panko breadcrumbs. They're essentiell to this recipe and without them the tofu fingers won't get as crispy. You can usually find them next to the traditional bread crumbs in most supermarket. Sometimes they're in the Asian food aisle., , If you don’t like spicy food, this recipe is not for you! But you could replace the Frank's Red Hot Buffalo Wing sauce with BBQ sauce if you want. This way they’re a lot less spicy!, , , Nutrition, Calories:, 449, kcal, |, Carbohydrates:, 35, g, |, Protein:, 16, g, |, Fat:, 26, g, |, Saturated Fat:, 3, g, |, Sodium:, 2266, mg, |, Potassium:, 302, mg, |, Fiber:, 2, g, |, Sugar:, 3, g, |, Calcium:, 133, mg, |, Iron:, 3.7, mg, , , , , Tried this recipe?, Mention, @_veganheaven_, or tag, #veganheaven, !, , , Rate the recipe!, If you like this recipe, please leave a good rating! This will help other readers., , , More Recipes, Spinach Tomato Pasta, Sofritas, Lemon Olive Oil Cake, Corn Tomato Avocado Salad, Reader Interactions, Comments, , , , , , Debra Steppel, , , October 26, 2023 at 9:19 pm, , , , I just made these for the first time and I was really impressed with how crispy they got in the oven without being fried. That being said, if I want to make a batch and keep it in the freezer, thawing only 2 or 3 at a time, how would you recommend that I heat them up for eating? I don’t have an air fryer. How long should I put them in a toaster oven to make sure they get hot throughout but don’t burn?, ",
        "Crispy Baked Buffalo Tofu Wings": "Ingredients: , , 1 lb extra firm or super firm tofu, , 6 tbsp cornstarch, arrowroot, or tapioca starch, , 1/4 cup plant milk, , , Bread Crumb Mixture, , , 1 cup panko style bread crumbs, , 2 tbsp olive oil, , 1/2 tsp paprika, , 1/2 tsp salt, , freshly ground black pepper, , 1 tbsp fresh minced parsley, , , Buffalo Sauce, , , 6 tbsp (90g) red cayenne pepper hot sauce, ideally Franks RedHot, , 3 tbsp (35g) vegan butter, , 1/8 tsp granulated garlic, , 1/8 tsp salt, , , To serve, , , Vegan bleu cheese or ranch style dressing, , , , ,  Instructions: , Each piece of tofu gets first dipped in starch, then a plant milk, and finally bread crumbs., , The starch will stick to the damp surface of the tofu. The plant milk will absorb into the starch and create a sticky surface for the breadcrumbs to adhere to., , You can use any plant milk you like, but use plain or plain and unsweetened milk for best results. I prefer to use soy milk, with oat milk as my second choice., , The breadcrumb mixture is made of panko style breadcrumbs and seasoned with paprika (I love smoked paprika here if you have it), salt, black pepper, minced parsley, and a drizzle of olive oil., , The oil adds a richness to the breading, which makes for extra tasty ‘wings’ when baked! Remember that wings are usually fried not baked so your tongue will expect some richness!, , The breaded tofu is baked on a lightly oiled pan until nice and crispy, and then tossed in a spicy buffalo sauce., , , The buffalo sauce:, , Buffalo sauce is made of hot sauce, and melted vegan butter, a bit of garlic powder, and a pinch of salt., , If you want to substitute the vegan butter for oil you can. Use refined coconut oil for a mouthfeel most similar to butter. If you use oil instead of butter you will need to add more salt to taste., , The hot sauce you choose for buffalo sauce is very important. You want a red cayenne pepper-style hot sauce, as these tend to be not too spicy (by my standards). I use, Franks RedHot, , some people prefer, Crystal Hot Sauce, and others like, Louisiana Hot Sauce, ., , If you don’t have an opinion on which hot sauce to use then you better make this recipe three times with each of those hot sauce brands (and/or maybe a less mainstream one?). Then rank them and come up with a super strong opinion stat! J/k, though it would be worth eating these crispy baked buffalo tofu wings that many times in a row., , , To make buffalo sauce more or less spicy:, , The way you control the heat level when making buffalo sauce is by adding more or less [vegan] butter to the hot sauce. If you want a milder sauce, add more butter! If you want it spicier, add more hot sauce or less butter. Easy peasy., , Tips on keeping the buffalo tofu wings crispy:, , The second you add the buffalo sauce to the crisp just-baked wings they start to get soggy., , To minimize any sogginess, make sure they are very well crisped before adding the hot sauce! Also eat them immediately, don’t let them sit around in sauce., , You can stick them back into the oven to re-crisp a bit after saucing. But they’ll soak up the sauce and lose some of that sauciness if you do so., , On that note, enjoy the buffalo tofu wings hot out of the oven with some creamy sauce for dipping. For store bought options my favorite dressings are made by Follow Your Heart, and if you want to go the homemade route, try my, cashew ranch dressing, which I think is perfection!, , These vegan buffalo wings are a perfect for a party appetizer, and great for a munchies style dinner. They also make for the most, epic vegan mac and cheese, !, , And don’t forget you can always make it into a yummy salad!, , , Can I make this gluten free?, , Sure thing! Use gluten free breadcrumbs, panko-style if you can find it. You can also crush up corn cereal or puffed rice cereal to make gluten free breadcrumbs., , , If you make these vegan buffalo tofu wings, leave a comment below and rate the recipe on the recipe card. And please share your photos with me on Instagram, tag @thecuriouschickpea and #thecuriouschickpea. I love seeing your recreations!, , WANT MORE DELICIOUS VEGAN RECIPES?, SIGN UP FOR MY, EMAIL NEWSLETTER, & FOLLOW ME ON, INSTAGRAM, ,, FACEBOOK, , AND, PINTEREST, !, , Like these buffalo tofu wings? Try them in my, vegan buffalo wing mac and cheese, !, , , , , Continue to Content, , , , , , , , Crispy Baked Buffalo Tofu Wings, , , , Yield:, , 18 tofu wings, , , , Prep Time:, , 10 minutes, , , , , Cook Time:, , 40 minutes, , , , , Total Time:, , 50 minutes, , , , , , Spicy, delicious, and indulgent-tasting these crispy baked buffalo tofu wings make the perfect appetizer or finger food for your next party or nibbly dinner and are excellent on top of a salad!, , , , , , Print, , , , , , , Preheat the oven to 425 ºF and lightly grease a large rimmed baking sheet., If using extra-firm tofu press out the extra water: Slice your tofu into 6 width-wise slabs and wrap in a lint-free towel or paper towel. Place some weights over the wrapped tofu, like a heavy cast iron skillet or books atop a baking sheet. Let drain for about 20-30 minutes before continuing., Cut your tofu into 18 'wings' or ~1/2\" sticks. Cut the block of tofu into 6 slices width-wise if you haven't already for pressing, then slice each of those slabs into 3 slices lengthwise., Put the cornstarch (or arrowroot or tapioca starch) in one bowl, the plant milk in a second bowl, and mix together the bread crumb mixture in a third bowl. Pour some of the bread crumb mixture onto a plate., Dip each tofu 'wing' into the starch, followed by the milk, then roll in the breadcrumbs on the plate. Place the wing onto the prepared baking sheet and repeat with the remaining 'wings.' Use one hand for the starch and bread crumbs and your other for the milk to keep breading from clumping on your fingers. Add more of the breadcrumb mixture to the plate as needed., Bake the prepared tofu at 425 ºF for 25 minutes, flip, then bake an additional 10-15 minutes until the tofu wings are nice and crispy., While they're baking, make the buffalo sauce. Melt the vegan butter and stir in the hot sauce, granulated garlic, and salt., Put the tofu wings in a large mixing bowl and toss with the buffalo sauce to coat. Serve immediately., Leftover buffalo tofu wings can be re-crisped in the oven., , , , Notes, , , If you have a convection bake setting, use it and bake for about 30-35 minutes flipping halfway through., , , , , Recommended Products, , As an Amazon Associate and member of other affiliate programs, I earn from qualifying purchases., , , , , , , , Frank's Redhot Original Cayenne Pepper Sauce, Fat Free Hot Wing Sauce, 23 oz, , , , , , , , Nutrition Information:, , Yield:, 6, , Serving Size:, 3, , Amount Per Serving:, , Calories:, 329, Total Fat:, 17g, Sodium:, 521mg, Carbohydrates:, 36g, Fiber:, 4g, Sugar:, 3g, Protein:, 13g, , , , , , , , , , , , Did you make this recipe?, , Please leave a comment on the blog or share a photo on, Instagram, , , , , , , © Eva, , , , Cuisine:, American, , /, , Category:, Appetizers, , , , , , , , , This recipe was originally posted on July 17, 2018., , , , , , , , , Pin, , , , , Share, , , , , Tweet, , , , , Email, , , , , , , , By, Author, Eva Agha, , , Posted on, Published:, January 15, 2021, , , , Categories, Appetizers, , , Entrees, , , Quick Recipes, , , Reader Favorites, , , Side Dish, , , Tags, Tags, bleu cheese dressing, buffalo sauce, hot sauce, ranch, savory, spicy, tofu, wings, , , , , Post navigation, , Vegan Creamy Garlic Pasta with Shaved Brussels Sprouts, Easy Vegan Baked Ziti, , , , Click here to cancel reply., , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , Elena, , Saturday 20th of January 2024, , , , , Hi,, , Can I freeze the tofu after breading for meal prep? And then bake it when ready to eat, , , , , , , Kim, , Monday 22nd of May 2023, , , , , Loved these! Made them in the air fryer! Crispy and delicious, , , , , , , Betty, , Tuesday 25th of October 2022, , , , , Best crispy tofu recipe by far — (I’m 5 years vegan so I’ve tried them all!).  We used Frank’s Buffalo and added the tofu to a wheat tortilla with warm white rice, lettuce, vegan mayo, avocado and cilantro.  Yum., , , , , , , Beth Villanueva, , Saturday 27th of August 2022, , , , , This is the crispiest tofu recipe I have found so far since becoming vegan over 3 years ago.    My husband works late so instead of tossing the tofu completely in Buffalo sauce and having it get soggy, I just drizzled some over the top of the Buddha bowl I made for dinner.  He can add more later if he wants.   Really great recipe!, , , , , , , Robin Simons, , Saturday 19th of February 2022, , , , , Draining tofu should be in the prep time. As should enough time to bread the tofu. Dinner will be an hour late,not that it’s your problem, but this was not easy or quick., , , , , This site uses Akismet to reduce spam., Learn how your comment data is processed., , , , , , , , , About The Curious Chickpea, , , Hi I'm Eva, the face behind The Curious Chickpea. My favorite animal is the tiger, but I'd rather hug a chicken. I love to cook and bake and want to share that passion with you., , , , Follow The Curious Chickpea:, , , , , , , , , , , , , , , , , , , , , , , , Current Reader Favorites, Crispy Baked Buffalo Tofu Wings, Vegan Chickpea Meatballs in Roasted Red Pepper Sauce, Tibetan Vegetable Momos with Spicy Sesame Tomato Chutney, Vegan Caramelized Mushroom Pizza, Vegan Malai Kofta: Indian Dumplings in Curry Tomato Cream Sauce, Web Stories, , Check out these slide show, stories, on your favorite Curious Chickpea recipes!, , , , , , , , , , , , , , , , , , Copyright © 2021 | The Curious Chickpea LLC |, Affiliates Disclosure, |, Privacy Policy, , , , Skip to Recipe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Chickpea Chicken Nuggets": "Ingredients:  Instructions: ",
        "Crispy Baked Tofu Nuggets": "Ingredients: check out my post:, 6 Essential Vegan Pantry Staples, . Find in the organic or health-food section of your local store or order, Nutritional Yeast, online., , Next, you break the tofu blocks into bite-sized chunks. Try not to crumble the tofu but also don’t worry about making the nuggets perfectly uniform. You’re going for a kind of nugget shape that’s a bit rounded and has nice nooks and crannies for your paste to cling to., , , Gently fold the tofu into the paste, making sure that each tofu chunk is coated. Use tongs or a slotted spoon to place the nuggets onto a parchment-lined baking sheet. This will keep any extra paste from getting onto the baking sheet (which can burn and stick). (Don't use aluminum foil to line the baking sheet, as this can also cause burning.), , Then pop the nuggets in the oven and cook at 400°F or 200°C for about 30 to 35 minutes or until crispy on the outside., , , , , While the nuggets are cooking, , US Customary, Metric, , 1x, 2x, 3x, 14, , oz, , or 400 g of super-firm tofu, , (or extra-firm tofu, pressed), ½, , teaspoon, , soy sauce, ½, , cup, , dill pickle juice, 2, , tablespoon, , agave syrup, 1, , tablespoon, , vegetable broth powder or poultry seasoning, 1, , teaspoon, , sweet paprika, 1, , teaspoon, , garlic powder, 1, , teaspoon, , onion powder, ¾, , cup, , nutritional yeast, Optional, vegan honey mustard dipping sauce, , add more nutritional yeast until you reach the right consistency)., Break the tofu into thumb-sized chunks over the bowl with the paste., Lightly fold the chunks into the paste, being careful not to break the tofu too much., Using tongs or a slotted spoon, transfer the tofu onto a lined sheet pan and place in the oven. Try to avoid getting excess liquid on the baking sheet as it will cause sticking. Cook for 30 to 35 minutes or until the tofu is nicely browned on the outside., Serve with Vegan Honey Mustard Dipping Sauce (included below) or your favorite sauce., , Cook Mode, Prevent your screen from going dark, , Save this Recipe, Saved!, , , Notes, , Click here for the, Vegan Honey Mustard Sauce., , Be sure to use parchment paper as the liner. Aluminum foil could cause the nuggets to burn!, , , , Reply, , , , , , , , Julianne Lynch, , says, , , January 26, 2024 at 10:00 am, , , , So glad you liked them!, , , Reply, , , , , , , , , , Annette Nelson, , says, , , March 19, 2024 at 11:49 pm, , , , Is the recipe correct with 1/2 teaspoon of soy sauce?, , , Reply, , , , , , , , Julianne Lynch, , says, , , March 20, 2024 at 10:31 am, , , , Yes, that is correct., , , Reply, , , , , , , , , , Kat, , says, , , September 07, 2024 at 5:50 pm, , , , I just made this, exactly as listed. I didn’t like the smell of the sauce but continued on with it. Used poultry seasoning. It was yummy! Dip was also tasty! Pretty easy, came out browned and slightly crunchy. I and my man enjoyed! Thank you!, , , Reply, , , , , , , , Julianne Lynch, , says, , , September 09, 2024 at 7:01 am, , , , Yay! I'm so glad you ended up liking it!, , , Reply, , , , , , , , , , Taytum, , says, , , September 13, 2024 at 7:16 pm, , , , Can you freeze these and then reheat?, , , Reply, , , , , , , , Julianne Lynch, , says, , , September 16, 2024 at 8:07 am, , , , Yes!, , , Reply, , , , , , , , , , Maisie C, , says, , , January 19, 2025 at 8:52 pm, , , , These were really easy! I didn't love the flavor from the nutritional yeast in the batter - is there anything you would recommend to still give it that brown exterior but with a different flavor? Would flour work?, , , Reply, , , , , , , , Julianne Lynch, , says, , , January 30, 2025 at 10:27 am, , , , Hi Maisie, you could try using cornstarch, but you probably won't need as much. Maybe start by adding about half as much and see if you need to add a little more., , , Reply, , , , , , , , , , jackie d, , says, , , April 05, 2025 at 3:26 am, , , , This is the best tofu ever. I make in the airfryer and it comes out perfect . I have made it so many times and non vegan family love it . Just made some this morning so going to make the honey mustard sauce to go with it ., , , Reply, , , , , , , , Julianne Lynch, , says, , , April 05, 2025 at 10:51 am, , , , Thanks! I'm so glad you like it!, , , Reply, , , , , , , , , , JE, , says, , , April 06, 2025 at 7:26 pm, , , , Always looking for a Tofu recipe. So many are okay, but lack that extra 'something'. I haven't had Chick-fil-a in several decades, but decided to give this a try. Wow! So good. This recipe is a keeper. I made exactly as written. And I used the air fryer to 'bake'. Thanks so much for posting., , , Reply, , , , , , , , Julianne Lynch, , says, , , April 11, 2025 at 7:53 am, , , , Awesome! I'm so glad you liked it. Thanks for posting., , , Reply, , , , , , , , , , , Hi, I'm Julianne!, A dedicated home chef for over 20 years and a vegan recipe developer since 2020. I love creating simple and comforting vegan food for the whole family. Most of my recipes are quick, Whole-Foods Plant-Based, and easy on the budget. Thanks for stopping by!, , You can also find me at, AirFryerVeg.com, ., , More about me →, , , Trending, , Vegan Chick-fil-A style Tofu Nuggets with Vegan Honey Mustard Sauce (Oil-free!), Vegan Oatmeal Raisin Cookies (Healthy, Easy, + Oil-Free), Vegan Potato Soup (Easy & Oil-Free), Tofu Nuggets (Vegan + Oil-Free!), , Recent, , Vegan Butter Beans (Easy + Creamy!), No-Bake Pumpkin Balls (Easy + Vegan!), Vegan Pear Muffins (Oil-free!), Vegan Mother's Day Recipes, , , Web Stories, , , , , , Footer, , ↑ back to top, , , , Legal, , , Privacy Policy, , Disclaimer, , Terms & Conditions, , Impressum, , , , , Free Meal Planning Tips & Printables!, , , Sign Up, for free printables and weekly updates, , , , , , Contact, , , Contact, , Media Kit, , FAQ, , , , , As an Amazon Associate I earn from qualifying purchases., , ***, , Unauthorized use and/or duplication of this material without express and written permission from this blog’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to No Sweat Vegan with appropriate and specific direction to the original content., , , Copyright © 2020-2025, No Sweat Vegan, on the, Foodie Pro Theme, , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: How to serve, How to Store & Reheat, More tofu recipes, 📖 Recipe, , , , How to freeze and thaw tofu for a more chicken-like texture, , If you are using super-firm tofu, , However, if you are using firm or extra firm tofu, simply freeze your tofu overnight (or keep frozen blocks of tofu in your freezer as a staple), and then on the morning you want to make this recipe, place the tofu in the refrigerator to defrost. (For at least six hours). Some people even refreeze the tofu and thaw it AGAIN., , , Can I make them in an air fryer?, , You sure can! You'll just need to cook them on 400F or 200C for 12 to 15 minutes. Check out this post on, Air Fryer Tofu Nuggets, , , When it's time to prepare the tofu, creamy potato salad, , , vegan coleslaw, , or, oil-free oven fries, . Or let them be the star of my, Hearty Country Salad, ., , Pro tip:, I like to make a double batch of these vegan Chick-fil-A style nuggets and save the extra in an airtight container in the fridge (up to 5 days). Whether you serve them cold or reheat, they are perfect for adding to salad and wraps throughout the week. Likewise, the vegan honey mustard dipping sauce stores well and is perfect for salad dressings and dipping oven fries or other veggies., , , , How to serve, , Serve these nuggets as a main course with, vegan honey mustard sauce, or use them to, top a salad, . They can also make, a great party appetizer, . Great dinner pairings include:, , Vegan Pumpkin Mac and Cheese, Creamy Vegan Coleslaw (Oil-Free!), Vegan Mashed Potatoes, Air Fryer Squash, Air Fryer Greens Beans, , How to Store & Reheat, , You can store any leftovers in the refrigerator in an airtight container for up to a week. I've never tried freezing them, but you could try it! Be sure to let me know in the comments if you do. Reheat in the microwave or oven., , More tofu recipes, , Best Tofu Recipes (Vegan), Korean Tofu (Spicy, Vegan, & Oil-free), Vegan Butter Chicken with Tandoori Tofu, Orange Tofu (Vegan + Oil-Free), , , , , , ** I recently updated this post and changed the recommended cooking temperature from 425F/220C to 400F/200C. This might result in a slightly longer cook time but should result in a more consistent result., , , ** I also want to clarify that if you use super firm tofu (the kind that comes vacuum sealed without much water), but if you use firm tofu, you should press the tofu for 10 to 30 minutes., , 📖 Recipe, , , , Vegan Chick Fil A Style Nuggets, , , , If you've been searching for an easy and delicious vegan Chick-fil-A style nugget recipe, then you're in luck. These nuggets combine agave sweetness and briny pickle juice for a unique yet familiar flavor. Plus everything is oil-free! Perfect for dipping in a honey mustard dipping sauce., , , 4.61, from, 344, votes, , , , Print Recipe, , Share on Facebook, , Pin Recipe, , Save, Saved!, , , , , , Prep Time, 5, minutes, , mins, Cook Time, 35, minutes, , mins, Freezing and Thawing Time, 12, hours, , hrs, , , , , , , Course, Main Course, Cuisine, American, , , , , , Servings, 4, Calories, 171, , kcal, , , , Equipment, Wilton Easy Layers Sheet Ca..., Shop on Amazon, baking sheet, mixing bowl, , , Optional Freezing/Thawing Technique, Open the tofu to drain the water (optional) and place in a freezer bag or container. Freeze at least 4 hours or overnight. Defrost in the refrigerator about 6 hours. (Place in the freezer the night before and take out on the morning you want to make the nuggets). This step is optional but will give the tofu a more \"chicken-like\" texture., Preparing and Cooking the Vegan Chick-fil-A Style Nuggets, Preheat oven to 400°F or 200°C., this recipe will still be delicious., , Be careful not to get extra liquid on the baking sheet, as it will stick and can burn. Plus, you want all those delicious flavors on your nuggets!, , If you put the tofu nuggets into the paste and find that it's still too thin, just add a little more nutritional yeast and carefully fold into the nuggets and paste., , you will need to press the tofu to remove excess water. After the tofu is defrosted, r, emove tofu from the packaging and wrap it in a paper towel or clean kitchen towel. Place wrapped tofu on the counter and press with the heel of your hand, applying enough pressure to release some of the water (not so hard that you crush the tofu)., I find that simply squeezing out the water is sufficient for this recipe., , , If you aren't using extra-firm tofu, , Do *NOT* use silken tofu for this recipe., , If you want to reduce the sodium, you can use light soy sauce or halve the soy sauce and replace the difference with water., , Want to use an air fryer? Try 12 to 15 minutes at, 400°F or 200°C., , , Nutrition, Calories:, 171, kcal, Carbohydrates:, 18, g, Protein:, 15, g, Fat:, 5, g, Saturated Fat:, 1, g, Sodium:, 516, mg, Potassium:, 185, mg, Fiber:, 4, g, Sugar:, 7, g, Vitamin A:, 246, IU, Calcium:, 70, mg, Iron:, 1, mg, , , , , Keyword, chick fil a style vegan nuggets recipe, vegan Chick Fil A nuggets, vegan tofu nuggets, , , , Tried this recipe?, Tag me on Instagram, @no_sweat_vegan, or, #nosweatvegan, !, , , Want access to my Exclusive Meal Planning Tips & Printables page?, , , , , , Web Story, , , More Vegan Recipes, Strawberry Rhubarb Baked Oatmeal (Vegan + No Banana!), Vegan Spinach Artichoke Dip (Easy + Nut-Free!), Pumpkin Baked Oats (Vegan), Vegan Pumpkin Risotto (With Sage!), , , , 218268, , shares, , , , , , , Facebook, , , , , Pinterest, , , , , Yummly, , , , , Email, , , Comments, , , , 4.61 from 344 votes (, 317 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , , , , , Jennifer V., , says, , , June 10, 2020 at 12:14 am, , , , Amazing! Perfect! Made this with the sauce and some waffle fries. The flavor is spot on when paired with the sauce. Thank you!!, , , Reply, , , , , , , , Julianne Lynch, , says, , , June 10, 2020 at 6:11 am, , , , Thanks! I'm so glad you liked them. The sauce really does take this dish to the next level!!, , , Reply, , , , , , , , Julie, , says, , , July 03, 2021 at 7:41 pm, , , , I have made this recipe 4 times now. Sooooo good. I am from Canada so I have never tried chick filet but this is such an easy and delicious recipe. Thank you for sharing., , , Reply, , , , , , , , Julianne Lynch, , says, , , July 04, 2021 at 6:10 am, , , , That's great!! I'm so glad you like it!, , , Reply, , , , , , , , , , Mimi, , says, , , August 08, 2023 at 12:33 am, , , , I don't think I've ever left a comment on a recipe blog, but I had to this time. My first attempt at vegan nuggets involved fried seitan and a lot of disappointment. These, while a touch heavy on the poultry seasoning for my taste (very easily remedied), were virtually indistinguishable from actual chicken when dunked in some sauce. Fantastic recipe, won't miss meat in the slightest with these in my rotation., , , Reply, , , , , , , , Julianne Lynch, , says, , , August 21, 2023 at 3:22 pm, , , , Awesome! So glad you liked this recipe!, , , Reply, , , , , , , , , , , , Alice Souza, , says, , , July 17, 2020 at 4:24 pm, , , , Can you do this in the air fryer?  And, what would happen if you press the tofu?, , Thanks, , , Reply, , , , , , , , Julianne Lynch, , says, , , July 18, 2020 at 7:32 am, , , , Hi Alice! Yes, you can do it in the air fryer (12-15 minutes on 400F). I don't press the tofu (unless it's frozen and thawed) because the brand I buy is super firm. But if your brand is less firm then you should press some of the water out first. If you're not sure, just try pressing it for 15 to 30 minutes (wrap in a clean kitchen towel and stack something heavy on top)., , , Reply, , , , , , , , , , Tamara, , says, , , August 23, 2020 at 10:58 pm, , , , Excellent and very easy! I used maple syrup (1 tbsp instead of 2) and it was perfect., , , Reply, , , , , , , , Julianne Lynch, , says, , , August 30, 2020 at 9:06 am, , , , Great! I'm so glad the maple syrup worked out., , , Reply, , , , , , , , , , A L, , says, , , August 25, 2020 at 7:18 pm, , , , Anything to use instead of nutritional yeast? And also for agave? I'm not worried about keeping this vegan, that doesn't matter, , , Reply, , , , , , , , Julianne Lynch, , says, , , August 30, 2020 at 9:05 am, , , , Instead of Nutritional Yeast you could try corn starch, perhaps (I haven't tried it this way, so it's just a guess). For an agave substitute, I think any liquid sweetener would do., , , Reply, , , , , , , , , , C, , says, , , September 03, 2020 at 8:11 pm, , , , Hi there! Would you mind if I share your blog with my facebook group? There's a lot of people that I think would really appreciate your content. Please let me know. Many thanks, , , Reply, , , , , , , , Julianne Lynch, , says, , , September 04, 2020 at 8:20 am, , , , Sure! I'd be more than happy for you to share the blog with your Facebook group. Thanks!, , , Reply, , , , , , , , , , Ashley, , says, , , September 14, 2020 at 5:08 pm, , , , Hi - I’m not a vegan or vegetarian but want to start introducing meat alternatives to my family. What brand of extra firm tofu do you recommend for this recipe? Thanks!, , , Reply, , , , , , , , Julianne Lynch, , says, , , September 16, 2020 at 6:05 am, , , , Hi Ashley, I'm so glad you're interested in adding plant-based meals to your diet! I don't currently live in the US, but I know Kroger has a Simple Truth brand of organic extra firm tofu that would be affordable and good for this recipe. Another great brand is Trader Joe's Super Firm Tofu (if you live near a Trader Joe's). I hope that helps!, , , Reply, , , , , , , , Lauracatherine, , says, , , August 27, 2022 at 9:25 pm, , , , Hi so the recipe seems great i want to try it … i generally don't buy pickles and i have a large family of 7. That would be a lot of pickle juice. Any recommendations or proper substitute?, Many thanks, , , Reply, , , , , , , , Julianne Lynch, , says, , , August 30, 2022 at 8:01 am, , , , If you want to make a similar recipe without pickle juice, I recommend these tofu nuggets:, https://nosweatvegan.com/easy-tofu-nuggets/, They are very similar but don't have pickle juice in the recipe., , , Reply, , , , , , , , , , , , Hannah, , says, , , September 30, 2020 at 2:20 am, , , , The first time I have ENJOYED tofu! Amazing recipe! Well done., , , Reply, , , , , , , , Julianne Lynch, , says, , , September 30, 2020 at 6:01 am, , , , That's what I love to hear! So glad you liked them!!, , , Reply, , , , , , , , , , Marilea, , says, , , October 07, 2020 at 11:16 pm, , , , This was yummy! It was a favorite with my husband. I did have a question. Is the nutritional yeast to make it “battered and fried” like chick filet? Could I substitute panko crumbs to still make it battered and crunchy? I don’t care much for nutritional yeast. The nutritional yeast flavor was not too strong though, it was tolerable. Thanks for sharing your creativity!, , , Reply, , , , , , , , Julianne Lynch, , says, , , October 08, 2020 at 7:58 am, , , , I'm glad you liked it! If you want to keep it crispy without the nutritional yeast, you could try cornstarch. I have done that a few times with my chili-lime tofu nuggets, and I thought it was very comparable in texture., , , Reply, , , , , , , , , , Sarah, , says, , , October 10, 2020 at 5:47 pm, , , , What do you recommend if the coating doesn’t stick well to the tofu?  The coating I made was thick, so I believe there was enough nutritional yeast, but I really struggles to have it fully coat the tofu., , , Reply, , , , , , , , Julianne Lynch, , says, , , October 13, 2020 at 11:09 am, , , , It depends on how you break up the tofu. If you cut it with a knife or make the edges too uniform and flat, it will have more trouble sticking. Be sure to check out the photos in the blog post to see how to best break the tofu into chunks. The paste sticks much better to the sides that are craggy and uneven. If you already did that, try using a bit of cornmeal in the batter. Let me know if either of those helps., , , Reply, , , , , , , , Kate, , says, , , February 08, 2021 at 2:37 am, , , , I really do not like dill pickles. Is there anything else I could use?, , , Reply, , , , , , , , Julianne Lynch, , says, , , February 08, 2021 at 11:50 am, , , , Do you like sweet pickles? You could sub that (maybe reduce the agave). If not, try this basic tofu nugget recipe. It's very similar but has no pickle juice., https://nosweatvegan.com/easy-tofu-nuggets/, , , Reply, , , , , , , , , , , , , , jo, , says, , , October 18, 2020 at 10:09 am, , , , Where can I find dill picked juice? I\"ve never heard of it and google doesn't come up with any helpful suggestions, , , Reply, , , , , , , , Julianne Lynch, , says, , , October 18, 2020 at 5:20 pm, , , , It depends on where you live. If you are in the US just buy a jar of pickles (not sweet, but the regular dill variety) and use the liquid from the can., , , Reply, , , , , , , , , , Karwn, , says, , , October 18, 2020 at 4:07 pm, , , , When you freeze the tofu is it with or without the liquid? Thanks!, , , Reply, , , , , , , , Julianne Lynch, , says, , , October 18, 2020 at 5:17 pm, , , , I freeze it in the plastic packaging (with the liquid). So you definitely need to press it to remove the liquid after it thaws., , , Reply, , , , , , , , Karen, , says, , , October 18, 2020 at 5:26 pm, , , , Thank you for the quick response!, , , Reply, , , , , , , , , , , , Anna Bowen, , says, , , October 28, 2020 at 9:24 pm, , , , I forgot to take the tofu out of the freezer this morning.  Can I thaw it in a hot water bath, and still get good results?, , , Reply, , , , , , , , Julianne Lynch, , says, , , October 30, 2020 at 10:08 am, , , , Hi Anna,, Sorry I didn't see your question sooner. Yes, you can thaw it in a hot water bath or even a microwave. Just be sure to press all the water out., , , Reply, , , , , , , , , , Yoxara, , says, , , November 05, 2020 at 2:30 am, , , , Love the recipe! Thank you so much! I’m sharing with a lot of friends!!, , My only questions is if you can use the extra marinade later and just put it on your fridge for let’s say a week?, , , Reply, , , , , , , , Julianne Lynch, , says, , , November 05, 2020 at 8:25 am, , , , Thanks! I'm really glad you like it. I wouldn't keep the marinade for more than 4 days, but you could freeze it and then just defrost before using it again., , , Reply, , , , , , , , , , Roxana guerra, , says, , , November 08, 2020 at 4:32 pm, , , , Is there anything I can sub the pickle juice for? I don’t have any and i don’t really eat pickles so i don’t want to get a whole jar for it to be a waste.., , , Reply, , , , , , , , Julianne Lynch, , says, , , November 09, 2020 at 9:08 am, , , , Hi Roxana, There are two possibilities. You can make your own pickle brine (add vinegar, salt, water, and dried dill to a small saucepot, bring to a boil to combine, and then cool--here are some more tips on making a brine:, https://www.thekitchn.com/how-to-quick-pickle-any-vegetable-233882, ). The other possibility would be to leave it out. Just follow my recipe for Easy Tofu Nuggets. It's a very similar recipe but there's no pickle juice. 😉, , , Reply, , , , , , , , , , Leila, , says, , , November 10, 2020 at 9:10 pm, , , , This recipe looks delicious I can’t wait to try this later today. I was unable to find the sweet paprika in my local store. I was thinking about using regular paprika & mixing it with sugar. Do you think that would work? Or should I just stick to regular paprika?, , , Reply, , , , , , , , Julianne Lynch, , says, , , November 11, 2020 at 7:17 am, , , , I think regular paprika (without sugar) is fine. I only call it sweet paprika to differentiate it from smoked paprika. (I should probably change the wording, actually). I hope you love the recipe!, , , Reply, , , , , , , , , , Alyssa W, , says, , , November 13, 2020 at 4:30 pm, , , , Do you have the nutritional information for this recipe? And could you use flour instead of nutritional yeast?, , , Reply, , , , , , , , Julianne Lynch, , says, , , November 15, 2020 at 8:40 am, , , , If you don't have nutritional yeast, I would substitute with corn starch (this will make it crispier than flour). I don't yet have the nutritional info available, but I will try to update soon. Thanks!, , , Reply, , , , , , , , Breanna R, , says, , , December 02, 2020 at 7:29 pm, , , , Instead of baking, is it possible to shallow-fry these in a skillet? Thank you!, , , Reply, , , , , , , , Julianne Lynch, , says, , , December 04, 2020 at 7:01 am, , , , Hi Breanna, , , I have never tried to shallow fry these nuggets, so I can't say for sure. I think it would probably work, but I'm not sure how the inside texture would turn out. Let me know if you try it!, , , Reply, , , , , , , , , , Julianne Lynch, , says, , , December 27, 2020 at 12:47 pm, , , , Hi Alyssa, I wanted to update my reply from a few weeks ago to let you know that the nutritional info for this recipe is now available. You can find it at the bottom of the recipe card., , , Reply, , , , , , , , , , JayTrice, , says, , , January 21, 2021 at 2:33 am, , , , I just converted to plant based and these were an awesome treat!! The freezer trick was cool as it changed the texture. That dip was perfect and I have leftovers for my salads!! Thank you!!, , , Reply, , , , , , , , Julianne Lynch, , says, , , January 21, 2021 at 7:17 am, , , , That's great to hear! I hope that finding recipes you like will make the transition easier!, , , Reply, , , , , , , , , , Suzanne Troiani, , says, , , February 07, 2021 at 11:36 pm, , , , I tried to do these in the air fryer at 400 as suggested, but the were completely burned after 15 minutes. Do you have any ideas as to what could have gone wrong?, , , Reply, , , , , , , , Julianne Lynch, , says, , , February 08, 2021 at 11:51 am, , , , That's too bad. Each Air Fryer is a little different. Can I ask which brand you were using? I would try 390 then. Check at 12 minutes., , , Reply, , , , , , , , , , Molly, , says, , , February 09, 2021 at 1:21 am, , , , Good taste but mine did not resemble the flavor a chick fil a nugget in the least., , , Reply, , , , , , , , Julianne Lynch, , says, , , February 09, 2021 at 7:31 am, , , , I\"m glad you liked it! It's in the \"style\" of Chick-fil-A, so it won't be exactly the same., , , Reply, , , , , , , , , , Sarah, , says, , , March 19, 2021 at 9:37 am, , , , Do I need to press the todu first?, , , Reply, , , , , , , , Julianne Lynch, , says, , , March 19, 2021 at 9:40 am, , , , Hi Sarah, It depends on what kind of tofu you are using. If you are using super firm tofu (the kind that's really dense and come vacuum sealed without much extra water), then you can probably get away with not pressing first. If you are using the firm or extra firm variety, then you definitely want to press first because there will be a lot of extra water. Thanks for asking!, , , Reply, , , , , , , , , , Jet1821, , says, , , March 31, 2021 at 12:06 am, , , , So delicious! My carnivore husband agrees! Halved the coating recipe using only 1/4 cup nutritional yeast for one block of tofu and it worked out perfectly. If the chunks are larger than thumb size it still works. Loved it. Thanks!, , , Reply, , , , , , , , Julianne Lynch, , says, , , March 31, 2021 at 11:34 am, , , , I'm so glad you liked it! And yes, it can work well in different sizes. I'm glad to hear it halving the recipe worked too!, , , Reply, , , , , , , , , , Elizabeth, , says, , , April 02, 2021 at 9:37 pm, , , , I didn't want to give a bad star review, but I did try these last night and I was not a fan. I think I took the \"paste consistency\" too much to heart and added too much cornstarch (as a sub for yeast). My husband liked them, but I didn't end up being a fan. He said it was an almost good substitute for chicken!, , , Reply, , , , , , , , Julianne Lynch, , says, , , April 03, 2021 at 7:41 am, , , , Thanks for trying them! Maybe try them again with the nutritional yeast instead. Or if you want to use cornstarch don't use quite as much. I'm glad your husband liked them!, , , Reply, , , , , , , , , , Charleen M Briscoe, , says, , , May 13, 2021 at 12:53 pm, , , , So so good I'm experimenting with tofu right now. I've made 4 different versions and this by far is the best. Thanks, , , Reply, , , , , , , , Julianne Lynch, , says, , , May 13, 2021 at 12:55 pm, , , , Wonderful! So glad I could help!!, , , Reply, , , , , , , , , , Mel, , says, , , May 19, 2021 at 11:30 pm, , , , Wow, I just made these and they came out SO GOOD! It tastes so much like chic fil a’s nuggets and sauce. You nailed it! Thank you for this recipe! 🙂, , , Reply, , , , , , , , Julianne Lynch, , says, , , May 20, 2021 at 11:26 am, , , , Thank you for the kind words! It really makes my day to know people love the recipe!, , , Reply, , , , , , , , , , Nicole, , says, , , June 21, 2021 at 6:13 pm, , , , Just wondering if there’s any substitute to vegetable broth powder? I can’t seem to find any! Thanks in advance!, , , Reply, , , , , , , , Julianne Lynch, , says, , , June 21, 2021 at 8:37 pm, , , , Hi Nicole, You can use any kind of chicken-less seasoning, poultry seasoning, or even a broken-up vegetable bouillon cube. I hope that will give you some ideas., , , Reply, , , , , , , , Angelia, , says, , , March 02, 2023 at 7:06 pm, , , , I'm not one for leaving comments, but this recipe is so tasty that I must!  This is the first tofu chicken nugget recipe that I tried, and I have no need to look further.  I had to convince myself I was actually eating tofu - THEY ARE THAT DELICIOUS!  I made the recipe exactly as written with two exceptions - I didn't have agave syrup so I substituted with maple syrup, and I let the tofu marinate in the paste overnight (for about 26 hrs).  I put my nuggets on parchment paper in my air fryer and they came out perfectly., Thank you for sharing this exceptional tofu recipe with us!, , , Reply, , , , , , , , Julianne Lynch, , says, , , March 03, 2023 at 8:04 am, , , , Awesome! So glad you liked it!!, , , Reply, , , , , , , , , , , , , , Connie, , says, , , September 13, 2021 at 3:29 am, , , , I made these for my husband and daughter tonight & we thoroughly enjoyed them. The honey mustard dipping sauce is perfection! Thank you for these easy & very tasty recipes!, , , Reply, , , , , , , , Julianne Lynch, , says, , , September 13, 2021 at 6:06 am, , , , You're very welcome! I'm so glad you liked the recipe. Thanks so much for commenting., , , Reply, , , , , , , , , , Sarah, , says, , , March 25, 2022 at 12:51 am, , , , So delicious! I was really skeptical at first, only because some of the other \"Chickn\" recipes I've made have fell flat. But these were so great! I froze the tofu over night and let it defrost for 6 hours in the fridge, but the tofu was still rock hard! Weird. So I kept it in the fridge to thaw for the next night. I pressed the tofu before freezing AND after thawing and it was great! The batter or paste, has such a great flavor and texture. The honey mustard sauce was delicious! Highly recommend this!, , , Reply, , , , , , , , Julianne Lynch, , says, , , March 25, 2022 at 8:18 pm, , , , That's great! I'm so glad you liked it. And thanks for your details on the preparation!, , , Reply, , , , , , , , , , Neva, , says, , , August 03, 2022 at 5:20 pm, , , , OMG!!! I thought I was actually eating Chic-Fil-A! I subbed date syrup for agave and used the poultry seasoning instead of the veggie broth. The nuggets were a little darker, but sooo delicious. This is a definite keeper! Can't wait to try more of your recipes! Thank you for all your hard work and experimenting, so I don't have to 🙂, , , Reply, , , , , , , , Julianne Lynch, , says, , , August 04, 2022 at 6:38 pm, , , , Thanks so much! I\"m so glad you loved it!, , , Reply, , , , , , , , , , CJ, , says, , , November 19, 2022 at 12:24 am, , , , I used the correct amount of poultry seasoning and that’s all they tasted like to me, which wasn’t good 🙁 I’m not sure what went wrong here or if that’s just how they taste. I think I’ll give these another shot with the veggie broth powder instead.., , , Reply, , , , , , , , Julianne Lynch, , says, , , December 01, 2022 at 9:06 am, , , , Yes, unfortunately, different brands and seasonings can vary in flavor. I hope you like them better with the broth powder!, , , Reply, , , , , , , , , , Brittany, , says, , , January 24, 2024 at 5:17 pm, , , ",
        "Chickpea Nuggets": "Ingredients: , ▢, 1, , 15 oz, , can of chickpeas, , drained and rinsed, ▢, ⅓, , block, , extra firm tofu, ▢, ½, , cup, , oat flour, ▢, aquafaba, , save the chickpea liquid from the can, ▢, 1, , teaspoon, , garlic powder, ▢, 1, , teaspoon, , onion powder, ▢, ¾, , teaspoon, , salt, ▢, sprinkle of smoked paprika, ▢, 1, , cup, , breadcrumbs of choice, , if you are gluten-free, use GF breadcrumbs, , get delicious and flavorful snacks or side dish recipes for your whole family. Get the recipe here. […], , , Reply, , , , , , , , What are Vegan Nuggets? Plus: the Best Brands and Recipes – Plant Based .au, , says:, , , , December 30, 2022 at 2:01 am, , , , , […] For those who love nuggets, however not all of the processing that goes into store-bought choices, this recipe will assist to fulfill your cravings. As a substitute of vegan meat, chickpeas type the premise of those nuggets. And critically, they’re so tasty and moreish, you gained’t even discover the distinction.Get the recipe […], , , Reply, , , , , , , , What Are Vegan Nuggets? Plus, The Best Brands And Recipes, , says:, , , , March 21, 2023 at 5:10 pm, , , , , […] If you love nuggets, but not all the processing that goes into store-bought options, this recipe will help to satisfy your cravings. Instead of vegan meat, chickpeas form the basis of these nuggets. And seriously, they’re so tasty and moreish, you won’t even notice the difference.Get the recipe […], , , Reply, , , , , , , , Kick The Chicken Habit With These 9 Storebought Nuggets And 5 Recipes, , says:, , , , April 14, 2024 at 1:11 pm, , , , , […] If you love nuggets, but not all the processing that goes into store-bought options, this recipe will help to satisfy your cravings. Instead of vegan meat, chickpeas form the basis of these nuggets. And seriously, they’re so tasty and moreish, you won’t even notice the difference.Get the recipe […], , , Reply, , , , , , , , Kick the Chicken Habit With These 9 Storebought Nuggets and 5 Recipes - The Hide USA, , says:, , , , April 14, 2024 at 1:53 pm, , , , , […] If you love nuggets, but not all the processing that goes into storebought options, this recipe will help to satisfy your cravings. Instead of vegan meat, chickpeas form the basis of these nuggets. And seriously, they’re so tasty, you won’t even notice the difference.Get the recipe […], , , Reply, , , , , , , , Kick The Chicken Habit With These 9 Storebought Nuggets And 5 Recipes, , says:, , , , April 14, 2024 at 2:08 pm, , , , , […] If you love nuggets, but not all the processing that goes into storebought options, this recipe will help to satisfy your cravings. Instead of vegan meat, chickpeas form the basis of these nuggets. And seriously, they’re so tasty, you won’t even notice the difference.Get the recipe […], , , Reply, , , , , , , 4.91 from 20 votes, , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , , , , , , , , danielle brown, , Hi! I’m Danielle Brown, the face behind HealthyGirl Kitchen! I share easy, approachable plant-based recipes that are not only healthy but taste amazing. Follow me on, Instagram, ,, TikTok, , and, Facebook, for free vegan meal ideas, recipes and healthygirl tips., , , , follow me on, , , Spring Recipes, , , , , , Spring Roll in a Bowl, , , , , Vegan Tuna Pasta Salad (Yogurt Dressing!), , , , , Vegan Gluten-Free Carrot Cake, , , , , Quinoa Broccoli Salad (with creamy dill dressing!), , , , , All Your Greens Pasta, , , , , Mediterranean Gnocchi (easy healthy dinner!), , Popular Recipes, , , , , , Mother’s Day Gift Idea: Salad Lover Kit, , , , , Longevity Salad, , , , , One Pan Tuscan Pasta, , , , , Healthy “Happy Meal” (McDonald’s Copycat!), , , , , Bean and Sweet Potato Tacos (quick and easy!), , , , , Golden Girl Curry, , , , , Footer, , , follow me!, , Stay up on everything HealthyGirl!, , , , contact me, Questions or concerns? Send me an email!, [email protected], , Disclaimer, Privacy Policy, , © 2025 HealthyGirl Kitchen. All Right Reserved., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , Instructions: , , I made mine in the air-fryer! They turned out incredible – I can’t believe they are actually healthy., , , Will my non-vegan friends and family like them?, , The short answer is, YES! These are enjoyed by both vegans and meat-eaters. I dipped mine in ketchup and they seriously brought me back to my childhood. These are so nostalgic. If you are looking for a healthier version of chicken nuggets these are IT. Crispy chicken nuggets are going to be your new favorite vegan lunch or dinner. Make these for your guests – they will love these and be so impressed., , , A few important tips:, , , Feel free to make them, then put them in the fridge or freezer to make later on. If you keep them in the freezer, the cooking time just might take a bit longer!, , Use any bread crumbs you like whether they’re whole wheat, gluten-free, panko or almond., , Serve warm and fresh! Don’t wait to eat them after cooking, they are best when eaten fresh,, , Best served with a mustard dip, ketchup, BBQ sauce or vegan aioli., , , , Share the Love on Social Media, , Pin this amazing, crispy chickpea nuggets recipe, on Pinterest, share the link on Facebook for friends and family to see, or post a picture of your creation on Instagram. Also, be sure to follow me on my new tiktok account, I post a lot of great content on there., , Instagram, : @HealthyGirlKitchen, , TikTok, : @HealthyGirlKitchen, , Facebook, : @HealthyGirlKitchen, , , , , , Crispy Chickpea Nuggets (oil-free), , , Danielle Brown, , , 100% plant-based chickpea chicken nuggets that are oil-free optional, gluten-free optional and vegan. Delicious, easy and fun to make., , , 4.91, from, 20, votes, , , , Print Recipe, , Pin Recipe, , , , , , Prep Time, 20, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 35, minutes, , mins, , , , , , , Course, gluten-free lunch, gluten-free vegan dinner, gluten-free vegan lunch, kids dinner, kids lunch, oil-free dinner, vegan dinner, vegan meal, wfpb dinner, WFPB lunch, Cuisine, Gluten-free Vegan, Healthy Vegan, Oil-free, Plant-based, Vegan, WFPB, , , , , , , , , Drain chickpeas with a bowl under it to save the chickpea liquid or \"aquafaba\". Add chickpeas into the food processor with spices., Pulse the chickpeas, tofu, and spices together then add in the oat flour and 2 tablespoon of chickpea liquid. Pulse until combined. Do not over blender - it should have texture., Make a prep station with a bowl of the breadcrumbs, a bowl with the remaining chickpea liquid and then a plate., Form the mixture into nugget shapes, dipping each one in the chickpea liquid first then the breadcrumbs. Place them all on the plate. You should get about 10-12 nuggets., Serve fresh with ketchup or BBQ sauce and enjoy!, , , , , , , Tried this recipe?, Let us know, how it was!, , In good health,, , Danielle, , , More Recipes, , , , , One Pan Broccoli Cheddar Orzo, , , , , Seedy Bread, , , , , One Pan Taco Casserole, , , , , One Pan Dumplings (15 minute dinner!), Comments, , , , , , Starletta, , says, , , June 25, 2020 at 4:37 pm, , , , Looks great but how many does it make?, , , Reply, , , , , , , , Danielle Keith, , says, , , June 29, 2020 at 8:53 am, , , , 10-12!, , , Reply, , , , , , , , Nicky, , says, , , October 16, 2021 at 3:01 pm, , , , What pack size of tofu are you using? Thanks, , , , , , , , , , , , , Susan, , says, , , July 07, 2020 at 7:42 am, , , , What temperature do you cook them in the air fryer? Would it also be 450?, , , Reply, , , , , , , , Danielle Keith, , says, , , July 08, 2020 at 4:51 pm, , , , 400!, , , Reply, , , , , , , , , , Peter, , says, , , July 07, 2020 at 5:49 pm, , , , Hi Danielle, thanks for this recipe. I am a coeliac and have to adhere to a strict gluten free diet. I would like to try the crispy chickpea nuggets but what is the best substitute for the oat flour ingredient as oats contain the gluten protein and I cannot tolerate them without serious illness., Thanks in advance., Peter, , , Reply, , , , , , , , Danielle Keith, , says, , , July 08, 2020 at 4:51 pm, , , , Get gluten-free oats! They have certified gluten-free oats. If you can’t find that, use chickpea flour., , , Reply, , , , , , , , Laurie, , says, , , March 11, 2021 at 8:30 am, , , , My daughter has severe celiac disease & there are gluten free oats available. Our favorite is bobs red mill. Just toss in your blender or food processor., , , Reply, , , , , , , , , , Nancy Sue, , says, , , July 08, 2020 at 4:50 pm, , , , What a wonderful recipe! These were very crispy in my air-fryer., , , Reply, , , , , , , , Danielle Keith, , says, , , July 08, 2020 at 4:52 pm, , , , I am so glad Nancy Sue! You are so sweet., , , Reply, , , , , , , , , , Ash.irvine, , says, , , July 15, 2020 at 11:48 am, , , , So incredibly easy! I’ll need a double batch for my brood in future but these are amazing! Thanks! I’m loving your recipes!, , , Reply, , , , , , , , Lori B, , says, , , July 16, 2020 at 9:53 pm, , , , These were terrific! Super easy to make too. I baked in the oven because I’m the last person on the planet who doesn’t have an air fryer. Next time I think I’ll toss them in buffalo sauce for a real treat. We love plant-based eating, there are so many wonderful recipes! Thank you!, , , Reply, , , , , , , , Mariana Ferreira da Silva e Sousa, , says, , , August 01, 2020 at 4:02 pm, , , , I can say that I have tried at least 2 recipes of plant-based nuggets and none were so good and so easy to do like this one., I made them in the oven and I was a bit afraid of them to be too dry, but no! They were crispy and very tasty! I will definitely do this one more frequent!, Thank you so much!, , , Reply, , , , , , , , Kathleen, , says, , , August 14, 2020 at 1:22 pm, , , , These are a keeper! My two girls love them! Thank you for an awesome vegan nugget recipe!, , , Reply, , , , , , , , Danielle, , says, , , September 16, 2020 at 6:46 pm, , , , These were so yummy and easy to make! My husband and 2 toddlers enjoyed them. Thanks for the recipe!, , , Reply, , , , , , , , C., , says, , , November 07, 2020 at 5:25 pm, , , , This was really good!  Thanks for the recipe.  I used Special K cereal for the breading…whizzed in the food processor.  It was very crispy!  I have a convection oven.  I did 400 degrees for 20 minutes, turned them and did 10 more. I baked them on a rack with a cookie pan underneath.  That way I did not have to turn them., , , Reply, , , , , , , , C., , says, , , November 07, 2020 at 5:27 pm, , , , This was really good!  Thanks for the recipe.  I used Special K cereal for the breading…whizzed in the food processor.  It was very crispy!  I have a convection oven.  I did 400 degrees for 20 minutes, turned them and did 10 more. I baked them on a rack with a cookie pan underneath.  That way I did not have to turn them.  I hope people give these a try!, , , Reply, , , , , , , , C., , says, , , November 07, 2020 at 5:28 pm, , , , Whoops!  Meant I did not have to flip them!, , , Reply, , , , , , , , , , Charli, , says, , , November 21, 2020 at 7:34 pm, , , , These were delicious!, , , Reply, , , , , , , , Hiss, , says, , , November 30, 2020 at 8:07 pm, , , , The dregrees in which we are going to bake them are in Fahrenheit or Celcius? ☺️, , , Reply, , , , , , , , Danielle Keith, , says, , , December 02, 2020 at 3:38 pm, , , , Farenheit!, , , Reply, , , , , , , , , , Dara, , says, , , December 30, 2020 at 11:29 am, , , , I am allergic to oats 🙁 would almond or gluten free flour work instead ?, , , Reply, , , , , , , , Danielle Keith, , says, , , December 30, 2020 at 3:25 pm, , , , yes!, , , Reply, , , , , , , , , , Julie, , says, , , January 05, 2021 at 2:20 pm, , , , Oh! These are so good! I made them with 1 3/4 c chickpeas I soaked and cooked myself (in case anyone is wondering about the 15oz can equivalent), and breaded them with tortilla chips (bc I had a stupid number of partial tortilla chip bags in my pantry that I ground in the food processor and use for breading now). So delicious and stupid easy to make. A go to recipe for me now., , , Reply, , , , , , , , Naomi, , says, , , February 20, 2021 at 2:16 pm, , , , WOW! Amazing recipe. We all love them including my toddler. 🙂, , , Reply, , , , , , , , Deanna Guerrero, , says, , , March 26, 2021 at 10:16 pm, , , , I love these so much and my husband seriously thought they were chicken😛, Do you have nutritional info on these?, , , Reply, , , , , , , , Jodi Erhardt, , says, , , April 14, 2021 at 8:29 am, , , , These look awesome! Can’t wait to try them with my kiddo! Is there a way to increase the protein level?, , , Reply, , , , , , , , Danielle Keith, , says, , , April 20, 2021 at 2:24 pm, , , , They’re already packed with protein! Try out my tofu tenders for more protein though., , , Reply, , , , , , , , , , Eli G, , says, , , April 20, 2021 at 10:01 pm, , , , literally so delicious! i was so skeptical of them but when i tasted them I was in awe. I did add other spices like paprika and chili powder. i also just sprayed them slightly with olive oil. This recipe is definitely a keeper!!! I ended up forming 16 nuggets. AMAZING RECIPE! *chefs kiss* *muah*, , , Reply, , , , , , , , Annie, , says, , , October 03, 2021 at 2:27 am, , , , Wonder if I could do this with dry (soaked) chickpeas!, , , Reply, , , , , , , , Denise, , says, , , October 04, 2021 at 4:05 pm, , , , Can I do these without the tofu?, , , Reply, , , , , , , , Sunshine, , says, , , April 15, 2022 at 12:51 pm, , , , We are trying to go plant based and I was shocked my picky kids who refuse to try hummus or chickpeas actually loved these! Next time I will use a little more salt and spices. I think adding the spices to the breadcrumbs will be good too! I airfried mine at 370 for 15 min., , , Reply, , , , , , , , Birt, , says, , , February 11, 2023 at 7:09 pm, , , , I should have done as you suggested. 400 degrees was too much in our air fryer., , , Reply, , , , , , , , , , Amber, , says, , , January 01, 2023 at 5:52 pm, , , , Hello, would I be able to substitute the breadcrumbs with arrowroot powder?, , , Reply, , , , , , , , Taylor From HealthyGirl Kitchen, , says, , , August 26, 2024 at 5:39 pm, , , , The breadcrumbs give it a crispy outer layer., , , Reply, , , , , , , , , , Jenn, , says, , , January 03, 2023 at 9:50 pm, , , , These look amazing! I can’t have soy, so I make my own red lentil tofu. How much is 1/3 of a regular tofu block?, , , Reply, , , , , , , , Taylor From HealthyGirl Kitchen, , says, , , August 26, 2024 at 5:37 pm, , , , Some stores now carry a soy free tofu or even a chickpea tofu!, , , Reply, , , , , , , , , , Julie Larson, , says, , , January 09, 2023 at 12:00 pm, , , , , , Reply, , , , , , , , Taylor From HealthyGirl Kitchen, , says, , , August 26, 2024 at 5:37 pm, , , , Pressing it will help make it crispier because you are taking the liquid out of it., , , Reply, , , , , , , , , , Barbara Ernst, , says, , , February 19, 2023 at 8:56 pm, , , , Any substitution for tofu? Or can it be omitted? Thanks, , , Reply, , , , , , , , Danielle Brown, , says, , , March 24, 2023 at 4:50 pm, , , , Add more chickpeas!, , , Reply, , , , , , , , , , jasmine Pender, , says, , , May 08, 2023 at 8:31 am, , , , What can I use besides tofu, , , Reply, , , , , , , , Taylor From HealthyGirl Kitchen, , says, , , August 26, 2024 at 3:26 pm, , , , The tofu is what helps keep the nuggets firm, , , Reply, , , , , , , , , , Kiera, , says, , , July 30, 2023 at 4:46 pm, , , , These are so good and easy to make! I used the air fryer and did add some oregano and black pepper to the seasoning mix while omitting the garlic powder and it didn’t disappoint. The texture and crunchiness and flavor profile is spot on and my toddlers loved every bite! Definitely adding to my lunch list., , , Reply, , , , , , , , Mj, , says, , , August 25, 2023 at 2:26 pm, , , , Danielle, this recipe sounds amazing. I’m wondering though, the dialog says soy free and makes no mention of tofu, however the written recipe says to add 1/3 block of tofu.  Which is correct?  Thanks, I can not wait to make these and stop buying the expensive, processed fake chicken  nuggets., , , Reply, , , , , , , , Danielle Brown, , says, , , August 28, 2023 at 7:19 am, , , , Hi MJ! Great catch! This recipe was updated and tofu was added., , , Reply, , , , , , , , , , Wendy, , says, , , January 30, 2024 at 2:03 pm, , , , How big is each nugget?, , , Reply, , , , , , , , Taylor From HealthyGirl Kitchen, , says, , , August 26, 2024 at 12:56 pm, , , , The same size as a standard nugget. I would say about 2in long., , , Reply, , , , , , , , , , Summer, , says, , , September 19, 2024 at 11:31 pm, , , , My family is a mix of plant-based and meat eaters. Since I found this recipe, I’ve been making it in batches, and I always have to make more because everyone loves it. Even my youngest sister, who is a very picky eater and usually doesn’t like plant-based foods, keeps asking me to make more. I’m really happy to have a healthy alternative that everyone in the family can enjoy. Thank you!, , , Reply, , , , , , , , Jenn, , says, , , December 06, 2024 at 9:52 pm, , , , Hi! I’d like to make these but it’s not clear — should we cook them if we’re going to keep them in the fridge or freezer? Or should we just shape them without cooking?, , , Reply, , , , , , , , Taylor From HealthyGirl Kitchen, , says, , , December 15, 2024 at 1:56 pm, , , , You can cook them and then reheat them by baking or air frying., , , Reply, , , , , , Trackbacks, , , , , , How to Transition to a Plant-Based Diet Without the Stress -, , says:, , , , April 18, 2021 at 9:29 am, , , , , […] Crispy Chickpea Nuggets […], , , Reply, , , , , , , , 21 Easy Vegan Chickpea Recipes For Meal Prep | Healthy Recipes, , says:, , , , May 26, 2021 at 11:48 am, , , , , […] Chickpea nuggets are plant-based, gluten-free",
        "Chickpea Veggie Nuggets": "Ingredients: , 1x, 2x, 3x, ▢, 15, , ounces, , , , canned chickpeas, , , drained and rinsed, ▢, ½, , cup, , , , grated zucchini, ▢, ½, , cup, , , , grated carrot, ▢, ¼, , cup, , , , minced onion, ▢, ½, , Tablespoon, , , , Italian seasoning, ▢, 1, , teaspoon, , , , sea salt, ▢, 1-2, , cloves, , , , garlic, , , to taste or sub 1/2 tsp garlic powder, ▢, , , black pepper to taste, ▢, ¼, , teaspoon, , , , paprika, ▢, 2, , large, , , , eggs, ▢, 1, , teaspoon, , , , olive or avocado oil, , , +extra for cooking, ▢, ½, , cup, , , , oat flour or your favorite breadcrumbs, , Equipment, ▢, food processor, ▢, small cookie scoop, ▢, large pan, , DO NOT OVER MIX., Mixture should be wet but scoopable. See photo in post for reference., Heat cooking oil in a large pan over medium high heat., Using a heaping tablespoon or a small cookie scoop, portion out the mixture into the pan. Cook nuggets 3-5 minutes and flip, using the back of your spatula to gently flatten them a bit. Cook an additional 3-5 minutes or until outside of the nugget has a slightly golden color., Enjoy warm and with your favorite dipping sauce. Allow leftovers to cool completely and store in an air-tight container in fridge for 4-5 days, , , Notes, , , , Many readers have successful made these nuggets with, flax eggs for a vegan option., , Readers have shared that these, nuggets work in the air fryer too, .  Cook at 400℉ in your air fryer for about 12 minutes flipping half way through., , , Serving:, 4, nuggets, , , Calories:, 173, kcal, , , Carbohydrates:, 22, g, , , Protein:, 9, g, , , Fat:, 6, g, , , Saturated Fat:, 1, g, , , Polyunsaturated Fat:, 2, g, , , Monounsaturated Fat:, 2, g, , , Trans Fat:, 0.01, g, , , Cholesterol:, 74, mg, , , Sodium:, 743, mg, , , Potassium:, 289, mg, , , Fiber:, 5, g, , , Sugar:, 1, g, , , Vitamin A:, 2300, IU, , , Vitamin C:, 4, mg, , , Calcium:, 65, mg, , , Iron:, 2, mg, , , , , , , , , , , , , , , , , , , , , , Dinner, , Meal Prep, , Vegetarian, , Carrot, , Zucchini, , , , originally published on, Jan 28, 2020, (last updated, Jan 11, 2025, ), , , , 246 comments, , , Leave a comment », , , , , , , , , « Previous Post, Oat Flour Beet Brownies (egg-free), , Next Post », , How To Store Spinach (so it stays fresh all week!), , , , , , , 4.93 from 134 votes (, 73 ratings without comment, ), , , , Leave a comment & rate this recipe, Cancel reply, Did you make this recipe? So good, right? It would mean the world to me if you left a comment and star rating so that more people can see how delicious veggie-loading can be. Plus, it helps me to see what recipes you are all loving so I can make more like them., , Thanks for taking the time to share your feedback., Comment, *, , , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , Notify me if Taesha replies to my comment, , , , , Δ, , , Comments, , 246 comments on “Chickpea Vegetable Nuggets”, , Leave a comment », , , , , , , Lucelia Pretorius, —, February 19, 2024 @ 11:55 pm, , Reply, , , This will forever be one of my favorite recipes. I always come back to this recipe and i have had it for years. Best one out there!!!, , , , , , , , Taesha Butler, —, February 20, 2024 @ 8:46 am, , Reply, , , What a beautiful compliment, Lucelia! I’m so glad you enjoy it so much!, , , , , , , , , , Maddie, —, March 9, 2024 @ 2:57 pm, , Reply, , , I made these in the air fryer and they turned out so great! Did about 4-5 min per side, my nuggets were on the larger side. Used almond flour and coconut oil as substitutes as well. My 1 year old loved them and so did I! Thank you for the great recipe., , , , , , , , Taesha Butler, —, March 10, 2024 @ 9:10 am, , Reply, , , So happy you enjoyed these so much, Maddie!, , , , , , , , , , Kesha Dickens, —, March 24, 2024 @ 6:47 pm, , Reply, , , No bread crumbs and only quick oats available. Grounded up 1/2 cups. Only had frozen carrots used one cup. No eggs used flax seed and water. Fried in skillet itptheyvare started flaking. Decided to try air fryer made fore the perfect consistency loved lit, , , , , , , , Taesha Butler, —, March 25, 2024 @ 6:51 am, , Reply, , , Love your modifications + appreciate you sharing that they were a success, Kesha! Readers are always looking for ways to tweak these, so many will find this helpful! And so glad you enjoyed them. Thanks for taking the time to leave a review!, , , , , , , , , , Hailey, —, April 19, 2024 @ 9:50 pm, , Reply, , , So I actually subbed the vegetables for 1 cup of  peas (was all I had lol) & it worked still! I pan fried a few but then put the rest in the air fryer for 15 min at 400 degrees, flipping halfway., , , , , , , , Taesha Butler, —, April 21, 2024 @ 12:48 pm, , Reply, , , Oh I love that swap, Hailey! Thanks for sharing that it works!, , , , , , , , , , Jess, —, April 20, 2024 @ 6:44 pm, , Reply, , , and eyeballed how much to increase breadcrumbs as a result).  I hand-shredded the carrot and zucchini (and squeezed out water by hand) but used a food processor to blend the chickpeas and eggs before combining all.  My mix was fairly wet (1/4C worked great as a scoop, and then I shaped/flattened them) and highly recommend baking because it’s so hands-off!  (My oven cooks fast but 400-425 for 20ish min for me)., , , , , , , , Taesha Butler, —, April 21, 2024 @ 12:50 pm, , Reply, , , So glad you love these so much, Jess! And thanks for sharing your tweaks, especially the baking tips! I know many readers prefer to pop these in the oven!, , , , , , , , , , Anya, —, May 4, 2024 @ 8:12 pm, , Reply, , , Hi. It looks so delicious. Can I replace the eggs with vegan eggs? ( flaxseed). Thank you, , , , , , , , Taesha Butler, —, May 5, 2024 @ 9:30 am, , Reply, , , Hi Anya! I haven’t tried to replace the egg in this myself but I know other readers have subbed in different egg replacements with success!, , , , , , , , , , Daniella, —, May 13, 2024 @ 7:02 pm, , Reply, , , Do we think they’re able to go into the oven?, They’re super yummy the ones I did fry!, Thank you!, , , , , , , , Taesha Butler, —, May 14, 2024 @ 8:47 am, , Reply, , , Hi Daniella! I haven’t tried baking these myself but I know many readers have and have shared their experiences in the comments!, , , , , , , , , , Michele, —, July 9, 2024 @ 11:27 pm, , Reply, , , These are delicious. However, I did make them using flax eggs and I added a bit more water. I cooked them in my air fryer at 400 for about 12 minutes flipping half way through. My 10 year old granddaughter said “Now we don’t have to go to McDonalds anymore!” That tells you something about how good they are. Thank you for sharing your recipe., , , , , , , , Taesha Butler, —, July 10, 2024 @ 6:57 am, , Reply, , , That does indeed say something! I’m so glad these were such a hit, Michele!, , , , , , , , , , Nus, —, August 17, 2024 @ 4:29 pm, , Reply, , , Thank you so much for this recipe! I have to eat vegetarian because of dietary restrictions and I couldn’t justify getting vegan chicken nuggets because of the price and additives. I really wanted a replacement for meal prep that could accommodate my busy days and this fit the bill!, , I ended up doubling the recipe, used only carrot and regular breadcrumbs, added an extra egg, and adjusted the spices to my liking., , While these aren’t an exact replacement for those vegan nuggets, they served the same purpose, got me a good dose of protein and veggies without the harmful additives, and will get me through at least 15 meals!, , , , , , , , Taesha Butler, —, August 18, 2024 @ 2:54 pm, , Reply, , , So glad these hit the spot and fulfilled that need for you, Nus!, , , , , , , , , , Jenna, —, September 14, 2024 @ 12:13 pm, , Reply, , , Best veggie nugget recipe I’ve come across, taste and texture pretty similar to regular chicken nuggets. Highly recommended giving a try!, , , , , , , , Taesha Butler, —, September 15, 2024 @ 1:23 pm, , Reply, , , So glad you enjoyed them, Jenna!, , , , , , , , , , P, —, November 13, 2024 @ 1:52 pm, , Reply, , , Can’t wait to try them! Will they freeze and if yes, at what stage should I freeze them please?, Thank you!, , , , , , , , Taesha Butler, —, November 14, 2024 @ 7:00 am, , Reply, , , They freeze well after cooking!, , , , , , , , , , Leigh, —, January 3, 2025 @ 11:10 am, , Reply, , , What would be a good substitute for the zucchini?  In my home there is an allergy to zucchini, squash, cucumber, and some other things., , , , , , , , Taesha Butler, —, January 3, 2025 @ 1:49 pm, , Reply, , , More carrots would work!, , , , , , , , Leigh, —, January 3, 2025 @ 3:09 pm, , Reply, , , Thanks!, , , , , , , , , , , , Vikki, —, March 6, 2025 @ 8:18 am, , Reply, , , Did anybody else who did not use eggs just taste like flattened falafel? I loved mine honestly because I love falafel but I’m wondering if the egg changes the consistency. I used the aquafaba instead of the eggs. These were fun to make and to see how they came out. I like them a lot., , , , , , , , Claire Langlois, —, March 13, 2025 @ 2:28 pm, , Reply, , , 😋 Delicious and it will  be a go to recipe for frozen meal to bring on our camping trips. Using a cookie spoon, spraying with olive oil and baked them in the air fryer  for 10 minutes turning them at the 8 minute. I spiced them with cumin, corriander, oregano and plus S&P and paprika.  I also made one batch with almond flour, green peas to replace zucchini and had basil. I used robot. They came out crispy outside, soft inside and perfect mouthful of healty food., , , , , , , , Andrea, —, March 22, 2025 @ 5:42 am, , Reply, , , These are Legit Amazing!!, Since you’ve already got the food processor out it’s so easy to just blend some oats first (I never bother buying oat flour!), I was surprised that something so healthy could be so delicious!!, Thanks 🙏🥰, , , , , , , , Taesha Butler, —, March 22, 2025 @ 7:23 am, , Reply, , , Yay!!! Music to my ears! I’m so glad you enjoyed them so much!, , , , , , , , , « Older Comments, , 1, , 2, , 3, , , , , , , , , , , , , Hi, I’m Taesha!, , Hi! I’m Taesha! I help busy people fall in love with healthy eating with my simple, family-friendly, veggie-loaded recipes. I believe vegetables can and SHOULD be delicious. Here, let me show you how!, , More About Me, , , , , , , Subscribe Now, get, new recipes, via email:, , Never miss a new veggie-loaded recipe or natural living rambling., , , , , , , Subscribe Now, , , , , , Reader Favorites, , , , , , Perfectly Roasted Yukon Gold Potatoes, , , , , , , Healthy Morning Glory Breakfast Muffins, , , , , , , 35 Minute Ground Turkey & Sweet Potato Taco Skillet, , , , , , , Fudgy Peanut Butter Sweet Potato Brownies, , , , , Search Recipes, , , , Submit, , , Categories, Categories, , Select Category, , Air Fryer, , Breakfast, , Cooking How To’s, , Dairy-Free, , Desserts, , Dinner, , Dips, Sauces & Spreads, , Food For Thought, , Gluten-Free, , Grain Free, , Instant Pot, , Meal Prep, , Muffins, , No Cook, , Nut-Free, , Oatmeal, , Paleo, , Pancakes & Waffles, , Recipe Roundups, , Recipes, , Roasted, , Salads, , Side Dishes, , Slow Cooker, , Smoothies & Drinks, , Snacks, , Soups, , The Healthy Family, , Uncategorized, , Vegan, , Vegetarian, , Whole30, , , , , , , , , , , Veggie-Loaded Dinners, , , Tortellini soup with mixed veggies, , Ground turkey and sweet potato skillet, , Slow cooker vegetable chicken stew, , Turkey meatloaf with added veggies, , Creamy pasta with broccoli, , Spinach mac and cheese, , Chicken broccoli rice casserole, , Unstuffed cabbage soup with beef, , , , Seasonal Staples, , , , Baked sweet potatoes, , , , Instant pot sweet potatoes, , , , Mashed butternut squash, , , , Kabocha squash soup, , , , Roasted yukon gold potatoes, , , , Zucchini and corn fritters, , , , Corn potato chowder, , , , Veggie-packed vegetarian stuffing, , , , , Popular Breakfast Recipes, , , , Morning glory breakfast muffins, , , , Blender banana pancakes, , , , Classic overnight oats with rolled oats, , , , Carrot cake quick bread, , , , Vegetarian breakfast casserole, , , , Mango pineapple smoothie, , , , Blueberry spinach smoothie, , , , Pumpkin baked oatmeal, , , , , , , , , , , , get, new recipes, via email:, , , , , , , , , , , , , , , , , ^ Back to Top, , Home, , About me…, , Recipes, , Subscribe, , Contact, , Editorial Policies, , Legal & Privacy, , , , ©2025 The Natural Nurturer., Design by, Purr, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , , , , , Air Fryer, , Instant Pot, , Meal Prep, , No Cook, , Roasted, , Slow Cooker, , , , Recipes by Vegetable, , Recipe Search, , Recipe Index, , Recipe Stories, , , , Food For Thought, , Shop, , , , , , Ebooks and Meal Plans, , Recommended Products, , , , Subscribe, , , , , , , , , , , , , , , , , , , , , , Submit, , , , , , , , Home, , Info, , , About me…, , Subscribe, , Contact, , , , Recipes, , , Recipes by Type, , , Breakfast, , , Muffins, , Oatmeal, , Pancakes & Waffles, , , , Desserts, , Dinner, , Dips, Sauces & Spreads, , How To, , Salads, , Side Dishes, , Smoothies & Drinks, , Snacks, , Soups, , , , Recipes by Diet, , , Dairy-Free, , Gluten-Free, , Grain Free, , Nut-Free, , Paleo, , Vegan, , Vegetarian, , Whole30, , , , , , Air Fryer, , Instant Pot, , Meal Prep, , No Cook, , Roasted, , Slow Cooker, , , , Recipes by Vegetable, , Recipe Search, , Recipe Index, , Recipe Stories, , , , Food For Thought, , Shop, , , Ebooks and Meal Plans, , Recommended Products, , , , Subscribe, , , , , , , , , , Home, », Recipes, », Dinner, », Chickpea Vegetable Nuggets, , Chickpea Vegetable Nuggets, , , by, , Taesha Butler, , on, Jan 28, 2020, (updated, Jan 11, 2025, ), , Jump to Recipe, , 4.93, from, 134, votes, , , , , , These Chickpea Vegetable Nuggets are the perfect finger food for little eaters! Loaded with veggies and vegetarian protein! Easy to make and super delicious, enjoy these vegetable nuggets on their own, instead of meatballs, or dunk them in your favorite sauce!, , , Nuggets are a beloved finger food of childhood.  Heck, they are a beloved finger food of adulthood, too!, , Maybe it’s because you don’t need a fork to eat them. Or maybe because they are so dunkable in whatever sauce I have on hand. Or it really could be because nuggets have a way of being an easy addition to any meal and kiddos instantly get excited to see them on their plate., , And while there is a time and place for the occasional dino-nugget from the freezer section of the grocery store, I honestly prefer to make my own nuggets so that I can fill them with vegetables (like I do) and since they are so easy to make, nuggets make for an easy weeknight dinner., , , , , , , , , These Chickpea Veggie Nuggets are a vegetarian twist on my super popular, Veggie-Loaded Chicken Bites., These vegetable nuggets are perfect for a lunch box or to make quickly on a crazy busy Tuesday night after soccer practice. Or to just keep on hand in place of those dino-nuggets for a healthier, veggie-loaded dinner option for when life is…..well life and crazy!, , , , , , , , , , The Veggie Loaded Roadmap, , Find the recipes + tips to help you eat more veggies with my free ebook., , , , Sign Up, , , , Why these vegetarian nuggets are awesome!, , , Bite-sized!, Don’t ask me why, but little finger foods are always fun to eat and typically a mega hit with kids AND adults. So these nuggets are not only delicious and healthy, but just plain fun to eat., , They are like easy, mini falafels., Yum!, , A fun way to get extra veggies in!, Great for kids (or adults) who might be feeling a little iffy about veggies at the moment. Or maybe you are like me and just like to add extra veggies in whenever possible., , A great recipe for chickpea newbies., If you are trying to add more beans into your diet, but maybe you or a family member is feeling a bit iffy about them, this recipe is a great meal to make. The flavors and texture are on point!, , , To make these Chickpea Veggie Nuggets, I used…., , , chickpeas, cooked and drained, , grated zucchini, , grated carrot, , minced onion, , Italian seasoning, , sea salt, , garlic, , black pepper, , paprika, , eggs (see below about making these egg-free), , olive or avocado oil, , oat flour or your favorite breadcrumbs, , , What to serve with these Chickpea Vegetable Nuggets, , Whatever way you normally eat or dip your nuggets in will probably work with these vegetable nuggets, too! But for a little serving inspiration, this is how we love ’em., , , Ranch dressing, , sugar-free or, homemade ketchup, , honey mustard sauce, , in place of meatballs with your favorite pasta and, sauce, , with, roasted fingerling potatoes, (with ketchup for some fry-vibes), , mashed, potatoes & cauliflower, , with, butternut squash vegan cheese sauce, , on their own!, , , , Can I make these Chickpea Vegetable Nuggets without eggs?, , This is a frequently asked question from readers! The eggs in this recipe work as a binding agent that hold these nuggets together. Basically, they are the glue, so I don’t recommend skipping them., , Some readers have made these nuggets with “, flax eggs, ”  and were successful in using this egg-free binding agent. However, others (including myself) have not found this to be a successful egg substitute. I have found the nuggets to hold together some, but generally crumble easily., , Don’t get me wrong, these Chickpea Vegetable Nuggets still taste great when made egg-free, but the consistency and end result is quite different. So just a heads up if you opt to go that route when making them., , And I will keep experimenting in trying to find an awesome egg-free alternative for you all!, , , Suggested adaptations, , One thing I feel super passionate about is helping make recipes their own! Here are a few tips and tricks for adapting these vegetarian nuggets to fit your life and what you have in your kitchen!, , , Use all zucchini or all carrot., If you don’t have both on hand, no worries, just use more of whatever you have!, , Use whatever breadcrumbs you have on hand., If oat flour is not your thing or you don’t have some on hand, just use whatever breadcrumbs your family enjoys., , Freeze them., Cook these nugget up a head of time, let them cool and freeze them! I like to toss them in my toaster oven to warm up for a quick and healthy dinner option when life gets busy., , Jazz up the flavors!, We all have different taste preferences, so feel free to add more garlic, salt, pepper or even some spice if that is what your family enjoys! Chickpeas are a pretty blank slate, so you can really get creative with how to make these a family favorite!, , , , , , , , 4.93, from, 134, votes, , Chickpea Vegetable Nuggets, , , Yield:, 5, , servings, , Prep Time:, 10, minutes, , mins, Cook Time:, 20, minutes, , mins, , Cuisine:, American, Course:, Main Course, Author:, Taesha Butler, , , These Chickpea Vegetable Nuggets are the perfect finger food for little eaters! Loaded with veggies and vegetarian protein! Easy to make and super delicious, enjoy these vegetable nuggets on their own, instead of meatballs, or dunk them in your favorite sauce!, , , Print Recipe, , Pin Recipe, , Leave a Review, , , , Cook Mode, Prevent your screen from going dark, , , , Place shredded zucchini and carrots in the middle of a clean dish towel or large piece of paper towel. Wrap them up and squeeze a few times to help drain out some of the moisture., In your food processor",
        "Crispy Chickpeas": "Ingredients: , Important, – We use affiliate links to recommend products. Please read our Privacy Policy for more information., , Since this recipe calls for just 1 main star ingredient, it is a stupendously easy recipe., , , 15.5 ounce can of CHICKPEAS, , low sodium, , Oil Spray, or you can use this, OIL SPRAYER BOTTLE, , Spices Used, –, Cayenne Pepper, , , Cumin Powder, , , Granulated Salt, , , Kitchen Gadgets Used in making Crispy & Spicy Chickpeas Snack, , , Kitchen Colander, , Cuisinart Air Fryer, ( has great reviews) or, Mealthy CrispLid, , Spoon, to Stir, , , How to make Crispy Chickpeas in Air Fryer?, , It is a pretty easy process to make Crunchy Spicy Chickpeas in the Air Fryer. I have made these in my Philips Air fryer and made another batch in Mealthy CrispLid. Both of these worked really great., , , Drain the chickpeas from the can and wash them under running water. Keep them aside for a few minutes till water is drained completely., , Place the Air-Fryer on the Kitchen counter. Plug it in. Spread out the Chickpeas on the Air fryer basket. Place it inside the air-fryer., , Set the temperature at 390*F/200*C for 20 minutes., , Prepare the seasoning in a bowl. Set aside., , After 5-7 minutes, take out the basket. The chickpeas are somewhat dry at this point. Spray the chickpeas with oil and sprinkle 1/3rd of the seasoning on it. Stir with a spoon. Place the basket back in the air-fryer. Take out the basket every 5 minutes and give a good shake., , It should take somewhere from 15-20 minutes for Chickpeas to crisp up. It depends upon the outside weather and the kind of chickpeas you have used as well. Check at 15 minutes for the doneness. Mine were super crisp at 20 minutes exact. Therefore keep an eye., , Once these are crisp to your desired liking, take these out and toss them with the rest of the seasoning. You may adjust the spice and salt level to your personal liking too. More suggestions will be made in the post below., , , Crispy Spicy Chickpeas in Air Fryer, , Simply vegetarian Air Fryer Recipes, , Air fryer Nuts, , , Air fryer Bread Roll, , , Air Fryer Sabudana Wada, , , Air Fryer Eggplants, , and more., , Save 60% on select product(s) with promo code 60DNXKR3 on Amazon.com, , Vegan Instant Pot Recipes from the blog, , Red Thai Curry, , , Saag Aloo, , , Chana Masala, , , Red Kidney Beans Curry, , , Taco Soup, , and more., , Save 25% on select product(s) with promo code 25VN7IX4 on Amazon.com, , Crispy Air Fryer Chickpeas Recipe, , , , , , Print, , Pin, , 3.66, from, 47, votes, , , Vegan Air Fryer Chickpeas - Crispy & Spicy, , , 1, , can, , of 15.5 ounce Chickpeas, , low sodium or no salt, 1/4, , tsp, , Cayenne pepper powder, 1/4, , tsp, , Cumin powder, 1, , tsp, , Salt, Few, , Sprays, , of Cooking Oil or Olive Oil, , , , , , , , , Kevin, , says:, , , , September 17, 2019 at 12:00 am, , , , , , , , I was scanning the answer for, air fryer, recipe consequently. I discovered your blog exceptionally accommodating., , , Reply, , , , , , , , Dahn, , says:, , , , September 4, 2019 at 7:22 pm, , , , , , , , Crispy chickpeas make wonderful snacks and I never have to feel guilty when I eat them late at night. I like the spicy flavors in yours, , , Reply, , , , , , , , Tisha, , says:, , , , September 4, 2019 at 6:58 pm, , , , , , , , Chick peas always make such a great snack!  This really makes them so crispy and perfect!, , , Reply, , , , , , , , Patty at Spoonabilities, , says:, , , , September 4, 2019 at 6:37 pm, , , , , , , , These definitely look soooo addicting! I’ve got to try these!, , , Reply, , , , , , , , Alexandra, , says:, , , , September 4, 2019 at 6:07 pm, , , , , , , , What an awesome recipe – this is so easy but so delicious! A great use for the air fryer 🙂 And good luck to all in the competition!, , , Reply, , , , , , , , plant.well, , says:, , , , September 4, 2019 at 4:48 pm, , , , , , , , Oh I’ve been looking for a recipe like this for so long! Seems like such a yummy, healthy snack, thanks for sharing!, , , Reply, , , , , , , , Vaishali Menon, , says:, , , , August 31, 2019 at 6:18 am, , , , , Thanks Sonal for air dryer recipe collection. Was looking for these from.a reliable.aource and who else but you… muaah., , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , August 31, 2019 at 6:29 am, , , , , Hugs  Vaishali, , , Reply, , , , , , , , , , Sandhya Nadkarni, , says:, , , , August 30, 2019 at 5:27 pm, , , , , , , , Would love to win the mealthy crisp lid! Looks awesome!, , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , August 31, 2019 at 6:29 am, , , , , Yayyy, , , Reply, , , , , , , , , , , , , , Top Posts, , , , , , , , , , Easy Chocolate Cheesecake in a Jar, , , , , , , , , , , , , , Gujiya Pinwheels Puff Pastry Recipe, , , , , , , , , , , , , , Rabdi Gulabjamun Cups No Cook Recipe, , , , , , , , , , , , , , Air Fryer Puff Pastry Pizza Recipe, , , , , , , HELLO!! THANKS FOR BEING HERE!, , , , I am a born & raised Indian, now living in USA since last 20 years. Raising 2 beautiful girls and a puppy with my amazing husband., Read More About Sonal, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Copyright © 2025 • Simply Vegetarian 777 • All Rights Reserved •, Privacy Policy, , , , , , , , , , , , , , Scroll to top, , Scroll to top, , , , , , , , , , , , , , , , Home, , About, , Recipe Index, , Contact, , Subscribe, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , Instructions: , , , Course, Appetizer, , Cuisine, American, , Keyword, chickpeas curry, crispy chickpeas, Mealthy Crisp Lid, spicy chickpeas recipe, Vegan Air Fryer Chickpeas, , , , Prep Time, 5, minutes, , minutes, , Cook Time, 20, minutes, , minutes, , , , Servings, 4, , , Author, simplyvegetarian777, , Equipment, Air Fryer, Kitchen Colander, , Drain the, chickpeas, in a, colander, from the can and wash them under running water. Keep them aside for a few minutes till water is drained completely., , Place the, Air-Fryer, on the Kitchen counter. Plug it in. Spread out the Chickpeas on the Air fryer basket. Place it inside the air-fryer., , Set the temperature at 390*F/200*C for 20 minutes., , Prepare the seasoning of, cayenne pepper, , , cumin powder, , , granulated salt, in a bowl. Set aside., After 5-7 minutes, take out the basket. The chickpeas are somewhat dry at this point. Spray the chickpeas with oil using either a, Pam Spray, or, Oil Spraying Bottle, . And sprinkle 1/3rd of the seasoning on it. Stir with a spoon. Place the basket back in the air-fryer. Take out the basket every 5 minutes and give a good shake., It should take somewhere from 15-20 minutes for Chickpeas to crisp up. It depends upon the outside weather and the kind of chickpeas you have used as well. Check at 15 minutes for the doneness. Mine were super crisp at 20 minutes exact. Therefore keep an eye., , Once these are crisp to your desired liking, take these out and toss them with the rest of the seasoning. You may adjust the spice and salt level to your personal liking too., Making Crispy Chickpeas in Instant Pot Air Fryer Lid &, Mealthy CrispLid, Place the 6 quarts Instant Pot on the kitchen counter and place the inner pot inside. Now place the trivet and basket inside the Inner pot., , Spread out the drained chickpeas on the basket evenly. Place the Air fryer lid or, Mealthy CrispLid, on top of your Instant Pot and plug it in. Set the handle of the Crisp Lid down in order to start it. If the handle is up straight, it won't start., , Set the temperature to 400*F/200*C and timer to 20 minutes. Watch the video., After 5-7 minutes, remove the lid and place it on its silicon mat. The chickpeas are somewhat dry at this point. Spray the chickpeas with oil using either a, Pam Spray, or, Oil Spraying Bottle, . And sprinkle 1/3rd of the seasoning on it. Stir with a spoon. Place the lid back on top of the instant pot. Remove the lid every 5 minutes and stir with a spoon., This should be done in 15-20 minutes depending upon the kind/brand of chickpeas used. Check at 15 minutes for the crispness. Mine were almost done at 15 minutes. For the last 3 minutes, I increased the temperature of the Mealthy Crisp Lid to 425*F for that perfect crispness., Once done, take them out in a bowl and season with the rest of the seasoning. You may adjust the salt and spice to your liking., Crispy Chickpeas in the Oven, Preheat the oven at 400*F/200*C. Spread out the drained chickpeas on a cookie baking tray. Bake them in the oven for about 5-7 minutes. Take out the tray, spray with some oil and sprinkle some seasoning. Toss well. Spread it out again evenly. Bake for about 25-30 minutes in total till they are done crispy to your liking., Seasoning Options, 1. I have used Cayenne & Cumin to season mine. Other options are -, 2. Use Jerk Seasoning, 3. Cool Ranch seasoning, 4. Lime & Honey, 5. Spicy Buffalo, 6. Indian Curry Seasoning and so much more, How to Store Crispy Air Fryer Chickpeas?, Once at the room temperature, store them in an airtight container in the pantry. They survive well in a closed container., How to Use Crispy Chickpeas in a Recipe, 1. Eat these as a protein and fiber-rich snack., 2. Top your salads with these to add more textures., 3. Add some onions, tomatoes and a dash of lime to these and your delicious mini salad is ready., 4. Take them as a hostess gift to a party., Can I double the recipe?, Yes, you can. If you have a small air fryer, you might have to make it in 2 batches. For a larger air fryer, you probably can make it in 1 go., You can do the double batch in 1 go in a Mealthy Crisp Lid and Oven., Can I make these Crispy Chickpeas in Instant Pot Air Fryer Lid or Vortex?, Yes you can. Spread out the Chickpeas on the Air fryer basket. Set the temperature at 390*F/200*C for 20 minutes. Prepare the seasoning of, cayenne pepper, ,, cumin powder, ,, granulated salt, in a bowl. Set aside., After 5-7 minutes, take out the basket. The chickpeas are somewhat dry at this point. Spray the chickpeas with oil using either a, Pam Spray, or, Oil Spraying Bottle, . And sprinkle 1/3rd of the seasoning on it. Stir with a spoon. Place the basket back in the air-fryer. Take out the basket every 5 minutes and give a good shake., It should take somewhere from 15-20 minutes for Chickpeas to crisp up. It depends upon the outside weather and the kind of chickpeas you have used as well. Check at 15 minutes for the doneness. Mine were super crisp at 20 minutes exact. Therefore keep an eye., Once these are crisp to your desired liking, take these out and toss them with the rest of the seasoning. You may adjust the spice and salt level to your personal liking too., , Video, , , , , , You can follow us on, Facebook, ,, Instagram, ,, Pinterest, &, Twitter, for regular updates. And don’t forget to sign up for our E-Letter whenever we publish a new post., , I am sure you are going to try this recipe soon. Please share your feedback in the comments section if you try it., , In my kitchen, you will always EAT HAPPY & STAY HAPPY., , Sonal, , , , , Related, , , , , , , , 3.66 from 47 votes (, 37 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, , Email, , , , Notify me of follow-up comments by email., , Notify me of new posts by email., , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 21 Comments, , , , , , , shweta, , says:, , , , May 11, 2022 at 2:25 am, , , , , , , , Awesome recipe, I’m going to try it now, , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , May 19, 2022 at 6:27 am, , , , , Thanks, , , Reply, , , , , , , , , , Shrutikirti, , says:, , , , May 13, 2021 at 2:50 am, , , , , , , , What a superb article on Vegan Air Fryer Chickpeas Recipe  :O i never imagined this information can be so useful! I found that all your articles are also amazing, I would feel so happy share it with others!, , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , May 18, 2021 at 1:45 am, , , , , Thanks, , , Reply, , , , , , , , , , Rakesh, , says:, , , , March 16, 2021 at 2:43 am, , , , , , , , Keep posting such informative and delicious posts. Thanks for covering this topic. My problem solved. 🙂, , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , March 20, 2021 at 1:39 pm, , , , , Thanks, , , Reply, , , , , , , , , , Soumya, , says:, , , , March 11, 2021 at 1:03 pm, , , , , I bought an air fryer last week. Since then I have been looking for a recipe like this. Thanks aton for sharing., , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , March 12, 2021 at 11:46 am, , , , , I am so glad you liked it, , , Reply, , , , , , , , , , Jillzer, , says:, , , , February 5, 2021 at 4:24 am, , , , , Can’t wait to try these, I’ve only ever made them in the oven. Never thought of making them in my air fryer. But why does the outside temperature matter? I’m confused by that comment. Thank you., , , Reply, , , , , , , , simplyvegetarian777, , says:, , , , February 5, 2021 at 4:53 am, , , , , Thanks Jill :)., The outside temperature will matter if it’s raining outside too much, otherwise not 🙂, , , Reply, , , , , , , Pingback:",
        "Crispy Air fried chickpeas": "Ingredients: , , A can of chickpeas, , Oil to spray on chickpeas, , Seasonings, , , How to make Crispy Air Fryer Chickpeas, , First, open and drain a 15.5-oz can of garbanzo beans. Garbanzo beans and chickpeas are the same. I don’t bother rinsing them, but you can do it if you like; make sure to drain them in a, colander, ., , , , Next, add the drained chickpeas to the air fryer basket, spreading them out across the bottom., , This is how we’ll dry the chickpeas before we add oil., , , , Close the air fryer basket and set the temperature to 390 degrees Fahrenheit. Set the timer for 17 minutes. After 5 minutes, open the air fryer basket. At this point, your chickpeas should be dry and ready for you to spray them with oil., , I fill my, spray bottle, with oil for my air fryer cooking., , , , After spraying the chickpeas with oil, I close the air fryer basket. Then, I continue the cooking cycle and shake the basket every 5 minutes., , When there are about 2 minutes left, I add half of my seasoning combination. This allows the chickpeas to roast without the seasonings burning or falling off., , , , Continue to cook for the last 2 minutes, and then remove the chickpeas. If you need a little crispier, put them in for a few more minutes. I found that the 17-minute total cooking time was perfect for the chickpeas in my Phillips Air Fryer., , After cooking the chickpeas, place them in a large bowl and pour the remaining seasoning on them. Stir to coat the seasoning on all the chickpeas. Allow them to cool and enjoy., , How to enjoy your chickpeas, , These chickpeas can be enjoyed individually as a snack or used in your favorite recipes. Try them on top of a salad in place of, croutons., , , The Best Oil to Use, , For crunchy chickpeas, it's best to use a light oil with a high smoke point, such as avocado oil, which coats well without weighing down the chickpeas or burning them at high temperatures., , Seasoning Options, , I suggest you use your favorite seasoning choice. I've included a few in the recipe card below., , , BBQ Seasoning, , Jerk Seasoning, , Ranch Seasoning, , Cinnamon Sugar, , , Tanya's Notes on Air Fryer chickpeas, , , The best results were obtained by drying the chickpeas in the Air Fryer before adding the oil. They should be dry after 5 minutes., , How long it takes to cook the chickpeas will depend on the Air Fryer brand and size. I suggest checking the doneness of your chickpeas after 15 minutes., , Add half of the seasoning before the last 2 minutes of air frying and the remainder when the chickpeas are done. I noticed that when I added seasoning too early, it would fall off the chickpeas or taste burnt., , If you want to make these ahead or have leftover chickpeas, you can store them in a paper bag for a couple of days. I found that storing them in a paper bag was the best way to keep them crispy., , Have fun with the seasonings! The possibilities are endless., , The chickpeas may pop in the air fryer. This is normal, just be careful when removing them from the air fryer., , You do not need to remove the skin from the chickpeas., , , , , I hope you enjoy this healthy snack of roasted chickpeas!, , If you're looking for more, Air Fryer recipes, , try these out:, , Air Fryer Bacon Wrapped Chicken Bites, , Breaded Potato Wedges, , Air Fryer Apple Chips, , Easy Air Fryer Recipes for Beginners, , Air Fryer Granola, , Pin Air Fryer Chickpeas for Later, , , , , , , , , , , Print, , Pin, , Save, Saved!, , 4.76, from, 90, votes, , , Crispy Air Fryer Chickpeas, , , This quick and easy Crispy Air Fryer Chickpea recipe is perfect for when you are craving a delicious snack. You can season with salt and pepper or any of the 4 flavor combinations that's provided., , , , Course, Snack, , Cuisine, American, , Keyword, air fryer chickpeas, , , , Prep Time, 5, minutes, , minutes, , Cook Time, 17, minutes, , minutes, , Total Time, 22, minutes, , minutes, , , , Servings, 3, , people, , , Calories, 126, kcal, , , Author, Tanya, , Cook Mode, Prevent your screen from going dark, , 15.5, , oz, , can Garbanzo beans, , drained, Oil for spraying, Seasonings, Cinnamon Sugar, 1, , Tablespoon, , granulated sugar, ½, , teaspoon, , Cinnamon, Ranch, 1, , Tablespoon, , ranch dressing packet, Chili Lime, 1, , teaspoon, , chili powder, ½, , teaspoon, , cumin, ½, , teaspoon, , salt, ¼, , teaspoon, , garlic powder, ¼, , teaspoon, , true lime, BBQ, 1 ½, , teaspoon, , paprika, 1, , teaspoon, , brown sugar, ½, , teaspoon, , celery salt, ½, , teaspoon, , garlic powder, ½, , teaspoon, , dry mustard, ¼, , teaspoon, , black pepper, , , This post was originally published on February 19, 2019. It has been updated with additional helpful information., , More Air Fryer Recipes, Air Fryer Meatloaf (Juicy and Tasty), Air Fryer Cinnamon Sugared Pecans, Air Fryer Chocolate Molten Lava Cakes, Easy Air Fryer Crab Cakes (Ready in Minutes!), , Spread the Flavor and Share, , , , , , , , , , , , , , , , , , , , , Comments, , , , 4.76 from 90 votes (, 38 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , , , , , L. M., , says, , , April 01, 2025 at 1:40 pm, , , , , ,  Instructions: recipe card at the bottom of the post., You can find important tips/tricks in the, blog post., , I use my Air Fryer quite often. It’s not only for, fries, , , wings, , and, steak, …I also make delicious, quick, and easy snacks. I enjoy using the air fryer for quick snacks with frozen foods., , My favorite snack is chickpeas. I like grabbing a chickpea can and putting it in the air fryer. I roast them, and in less than 20 minutes, I have a delicious snack. They're also great as a salad topper., , I’ve been roasting chickpeas for a while. They’re healthy for you, high in fiber, and are tasty and much less expensive than other snacks you can purchase., , I used to roast them in my oven but found that roasting chickpeas in the oven gave inconsistent results. I can’t stand grabbing one chickpea that is super crispy while the next is a soft, wet mess. The Air Fryer made every single chickpea crispy., , , , Place chickpeas in Air Fryer basket. Set temperature to 390 degrees Fahrenheit and timer to 17 minutes. After 5 minutes, open basket and spray chickpeas with oil and shake basket. Close and continue air frying, shaking about every 5 minutes., With about 2 minutes left, open air fryer basket and sprinkle half of the seasoning on the chickpeas. Close and continue air frying for the remaining 2 minutes. Once chickpeas are done, remove and place in a bowl. Sprinkle remainder of the seasoning on the chickpeas and stir to combine. Serve and enjoy., , Video, , Notes, Suggested Tools for Air fryer Chickpeas, , , Air Fryer, , Air Fryer Spray bottle for spraying oil, , , I recommend spraying with an oil with a high smoke point. Avocado, olive oil, vegetable oil, or canola oil all work fine., , *Calorie information provided does not include seasonings., , Nutrition, Calories:, 126, kcal, , , My Southern Air Fryer ECookbook, Find all my Top Southern Air Fryer recipes in one place!, My Southern Air Fryer ECookbook, !, , , , Subscribe to my YouTube, Subscribe to my, YouTube Channel, for full length recipe videos. Click the bell icon to be notified when I upload a new video., , , , , Tried this recipe? Share on Instagram, Mention, @Myforkinglife, or tag, #myforkinglife, !, , , Although myforkinglife.com attempts to provide accurate nutritional information, these figures should be considered estimates. Varying factors such as product types or brands purchased, natural fluctuations in fresh produce, , , Reply, , , , , , , , Tanya, , says, , , April 07, 2025 at 6:14 pm, , , , Thank you so much, L.M.! So glad I can help., , , Reply, , , , , , , , , , B Weis, , says, , , July 27, 2024 at 4:35 pm, , , , I made the cinnamon sugar ones. Don't know if my airfrier is too old, or if it's because I used freshly cooked chickpeas, or what. But even at 400 degrees it took WAY LONGER than 17 minutes. And they still ended up tasting like bland chickpeas. I ended up mixing honey with cinnamon and cooking them again. After that they were delicious. Thank God I'm a professional baker., , , Reply, , , , , , , , Tanya, , says, , , July 28, 2024 at 11:29 am, , , , Hey B Weis, so happy it worked out in the end. Agreed, definitely depends on the air fryer. The original air fryer I used for these was my Philips. I’ve also made this in the Cosori and Ninja air fryer (I’ve had a lot over the years lol). They all cook differently but the 17 minute time worked well, although my Ninja took less time., , , Reply, , , , , , , , , , Suzanne, , says, , , May 11, 2024 at 7:46 am, , , , I have tried to make these so many different ways and never liked the result.  THIS IS PERFECT!  You addressed all of my problems from the past. ha ha I am resisting having last night's snack leftovers as breakfast today.  THANK YOU!!!!!!, , , Reply, , , , , , , , Tanya, , says, , , May 13, 2024 at 6:57 am, , , , Thanks so much, Suzanne! Chickpeas as a part of breakfast sounds like a yummy idea., , , Reply, , , , , , , , , , Kathy, , says, , , April 02, 2024 at 2:55 pm, , , , I found some parchment paper liners on Amazon and they are terrific., , , Reply, , , , « Older Comments, , , , Welcome!, , Welcome to My Forking Life! Hi, I'm Tanya, attorney, busy wife and mom, and lover of quick, easy, and delicious meals., , , More about me, , , , Popular Recipes, , Jamaican Oxtails Recipe, Air Fryer Fried Chicken, Brown Stew Chicken, Pressure Cooker Shrimp Paella, , Holiday Favorites, , Southern Sweet Potato Pie Recipe, Easy Recipe for Gravy without Drippings, Creamy Baked Macaroni and Cheese, Grandma's Giblet Gravy Recipe, , , , , , , Footer, , , ↑ back to top, , , , , , Privacy Policy, , Contact, , About Tanya, , , , , As an Amazon Associate, I earn from qualifying purchases., , Copyright © 2025 My Forking Life, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name, , , , , Email, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Smoky Baked Beans": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., GF, V, VG, Colgin is a trademark of Colgin Cellars, Inc.., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., SMOKY BAKED BEANS, O, SERVES: 8 (approx. ½ cup each)   Prep Time: 10 min.   Cooking Time: 1 hr. 1 min., CONTAINER EQUIVALENTS (per serving):, 1, ½, ½, 1 Tbsp. + 1 tsp., olive oil, ¾ cup, , chopped sweet onion, , (approx. 1 medium), 2 cans (8-oz. each)\t all-natural tomato sauce, , , no salt or sugar added, 1 Tbsp., , Worcestershire sauce, , , gluten-free, vegan, 2 Tbsp., , all-natural liquid smoke, , (optional), ¾ tsp., , Dijon mustard, 3 Tbsp., , blackstrap molasses, 2 cans (15-oz. each)\t cannellini beans, drained, , , rinsed, , , Sea salt (or Himalayan salt), , (to taste; optional), , 1. \t Preheat oven to 325° F., 2. \t Heat oil in ovenproof medium saucepan over medium-high heat., 3. \t Add onion; cook, stirring frequently, for 4 to 5 minutes, or until onion is, translucent., 4. \t Add tomato sauce, Worcestershire sauce, liquid smoke (if desired), mustard, , molasses, and beans. Season with salt, if desired; cook, stirring frequently, , over medium-low heat, for 5 minutes., 5. \t Place saucepan in oven, uncovered. Bake for 45 to 50 minutes, or until, sauce is thick., RECIPE NOTES:, •\t Maui and Vidalia are two varieties of onion that you can use., •\t Colgin® is a brand of all-natural liquid smoke that you can use., •\t Pure maple syrup can be substituted for molasses., NUTRITIONAL INFORMATION (per serving): Calories: 128  Total Fat: 3 g  Saturated Fat: 0 g  Cholesterol: 0 mg  Sodium: 499 mg  Carbohydrates: 21 g  Fiber: 4 g, Sugars: 7 g  Protein: 4 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Vegan Buffalo Quinoa Bites": "Ingredients: , 1x, 2x, 3x, for the bites, 1, , 15 oz can of white beans, 1, , shallot, , chopped, 3, , garlic cloves, 1/4, , cup, , vegan buffalo sauce, 1, , teaspoon, , smoked paprika, 1/2, , teaspoon, , salt + pepper, 1, , cup, , cooked quinoa, 3, , tablespoons, , chickpea flour, for the dressing, 1/4, , cup, , tahini, 2, , tablespoons, , hemp hearts, 1/4, , cup, , fresh chives, 1, , tablespoon, , nutritional yeast, 1, , teaspoon, , onion powder, 1, , teaspoon, , garlic powder, 1 - 2, , teaspoons, , dried dill, , start with 1, 1/2, , teaspoon, , salt & pepper, Juice of 1 lemon, 1/2 - 3/4, , cup, , water, , Arrange the bites around a bowl of the ranch dip on a serving plate (along with some carrots and celery if desired) and enjoy!, , Video, , , , , , , , , , Nutrition, Calories:, 78, kcal, |, Carbohydrates:, 9, g, |, Protein:, 4, g, |, Fat:, 3, g, |, Saturated Fat:, 1, g, |, Cholesterol:, 2, mg, |, Sodium:, 67, mg, |, Fiber:, 2, g, |, Sugar:, 1, g, , , , cuisine:, American, , course:, Appetizer, , , , , ★★★★★, , Did You Make This Recipe?, , Be sure to, share a comment and rating, to let us know!, , , , , , Filed Under:, , Appetizers, , Blender, , Dairy Free, , Dips & Spreads, , Gluten-Free, , Oven, , Recipes, , Sides, , Snacks, , Vegan, , Vegetarian, , , , , , New to cooking quinoa? Grab your FREE Quinoa Starter Guide!, , Become part of the Simply Quinoa community and receive weekly emails with exclusive content that I only share in email, as well as my in-depth guide to starting your quinoa journey., , Download Your Free Guide, , , , , , , , , , , , , , , , , , , , , , , , , , Recipe Key, DF, Dairy Free, Fx, Flexitarian, FF, Freezer Friendly, GF, Gluten-Free, Ve, Vegan, V, Vegetarian, , , , , Hey There!, , I'm Alyssa!, , Nutritionist, Yoga-lover, Dog mom, Author, Photographer, Entrepreneur, , Welcome to Simply Quinoa - an online destination that provides simple, practical and personal steps to living a healthier life so that you can be well + truly healthy., , , Popular Posts, Lentil Curry, Detox Turmeric Lentil Soup, 5-Ingredient Garlic Butter Quinoa, Anti-Inflammatory Ginger & Turmeric Carrot Soup, , FREE Download, , , 3-Day Reset Guide, , Get back on track in 72 hours!, , , , Let's Go!, , , SQ Cookbooks, , , , , , Simply Nourish Seasonal Meal Plan, , Buy Now →, , , , , , , , SQ Dinner in 30, , Buy Now →, , , , , , , , Ultimate Guide to Energy Balls, , Buy Now →, , , , , , , , , , , , , , , , , , , , , , , Recipe Finder, , , , , By Course, , , Menu Toggle, , , , , , , Breakfast, , , , Lunch, , , , Dinner, , , , By Diet, , , Menu Toggle, , , , , , , Dairy Free, , , , Flexitarian, , , , Gluten-Free, , , , Grain-Free, , , , Vegan, , , , Vegetarian, , ,  Instructions: , , Menu Toggle, , , , , , , Blender, , , , Freezer Friendly, , , , Instant Pot, , , , Oven, , , , Slow Cooker, , , , Shop, , About, , , , , , , , , , , , , , , , , , , Search, Search, , Recipe Finder, , , , , , , , , , , , , , , , , Search …, , , , , , , , , , , , , , , , , , , , , , , , , , , , , Main Menu, , , , , , , , , , , , , , , , , , , Home, », Recipes, », Appetizers, », Vegan Buffalo Quinoa Bites & Vegan Ranch Dip, , , , , , , , , , , , , Vegan Buffalo Quinoa Bites & Vegan Ranch Dip, , , , , By:, , Alyssa, , , Published:, , January 30, 2018, , Updated:, , May 17, 2023, , Rating, , , 29 Comments, on Vegan Buffalo Quinoa Bites & Vegan Ranch Dip, , , DF, GF, Ve, V, , , , , This post may contain affiliated links. Please read my, disclosure policy, ., , , Jump to Recipe, , , , , , , , , , , Share, , , , , Tweet, , , , , Pin, , , These simple vegan buffalo quinoa bites are a quick and healthy appetizer or snack, and are perfect for parties! Served with a creamy ranch dipping too!, , , this recipe, , How many times have been out to eat with friends, they order the buffalo wings and you drift off into a daydream where you're eating something deliciously buffalo-y yet also plant-based?, , Probably at least 100 for me!, , For me, that wing-lover in my life is Matt. He's a meat-eater, which I'm totally okay with, and definitely loves his wings. While I've never personally been a fan of chicken wings (even before I was plant-based), I do love a good buffalo sauce and the smell is so addicting!, , For all my buffalo flavor lovers out there, I've got you. Today we're making Vegan Buffalo Quinoa Bites and serving them with a creamy ranch dressing and they are everything. Simple. Healthy. Flavorful. Protein-Packed. And freaking delicious!, , , The great thing about this recipe? It's made entirely in the food processor!, , The base is white beans, which are creamy and relatively mild in flavor, which makes them the perfect vehicle for the buffalo sauce. We're also adding in some quinoa (of course!) to help hold everything together and add in some extra protein., , Our spices are simple: just buffalo sauce, salt and pepper. Because honestly, that's all these quinoa bites need!, , , Once we blend it all up, you shape them into patties or balls!, , If you're serving these at a party, I suggest thinking about the look you're going for and the audience that you're serving them to. Got kids at the party? I like patties because they remind me of chicken nuggets. Something a little more “sophisticated”, I'd probably go with balls because they resemble mini meatballs., , , And speaking of serving…, , Let's talk about this vegan ranch dressing!, , I should preface by saying it's not a true ranch dressing, a bit more on the herbaceous side, but it's absolutely scrumptious! I actually used my, vegan caesar dressing, for inspiration, so we've got, tahini, and hemp seeds as our base, then swapped out the spices to give it a more ranch-like flavor., , Our spices? Fresh chives, onion powder, garlic powder, dried dill and lemon. The chives are what's giving it that light green color, and while not traditional, promise you'll love it!, , , These vegan buffalo bites are definitely a must-make for your next party! (whether Super Bowl or otherwise), , I also like saving some extras, or making a double batch, and keeping the leftovers for salads or bowls. They're a great source of protein and add a really nice pop of flavor. They remind me of falafels, just buffalo flavored!, , Can't wait to see your recreations, friends! Make sure to tag me on Instagram with your own quinoa bites ❤ you can use, @simplyquinoa, or, #simplyquinoa, !, , , , Need More Appetizers? Try These!, , , Amaranth Baked Vegan Falafel, , The Ultimate Summer Hummus Board, , Vegan Sweet Potato Tots, , Butternut Squash & Lentil Patties, , Spicy Mango Guacamole, , Sweet Potato Pizza Bites with Lentil Bolognese, , Spinach Artichoke Dip, , , , , , Vegan Buffalo Quinoa Bites, , , 4.1, from, 42, votes, , , These simple vegan buffalo quinoa bites are a quick and healthy appetizer or snack, and are perfect for parties! Served with a creamy ranch dipping too!, , , , , author:, Alyssa, , , yield:, 20, , bites, , , , , , , , , Print Recipe, , Pin Recipe, , , , , Prep:, 10, minutes, , minutes, Cook:, 30, minutes, , minutes, Total:, 40, minutes, , minutes, , , , , Preheat oven to 350ºF. Spray a baking sheet with cooking spray and set aside., Add half the beans, shallot and garlic into a food processor and pulse until mixture is coming together, 10 – 15 pulses.Add the buffalo sauce and spices and process again until smooth., Pulse in the remaining beans, the quinoa, and chickpea flour until just combined. Remove lid and stir together to form a dough., Shape dough into golf ball-sized patties and place on baking sheet. Repeat until no dough remains., Bake on center rack for 30 minutes, flipping halfway through until the bites are browned and crispy on the outside. Remove and let sit for 5 – 10 minutes., While the bites are resting, , , Menu Toggle, , , , , , , Blender, , , , Freezer Friendly, , , , Instant Pot, , , , Oven, , , , Slow Cooker, , , , , , , Start Here, , Work With Me, , Contact, , , , , , , By Course, , , Menu Toggle, , , , , , , Breakfast, , , , Lunch, , , , Dinner, , , , By Diet, , , Menu Toggle, , , , , , , Dairy Free, , , , Flexitarian, , , , Gluten-Free, , , , Grain-Free, , , , Vegan, , , , Vegetarian, , , , , , Menu Toggle, , , , , , , Blender, , , , Freezer Friendly, , , , Instant Pot, , , , Oven, , , , Slow Cooker, , , , , , , , , , , , , , , , , As Seen On:, , , , , , , , , , , , , , , , , , , , , , , FREE 3-Day Reset Guide, , Get Yours Today!, , , , , , , Diet, Gluten-Free, , Paleo, , Vegan, , Vegetarian, , , , , , , Recipes, Breakfast, , Dinner, , Sides, , Dessert, , , , , , , About SQ, Work With Me, , Contact, , Affiliate Disclaimer, , Privacy Policy, , , , , , , , , , , , , © 2025 Simply Quinoa, , , , , , , Site by:, Swift Horse Marketing, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Deviled Eggs Three Ways": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., DEVILED EGGS THREE WAYS (CONTINUED), 1.\t Bring water to a boil in a large saucepan over high heat., 2.\t Add eggs; cook for 12 minutes. Cook’s Note: To avoid cracking, remove your eggs from refrigerator 30 minutes before you cook, them., 3.\t Remove eggs from boiling water; immediately place eggs in an ice water bath to stop cooking process. Peel eggs as soon as they, are cool enough to handle. Cook’s Note: The shock of ice water separates shell from the white, making eggs a snap to peel, but if, you leave them in cold water too long, the temperature equalizes and the effect is lost., since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the V  icon are designed to be Vegan and contain no animal products. Please read product labels for each ingredient to ensure this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., PF, OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., NUTRITIONAL INFORMATION (per serving): Calories: 42   Total Fat: 5 g   Saturated Fat: 1 g   Cholesterol: 0 mg   Sodium: 0 mg   Carbohydrates: 0 g   Fiber: 0 g, Sugars: 0 g   Protein: 0 g, SESAME INFUSION, O, SERVES: 12 (1 tsp. each)    Prep Time: 10 min.    Cooking Time: 15 min., CONTAINER EQUIVALENTS (per serving):, 1, VEGAN CONTAINER EQUIVALENTS (per serving):, 1, This delicious Sesame Infusion is perfect in our Ahi and Avocado Quinoa Sushi, but it’s also great in soups, vegetables, , and rice dishes.  It is a flavor bomb! It only takes a tiny amount to add so much goodness to salads, roasted veggies, sushi, , or grilled meats and fish. Leftover infusion can be stored in an airtight container in the refrigerator for up to a month. And remember, don’t strain out, those crunchy bits of garlic and ginger; they make for a great texture addition as well as little punchy flavor accents when you bite into them!, ¼ cup, sesame oil, 3 cloves, garlic, finely chopped, 1 Tbsp., finely chopped fresh ginger, ½ tsp., ground smoked paprika, 1.\t Heat oil, garlic, and ginger in small saucepan over low heat, stirring, occasionally, for 12 to 15 minutes, or until garlic has turned golden brown., Remove from heat., 2.\t Add paprika; allow to infuse until oil has cooled to room temperature., RECIPES, © 2021 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: FOR ASIAN INFUSION:, 1.\t Place yolks in food processor (or blender). Add mayonnaise, mustard, lemon peel, lemon juice, Sesame Infusion, pepper, fish, sauce, and bonito (if desired); pulse until smooth. Cook’s Note: The size of yolks varies and more or less mayonnaise might be, needed to achieve the desired consistency; you are looking for a texture similar to frosting., FOR SCANDINAVIAN SMORGASBORD:, 1.\t Place yolks in food processor (or blender). Add yogurt, mustard, lemon peel, lemon juice, salmon, dill, pepper, and salt; pulse until, smooth. Cook’s Note: The size of yolks varies and more or less yogurt might be needed to achieve the desired consistency; you are, looking for a texture similar to frosting., FOR DEVIL’S CURRY:, 1.\t Place yolks in food processor (or blender). Add yogurt, lime peel, lime juice, ghee, green onion, curry powder, chile, salt, and lime, leaves (if desired); pulse until smooth. Cook’s Note: The size of yolks varies and more or less yogurt might be needed to achieve the, desired consistency; you are looking for a texture similar to frosting., FOR ALL EGGS:, 1.\t Arrange egg whites on a serving plate. Set aside., 2.\t Place egg yolk mixture in a 1-gallon freezer bag (or piping bag). Cut off a small piece of one corner and use like a piping bag to, pipe mixture evenly and neatly into the center of each egg white., 3.\t Garnish with sweet paprika (if desired) and a drop of Sesame Infusion for Asian Infusion Eggs; salmon and dill for Scandinavian, Smorgasbord Eggs; or curry powder and green onion for Devil’s Curry Eggs; enjoy!, TIPS:, •\t Bonito is a Japanese smoked fish that can be found at many health food markets and Asian markets., •\t Ghee is clarified butter that is commonly used in South Asian cuisine. It can be found in Indian markets or online., NUTRITIONAL INFORMATION (per serving) Devil’s Curry Eggs: Calories: 171   Total Fat: 11 g   Saturated Fat: 4 g   Cholesterol: 369 mg   Sodium: 323 mg, Carbohydrates: 3 g   Fiber: 1 g   Sugars: 2 g   Protein: 14 g, NUTRITIONAL INFORMATION (per serving) Scandinavian Smorgasbord Eggs: Calories: 167   Total Fat: 11 g   Saturated Fat: 3 g   Cholesterol: 368 mg, Sodium: 240 mg   Carbohydrates: 2 g   Fiber: 0 g   Sugars: 2 g   Protein: 15 g, NUTRITIONAL INFORMATION (per serving) Asian Infusion Eggs: Calories: 284   Total Fat: 25 g   Saturated Fat: 5 g   Cholesterol: 373 mg   Sodium: 282 mg, Carbohydrates: 2 g   Fiber: 0 g   Sugars: 1 g   Protein: 12 g, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., GF, V, VG, Recipes containing the GF  icon are designed to be Gluten-Free and contain no gluten. If you are following a gluten-free diet"
    }
}