{
    "ingredients": {
        "Parmesan Carrot Fries": "carrots,parmesan cheese,garlic",
        "Carrot Fries": "carrots",
        "Avocado Fries": "avocado, breadcrumbs,italian seasoning",
        "Airfried French Fries": "potato",
        "Fauz Tato Chips": "daikon radishes,garlic powder",
        "Air fried Onion Rings": "onion,flour,milk,bread crumbs"
    },
    "recipe_url": {
        "Parmesan Carrot Fries": "https://www.pinterest.co.uk/pin/496592296425823211/",
        "Carrot Fries": "https://www.thefoodhussy.com/air-fryer-carrot-fries",
        "Avocado Fries": "https://rachnacooks.com/vegan-avocado-wedges-healthy.../",
        "Airfried French Fries": "https://sweetcsdesigns.com/the-best-easy-air-fryer-french-fries-recipe/",
        "Fauz Tato Chips": null,
        "Air fried Onion Rings": "https://thesugarfreediva.com/low-carb-air-fried-onion-rings/"
    },
    "Recipe": {
        "Parmesan Carrot Fries": "Ingredients:  Instructions: ",
        "Carrot Fries": "Ingredients: , , , carrots – I like to use large carrots – but you could also quarter baby carrots lengthwise for this recipe as well, , Smaller baby carrots will take a little less time cooking time, , Want to save a little time? Buy a bag of carrot chips!, , olive oil, , favorite seasoning – I like a lemon/herb seasoning but here are a couple of spice blend ideas you can put together on your own:, , Fragrant & Fun – garlic powder, onion powder, lemon juice, black pepper and sea salt, , Spicy Carrot Fries – brown sugar & chili powder or maple syrup & cayenne pepper, , , , , , , How do you make carrot fries in the air fryer?, , This healthy alternative to traditional fries is super simple as well with just a few easy steps:, , , Peel and cut carrots into french fry shapes, , Be mindful of the thickness of the carrot fries – the thicker they are – the longer they’ll take to cook, , Place carrot sticks into a large bowl, , Toss with a tablespoon of oil and 2 tablespoons of seasoning until well coated, , Place carrots in a single layer in your air fryer basket (or oven), , Air fry at 350 degrees for 7 minutes, , Shake the basket to flip your carrot fries, , Air fry for an additional 7-8 minutes, , Serve! Sprinkle with parmesan cheese or serve with a dipping sauce like ranch, spicy mayo or get fancy with a pesto aioli (pesto + mayo), , , , Are carrot fries more healthy than traditional french fries?, , Definitely! These delicious air fryer carrot fries are made with carrots vs potatoes – so that’s a big plus right off the bat. You’re also using much less oil than deep frying. These are a healthy snack that you can enjoy with any dish!, , If you want to make them even healthier – spritz them with olive oil spray or avocado oil instead of pouring the olive oil into the bowl – this will eliminate any excess oil on your carrots., , , How can I make a crispier carrot fry?, , I love this healthy recipe but sometimes I like a crispy carrot! If you add a little corn starch (1/2 tsp) when you toss your carrots in seasoning – that will absorb any excess moisture and crisp up your fries a bit., , Can I make carrot fries in the oven?, , Yes – spread the seasoned carrots out on a baking sheet and bake at 425 for 25 minutes., , , Best Air Fryer Accessories, , Here’s my ultimate list of best air fryer accessories – whether you have a basket- or oven-style! I’ve also included a price guide as well as my favorite recipes for those accessories., , , , Air Fryer Side Dishes, , Air fryer carrots fries are a great easy side dish – and if you like air fryer vegetables – here are some of my other favorite easy recipes:, , –, Air Fryer Stuffed Mushrooms, , , –, Air Fryer Buffalo Cauliflower, , , –, Air Fryer Avocado Fries, , , , 21 More Weight Watchers Air Fryer Recipes!!!, , , You can also join my, Easy Air Fryer recipe group on Facebook, to get more recipes and answers to any questions you might have., , , Save the Recipe, Want to Save The Recipe?, , Enter your email below and we will send it straight to your inbox! Plus get NEW recipes from us every week!, First Name, Email, Submit, , , , , , Air Fryer Carrot Fries, , , , Roasted carrots are great – but they take time – UNLESS you’re making them in your air fryer! These air fryer carrot fries are a tasty and quick side dish for any meal!, , , 5, from, 5, votes, , , , Print Recipe, , Pin Recipe, , , , , , , Prep Time, 5, minutes, , mins, Cook Time, 15, minutes, , mins, Total Time, 20, minutes, , mins, , , , , , , Course, Side, Cuisine, American, , , , , , Servings, 2, , people, Calories, 85, , kcal, , , , Equipment, Instant Pot Omni Pro Air Fryer, Serving Platter, Silicone Tongs, , , 1x, 2x, 3x, 2, , carrots, 1, , tbsp, , olive oil, 2, , tbsp, , lemon herb seasoning,  Instructions: , Peel carrots and slice into “french fry” shaped sticks, 2 carrots, Place carrots in bowl and add oil and seasoning, 1 tbsp olive oil, , 2 tbsp lemon herb seasoning, Toss carrots until coated, Air fry at 350 for 15 min – shake half way, , Nutrition, Serving:, 1, carrot, Calories:, 85, kcal, Carbohydrates:, 6, g, Protein:, 0.5, g, Fat:, 7, g, Saturated Fat:, 1, g, Sodium:, 80, mg, Potassium:, 195, mg, Fiber:, 1.5, g, Sugar:, 3, g, Calcium:, 20, mg, , , , , Keyword, air fryer, carrot, , , , , Tried this recipe?, Let us know, how it was!, , , , Pin, Share, Post, , , , , Share, , , , , 6 Comments, , , , , , , Crystal O’Hara, , says:, , , , April 2, 2021 at 6:51 pm, , , , , 2 tbsp of seasoning was excessive. We even doubled the carrots. Did you mean 2 tsp?, , , Reply, , , , , , , , FoodHussy, , says:, , , , April 2, 2021 at 7:39 pm, , , , , I like a heavy seasoning – if you don’t – use less. Happy Friday., , , , , , , , , , , Janis, , says:, , , , May 18, 2021 at 8:01 am, , , , , These are delicious! I used sea salt and garlic powder. Almost tastes like sweet potato fries.  Thanks for sharing!, , , Reply, , , , , , , , Adam, , says:, , , , October 10, 2022 at 6:18 pm, , , , , Works great and my kids love it! We substitute a little BBQ rub instead of the lemon herb seasoning., , , Reply, , , , , , , , FoodHussy, , says:, , , , October 10, 2022 at 7:18 pm, , , , , Sounds good – I always say – use what you like and what you have!, , , , , , , , , , , Jinx, , says:, , , , November 30, 2022 at 8:54 pm, , , , , My family is obsessed with these! It’s in our weekly rotation. Even my 15 year old-and my dad who hates cooked carrots. We use onion powder, garlic powder, salt and pepper and they are perfection everytime! Thanks for giving us a veggie side we all love!, , , Reply, , , , , , , 5 from 5 votes (, 3 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, Name, *, , Email, *, , Website, , , Save my name, email, and website in this browser for the next time I comment., , , , , , , , , , , , , , , , , Hi! I’m Heather Johnson, the, Queen of Copycat Recipes, and the hussy behind Food Hussy!, I’m a food & travel blogger and have been blogging since 2008. I started out with restaurant reviews in Cincinnati but have since expanded to recipes and road trips. Most recently, I launched an Air Fryer Cookbook and won Guy’s Grocery Games!, , , , , , , , , , , , Trending Recipes, , Copycat Casey’s Breakfast Pizza, Olive Garden Giant Stuffed Shells Copycat Recipe, Copycat Popeye’s Red Beans & Rice, Longhorn Steakhouse Crispy Brussels Sprout Recipe, , , , , , , , , , , , , , , , , © 2025 The Food Hussy ·, Privacy Policy, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Sign up for my, , Air Fryer, , Quick Start Guide, , to get the MOST, , out of your air fryer!, , , , , , We respect your privacy. Unsubscribe at anytime., , , , , , , , , SEND ME THE RECIPES!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Home, , About, , Recipes, , Road Trips, , Contact, , Subscribe, , , , , , , Facebook, , Instagram, , Pinterest, , X, , YouTube, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Toggle Menu Close, , , , , , , , Search for:, , , , , Search, , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , ,",
        "Avocado Fries": "Ingredients: , 1x, 2x, 3x, 1, , avocado, , cut into fries – about 8-10, For the coating, 1, , cup, , breadcrumbs, 1, , tsp., , Italian seasoning, , like oregano, basil etc., 1, , tbsp., , cayenne, , or red chilli powder use as per taste, Salt to taste, 1, , tbsp., , cheese, , or vegan cheese optional, oil, , to spray/brush, , , Do you want to save this recipe?, Enter your email below & we’ll send it straight to your inbox. Plus you’ll get more great recipes and tips from us each week!, , , Send It, , Invalid email address. Please enter again., , , , , Awesome! Check your email for your saved recipe., ,  Instructions: , Cut avocado into half. Remove the seed and the skin. Cut each half into 4-5 fries., Mix together breadcrumbs, Italian seasoning, cayenne and salt. You can also add grated cheese (optional)., Dip avocado fries in the breadcrumbs coating and press well so that they adhere well and keep aside., In case your breading does not stick well, you can dip avocado slices in milk/plant-based milk and then press in breading., Preheat Airfryer to 180C or 360F for 5 minutes., Brush/Spray airfryer basket and breaded avocado wedges with oil. Now spead out the wedges in the airfryer basket and air fry for about 10 minutes at 180C or  360F till browned., Remove hot when the crumbs look golden brown and crunchy., Serve hot with a hot sauce or dip., , Video, , Notes, , Only use ripe avocados that are not mushy., , You can use any combination of herbs with your breadcrumbs., , If you want conventional fries, use a combination of flour (with salt and cayenne), plant-based milk/beaten egg and breadcrumb mix. Dip each wedge first in flour, then in plant-based milk/egg wash and finally bread it. Then air fry or bake it. You will get a thicker coating in your wedges., , If you have an oven, bake your wedges for 10 minutes each side at 200 degrees C., , This recipe is vegetarian and vegan., , , Nutrition, Calories:, 223, kcal, Carbohydrates:, 28, g, Protein:, 6, g, Fat:, 11, g, Saturated Fat:, 2, g, Polyunsaturated Fat:, 2, g, Monounsaturated Fat:, 6, g, Cholesterol:, 4, mg, Sodium:, 237, mg, Potassium:, 393, mg, Fiber:, 6, g, Sugar:, 3, g, Vitamin A:, 1669, IU, Vitamin C:, 8, mg, Calcium:, 110, mg, Iron:, 2, mg, , , , , , , Tried this recipe?, Let me know on Instagram, @rachna.parmar, or tag, #rachnacooks, , , , Check out our Food videos, , Subscribe, to our Food channel for recipe videos, , If you liked the recipe, I request you to leave a * star rating either on the recipe card or in the comments. Thanks., , 93, shares, , Facebook, , Pinterest, , Flipboard, , Reddit, More Air Fryer Sides, Air Fryer Shoestring Fries, Air Fryer Eggplant Slices or Begun Bhaja, 41 Air fryer Super Bowl Appetizers, Air Fryer Brussels Sprouts with Balsamic, Reader Interactions, Comments, , , , , , Mayuri6, , says, , , September 14, 2018 at 5:15 pm, , , , Yes, I am jealous that you have an Avocado Tree, and an airfryer too! Since I have neither, I am going to just drool at you pics and imagine what this fabulous recipe must taste like!, , , Reply, , , , , , , , shanayatales, , says, , , September 14, 2018 at 6:08 pm, , , , This sounds super easy and really delicious. Will try this weekend, especially because mom is here and she LOVES avocados! Thank you for sharing this recipe., , , Reply, , , , , , , , Rajlakshmi, , says, , , September 17, 2018 at 1:34 pm, , , , The fact that you are able to cut avocados into wedges is itself admirable. Mine becomes a paste like substance by the time I put it on bread., This recipe looks so awesome.  And delicious ?, , , Reply, , , , , , , , Sanch @ Sanch Writes, , says, , , September 17, 2018 at 4:59 pm, , , , That looks great. I love avos and while I don't have an airfryer I'm sure I can make that in the oven. Thanks for the recipe, , , Reply, , , , , , , , Damyanti Biswas, , says, , , September 18, 2018 at 4:03 am, , , , These look scrumptious!, , , Reply, , , , , , , , Soumya Prasad, , says, , , September 18, 2018 at 6:17 pm, , , , These look so yummy and are so easy to make! While I have no airfryer, I would make this in the oven., , , Reply, , , , , , , , LyflikedatMansi, , says, , , September 18, 2018 at 9:58 pm, , , , I absolutely love avocado for its health benefit. and this recipe of yours I tried this evening and my little one just loved it., Thanks for the share, , , Reply, , , , , , , , Vinitha, , says, , , September 22, 2018 at 4:02 am, , , , Yum! They look super delicious. Avocados are my favorite. I have guacamole almost everyday. Will try this and see if I can get my 3 boys to eat them too. ?, , , Reply, , , , , , , , a mindful traveler, , says, , , November 12, 2018 at 5:07 pm, , , , They look deliciously appetising Rachna 😉, , , Reply, , , , , , , , rachaelstray, , says, , , November 12, 2018 at 6:56 pm, , , , These sound like a real tasty treat!, , , Reply, , , , , , , , Tavo, , says, , , September 16, 2021 at 7:03 pm, , , , Really nice recipe! We loved avocados and made in an air fryer seems like the perfect treat!, , , Reply, , , , , , , , Rachna, , says, , , September 16, 2021 at 9:04 pm, , , , Thanks so much Tavo., , , Reply, , , , , , , , , , Mahy, , says, , , September 16, 2021 at 7:38 pm, , , , Oh wow, I didn't know you could enjoy avocados like this. Looks intriguing!, , , Reply, , , , , , , , Rachna, , says, , , September 16, 2021 at 9:04 pm, , , , Thanks Mahy, , , Reply, , , , , , , , , , Dannii, , says, , , September 16, 2021 at 7:45 pm, , , , I never would have thought to use avocado like this in the air fryer. It looks amazing., , , Reply, , , , , , , , Rachna, , says, , , September 16, 2021 at 9:03 pm, , , , Thank you Dannii, , , Reply, , , , , , , , , , Jenn, , says, , , September 16, 2021 at 7:56 pm, , , , Loving how simple this recipe is and I cannot wait to try it when I get my air fryer this Winter! Thanks for the recipe!, , , Reply, , , , , , , , Rachna, , says, , , September 16, 2021 at 9:03 pm, , , , You're very welcome, Jenn., , , Reply, , , , , , , , , , Julie, , says, , , September 16, 2021 at 8:53 pm, , , , This is a great way to have avocado. I could eat these as a snack or put them on a sandwich for a little texture., , , Reply, , , , , , , , Rachna, , says, , , September 16, 2021 at 9:03 pm, , , , Thanks Julie. Yes on a sandwich sounds good too., , , Reply, , , , , , , , , 5 from 28 votes (, 3 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , Primary Sidebar, , , Hi and welcome!, , I am Rachna, a Certified Nutritionist and Health Coach. I help you eat healthy. I specialize in healthy recipes especially Air fryer recipes., , I offer Health and Nutrition Coaching aimed at helping you achieve fat loss, healthy eating habits and more stamina and flexibility., , More about me →, , , HEALTHY RECIPES, , Air fryer Corn on the Cob, Air fryer Mushrooms, Air fryer Beet Chips, Air fryer Chickpeas, Air fryer Zucchini No Breading, Air fryer Peanuts, , LATEST RECIPES, , Air Fryer Teriyaki Salmon, Rajma Cutlets, Who Knew Vegetables Could Taste THIS Good? Try These Irresistible Sides!, 11 Air Fryer Recipes So Addictive, You'll Wonder How You Lived Without Them!, Air fryer Chicken Recipes So Good, It’ll Ruin Restaurant Takeout for You Forever!, So Crispy, So Healthy—These Air Fryer Snacks Will Blow Your Mind!, Footer, , ↑ back to top, , , , POLICIES, , , Privacy Policy, , Disclaimer, , Accessibility Policy, , , , , NEWSLETTER, , , Sign Up, for emails and updates, , , , , ABOUT, , , About, , Contact, , Media Kit, , , , , As an Amazon Associate I earn from qualifying purchases. This blog earns income from affiliate links and ads., , Copyright © Rachna cooks 2025, , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Airfried French Fries": "Ingredients: How to make French Fries in Air Fryer, Air Fryer Fries Tips, What to serve with air fried french fries, More Like this from Sweet C’s Designs, Crispy Air Fryer Fries Recipe, , , Crunchy Air Fryer Fries, , This recipe is one of my favorite recipes to use with my Ninja Foodi – just like my, popular air fryer chicken drumsticks recipe, , and, Air Fryer Steaks recipe, , , Air Fryer Tri Tip Steak, , and, Air Fryer Chicken Fried Steak, that all do really well in an instant pot with a crisping lid! For another take on these fries, be sure to check out my, Lemon Garlic Air Fryer French Fries, – the lemon pepper and garlic seasoning can’t be beat!, , I also LOVE to dip these fries in my, Zhoug (Skhug) Sauce, – its a spicy, tangy, totally addictive sauce I fell in love with in Israel., , Air fryers provide lightning-quick cook times and easy cleanup – with about 2 tablespoons of oil instead of quarts like a traditional deep fryer, – but, they are a bit of a misnomer – as they don’t actually fry anything. Instead, air fryers work more as a small convection-like appliance to crisp and heat foods evenly. They also don’t heat up your whole kitchen like an oven!, , I hope you love this recipe as much as we do!, , , , To make this recipe, you’ll need:, , , 3 large russet potatoes, – we love russets for their rich, buttery taste, and how the starch works to puff and crisp perfectly in the air fryer. Russet potatoes have the classic, rich, potatoey flavor everyone loves. You can peel the potatoes or leave the peel on – but be sure to wash it well., , 2-3 tablespoons olive oil, – use a good quality olive oil that you love the flavor of. You can change up the flavor of your fries by using flavored oils like garlic oil, chile oil, etc., , Sea salt and pepper, to taste, – I like to finish fries with either maldon salt or powdered salt for the light, salty flavor that distributes evenly., , , , , , , , , , , How to make French Fries in Air Fryer, , 1x, 2x, 3x, ▢, 3, , large russet potatoes, ▢, 2-3, , tablespoons, , olive oil, ▢, Sea salt and pepper, , , to taste,  Instructions: , , Prep., Using a mandoline, slice the potatoes into fries. I don’t worry too much about the size of fry I am making- some are bigger, and some are smaller. That’s fine!, , Soak., Next, place your spuds in a nice cool water bath. Completely submerge the fries in water. Let fries sit one hour. This helps to remove excess starch and will help the fries crisp up more in the oven., , Preheat., Preheat air fryer to 375 degrees. After an hour, drain the water, and pat fries dry with a paper towel., , Season., Toss with a couple tablespoons of olive oil, salt and pepper., , Air fry., Add fries to bottom of air fryer basket, making sure they are all on the same level (don’t stack them on top of each other.) Cook 13 minutes, until crispy and golden brown. Place on a baking sheet lined with paper towels and a cooling rack over it. Place in warm oven (set to the minimum temperature, not over 250 degrees) and let rest while other batches of fries are cooking., , Enjoy!, Serve hot, with, French Fry Sauce, !, , , , How long to Air Fry French Fries, , French fries in the air fryer cook pretty quickly – they should take about 13 minutes, depending on how thinly they are cut., , , , , , , , , Air Fryer Fries Tips, , Click here to see our web story for this post, ., , Season fries, . This recipe is so delicious because it can be made with all sorts of different flavors and seasonings to customize to your preferences – try some of these easy ideas, or come up with your own!, , , Onion powder or garlic powder over oiled fries for a bit more flavor., , Herbs de provence salt for a rustic French twist., , Cajun seasoning sprinkled over fries gives a spicy Five Guys like french fry flavor – straight from your air fryer., , Brush fries in the final 15 minutes of baking time with butter, diced garlic, and finely diced parsley for sinfully rich garlic butter fries., , , Use Russet Potatoes., Russet potatoes give a classic french fry flavor., Leave skins on, but be sure to wash potatoes well and scrub off any excess dirt, remove any eyes or bruises., , Use a mandoline to cut fries., Cut potatoes with a mandoline for easy, perfect sticks that will crisp up well., , Soak fries., Make sure your fries soak for at least one hour in a large bowl of cold water – preferably changing the water after 20 minutes or 30 minutes with fresh new cold water., Soaking in water helps remove some of the starch, which will help them crisp up better!, , Dry fries well after soaking, . Make sure your fries are very very dry after soaking., Pat them with paper towels or a clean dish towel to be sure there is no residual moisture., , Wet fries = soggy fries., , Cook in Single Layer, ., Allowing fries to have room away from each other while air frying helps them cook faster and get crunchier. Fries that have plenty of space to cook should not stick to the air fryer basket and should come out with a gentle shaking of the basket., Sometimes I will add more fries to the basket and simply increase cook time a few minutes, shaking often to make sure the heat is evenly distributed., , Adjust cooktime as needed., , I watch my french fries closely while cooking, and make adjustments as needed., , Every oven and air fryer is different, and I’ve noticed a ton of things impact cook time and even something as small as the humidity in the air can impact cook time., , Rest air fries in warm oven., , I line a baking sheet with paper towels and place a cooling rack over it. When each batch is done from the air fryer, I toss them on the cooling rack and pop the baking sheet in the oven., I set the oven as low as possible – about 200-250 degrees at the most- to keep the fries warm., , , This also lets any excess oil drip off, and prevents fries from becoming cold or soggy., , , What Air Fryer To Use., As far as what kind of air fryer you can use to make french fries, it truly is anything goes – but the hotter you can get your air fryer, the better!, I have a, Phillips Air Fryer, I got from my parents – and we’re loving it!, , Click here to buy a crisping lid for your instant pot., If you need to buy an, Instant Pot Duo Crisp click here, – to, buy a crisping lid, click here, ., , Serve with dipping sauce! Whether its ketchup, , Spicy Whipped Feta, , mayo, , Easy Homemade Blue Cheese Dip, , or, French Fry Sauce, – fries are delicious when you dip them into something!, , , Air Fryer French Fries FAQs, , How long to air fry french fries?, , Air fryer french fries take about 20 minutes to cook., , , What air fryer should I use for crunchy air fryer fries?, , This recipe was designed after testing in the Instant Pot Air fryer, Instant Pot with Crisping Lid broiler function, Ninja Foodi + Broiler lid, and the Phillips Air Fryer. Cooktime was slightly different with each appliance, but each resulted in perfect air fryer fries. Check fries as you cook to make sure they are done to your preference!, , , What type of potatoes should I use for air fryer french fries?, , We personally love the classic potato flavor of russet potatoes for this recipe, but Yukon Golds work well too., , , Can I skip soaking potatoes?, , While you can skip soaking your potatoes before frying, the potatoes will have a harder time crisping up since they won’t have given off some of their starch. Letting potatoes release starch helps them crisp and allows the outside to get crunchy while still light and airy inside!, , , Do I need to dry potatoes before air frying?, , For this recipe it is essential to pat potatoes dry of any water so that the olive oil can stick to the potatoes and help crisp them up without getting soggy., , , Do I need to peel the potatoes for air fryer French fries?, , It’s a matter of personal preference. You can leave the skin on for added texture and flavor, or peel the potatoes if you prefer a smoother texture., , , Can I season the fries with spices and herbs?, , Absolutely! Season the fries with your favorite spices such as salt, pepper, garlic powder, paprika, or herbs like rosemary or thyme before air frying for added flavor., , , How do I keep the fries warm and crispy before serving?, , You can place the cooked fries on a wire rack in a single layer in a warm oven (around 200°F or 93°C) to keep them warm and maintain their crispiness until serving., , , What dipping sauces go well with french fries?, , Common dipping sauces include ketchup, mayonnaise, aioli, BBQ sauce, ranch dressing, or cheese sauce. You can also get creative with homemade sauces or seasonings. We also love our, French Fry Sauce, ., , , What temperature and time should I set on the air fryer for French fries?, , Preheat your air fryer to 375-400°F (190-200°C). Cook the fries for about 15-20 minutes, shaking or flipping them halfway through, until they are golden brown and crispy., , , Can I make this recipe with sweet potatoes?, , These French fries are simple and delicious – and can be used with sweet potatoes, too! You will need to adjust cooking time for crispness with the sweet potatoes for sweet potato fries, but the rest of the recipe can remain the same., , , Are potatoes healthy?, , Potatoes, while a starch, contain many health benefits when eaten in moderation. For more information on the health benefits of potatoes, consider this, potato nutrition guide, ., , , , , What to serve with air fried french fries, , If you’re looking for other delicious, easy air fryer sides like these french fries, be sure to check out our, Air Fryer Chicken Fried Steak Recipe, , , Air Fryer Cinnamon Raisin Bagels, , , The Best Air Fryer Baked Potato Recipe, , , Air Fryer Pumpkin Bundt Cake, , , Air Fryer Naked Chicken Tenders, , , Air Fryer Salsa Chicken Thighs Recipe, , , The Best Air Fryer Bacon Recipe, and some of our recent favorite air fryer recipes below:, , , Chuck Roast in Dutch Oven, The Best Venison Stew Recipe, Easy Smash Burgers, The Best Baked Pork Tenderloin Recipe, , To find our, entire air fryer recipe index, click here, ., , , If you love the best easy air fryer french fries recipe as much as I do, please give it a five star review and help me share on facebook and pinterest!, , , Only have 30 minutes to get dinner on the table? Sign up for my 30 minute dinner plans direct to your inbox!, Find and shop my favorite products in my Amazon storefront here!, , Want to save this recipe?, Just enter your email and get it sent to your inbox! \r\n\r\nPlus you’ll get new recipes from us every week – and be sure to tag @sweetcsdesigns on social media – I love to see your creations!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Name, *, Email, *, Save Recipe, , , More Like this from Sweet C’s Designs, , , , , Air Fryer Meatballs, , Pan Con Tomate, , Egg Roll, , Grilled Tuna Steak, , Peppermint Brownies, , Fried Chicken Tacos, , Garlic Roasted Potatoes, , , , , , Beef Ribs in Oven, , Cheese Danish, , Sausage Roll, , Garlic Knots Recipe, , Best Carne Asada Recipe, , Cajun Jambalaya, , , , , , Lemon Chicken Thighs, , Recipe for Swiss Steak, , Italian Chopped Sandwich, , Couscous Recipe, , , , , , , 4.88, from, 568, votes, , Crispy Air Fryer Fries, , By:, Courtney ODell, Servings:, 6, , servings, , Prep:, 10, minutes, , mins, Cook:, 15, minutes, , mins, Soaking Time:, 1, hour, , hr, Total:, 1, hour, , hr, , 25, minutes, , mins, , , , , , , , , , , , , , , , , , , , , , Crispy, crunchy, healthier than deep fried air fryer french fries are a perfect, delicious, easy side dish everyone loves!, , , , Equipment, Maldon Salt, Sea Salt Flakes, 8.5 oz (240 g), Kosher, Natural, Handcrafted, Gourmet, Pyramid Crystals, StarPack Basics Silicone Kitchen Tongs for Cooking Set (9″ & 12″ Cherry Red) – Stainless Steel Tongs for Cooking with Silicone Tips – Non-Stick & Grill Safe, High Heat Resistant Silicone Tongs (480°F), Instant Vortex Plus 10 Quart Air Fryer, Rotisserie and Convection Oven, Air Fry, Roast, Bake, Dehydrate and Warm, 1500W, Stainless Steel and Black, Ninja OL501 Foodi 6.5 Qt. 14-in-1 Pressure Cooker Steam Fryer with SmartLid, that Air Fries, Proofs & More, with 2-Layer Capacity, 4.6 Qt. Crisp Plate & 25 Recipes, Silver/Black, Instant Vortex Plus 6-in-1 4QT Air Fryer Oven Combo (Free App With 90 Recipes), Customizable Smart Cooking Programs, Nonstick and Dishwasher-Safe Basket, Stainless Steel, Ninja AF101 Air Fryer, 4 Qt, Black/gray, , Using a mandoline or sharp knife, slice the potatoes into fries. I don't worry too much about the size of fry I am making- some are bigger, and some are smaller. That's fine!, Next, place your spuds in a nice cool water bath. Completely submerge the fries in water., Let fries sit one hour. This helps to remove excess starch and will help the fries crisp up more in the oven., Preheat air fryer to 375 degrees., After an hour, drain the water, and pat fries dry with a paper towel., Toss with a couple tablespoons of olive oil, salt and pepper., Add fries to bottom of air fryer basket, making sure they are all on the same level (don't stack them on top of each other.), Cook 15-20 minutes, until crispy and golden brown., Place on a baking sheet lined with paper towels and a cooling rack over it., Place in warm oven (set to the minimum temperature, not over 250 degrees) and let rest while other batches of fries are cooking., Serve hot and enjoy., , Video, , , , , , , , , , Nutrition, Serving:, 1, g, Calories:, 205, kcal, Carbohydrates:, 32, g, Protein:, 4, g, Fat:, 7, g, Saturated Fat:, 1, g, Polyunsaturated Fat:, 6, g, Sodium:, 70, mg, Fiber:, 3, g, Sugar:, 2, g, Nutrition information is automatically calculated, so should only be used as an approximation., , Additional Info, Course:, Side dishes, Cuisine:, air fryer, , , , , , Tried this recipe?, Mention, @sweetcsdesigns, or tag, #sweetcsdesigns, !, , Categorized as:, Air Fryer, , , Appetizers, , , BBQ Sides, , , Instant Pot, , , One Pot, , , popular, , , Potatoes, , , Recipes, , , Side Dishes, , , Vegan, , Like this recipe? Share it with friends!, Pin, Facebook, Tweet, Yummly, Email, , About Courtney, Courtney loves to share great wine, good food, and loves to explore far flung places- all while masting an everyday elegant and easy style at lifestyle blog Sweet C’s Designs. Sweet C's devoted to finding the best food and drinks you'll want to make or find, around the world!, , Read More About Me, , , You May Also Like, , Funeral Potatoes, Scottish Tattie Scones, Cheesy Creamy Mashed Potatoes, Loaded Baked Potato Casserole, , , , 4.88 from 568 votes (, 563 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , , 80 Comments, , , , , , SJ, , says:, , , , March 9, 2025 at 8:54 am, , , , , Perfect fries!, , , Reply, , , , Comment navigation, Older Comments, , , , Sweet C'S, , Welcome to my blog!, , I'm Courtney - a stay-at-home mom, avid traveler, and home cook without formal training - I love sharing the best tips and tricks I've found for creating easy, gourmet quality meals my family loves, as well as fantastic vacation ideas and itineraries from places I love to visit!, , , , , , Read more about me, , , , , , , Popular, , The Best Baked Pork Tenderloin Recipe, Chicken Drumsticks in Air Fryer, Boneless Ribeye Roast Recipe, The Best Broiled Lobster Tails Recipe Ever, , , , Recent, , Sourdough Croutons, Lemon Garlic Aioli, Cadbury Egg Fudge, Peeps Cupcakes, As Seen In, Back to top, Sweet Cs Designs, Recipes, , , Air Fryer, , Appetizers, , Breads, , Breakfast, , Desserts, , , , Desserts, , , Pies & Tarts, , Cupcakes, , Cookies, , Cakes, , Brownies, , , , About, , , About Me, , Contact, , Media Kit, , FAQ, , , , Connect, , , Instagram, , Pinterest, , Facebook, , Twitter, , YouTube, , , , ©2025 Sweet Cs Designs. All rights reserved., , Privacy Policy, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Loading Comments..., , , , , , , , , Write a Comment..., , , , , , Email (Required), , , , , Name (Required), , , , , Website, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Air fried Onion Rings": "Ingredients: When it comes to making these onion rings, using lower carbohydrate alternatives helps to bring down the net carbs in this recipe., The average onion has about eight net carbs in it. Since you will most likely not be eating the entire onion yourself, we can keep the carbs down per onion ring., , , , , , Tips for making Air Fried Onion Rings., , Instead of using all purpose flour and regular breadcrumbs, we will use alternatives. You can find online, low carb flour, such as, Carbalose low carb flour, , , low carb bread crumbs or similar alternative, , , gluten free flour, and, gluten free bread crumbs ., , Here are some more helpful tips., , This recipe involves setting up a dredging station with three bowls. When transferring the sliced onion between bowls, You can make your onion rings even more crisp by giving them a quick spray with, nonstick, or, olive (or other) oil, before placing them into the fryer basket., Take your onion rings up a notch by adding a bit of, seasoning, to the flour mixture. This can include, Italian Seasonings, , , Salt, , and/or, Pepper, ., This is a reminder that you should give your air fryer a quick spray with, nonstick, before adding the onion rings in order to prevent sticking. Also, you will most likely need to make more than one batch rather than overcrowding the basket, for best results., , How to store homemade onion rings., , These onion rings should be stored in an airtight container or zip top bag and refrigerated. They should keep for up to a few days refrigerated and a few months if frozen. You can simply reheat the rings in your air fryer or oven., , Here are some similar recipes that you may also like., , Focaccia Bread with Olives Recipe, Keto Cheddar Goldfish Crackers Recipe, Sugar Free Keto Pop Tarts, Keto Almond Flour Brownies, Sugar Free Keto Pecan Pie Truffles, Keto No Bake Chocolate Cookies, Sugar Free Keto Berry Crumble Bars, Keto Low Carb Vegetable Wraps, , Keep up to date with my recipes, , , , , , , , , , Subscribe to the SugarFreeDiva, , I'll email this post to you as well as my new recipes weekly!, , , , , I agree to be sent emails from thesugarfreediva., , , , , , , , About this recipe for Keto Onion rings., , This is a simple recipe for making onion rings in an air fryer. Air frying these onion rings takes out the oil that is needed for regular frying., , , Making this recipe involves setting up a dredging station with three shallow bowls., , , , , Onion, . Sweet onion tastes best. Slice this onion about ¼-1/2\" thickness., Low Carb Flour, Can use, gluten free flour, for a gluten free version. Make adjustments as needed for your flour., Seasonings, to taste. Such as paprika or, Old Bay, ., Egg- one beaten., Keto Panko, or, Bread Crumbs, .- 1 ½ Cup., Nonstick Spray., , , , , How to make Really Easy and Yummy Low Carb Air Fried Onion Rings., , Carefully slice the onions into rings if you have not done so yet., In a shallow bowl, use a whisk to blend together the low carbohydrate flour and desired seasonings., Next, in a second shallow bowl, whisk your egg., Now, in a third shallow bowl, place your low carb panko or bread crumbs., Preheat your air fryer to 360 and lightly spray the basket for nonstick if needed, Use a fork if needed to dip the first sliced onion in the flour then the egg and lastly, into the panko. Then place the dipped onion into the basket of your air fryer. Repeat this process until you can fill the basket without overcrowding the onions., Air fry the onions for six minutes, stopping halfway to flip them over., Repeat the process until all of the onion rings have been air fried., , , Expert Tip:👉, You can make your onion rings even more crisp by giving them a quick spray with, nonstick, or, olive (or other) oil, before placing them into the fryer basket and then when taking them out., , , , 👇 Have you seen these popular recipes? 👇, , The Best Sugar Free Chocolate Chip Cookies, The Best Sugar Free Chocolate Brownies, 3 Ingredient Sugar Free Peanut Butter Cookies, Sugar Free Banana Bread, , Table of contents for this recipe., Keto Onion Rings that are Perfectly Crisp., Frequently Asked Questions About Air Frying, Tips for making Air Fried Onion Rings., How to store homemade onion rings., About this recipe for Keto Onion rings., How to make Really Easy and Yummy Low Carb Air Fried Onion Rings., , The Recipe Card for Low Carb Air Fried Onion Rings, , , , , Print Recipe, , 4.31, from, 218, votes, , Pin Recipe, , , Keto Low Carb Air Fried Onion Rings, , , This is such a great idea for an appetizer recipe. Really easy and Yummy Low Carb Air Fried Onion Rings. Keto and gluten free options as well., , , , Prep Time, 15, minutes, , mins, , Cook Time, 6, minutes, , mins, , Total Time, 21, minutes, , mins, , , Course:, Appetizer, Side Dish, Snack, Cuisine:, American, , Search Result:, air fried, gluten free, Keto Low Carb Air Fried Onion Rings, low carb, onion rings, , , Servings:, 4, , servings, , Equipment, air fryer, , 1, , Onion Sliced, ⅔, , cup, , Carbalose, , -see post for details and alternatives., 2, , tsp, , Seasonings, 1, , Egg Beaten, 1 ½, , cup, , Keto Bread Crumbs, , -see post for details and alternatives., , , , See, thesugarfreediva.com for details on this recipe., , , most recently updated:, , January 3, 2023, , *About Sugar Alternatives, Specific sugar alternatives are not given in the recipes presented on this site. Only suggestions are given as to the 'kind' of alternative to use. It is up to you to select the alternative to use that suits your needs best. If the recipe is heated or cooked, , , *As an Amazon Associate I earn from qualifying purchases. This means that the links on this website, and specifically on this post, that lead to other sites may be affiliate links., , Nutrition, Serving:, 8, g, |, Calories:, 49, kcal, |, Carbohydrates:, 6, g, |, Protein:, 2, g, |, Fat:, 1, g, |, Saturated Fat:, 0.4, g, |, Polyunsaturated Fat:, 0.2, g, |, Monounsaturated Fat:, 0.4, g, |, Trans Fat:, 0.01, g, |, Cholesterol:, 41, mg, |, Sodium:, 23, mg, |, Potassium:, 145, mg, |, Fiber:, 2, g, |, Sugar:, 4, g, |, Vitamin A:, 102, IU, |, Vitamin C:, 4, mg, |, Calcium:, 62, mg, |, Iron:, 1, mg, , , Really easy and Yummy Low Carb Air Fried Onion Rings., , Please see recipe post for further details on this recipe., , You can see items that have been featured on my, Sugar Free Sunday Spotlight here., , updated 1/23, ........., , «, Sugar Free Glazed Donuts, Focaccia Bread with Olives Recipe, », , Filed Under:, Air Fried, , , Keto and Low Carb Recipes, , , No Added Sugar Appetizers, , , , , , , , , Did you make this recipe?, , Be sure to tag me @thesugarfreediva on social media if you post any photos!, , , , As an Amazon Associate I earn from qualifying purchases. This means that the links on this website, and specifically on this post, that lead to other sites may be affiliate links., , , , , , , , , 4.31 from 218 votes (, 218 ratings without comment, ), , , Primary Sidebar, , , , , Welcome to my kitchen!, , I am Annie and I am sharing some of my favorite no added sugar recipes with you. These recipes are easy and offer a more healthy way to make delicious food- which I love., , , Read more, , , , , , , , , , Popular, , Low Carb Pizza Rolls, The Best Sugar Free Chocolate Chip Cookies, Sugar Free Banana Bread, 3 Ingredient Sugar Free Peanut Butter Cookies, Low Carb Sugar Free Lemon Cheesecake, No Bake Sugar Free Chocolate Cookies, , , Footer, Facebook, Instagram, Pinterest, Twitter, , , Recipes |, , Privacy, |, Disclosure, |, Shopping, |, About |, , Cookie Policy, |, Home Page, |, Top, , , , , Copyright ©, · |  myposhmedia | site by creativesitme |, Contact info & and Disclosure, Privacy policies, , Use of this site means that you agree with the terms and other disclosures of this site., Also, use of the information, recipes, and images without written consent from the owner of this site is prohibited., {Disclosure-This site uses affiliate links which means that there may be compensation involved with reader actions. Thank you!}, As an Amazon Associate I earn from qualifying purchases., This means that the links on this website that lead to other sites may be affiliate links., , , , , , , , , 400, , , , , 157635, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: Air frying can usually be done for about anything that could be fried in oil. Using, air fryer accessories, , you can do a lot more in your air fryer such as baking a cake., , , Are onion rings high in carbs?, , Carefully slice the onions into rings if you have not done so yet., In a shallow bowl, use a whisk to blend together the low carbohydrate flour and desired seasonings., Next, in a second shallow bowl, whisk your egg., Now, in a third shallow bowl, place your low carb panko or bread crumbs, Air fry the onion rings for 8 minutes and then flip them over. Continue to air fry for another 8 minutes or until done, Preheat your air fryer to 360 and lightly spray the basket for nonstick., Use a fork if needed to dip the first sliced onion in the flour then the egg and lastly, into the panko. Then place the dipped onion into the basket of your air fryer., Repeat this process until you can fill the basket without overcrowding the onions., Air fry the onions for six minutes, stopping halfway to flip them over. Repeat the process until all of the onion rings have been air fried., , Recipe Notes, *Please check the nutritional labels to assure that you are sticking to your diet restrictions for any substitutions used., Also, please see the actual recipe post for further details on this recipe., , , Follow Me, , , , , , , , , , , , , Thanks so much for visiting thesugarfreediva.com!, , If you decide to make this recipe, please @thesugarfreediva on social to let me know how it turned out for you., , Looking for a recipe that is not on my site?, , Please let me know and I will work on getting that recipe for you. Happy baking, eating, and enjoying life! Nutritional Information is only an estimate and can thus however"
    }
}