{
    "ingredients": {
        "Air Fryer Cauliflower Wings": "flour,onion powder,almond milk,cauliflower,hot sauce",
        "Sweet Potato Tater Tots": "sweet potatoes,onion powder,corn starch",
        "Buffalo Cauliflower wings": "cauliflower,all purpose flour,corn starch,vegan milk,breadcrumbs,hot sauce,honey,vegan butter",
        "Crispy Veg Nuggets": "potatoes,brocolli,green peas,carrots,sweet corn,coriander,oats powder, bread crumbs,vegan cheese",
        "Broccoli Tots": "brocolli,vegan cheddar,bread crumbs,onion,parsley"
    },
    "recipe_url": {
        "Air Fryer Cauliflower Wings": "https://www.pinterest.com/pin/496592296424257029/",
        "Sweet Potato Tater Tots": "https://jessicainthekitchen.com/sweet-potato-tater-tots-vegan/",
        "Buffalo Cauliflower wings": "https://carameltintedlife.com/air-fryer-cauliflower.../",
        "Crispy Veg Nuggets": "https://youtu.be/XmpEXXg0x04",
        "Broccoli Tots": "fixate_recipes\\Side and Snack\\FXR_Broccoli-Tots_R_02.25.19.pdf"
    },
    "Recipe": {
        "Air Fryer Cauliflower Wings": "Ingredients:  Instructions: ",
        "Sweet Potato Tater Tots": "Ingredients: , , , posted by, , Jessica Hylton, , on, Nov 5, 2021, , 25 comments », , , Jump to Recipe, , Jump to Video, , 4.94, (from, 16, ratings), , , , , , , , , , , , , , , , , , , , , , , , , , , , , , These homemade Sweet Potato Tater Tots have it all! They’re savory and sweet, smoky and salty, and each bite has a crispy exterior and pillowy-soft center. So good!, , , , , Tater tots are always a fun snack or side, but I think sweet potato tots are even better because they deliver all that crispy-crunchy-snacky goodness., , While it takes a little bit more work to make sweet potato tater tots from scratch as opposed to buying them frozen, it’s definitely worth the effort. This recipe is a lot more flavorful than store-bought, especially with the addition of smoked paprika; you can also control the oil and salt content when you’re DIYing it., , , I love serving these tots as a side for a, veggie burger, , or you can place them on a sheet pan and top them with, vegan queso, , , bacon, , and other toppings to make the most epic totchos you’ve ever tasted., , WATCH THE VIDEO TO SEE HOW IT’S MADE:, , , , , , , , , Sweet potatoes, – Any variety will work in this recipe., , Smoked paprika, – Smoked paprika isn’t the same as standard paprika; if you don’t have smoked paprika on hand, I definitely recommend picking it up!, , Garlic powder, , Onion powder, , Sea salt, , Coconut oil, – I love the way coconut oil compliments the flavor of sweet potatoes, but you can use another cooking oil if you prefer., , Cornstarch, – The secret to a crispy, crunchy exterior!, , , How to Make Sweet Potato Tater Tots, , While these require more work than frozen tater tots, they’re still quite easy to make! Here’s what you’ll need to do., , Prepare., Preheat your oven to 425°F/220°C and line two baking sheets with either silicone baking mats or well-greased parchment paper., , , , Parboil the sweet potatoes., Bring a large pot of water to a boil, then carefully place the sweet potatoes into the water and parboil them for 18 to 20 minutes, or until they’re still firm, but they can be easily pierced with a fork. Drain and rinse with cold water., , , , , , Prep the sweet potatoes., Once the sweet potatoes have cooled, peel off the skins using your fingers or a spoon. Grate the sweet potatoes into a large bowl., , , , , , Add the paprika, garlic and onion powders, cornstarch, salt, and a tablespoon of coconut oil to the bowl with the shredded sweet potatoes. Stir to combine., , , , , , Form your tots., Use a tablespoon to scoop out the tater tot mixture, then form it into a tot shape with your hands. Transfer to the prepared baking sheet, then repeat until all of the sweet potato mixture is used. Brush the finished tots with oil., , Bake., Place the baking sheet in the oven and bake the tater tots for 20 minutes; flip them over, then bake for another 20 minutes, or until they’re crispy and golden brown. Cool slightly, then serve., , , , Tips for Success, , Here are some tips to make sure your sweet potato tots turn out perfect every time!, , , Keep an eye on the potatoes., Sweet potatoes come in so many shapes and sizes, which means cooking times can vary! I recommend buying two potatoes that are similar in size and shape; if you use smaller potatoes, check for doneness after about 15 minutes., , Cornstarch substitutes., If you can’t use cornstarch, don’t just omit it—it helps hold the tots together and gives them that signature crunchy exterior. You can substitute all-purpose flour, tapioca starch, or arrowroot powder., , Adding salt., If you want to season these with additional salt, I recommend doing so right when you take them out of the oven. The salt will stick better when the tots are piping hot!, , , , , How to Store and Reheat Homemade Tater Tots, , If you have leftover sweet potato tots, they can go in an airtight storage container and be refrigerated for up to 3 days. To keep that exterior nice and crispy, reheat them in an oven set to 350ºF for about 15 minutes, or until warmed through., , Can I Freeze This Recipe?, , Yes, you can freeze these! To keep them from sticking together, freeze them on a parchment-lined baking sheet, then when they’re frozen through, you can transfer them to a freezer bag. Bake them in the oven at 350ºF until they’re warmed through or thaw them in the fridge overnight, then reheat in your oven or toaster oven., , , , , , , , Enjoy friends! If you make this sweet potato tater tots recipe, please snap a photo and tag, #jessicainthekitchen, on, Instagram, ! We’d also love it if you would leave a comment below, and give the recipe a rating! Thanks so much!, , , Save This Recipe Form, , , , Newsletter, , , , , , , Want to save this recipe?, , Enter your email below & I’ll send it straight to your inbox., Plus you’ll get new recipes from me every week!, SEND IT!, , , , , , , Servings:, 6, , servings, , Prep Time:, 10, minutes, , mins, Cook Time:, 1, hour, , hr, Total Time:, 1, hour, , hr, , 10, minutes, , mins, , , These Sweet Potato Tater Tots are great for kids! Crunchy on the outside, , 4.94, (from, 16, ratings), , , Print Recipe, , Pin Recipe, , Leave a Review, , , , , Cook Mode, Prevent your screen from going dark, , 2, , lbs, , sweet potatoes, , , (32 oz/907g), preferably larger even sized potatoes, 1, , teaspoon, , smoked paprika, 1, , teaspoon, , garlic powder, ½, , teaspoon, , onion powder, ¾, , teaspoon, , sea salt, 1, , tablespoon, , coconut oil + 1 teaspoon for brushing, , , any oil works, 2, , teaspoons, , cornstarch, , , , , , , Ashley, —, January 8, 2024 @ 7:13 am, , Reply, , , Hi! These look amazing. Do you think they would work well pressing them into a silicone mini muffin pan and then baking? I’m hoping to cut down on the time it takes to shape them. Thanks!, , , , , , , Jessica Hylton, —, January 9, 2024 @ 12:42 pm, , Reply, , , Hi Ashley,, , Great idea and yes!!! Not sure what baking time would be if they are rolled slightly larger but just check around the same time then add 5 mins increments!, , , , , , , , , Yum!, —, February 29, 2024 @ 11:13 pm, , Reply, , , So good! I forgot the cornstarch and they still turned out great. Delicious seasoning, great texture., , , , , , , Stephanie, —, April 22, 2024 @ 10:48 am, , Reply, , , Can I freeze these before cooking?if so would you take them out of the freezer and cook the same way?, , , , , , , Jessica Hylton, —, April 22, 2024 @ 2:08 pm, , Reply, , , Hi Stephanie,, , I would instead recommend fully cooking them then freezing them, then reheating them like how the recipe suggests! Freezing before cooking will put a lot of water into the finished product, and they won’t come out as crispy as you’d like. Hope this helps!, , , , , , , , , « Older Comments, , 1, , 2, , , , Leave a comment », , , , , , , , , , , , , Welcome!, Hi, I’m Jessica!, , Jessica is an award-winning photographer, videographer and home chef who is also now a new mom! Her mission is to provide thoroughly-tested simple and delicious meals from her kitchen to yours., , Jessica has been featured in The Washington Post, Essence Magazine, Google for Creators, The Oprah Magazine, Country Living and many more publications., , More About Jessica, , , Follow me:, , , Instagram, , , , Facebook, , , , Pinterest, , , , Twitter, , , , , , , , , Search Recipes:, , , , Submit, , , , , , , , , Get Jessica’s recipes directly to your inbox:, , Plus receive a FREE Weeknight Vegan Dinners Cookbook!, , , , , SEND ME:, new post updates, weekly roundup, , , , , Recent Posts, , , , , , Almond Milk, , , , , , , Chili Cornbread Casserole, , , , , , , Vegan Burritos, , , , , , , Carrot Cake Muffins, , , , , , , Kale Soup, , , , , , , Oatmeal Breakfast Cookies, , , , , , , , , , , As Seen In…, As Seen In…, , , , , , Get Jessica’s recipes directly to your inbox:, , Plus receive a FREE Weeknight Vegan Dinners Cookbook!, , , , , SEND ME:, new post updates, weekly roundup, , , , , , , ^ Back to Top, , Home, , About, , Press, , FAQ, , Privacy Policy, , Contact, , Accessibility Statement, , , , , , ©2025 Jessica in the Kitchen, ., Design by, , Purr, ., , , , , , , , , , , Submit, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , , , , , Instructions: Preheat your oven to 425°F/220°C. Line two baking sheets with silicone mats or well greased parchment paper., Set a pot of water to boil. Add in the sweet potatoes and parboil for 18-20 minutes. This works best for larger sweet potatoes (like two large), so if using smaller sweet potatoes start to check around 15 minutes that a fork can stick into the middle of it, but is still firm., Remove from boiling water and run cold water over the potatoes to stop them from cooking. Allow to cool completely. Once potatoes are cooled, use your fingers or a spoon and peel the skins off. They should slip off very easily., Using a large side of a grater, grate all of the sweet potatoes, then add shreds into a large bowl., Add in the smoked paprika, garlic powder, onion powder, cornstarch, sea salt and 1 tablespoon of coconut oil. Using a spatula, stir everything together to combine throughly. The mixture should be cooked through, and soft enough to squeeze together., Now, it’s time to form the tater tots. Using a tablespoon measurer, press the sweet potato mixture into the measurer. Then scoops out with your hands and form like a tater tot above in the photos – hold both ends with index finger and thumb, then rub/roll the centre into little tot. Line the baking sheets with the tater tots – leaving enough space so that they do not touch. You should get at least 30 tots., Using a regular or silicone pastry brush, brush the tater tots with the rest of the coconut oil on the outsides. This will really help it to crisp up. I like to brush both sides., Bake the tater tots in the middle rack of your oven for 40 minutes, flipping once at 20 minutes to get both sides well golden brown., Remove from oven and allow to cool slightly. Serve with your favourite dip, top with more salt if desired and enjoy!, , , Notes, Notes, , , , * if you can’t use cornstarch you can sub tapioca starch or arrowroot powder, or even flour., , , , , Storing in Fridge:, If you have leftover sweet potato tots, they can go in an airtight storage container and be refrigerated for up to 3 days., , , , Reheating:, To keep that exterior nice and crispy, reheat them in an oven set to 350ºF for about 15 minutes, or until warmed through., , , , Freezing:, You can freeze these in a flat layer like on a baking sheet (not touching), then when they are all frozen you can put them in a bag together. Thaw them in the oven at 350 until thawed. Or, you can thaw them in the fridge overnight them reheat in your oven or toaster oven, whichever you prefer., , , , , Calories:, 156, kcal, , , Carbohydrates:, 32, g, , , Protein:, 3, g, , , Fat:, 2, g, , , Saturated Fat:, 2, g, , , Sodium:, 375, mg, , , Potassium:, 523, mg, , , Fiber:, 5, g, , , Sugar:, 6, g, , , Vitamin A:, 21615, IU, , , Vitamin C:, 4, mg, , , Calcium:, 45, mg, , , Iron:, 1, mg, , Disclaimer: Although jessicainthekitchen.com attempts to provide accurate nutritional information, kindly note that these are only estimates. Nutritional information may be affected based on the product type, the brand that was purchased, and in other unforeseeable ways. Jessicainthekitchen.com will not be held liable for any loss or damage resulting for your reliance on nutritional information. If you need to follow a specific caloric regimen, please consult your doctor first., , , , Cuisine:, American, Course:, Lunch, Snacks, Author:, Jessica Hylton, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Breakfast, , Dairy Free, , Egg Free, , Fall, , Gluten Free, , Lunch, , Nut Free, , Recipes, , Snacks, , Soy Free, , Spring, , Summer, , Vegan, , Vegetarian, , Winter, , , , published on, Nov 5, 2021, , , 25 comments, , , Leave a comment », , , , , , , , , « Previous Post, Overnight Baked French Toast Casserole (Vegan), , Next Post », , Vegan Scalloped Potatoes, , , , , , , 4.94 from 16 votes (, 14 ratings without comment, ), , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , , ",
        "Buffalo Cauliflower wings": "Ingredients: , , For the crispy air fryer cauliflower:, , Cauliflower, : 1 small head of cauliflower, cut into bite-sized florets, , Flour, : Use regular all-purpose flour (or substitute with gluten-free flour such as Bob’s Red Mill All Purpose Flour), , Cornstarch, : A little cornstarch is good to add to the batter as a binder, and also helps in crisping up the cornflower., , Panko Breadcrumbs:, If you're looking for super crispy air fried cauliflower, this is what you need! Breaded cauliflower crisps up so well in the air fryer., , For the buffalo sauce:, , Hot Sauce:, I used a hot sauce from my local grocery store (in Switzerland). If you are based in the US, Frank's Hot Sauce is highly recommened by readers., , Melted Butter and Honey:, Both butter and honey add so much flavor to the sauce. You can skip the butter if you want to make it vegan (or avoid the extra calories)., , , , 1x, 2x, 3x, ▢, 1, , small head cauliflower, , cut into bite-sized florets, ▢, ½, , cup, , all purpose flour, , or use gluten free flour, ▢, ¼, , cup, , Cornstarch, ▢, ⅓, , cup, , Milk, , use cashew milk for a vegan option, ▢, ¾, , teaspoon, , garlic powder, ▢, ½, , teaspoon, , salt, , to season, ▢, 1, , teaspoon, , olive oil, ▢, 1, , cup, , Panko breadcrumbs, , add more as needed for breading, For the sauce, ▢, ⅓, , cup, , hot sauce, ▢, 2, , tablespoons, , honey, ▢, 1.5, , tablespoons, , melted butter,  Instructions: Expert Tips, Recipe Variations, Similar Recipes, Air Fryer Cauliflower Wings Recipe, , These crispy buffalo cauliflower wings are absolutely made for air frying. I love how crunchy the breaded cauliflower becomes when air fried. The best part is that once tossed in the hot sauce, they don’t turn limp or soggy – they stay crisp on the outside, and tender inside! Let me assure you that I am never going to go back to deep-frying cauliflower again. Air fried Crispy cauliflower wings are simply so much better than fried, and crunchier than baked., , About that buffalo sauce - the air fried cauliflower is tossed up in a mix of hot sauce, honey and melted butter (or olive oil). And the result - saucy, glazed caufliflower wings that are so delicious, you'd be tempted to eat them all in one sitting!, , , Ingredient Notes, , , To make this recipe, start by making the batter for the cauliflower., , In a large mixing bowl, add flour, cornstarch, olive oil, salt, garlic powder and just enough milk to make a thick, yet runny batter as seen below., , Add in the cauliflower pieces and mix well, to coat the cauliflower in the batter. Then transfer each cauliflower to a plate with panko breadcrumbs. Dredge them in the breadcrumbs., , , After dredging, place them on a rack to let the excess batter drip / fall off., , , Preheat your air fryer at 390 F for 5 minutes. Then take out the air fryer basket and place the breaded cauliflower in a single layer. Do not crowd the basket, else the cauliflower will not crisp up properly., , Air fry at 390 F for 20 minutes. At the 10 minute mark, take out the basket and flip the cauliflower so that they air fry evenly. Continue to air fry., , Optional step: At the 15 minute mark, I like to take out the basker and brush over some olive oil to give the cauliflower a nice glaze., , , Once done, transfer the air fried cauliflower bites into a large mixing bowl., , Prepare the buffalo sauce - mix together the hot sauce, melted butter, honey in a bowl and pour this mixture over the breaded cauliflower. Toss the bowl, coating the cauliflower nicely with the sauce., , , And that's is! Your air fryer buffalo cauliflower wings are now ready. I like to serve them with a side of homemade ranch dressing., , , Expert Tips, , Use panko bread crumbs:, To make these air fried cauliflower bites extra crispy and crunchy, you don't want to skip the panko bread crumbs. The crunch on the breaded cauliflower is to be heard to be believed!, , Use milk, not water for the batter:, I have recipe tested these buffalo cauliflower wings 5 times, and I definitely recommend using milk over water to make the batter. The coating is light, yet crisp, and doesn't turn soggy. The milk also enriches the taste of these wings, so yes, do not replace milk with water! Use a dairy-free substitute such as cashew milk, for a vegan option., , Recipe Variations, , BBQ Cauliflower Wings, : Replace the hot sauce in this recipe with your favorite brand of BBQ sauce. Then simple toss up the air fried breaded cauliflower in bbq sauce until it is well coated., , Sesame Honey wings, : Use the basic breaded cauliflower recipe to make the crispy air fried cauliflower. In a separate bowl, mix together equal amounts of soy sauce and honey, add a dash of sriracha sauce and sesame oil to season. Toss in the air fried crispy cauliflower, mix well until cauliflower is coated in the sauce, garnish with sesame seeds and serve!, , Make them gluten free, : If you are on a gluten-free diet, simple replace the all purpose flour with your preferred brand of gluten free flour (US readers, Bob’s Red Mill All Purpose GF Flour comes highly reommended), , Make them vegan, : To make crispy vegan cauliflower wings, simply substitute the milk in the batter with dairy-free milk such as cashew milk. Skip the butter in the sauce, and replace it with olive oil., , Similar Recipes, , You might also like these appetizers that our community loves!, , Air Fryer Baby Potatoes, , Air Fryer Corn on the Cob, , Herb Garlic Smashed Potatoes, , Beetroot Tikkis, , Crispiest baked potato wedges, , , , , Air Fryer Cauliflower Wings Recipe, , , Shinta, , , Super crisp and crunchy air fried cauliflower wings are perfect for any occasion - from game day to party sides, , , 5, from, 4, votes, , , , Print Recipe, , Pin Recipe, , , , , , Prep Time, 10, minutes, , mins, Cook Time, 20, minutes, , mins, , , , , , , Course, Appetizer, Side Dish, Snack, Cuisine, American, , , , , , Servings, 4, Calories, 265, , kcal, , , , Equipment, ▢, Air Fryer, , , To make the crispy air fried cauliflower, Start by making the batter for the cauliflower. In a large mixing bowl, add flour, cornstarch, salt, garlic powder, olive oil and just enough milk to make a thick, yet runny batter. Batter should be thinner than pancake batter, and thick enough to coat the back of a spoon., Add in the cauliflower pieces and mix well, to coat the cauliflower in the batter., Then transfer each cauliflower to a plate with panko breadcrumbs. Dredge the pieces to coat evenly in the breadcrumbs., Optional step - After dredging, place them on a rack to let the excess batter drip off., Preheat your air fryer at 390 F for 5 minutes., Then take out the air fryer basket and place the breaded cauliflower in a single layer. Do not crowd the basket, else the cauliflower will not crisp up properly., Air fry at 390 F for 20 minutes. At the 10 minute mark, take out the basket and flip the cauliflower so that they air fry evenly. Continue to air fry., Optional step - At the 15-minute mark, I like to take out the basket and brush the cauliflower pieces with some olive oil to make them brown evenly., Once the air frying cycle is over, transfer the air-fried cauliflower bites into a large mixing bowl., To make the buffalo sauce, Mix together the hot sauce, melted butter, honey in a bowl and pour this mixture over the breaded cauliflower. Toss the bowl, coating the cauliflower nicely with the sauce., Your air fryer buffalo cauliflower wings are now ready. Serve them with a side of homemade ranch dressing., , Video, , Nutrition, Calories:, 265, kcal, Carbohydrates:, 46, g, Protein:, 7, g, Fat:, 7, g, Saturated Fat:, 4, g, Polyunsaturated Fat:, 1, g, Monounsaturated Fat:, 2, g, Trans Fat:, 1, g, Cholesterol:, 14, mg, Sodium:, 879, mg, Potassium:, 551, mg, Fiber:, 4, g, Sugar:, 14, g, Vitamin A:, 213, IU, Vitamin C:, 84, mg, Calcium:, 99, mg, Iron:, 2, mg, , , , , Keyword, air fryer cauliflower wings, breaded cauliflower, buffalo cauliflower, crispy cauliflower, , , , , , Have you Tried this Recipe? Tag me Today!, Tag me on Instagram!, @carameltintedlife, or use the hashtag, #carameltintedlife, , «, Cabbage Thoran | Kerala Cabbage Stir Fry, Instant Pot Kheer | Instant Pot Rice Pudding, », , , , 2813, , shares, , , , , , , , , , , , , , , , , , , , , , , , , Reader Interactions, Comments, , , , , , Laurie Brown, , says, , , August 29, 2021 at 4:27 am, , , , Hi! This looks amazing and I want to give it a try thirs week. I don't have an air fryer though, and would like to bake them. Would you know the oven temp and cooking time to do that? Thanks in advance, these look perfect for football night 🙂, , , , , , , , , Shinta, , says, , , August 30, 2021 at 11:39 am, , , , Hi Laurie, you can make it in the oven instead of the air fryer - simply bake at 350 F for 35 minutes, flipping over once. Hope this helps, , , , , , , , , , 5 from 4 votes (, 4 ratings without comment, ), , , Primary Sidebar, , Shinta Simon, , is always on the lookout for inspiration for her next meal. She shares recipes for family meals, Instant Pot recipes and more, , , Read more..., , , Recent Recipes, , , Popular Posts, , Cashew Chicken Recipe | Takeout style Cashew Chicken, Vegetable Stew | Kerala Ishtew | Vegan Stew, Saag Paneer  | Palak Paneer  | How to make Saag Paneer, Mango Salad with Avocado and Berries, Green Goddess Chicken Salad, Air Fryer Chicken Wings - Extra Crispy Honey Lemon Pepper Wings, Instant Pot Beet Hummus, , Footer, Affiliate Links, , Caramel Tinted Life is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn advertising fees by advertising and linking to amazon.com and affiliated sites., , , , , Privacy Policy, , Work With Me, , About, , , , , Footer, , ^ back to top, , , , About, , Privacy Policy, About Me, , , , FREE e-book, , Sign Up!, for a FREE e-book on, Indian Recipes, , , , Contact, , Contact, , , , As an Amazon Associate I earn from qualifying purchases., , Copyright © 2021 Caramel Tinted Life | Technical Partner </>, Host My Blog, , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , ,",
        "Crispy Veg Nuggets": "Ingredients:  Instructions: ",
        "Broccoli Tots": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., BROCCOLI TOTS, SERVES: 4 (approx. 6 tots each) Prep Time: 20 min.  Cooking Time: 31 min., CONTAINER EQUIVALENTS (per serving):, 1, 1⁄2, 1⁄2, , Hot water, 4 cups, broccoli florets, 2, large eggs, ½ cup, shredded Cheddar cheese, ½ cup, gluten-free panko bread crumbs, ¼ cup, finely chopped onion, (approx. 1⁄3 medium), 2 Tbsp., finely chopped parsley, ¾ tsp., sea salt (or Himalayan salt), SPECIAL EQUIPMENT:, Parchment paper, Cheesecloth, 1. \t Preheat oven to 400° F., 2.\t\t Line baking sheet with parchment paper. Set aside., 3.\t\t Heat large saucepan of water to boiling over high heat., 4.\t\t While water is coming to a boil, place broccoli in food processor; process, until it is rice-like consistency., 5.\t\t Add broccoli to boiling water; blanch for 30 seconds to 1 minute. Drain, and rinse under cold water until cool. Place in cheesecloth (or clean, kitchen towel); wring out excess water., 6.\t\t Place broccoli, eggs, cheese, bread crumbs, onion, parsley, and salt in food, processor; pulse until well blended., 7.\t\t To make each tot, shape approximately 1 packed Tbsp. broccoli mixture, into tot shape. Place on prepared pan., 8.\t\t Bake for 22 to 25 minutes, rotating pan after 12 minutes, or until crispy., , RECIPE NOTES:, •\t Enjoy these tots with FIXATE Ketchup. The FIXATE Ketchup recipe, and nutritionals are available on Beachbody On Demand in our FIXATE, cooking show videos., •\t Store leftover tots in an airtight container in the refrigerator for up to, 5 days., NUTRITIONAL INFORMATION (per serving): Calories: 153  Total Fat: 7 g  Saturated Fat: 4 g  Cholesterol: 10 mg  Sodium: 662 mg  Carbohydrates: 13 g  Fiber: 1 g, Sugars: 1 g  Protein: 9 g, RECIPES, © 2019 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., 2, Instructions: "
    }
}