{
    "ingredients": {
        "Sweet Potato Avocado Bites": "sweet potatoes,avocado,lime juice,cherry tomatoes,radish sprouts",
        "Vegan cheesy Broccoli Quinoa Bites": "quinoa,broccoli,flaxseed powder,almond flour,nutritional yeast,lemon juice,vegan mayo,sriracha",
        "Spicy Cauliflower Bites": "cauliflower,hot pepper sauce,rice vinegar,onion powder,maple syrup,worcestershire sauce vegan,vegan butter,corn starch",
        "Nashville Vegan Cauliflower Bites": "cauliflower,non dairy milk,hot sauce,onion powder,flour,corn starch,baking powder,vegan butter,vinegar",
        "Air fried cauliflower buffalo bites": "cauliflower,red hot sauce,almond flour",
        "Vegan Spinach Balls": "spinach,cashews,almonds,egg,red onion,oats"
    },
    "recipe_url": {
        "Sweet Potato Avocado Bites": "https://www.blissfulbasil.com/sweet-potato-avocado-bites/#recipe",
        "Vegan cheesy Broccoli Quinoa Bites": "https://www.blissfulbasil.com/vegan-cheesy-broccoli-quinoa-bites-with-sriracha-aioli/#recipe",
        "Spicy Cauliflower Bites": "fixate_recipes\\Side and Snack\\FXR_Spicy_Cauliflower_Bites_R_03.19.18.pdf",
        "Nashville Vegan Cauliflower Bites": "https://www.veganricha.com/vegan-nashville-hot-cauliflower-bites/#recipe",
        "Air fried cauliflower buffalo bites": "https://diethood.com/air-fryer-buffalo-cauliflower-bites/",
        "Vegan Spinach Balls": "https://www.veganfamilyrecipes.com/vegan-spinach-balls/"
    },
    "Recipe": {
        "Sweet Potato Avocado Bites": "Ingredients: 2, , medium sweet potatoes, scrubbed and sliced into ¼-inch thick pieces, ½, , teaspoon, , cumin, ½, , teaspoon, , smoked paprika, Sea salt, to taste, 1 ½, , teaspoons, , olive oil, 1, , large avocado, pitted, ¼, , cup, , fresh lime juice, ½, , teaspoon, , sea salt, 5, , cherry tomatoes, sliced into ⅛-inch thick pieces, ½, , cup, , radish sprouts,  Instructions: Preheat oven to 400 degrees Fahrenheit., Add the sliced sweet potatoes, cumin, paprika, olive oil, and sea salt to a bowl. Toss to coat., Line a baking sheet with parchment paper and spread the sweet potato slices out into a single layer. Bake for 15 minutes or until tender., Scoop the flesh of the avocado into a medium bowl. Add the lime juice and ½ teaspoon sea salt and mash together with the back of a fork., Spread the sweet potato slices out of a serving platter or tray. Top each slice with a dollop of smashed avocado, one tomato slice, and a sprinkling of radish sprouts., Serve and enjoy!, , , , , , Related Posts, Springtime Avocado and Radish Toasts, Soft and Tender Peanut Butter Cookies | Vegan and Gluten-Free, Sweet & Smoky Poblano, Corn, and Avocado Salsa, 7-Ingredient Hasselback Sweet Potatoes with Avocado Aioli | vegan, gluten-free, Carrot, Lentil & Squash Soup with Walnut Croutons, Creamy Avocado, Artichoke & Kale Dip, , More Appetizers, Vegan Spicy Cauliflower Cashew Cheese Dip, Garlic Herb Burst Tomatoes, Loaded Nacho Potato Wedges, Vegan Cauliflower Cashew Spinach Artichoke Dip, , , , Stay in Touch, , Facebook, Instagram, Pinterest, Snapchat, Twitter, YouTube, , Reader Interactions, Comments, , , , , , Lauren Overholser, , says, , , March 24, 2014 at 9:12 am, , , , Ashley,, , Exciting news! I am always intrigued but the vegan lifestyle but don't feel like I could sustain it living here in Texas (you know, the land of omnivores). I love your blog, recipes and I identify with so many of the reasons you're commiting to becoming vegan. I wish you luck and will continue to follow along right here!, , , Reply, , , , , , , , Ashley, , says, , , March 25, 2014 at 7:47 am, , , , Lauren, thank you for all of the kind compliments and support! AND thank you for reading -- it means so much to me!, , , Reply, , , , , , , , , , Kaylee @ Lemons and Basil, , says, , , March 24, 2014 at 10:45 am, , , , Ashely, these look amazing! So vibrant and colorful! And I LOVE sweet potatoes and avocados, I'm afraid if I make these for company, I'll eat them all before they arrive!, , As for going 100% Vegan, congratulations on your decision, I wish you all the best! And just remember that if you are given any flack or judgement for your decision, then the issue lies with the one doing the judging, not you! Excited for you! :-), , , Reply, , , , , , , , Ashley, , says, , , March 25, 2014 at 7:43 am, , , , Thanks so much for your support, Kaylee!, , , Reply, , , , , , , , , , Sarah, , says, , , March 24, 2014 at 4:59 pm, , , , Sweet Potato + Avocado - I have never put those together before... I love avocado. I will have to try this, thanks Ashely., , , Reply, , , , , , , , Ashley, , says, , , March 25, 2014 at 7:47 am, , , , It's a a surprisingly addictive and delicious combination. I hope you enjoy it, Sarah!, , , Reply, , , , , , , , , , Christine @ Ciao Veggie, , says, , , March 25, 2014 at 10:54 am, , , , This looks amazing as always! I've been a subscriber to your feed for a while and I always look forward to your posts. Thought it was the right time to say hi and congratulations! Going vegan is a huge decision, it takes time, you need to try it on for size so it makes sense that you did it in stages. The important thing is that you feel comfortable living within your own values- it brings a peace that nothing else can. And it's OK to take us readers with you on that journey- it is not confusing, it is what makes blogs so interesting and human! Keep up the great work! :), , , Reply, , , , , , , , Ashley, , says, , , March 26, 2014 at 9:28 am, , , , Christine, thank you so much for your supportive words; they brought such a smile to my face as I read them! You are so right, the most important thing is finding peace and comfort within our own values. I'm glad to hear you've enjoyed following along on my journey and haven't been confused by it! Thank you for reading and commenting :), , , Reply, , , , , , , , , , Lauren, , says, , , March 25, 2014 at 8:22 pm, , , , Hi Ashley,, , I just found your site and am loving it! This recipe is so creative, I bet the sweet potato and avocado pair together so well. Though I only eat vegan about 80% of the time, I admire those that have made the full commitment. I have so many allergies to plant-based foods, that I feel the need to incorporate a bit of meat every once in a while. I look forward to reading more from you!, , , Reply, , , , , , , , Ashley, , says, , , March 26, 2014 at 9:05 am, , , , Hi Lauren! Thank you so much for your sweet words. That would be so challenging to be completely vegan with allergies to plant-based foods, but I think it's so awesome that you have found a balance that works so well for you., , Also, it's so serendipitous that you commented, because I just found your site the other week and fell in love with it! Your photography work is beautiful and your recipes look delicious. I will definitely be reading more from you, as well!, , , Reply, , , , , , , , , , Tenisha, , says, , , March 30, 2014 at 7:34 pm, , , , Just made these and they are delicious!, , , Reply, , , , , , , , Celeste Jackson, , says, , , April 09, 2014 at 4:54 pm, , , , Love these! Made them for dinner last night. The seasoning on the sweet potatoes is perfect. Simple to make too., , , Reply, , , , , , , , Lydia Lawson, , says, , , December 10, 2014 at 3:24 pm, , , , Are you supposed to let the potatoes cool before assembling? I want to bring these to a party but unsure how they will taste cold, and I don't want the avacado to melt on the hot potatoes., , , Reply, , , , , , , , Ashley, , says, , , December 11, 2014 at 11:09 am, , , , Hi Lydia! You can let them cool a bit before assembling, but there's no need to as the avocado doesn't really melt. However, if you're preparing them well in advance of the party (more than an hour or so), I would dollop the avocado on when you arrive simply so that it doesn't brown. I hope this helps, and enjoy!, , , Reply, , , , , , , , , , Diana Gellatly, , says, , , January 01, 2015 at 9:04 pm, , , , Thank you so much for this recipe. I'm so happy for you becoming a vegan. God bless you and your family., I too am starting over this year and getting back into  it.  I just need some good recipes. I got real tired of eating the same things. This year with the help of our Lord, it will be a better year., Thanks for all you do for us,, Diana, , , Reply, , , , , , , , Ashley, , says, , , January 05, 2015 at 2:28 pm, , , , Thanks so much, Diana! I'm so glad you're getting back into veganism. I hope you find the recipes delicious and helpful in your transition back!, , , Reply, , , , , , , , , , Sammy;s dad, , says, , , February 27, 2015 at 3:05 am, , , , I made these for my daughter who is vegan. Didn't have paprika so used garlic powder. Didn't have radish sprouts so used alfalfa sprouts. She (and I) loved them and this will be  staple around our house from now on. So easy, so tasty and another great use for sweet potato...Thanks, , , Reply, , , , , , , , Ashley, , says, , , February 27, 2015 at 7:23 pm, , , , Hi, Sammy's Dad! :) How sweet of you to make these for your daughter. I'm so glad that you both enjoyed them and that they will be a staple in your house. Thanks for taking the time to come back and share your thoughts and substitutions!, , , Reply, , , , , , , , , , Gaby f, , says, , , April 17, 2015 at 8:17 pm, , , , It's made these. Eating them as I type and I must say, wow they are delicious! I've never had avocado with sweet potato before but the combination tastes incredible. Thanks for the recipe!, , , Reply, , , , , , , , Amelia Buffaloe, , says, , , April 26, 2015 at 1:40 pm, , , , Ashley,, , I stumbled on your website via Pinterest a few monthly ago when I decided to go Vegan for 30 days as a challenge for myself. My boyfriend has been Vegan for a decade and Since I met him I have been eating Vegan 90% of the time so I began to research and educate myself on the unfortunate facts of dairy farms and slaughter houses on the U.S. After my 30 days I decided, in part of my love for animals to go full-on Vegan. Your story inspired me and supported me in my endeavor these last few months. I love your recipes and they get me excited about making vegan cuisine. Thank you for sharing with the online community - you keep me looking forward to dinner., , , Reply, , , , , , , , Ashley, , says, , , April 27, 2015 at 12:39 pm, , , , Hi, Amelia! I'm so glad Pinterest connected you to my site; what would we do without it?! That is so amazing that your 30-day vegan challenge turned into going fully vegan, and I'm touched that my story offered a bit of support during the transition. Thank you for taking the time to share such kind and supportive words. I wish you all the best in your continued vegan journey! xo, , , Reply, , , , , , , , , , Beth A Blair, , says, , , April 28, 2015 at 11:10 am, , , , I am raw vegan....going to recreate this totally raw! Going to slice the sweet potatoes a little bit thinner and place in dehydrator for a while and see what happens! Look and sound delicious!!, , , Reply, , , , , , , , Ashley, , says, , , May 11, 2015 at 10:55 am, , , , I love this idea, Beth! I hope dehydrating them worked out well for you and that you enjoyed the recipe!, , , Reply, , , , , , , , , , Eden Passante, , says, , , December 03, 2015 at 11:45 am, , , , Love this idea for an appetizer! The colors are beautiful too!, , , Reply, , , , , , , , Jessica H, , says, , , December 16, 2015 at 9:34 pm, , , , Will these still be tasty if I make them the night before a party? Should I re toast the potatoes before assembly?, , , Reply, , , , , , , , Ashley, , says, , , December 17, 2015 at 7:03 pm, , , , You can definitely make the potatoes ahead of time and reheat in the oven, I'd just hold off on prepping the other components until just before serving. I hope this helps -- enjoy!, , , Reply, , , , , , , , , , Morgan Downing, , says, , , December 23, 2015 at 11:50 am, , , , I'm am so proud of you for taking the next step to a truly compassionate lifestyle. You are saving the planet, animals and fellow humans! It's going to be hard, trust me. But, keep your head up! My Instagram @mdowning16 has ton of yummy, quick vegan meals. Thank you for coming to the light side! ???? Also, this recipie is going to be a hit at my (still-not-vegan) family Christmas. I hope to change some minds this holiday season!, , , Reply, , , , , , , , Ashley, , says, , , December 23, 2015 at 12:57 pm, , , , Thanks for the kind words, Morgan! I'm going on two years vegan at this point and haven't looked back since making the transition. I think it helped that I was vegetarian before and slowly transitioned. I hope these sweet potato bites win over your family!, , , Reply, , , , , , , , , , Holly Zandbergen, , says, , , December 01, 2016 at 7:45 pm, , , , Hi Ashley,, , I don't usually comment on people's blogs but felt a need to after reading your move in becoming fully vegan. I have recently decided to make the switch from vegetarian to vegan mainly because of sustainability issues. It is a decision that feels exciting and a huge step forward into a more authentic life. However, like you, I am extremely worried about the judgement I will receive from people. Feeling divided from people is the last thing I want but I know I must do what feels right for me and also as you stressed, let other people do what's right for them. I think its an incredibly exciting time that we live in even with the horrors of climate change, it seems to make sense that it can be reversed if we start to change our own eating habits., Keep creating, I have just come across your blog today and have read one recipe, but I'm a follower already as I needed to hear someone speaking from the heart about this issue., , Many thanks, , , Holly, , , Reply, , , , , , , , Andrea, , says, , , May 15, 2017 at 7:40 pm, , , , Are these meant to be served/eaten warm?, , , Reply, , , , , , , , Ashley, , says, , , May 15, 2017 at 8:27 pm, , , , Hi, Andrea! Yes, the sweet potato rounds should be warm when serving, although you could certainly chill them down and serve cold for a summer appetizer. Enjoy!, , , Reply, , , , , , , , , , Michaela, , says, , , June 20, 2017 at 9:11 am, , , , Thanks for this recipe. They look fab! I'm grain free and refined-sugar free and a healthy, happy carnivore, so I'll be adding some bacon bits and sour cream, but I'm always looking for cracker substitutes and these look perfect. Thanks again., , , Reply, , , , , , , , Ashley, , says, , , June 20, 2017 at 9:20 am, , , , You're welcome, Michaela!! And thank you for taking the time to express such kindness and gratitude—it really means so much to me. Enjoy!, , , Reply, , , , , , , , , , Tiffany Hedgecock, , says, , , November 29, 2017 at 6:58 am, , , , Do you leave the skin on the sweet potato?, , , Reply, , , , , , , , Ashley, , says, , , November 29, 2017 at 10:33 am, , , , Yes, I do! It makes them a bit sturdier, but you can peel them if preferred. Enjoy!, , , Reply, , , , , , , , , , Mary Place, , says, , , August 02, 2018 at 6:58 am, , , , Can you serve them chilled?, , , Reply, , , , , , , , Ashley, , says, , , August 02, 2018 at 9:13 am, , , , Hi, Mary! Sure, you can absolutely serve them chilled. I'd just recommend waiting to prepare the avocado and assemble until just before serving to ensure the avocado doesn't brown. Enjoy!, , , Reply, , , , , , , , , , Svala, , says, , , January 29, 2019 at 5:26 pm, , , , Can this be served cold? This looks amazing and, I really want to prepare this for my wedding, but I'll be cooking a lot of food and, I have only one oven, so Ill need to prepare somethings the day before., , , Reply, , , , , , , , Ashley, , says, , , January 30, 2019 at 6:29 pm, , , , Yes, absolutely, Svala! You can serve them cold. I'd just recommend preparing the avocado portion as close to serving time as possible since it browns so quickly., , , Reply, , , , , , , , , , Barry, , says, , , December 17, 2021 at 12:37 pm, , , , Sorry, didn't like this recipe at all.  The smoked paprika was overpowering.  There was way too much lemon juice in the avocado and too little olive oil for dressing the sweet potato.  The combination of sweet potato, avocado and tomato came off a bit bland, lacking any hint of \"wow\"., , , Reply, , , , , , , , Ashley, , says, , , February 04, 2022 at 7:08 pm, , , , I'm so sorry the recipe fell flat, Barry. I appreciate you taking the time to share your feedback and rating!, , , Reply, , , , , , , , , , Vicki, , says, , , December 22, 2021 at 12:44 pm, , , , What would you suggest if you can’t find radish sprouts in your stores?, , , Reply, , , , , , , , Ashley, , says, , , February 04, 2022 at 7:07 pm, , , , Hi, Vicki! You can omit altogether or substitute another type of micro green or sprout., , , Reply, , , , , , , , , , Chelle, , says, , , January 01, 2023 at 7:47 pm, , , , My mother in law made these for our New Year’s party. I’m not vegan but after tasting these had to find her recipe. These are perfection! I can’t wait to bring them to my next event!, , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , If you've made this recipe, please feel free to rate it!, , , , If you've made this recipe, please feel free to rate it!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , Notify me of follow-up comments by email., , , , Δ, , , Primary Sidebar, Meet Ashley, , Psychologist turned plant-passionate recipe writer + cookbook author. Lover of animals, veggies + space documentaries. My name is Ashley, and I’m the writer and photographer behind Blissful Basil., Read More…, , , Join over 100,000 followers!, , Bloglovin, Facebook, Instagram, Pinterest, Twitter, YouTube, , , , , Receive Recipes by Email!, , , , , , , , , Search, , Search, , , , , , , Popular, , From Nashville with Love, Easy Vegan Enchiladas, Dreamy Vegan Tomato Soup, Vegan Golden Butternut Squash Bisque, , Footer, , ↑ back to top, , , , , Keep in Touch, , , , , , , , , , , Sign Up!, for emails and updates + receive a Free eCookbook with our top 9 weeknight dinner recipes., , , , Blissful Basil, , Privacy Policy, About, Spirituality + Psychology, Recipe Index, Contact, Blog, , , , Food + Recipes, , Pasta recipes, Sandwich recipes, Soup recipes, Dessert recipes, Snack recipes, , , , , Copyright © 2010–2022, Blissful Basil, , , , , 48.6K, , shares, , , , , , , , , 476, , , , , , , , , , , , , 48.1K, , , , , , , , , , , , , 48.6K, , shares, , , , , , , , , 476, , , , , , , , , , , , , 48.1K, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,",
        "Vegan cheesy Broccoli Quinoa Bites": "Ingredients: nutritional yeast (for cheesiness), and smoked paprika for a little smokiness and warmth., , Also, there's no need to shape this version into patties. Simply use a cookie scoop to compact the \"dough\" and then drop each mound onto a lined baking sheet. Easy., , And did I mention delicious? These are a new favorite recipe of mine. Like classic broccoli bites only so much better, both in terms of taste and healthfulness. They're packed with fiber, healthy fats, omega-3, and protein., , , , , To make these zesty vegan broccoli bites, you'll start by pre-cooking the quinoa and broccoli. Both of which cook up in about 10 minutes flat., , While the quinoa and broccoli cook, whisk together a bit of flaxseed meal, olive oil, and water. Let the mixture stand for 10 minutes, or until it thickens. This will serve as an egg-like binder to hold the bites together., , Once the quinoa and broccoli are ready, add them to the flaxseed mixture along with a bit of almond flour (or meal), nutritional yeast, lemon juice, smoked paprika, salt, garlic powder, and black pepper., , , Give everything a good stir until it looks like this..., , , The \"dough\" will be quite damp, and a cookie scoop or small ice cream scoop is a necessity for this reason., , Use a cookie scoop to gather and compress 1 ½-tablespoon mounds of the dough, and then drop each on a lined baking pan., , , Once you've formed the dough into mounds, transfer the baking pan to the oven and bake the bites, untouched, for about 25 minutes., , The bottoms should be deep golden brown and crisp and the tops should be a rich golden color., , , While the broccoli bites bake, whip up a super simple sriracha aioli by whisking together a bit of vegan mayonnaise and sriracha (or chili garlic sauce—my personal preference)., , Serve the bites warm from the oven with the aioli., , , 📖 Recipe, , , , , Print, , Pin, , 5, from, 9, votes, , , Vegan Cheesy Broccoli Quinoa Bites with Sriracha Aioli, , , These vegan cheesy broccoli quinoa bites with sriracha aioli are hearty, flavorful, and totally snack-worthy. They make a crowd-pleasing appetizer and are also a hit with little ones, too (just skip the aioli if it's too spicy)., , , , Course, Appetizer, Snack, , Cuisine, Gluten-Free, Grain-Free, plant-based, Vegan, , , , Prep Time, 15, minutes, , minutes, , Cook Time, 30, minutes, , minutes, , Total Time, 45, minutes, , minutes, , , , Servings, 30, , bites, , , Author, Ashley, , Cheesy Broccoli Quinoa Bites, 1, , cup, , quinoa, 2, , cups, , filtered water, divided, 2, , cups, , frozen broccoli florets, 3, , tablespoons, , flaxseed meal, 2, , tablespoons, , olive oil, ½, , cup, , almond meal or almond flour*, ¼, , cup, , nutritional yeast flakes, 1, , tablespoon, , fresh lemon juice, 1, , teaspoon, , smoked paprika, 1 ¼ to 1 ½, , teaspoons, , sea salt, to taste, ½, , teaspoon, , garlic powder, Freshly ground black pepper, , to taste, Sriracha Aioli, ⅓, , cup, , vegan mayonnaise, 2, , tablespoons, , Sriracha or chile garlic sauce or to taste, , substituted more water for the oil, easy to make and so delicious. I'm a faithful follower and will continue!, , , Reply, , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , If you've made this recipe, please feel free to rate it!, , , , If you've made this recipe, please feel free to rate it!, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , Notify me of follow-up comments by email., , , , Δ, , , Primary Sidebar, Meet Ashley, , Psychologist turned plant-passionate recipe writer + cookbook author. Lover of animals, veggies + space documentaries. My name is Ashley, and I’m the writer and photographer behind Blissful Basil., Read More…, , , Join over 100,000 followers!, , Bloglovin, Facebook, Instagram, Pinterest, Twitter, YouTube, , , , , Receive Recipes by Email!, , , , , , , , , Search, , Search, , , , , , , Popular, , Cinnamon Popcorn Power Snack Mix, Easy Vegan Apple Cake, Vegan Crispy Sweet Potato Tacos with Avocado Cream, 46 Produce-Packed Vegan Summer Recipes, , Footer, , ↑ back to top, , , , , Keep in Touch, , , , , , , , , , , Sign Up!, for emails and updates + receive a Free eCookbook with our top 9 weeknight dinner recipes., , , , Blissful Basil, , Privacy Policy, About, Spirituality + Psychology, Recipe Index, Contact, Blog, , , , Food + Recipes, , Pasta recipes, Sandwich recipes, Soup recipes, Dessert recipes, Snack recipes, , , , , Copyright © 2010–2022, Blissful Basil, , , , , 9.9K, , shares, , , , , , , , , 37, , , , , , , , , , , , , 9.8K, , , , , , , , , , , , , 9.9K, , shares, , , , , , , , , 37, , , , , , , , , , , , , 9.8K, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Instructions: For the Cheesy Broccoli Quinoa Bites, Preheat the oven to 400F. Line a large baking pan with parchment paper., Thoroughly rinse the quinoa in a fine-mesh sieve or colander. Then, bring 1 ¾ cups of the water to a boil in a medium saucepan. Add the quinoa, return to a boil, and cook over medium heat for 10 to 12 minutes, uncovered, or until the quinoa has absorbed most of the water, stirring occasionally. Remove from the heat, fluff with a fork, cover, and let stand for 5 minutes., Steam or cook the broccoli until tender. Strain off any excess water and finely chop. Set aside., While the quinoa and broccoli cook, in a large mixing bowl, whisk together the remaining ¼ cup filtered water, the flaxseed meal, and the olive oil. Let stand for 10 minutes to thicken., Transfer the cooked quinoa to the mixing bowl with the flaxseed mixture. Stir in the broccoli, almond meal, nutritional yeast, lemon juice, paprika, salt, garlic powder, and black pepper until incorporated., Use a 1 ½-tablespoon cookie scoop to scoop out and compact mounds of the quinoa mixture. You want to really compress and compact them into the scoop. Drop each mound onto the baking tray. You should have about 30 mounds., Bake the patties for 24 to 26 minutes, or until deep golden brown and crisp on the bottoms and golden on top., For the Sriracha Aioli, In a small bowl, whisk together the mayonnaise and Sriracha until smooth. Chill until ready to serve., To Serve, Serve the bites warm from the oven alongside the aioli., , , Notes, *No nuts? No Problem. To make this recipe nut-free, substitute raw sunflower meal for the almond meal. To make your own, simply add a cup or two of raw sunflower seeds to a food processor, and process until ground into a fine flour., , , Related Posts, Vegan Smoked Almond Cheddar from This Cheese is Nuts! + A Giveaway!, Vegan Peanut Butter Cup Eggs, Vegan Cream of Broccoli Soup, Thai Quinoa Bowl, Vegan Game Day Nachos, Baked Vegan Quinoa Hash Browns, , More Recipes, From Nashville with Love, Easy Vegan Enchiladas, Dreamy Vegan Tomato Soup, Vegan Golden Butternut Squash Bisque, , , , Stay in Touch, , Facebook, Instagram, Pinterest, Snapchat, Twitter, YouTube, , Reader Interactions, Comments, , , , , , Naïby, , says, , , July 21, 2018 at 3:06 pm, , , , Wow! These little bits are so cute 😱. I love the golden colors. They look like they have been fried but no! Such a healthier alternative. I’m exited to try these!, , , Reply, , , , , , , , Ashley, , says, , , July 29, 2018 at 5:19 pm, , , , Thanks, Naïby! Hope you enjoy them! :), , , Reply, , , , , , , , , , Celeste Jackson, , says, , , July 23, 2018 at 10:25 am, , , , These look delicious and packed with flavor in a small bite! I can't wait to try them., , , Reply, , , , , , , , Ashley, , says, , , July 29, 2018 at 5:19 pm, , , , Thank you! Hope you enjoy them! :), , , Reply, , , , , , , , , , Maria, , says, , , July 28, 2018 at 4:20 am, , , , These must be perfect as a tasty and easy snack! The photographs are gorgeous too. Thank you for sharing :), , , Reply, , , , , , , , Ashley, , says, , , July 29, 2018 at 5:03 pm, , , , Thanks, Maria! :), , , Reply, , , , , , , , , , Brittany, , says, , , August 13, 2018 at 12:40 pm, , , , Have you tried freezing these by chance?    Thanks!, , , Reply, , , , , , , , Ashley, , says, , , August 14, 2018 at 1:54 pm, , , , Hi, Brittany! I haven't, but I have a feeling they'd freeze well and keep for up to a month when frozen., , , Reply, , , , , , , , , , Maiah Miller, , says, , , August 31, 2018 at 11:27 am, , , , Not sure if I missed something, but when is the yeast added? Thanks!!, , , Reply, , , , , , , , Ashley, , says, , , August 31, 2018 at 12:05 pm, , , , Yikes, good catch. Just edited to correct (it goes in along with the almond meal). Enjoy!, , , Reply, , , , , , , , , , Karen, , says, , , October 13, 2018 at 12:14 pm, , , , This is my family's favorite healthy recipe. They are so good that my entire family craves these delicious bites. We have made them every other week since the recipe was posted. To speed the preparation, I form patties using a 1/4 cup measuring cup. To make them completely healthy, we skip the mayo and just dip them in sriracha or chili-garlic sauce. Thanks Ashley!, , , Reply, , , , , , , , Ashley, , says, , , October 15, 2018 at 10:06 am, , , , Karen, this feedback makes me smile! So happy to hear you and your family are enjoying the recipe. Thanks for taking the time to come back and share your thoughts and tips, too. Very much appreciated! :), , , Reply, , , , , , , , , , Rowa, , says, , , November 26, 2018 at 3:08 am, , , , hii, thats looks yummy, but can i ask you how many calories in that ?, , , Reply, , , , , , , , Ashley, , says, , , November 28, 2018 at 5:01 pm, , , , Hi, Rowa! I don't calculate calories for my recipes (please see my FAQ page for why), but there are lots of great calculators online. Enjoy!, , , Reply, , , , , , , , , , Cathy Cheney, , says, , , February 03, 2019 at 1:45 pm, , , , When do you add the snaked paprika?, , , Reply, , , , , , , , Ashley, , says, , , February 04, 2019 at 1:43 pm, , , , Ahh, good catch, Cathy! Just updated the post, but it should be added along with the lemon juice, salt, etc., , , Reply, , , , , , , , , , Elsie, , says, , , February 22, 2019 at 9:38 am, , , , Hello...delicious recipe! Do you think it would work to freeze balls before baking?, , , Reply, , , , , , , , Ashley, , says, , , February 22, 2019 at 11:15 am, , , , Thanks, Elsie! You probably can get away with freezing them before baking. You'll likely just need to bake them a bit longer!, , , Reply, , , , , , , , , , Melanie Burka, , says, , , February 27, 2019 at 5:29 pm, , , , These are amazing! My son has just started his vegetarian journey :)  And being a fully supportive Momma Cat, I am on the internet scouring for yummy and quick prepped meals/snacks! Hes not Vegan, but these were a huge hit! Even my husband said they were yummy...Thanks for the meal idea and I've bookmarked your blog...much luv :), , , Reply, , , , , , , , Ashley, , says, , , February 28, 2019 at 9:38 am, , , , Melanie, so happy to know you and your family are enjoying this recipe! Your son is lucky to have a wonderful, supportive momma like you. :) Thanks for taking the time to come back and share your thoughts and rating—means so much to me and is helpful for others wanting to make the recipe, too., , , Reply, , , , , , , , , , Ratna, , says, , , October 05, 2019 at 1:44 am, , , , This recipe is an absolute keeper! It's supee yummy. I made it for my toddler, and he absolutely loved it! I used both little millet (found in Indian grocery stores) and quinoa. and coarsely ground both almond and pistachio. The rest of the recipe, I followed to the root., , Thanks so much!, , , Reply, , , , , , , , Ashley, , says, , , October 07, 2019 at 9:02 am, , , , Happy to hear you and your little one enjoyed the recipe, Ratna! Thanks for taking the time to come back and share your thoughts and adjustments—means so much to me and is helpful for others, too., , , Reply, , , , , , , , , , Janeen, , says, , , November 16, 2019 at 4:18 pm, , , , These are DELICIOUS!!! I got adventurous and took a handful of Aldi’s Mozzarella and chopped it up really fine and incorporated into the mix for a little extra cheesy kick..., , Thank you for sharing this recipe...this is going to be my new go to party/pot luck recipe!!, , , Reply, , , , , , , , Ashley, , says, , , November 17, 2019 at 11:13 am, , , , Happy to hear you enjoyed the recipe, Janeen! Thanks for taking time out of your weekend to come back and share your thoughts and rating. Means a lot to me and is helpful for others considering making the recipe, too. :), , , Reply, , , , , , , , , , Robin Mercado, , says, , , February 06, 2020 at 3:46 pm, , , , It it possible to use any other flour instead of almond flour? It’s pretty expensive and I’d love to make this recipe more affordable!, , , Reply, , , , , , , , Ashley, , says, , , February 06, 2020 at 4:08 pm, , , , Hi, Robin! Raw sunflower seed flour is easy to make and much more affordable. Simply process a few cups of raw, unsalted sunflower seeds in a food processor until ground into a flour-like consistency. Hope this helps and enjoy!, , , Reply, , , , , , , , , , Jennifer Farrington, , says, , , April 14, 2020 at 10:10 am, , , , I made these Sunday for Easter and my whole family devoured them!  Even my kids, who claim to not like quinoa and are often suspicious of my vegan food, loved them., , The only changes to the recipe I made where to use fresh broccoli that I steamed., , Thank you so much Ashley! I’ll definitely be making these for holidays and parties in the future., , , Reply, , , , , , , , Ashley, , says, , , April 14, 2020 at 12:36 pm, , , , Very happy to hear you and your family enjoyed these, Jennifer! It's especially heartwarming when the little skeptical ones are swayed into appreciation. :) Thanks for taking time out of your day to share your feedback and rating. Means a lot to me and is helpful for others considering making the recipe, too., , , Reply, , , , , , , , , , Kristen, , says, , , June 11, 2020 at 2:25 pm, , , , These look so good! Do you think they would be ok cooked and stored in the fridge for an event the next day?, , , Reply, , , , , , , , Ashley, , says, , , June 12, 2020 at 8:54 am, , , , Hi, Kristen! Yes, you can cook and refrigerate them ahead of your event. I'd recommend reheating in the oven at the same temp for maybe 6 to 8 minutes to warm through and crisp back up. Hope this helps and enjoy!, , , Reply, , , , , , , , , , Charisse, , says, , , July 17, 2020 at 10:46 am, , , , Hi I’m planning to make this recipe  but wondering if I can replace the flour with chickpea  flour. Thanks, , , Reply, , , , , , , , Ashley, , says, , , July 17, 2020 at 3:46 pm, , , , Hi, Charisse! The flavor of chickpea flour is quite a bit stronger and earthier than almond flour and the texture is usually a bit grittier, so it's hard for me to recommend without having tested it myself. If you decide to try it and have time to report back, I'd love to know how it goes. If you're looking for a nut-free alternative, sunflower seed flour will work (process raw sunflower seeds in a food processor until ground into a coarse flour texture). Hope this helps!, , , Reply, , , , , , , , , , Rebecca, , says, , , October 01, 2020 at 11:46 am, , , , Help me please! I made these and they tasted amazing but they did not hold together. They just crumbled in my, Hand when i picked them up. I followed the recipe exactly and used everything you said. Where did I go wrong?  Thank you!!, , , Reply, , , , , , , , Ashley, , says, , , October 02, 2020 at 6:10 am, , , , Hi, Rebecca! Hmm, that is very strange and also tough to problem solve without having been there with you. My best guess would be that the flaxseed meal was either ground too coarse or it was old and not gelatinous enough. It's also possible that the bites weren't packed tight enough before baking. I'm sorry you had that experience—I haven't had anyone report this problem before., , , Reply, , , , , , , , , , Sara, , says, , , November 13, 2020 at 10:31 am, , , , Hi would these work without yeast? Could I substitute with something? They look delicious but unfortunately I’ve had bad reactions to nutritional yeast., , , Reply, , , , , , , , Ashley, , says, , , November 24, 2020 at 9:56 am, , , , Hi, Sara! Nutritional yeast is a really tricky one to substitute in general but especially in these as it's what gives them their cheesy flavor. If you're ok with making regular broccoli bites instead, you can try omitting it altogether. You may need to add a bit more almond meal if they dough is too soft/sticky to form, but other than that it should be straightforward. Hope this helps!, , , Reply, , , , , , , , , , Ashley Kelker, , says, , , December 24, 2021 at 2:24 pm, , , , Delicious! Very easy to make, great to have around for a quick snack!, , , Reply, , , , , , , , Ashley, , says, , , February 04, 2022 at 7:07 pm, , , , Happy to hear you're enjoying the recipe, Ashley!, , , Reply, , , , , , , , , , KP, , says, , , December 26, 2022 at 2:41 pm, , , , These look amazing, can't wait to try them! What other dios could I use? Siracha is not an option. Would they be good with ranch dressing?, , , Reply, , , , , , , , Ashley, , says, , , February 24, 2023 at 9:39 am, , , , Yes, these would be great with ranch as well!, , , Reply, , , , , , , , KP, , says, , , February 25, 2023 at 9:01 am, , , , I made these for Christmas, and the family loved them! The ranch was a hit, it was great to have a couple options. Thank you for the wonderful recipe, Iwill definitely be making this one again!, , , Reply, , , , , , , , Ashley, , says, , , May 15, 2023 at 8:41 am, , , , Happy to hear you and your family enjoyed the recipe, KP! Thanks for taking the time to come back and share your thoughts and rating., , , Reply, , , , , , , , , , , , , , Paula, , says, , , January 06, 2024 at 1:23 pm, , , ",
        "Spicy Cauliflower Bites": "Ingredients: since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., SPICY CAULIFLOWER BITES, O, SERVES: 3 (1 cup each)   Prep Time: 20 min.   Cooking Time: 35 min., CONTAINER EQUIVALENTS:, 1, 1, I ALWAYS try to bring a somewhat healthy dish to parties, but I don’t want to be that person who always, brings the vegetable platter. This is a great way to bring something interesting that can be passed off as, not-so-healthy. (Shhh…), 6 cups, , cauliflower florets, , (approx. 1 lb.), ½ tsp., , sea salt (or Himalayan salt), , , divided use, ¼ cup, , hot pepper sauce, 2 Tbsp. + 2 tsp., rice vinegar, 1 tsp., , chili powder, 1 dash, , ground smoked paprika, ¼ tsp., , garlic powder, ¼ tsp., , onion powder, ½ tsp., , pure maple syrup, ½ tsp., , Worcestershire sauce, , , gluten-free, vegan, 1 Tbsp., , organic grass-fed butter, 1½ tsp., , cornstarch (preferably GMO-, , free) + 1½ tsp. water, , (combine to make a slurry), SPECIAL EQUIPMENT:, Nonstick cooking spray, 1.\t\t Preheat oven to 350° F., 2.\t\t \tLightly coat large baking sheet with spray., 3.\t\t \tPlace cauliflower on baking sheet. Coat cauliflower lightly with spray. Season, evenly with ¼ tsp. salt., 4.\t\t Bake for 20 minutes, or until tender-crisp., 5.\t\t \tWhile cauliflower is baking, combine hot sauce and vinegar in medium, saucepan., 6.\t\t Add chili powder, paprika, garlic powder, onion powder, maple syrup, , Worcestershire sauce, butter, and remaining ¼ tsp. salt; whisk to blend., 7.\t\t Heat hot sauce mixture over medium-high heat; cook, stirring frequently, for, 5 minutes, or until thickened. Set aside., 8.\t\t Add cornstarch slurry, whisk until combined., 9.\t\t Pour hot sauce mixture over baked cauliflower (on baking sheet); mix well., 10. \tReturn cauliflower to oven. Bake for 5 minutes., 11. \tRemove from oven, transfer cauliflower to plate lined with paper towels to, drain., 12. \tServe 1 cup hot cauliflower mixture with 1 Tbsp. Lemon Garlic Sauce for, each serving., SERVING SUGGESTION:, •\t Pair with sliced celery for a traditional appetizer. Make sure you add your, container!, •\t Add 1 Tbsp. Lemon Garlic Sauce (see separate recipe for Lemon Garlic, Sauce) to each serving. Make sure you count 1⁄2, container., NUTRITIONAL INFORMATION (per serving): Calories: 96   Total Fat: 2   Saturated Fat: 1   Cholesterol: 5   Sodium: 599   Carbohydrates: 12   Fiber: 2   Sugars: 5, Protein: 2, RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., *\u0007Consuming raw or undercooked meats, poultry, seafood, shellfish, eggs, or unpasteurized milk may increase your risk of foodborne illness., Recipes containing the GF  icon are designed to be Gluten-Free and contain no gluten. If you are following a gluten-free diet, since foods, are often processed at facilities that also process wheat and other grains., Recipes containing the PF  icon are designed to be Paleo-Friendly and contain no grains or legumes, and only paleo-appropriate starchy vegetables and dairy. Please read product labels for each ingredient to ensure, this to be the case., Recipes containing the VG icon are designed to be Lacto-Ovo vegetarian and contain no poultry, meat, or fish. Please read product labels for each ingredient to ensure this to be the case., GF, VG, PF, LEMON GARLIC SAUCE, O, SERVES: 5  (2 Tbsp. each)    Prep Time: 10 min.    Cooking Time: None, CONTAINER EQUIVALENTS (per serving):, 1, 2 Tbsp., fresh lemon juice, 1, large egg yolk, pasteurized*, 2 cloves, garlic, crushed, 1 Tbsp., Dijon mustard, gluten-free, 1 Tbsp., whole-grain mustard, gluten-free, , Sea salt (or Himalayan salt), and ground black pepper, (to taste; optional), 3 Tbsp., extra-virgin olive oil, 1. \t Combine lemon juice, egg yolk, garlic, and mustards in a small bowl;, mix well., 2. \t Season with salt and pepper, if desired., 3. \t Slowly add oil, whisking continuously until well blended., NUTRITIONAL INFORMATION (per serving): Calories: 92    Total Fat: 9 g    Saturated Fat: 1 g    Cholesterol: 37 mg    Sodium: 203 mg    Carbohydrates: 2 g, Fiber: 0 g    Sugars: 0 g    Protein: 1 g, OThis recipe works well with 80 Day Obsession. Make sure it works with your container counts., RECIPES, © 2018 Beachbody, LLC. All rights reserved. Beachbody, LLC is the owner of the Fixate, Beachbody, and Team Beachbody trademarks, and all related designs, trademarks, copyrights, and other intellectual property., Instructions: ",
        "Nashville Vegan Cauliflower Bites": "Ingredients: US Customary, Metric, , 1x, 2x, 3x, ▢, 1, , medium head of cauliflower, , , chopped into florets, Batter:, ▢, 1/3, , cup, , non dairy milk, , , such as almond or soy milk, ▢, 1, , tsp, , hot sauce, ▢, 1/2, , tsp, , garlic powder, ▢, 1/2, , tsp, , onion powder, ▢, 1/2, , tsp, , salt, ▢, 1/4, , cup, , flour, , , (all purpose, or use rice flour for gluten-free), ▢, 3, , tbsp, , starch, , , (I use cornstarch, arrowroot or potato starch works too), ▢, 1/2, , tsp, , baking powder, ▢, 1, , tsp, , oil, Nashville style hot chicken sauce:, ▢, 1, , tbsp, , oil or melted vegan butter, ▢, 1/2, , tsp, , cayenne, , , , use 1/4 tsp for less heat, ▢, 1, , tsp, , black pepper, , , , use 1//2 tsp for less heat, ▢, 1, , tsp, , sugar, , , or maple syrup, ▢, 1, , tsp, , sweet paprika, , , , use more if omitting cayenne, ▢, 2, , tbsp, , hot sauce, ▢, 1/2, , tsp, , garlic powder, ▢, 1/2, , tsp, , poultry seasoning, , , ( or use sage + onion powder), ▢, 1, , tbsp, , vinegar, ▢, 1, , tbsp, , water, , Cook Mode, Prevent your screen from going dark, , so work quickly., Add cauliflower florets and toss well to coat. It will take a minute for the thick batter to coat the florets well. Some uncoated cauliflower edges are ok. Drop on parchment lined baking dish. Spray oil on top. (You can also sprinkle 2-3 tbsp breadcrumbs on the florets in the dish for extra crispyness)., Bake at 425 deg F for 25 mins (35 mins if serving the bites with hot sauce on the side) . In the meantime, make the nashville hot sauce mixture in large bowl. You can double this sauce easily for larger cauliflower., Remove the dish from the oven and cool for 5 mins. Add the baked cauliflower to the sauce bowl and, gently, toss to coat., Drop back into the baking dish and bake for 15 mins or longer at 400 deg F.  Serve with cooling dips such as, vegan ranch, and some pickles., , Video, , Notes, Reduce the hea, t of the sauce by reducing the cayenne, black pepper and hot sauce. Add more sweet paprika instead, add more tang(vinegar), some more oil or aquafaba for volume., , Omit Oil:, Reduce or omit oil in the sauce by using aquafaba instead. Omit the oil from the batter. If possible, use a light spray for crispyness., , , , Nutrition is for 1 of 4 serves, does not include dips., , Nutrition, Calories:, 144, kcal, , , Carbohydrates:, 21, g, , , Protein:, 5, g, , , Fat:, 5, g, , , Sodium:, 544, mg, , , Potassium:, 513, mg, , , Fiber:, 3, g, , , Sugar:, 4, g, , , Vitamin A:, 340, IU, , , Vitamin C:, 75, mg, , , Calcium:, 84, mg, , , Iron:, 1.2, mg, Nutrition information is automatically calculated, so should only be used as an approximation., , , , , , , , , Did you make this recipe? Rate and comment below!, , , , Share:, Pin, Facebook, Tweet, Yummly, Email, , About Richa, Hi, I'm Richa! I create flavorful plant based recipes that are inspired by my Indian upbringing, including many gluten-free, soy-free, and oil-free options., , Read More, , , , , , , You May Also Like, , Gameday Recipes, GO, Gluten Free Option, Vegan Mozzarella Sticks with Cashew Mozzarella – Baked or Fried, Gameday Recipes, GO, Gluten Free Option, NO, Nut-Free Option, SO, Soy Free Option, Cheesy Pull-Apart Mushroom Sliders, South Indian curries, GF, Gluten Free, NF, Nut-Free, SO, Soy Free Option, Tofu Kondattam (South Indian Spicy Crispy Tofu), Holiday Recipes, GO, Gluten Free Option, NO, Nut-Free Option, SO, Soy Free Option, Creamy Mushroom Puffs, , , , 4.97 from 26 votes (, 2 ratings without comment, ), , , , Leave a comment, Cancel reply, If you Love the Recipe, Please consider rating it using stars in comments! It helps readers and helps more people find the recipe online and I love hearing from you all!, Your email address will not be published. Required fields are marked *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , This site uses Akismet to reduce spam., Learn how your comment data is processed., 71 Comments, , , , , , Anita, , says:, , , , February 9, 2025 at 7:31 pm, , , , , I am from Nashville and can’t have Nashville Hot Chicken bc I’m allergic to the breading. How sad is that? Until TODAY! Thank you, Richa, for another great recipe. Oh, my goodness, this is SO good. New favorite., , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , February 9, 2025 at 11:21 pm, , , , , Thank you for taking the time to comment Anita!! So happy to hear!, , , Reply, , , , , , , , , , Dany, , says:, , , , February 3, 2025 at 7:50 am, , , , , They are very delicious!, I make it once a week,try it!, , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , February 4, 2025 at 10:05 am, , , , , Yay!!, , , Reply, , , , , , , , , , Heather, , says:, , , , January 11, 2025 at 3:01 pm, , , , , Absolutely delicious! I would say the batter and sauce are literally just enough so if you have a large head of cauliflower you might want to 1.5x the recipe. Otherwise absolutely perfection., , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , January 14, 2025 at 8:50 am, , , , , Thanks for the tip!, , , Reply, , , , , , , , , , Krista, , says:, , , , August 23, 2024 at 5:58 pm, , , , , This was wonderful! I added them to a pita wrap with hummus, tabouli, and cucumbers and it was so good! Glad to have leftovers so I can have another tomorrow. Thanks for the recipe!, , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , August 24, 2024 at 9:48 am, , , , , Sounds delicious!, , , Reply, , , , , , , , , , Angela, , says:, , , , March 26, 2023 at 3:32 am, , , , , Very good, , , Reply, , , , , , , , Vegan Richa Support, , says:, , , , March 27, 2023 at 6:39 pm, , , , , yay!, , , Reply, , , , , , Comment navigation, Older Comments, , , , Hi, I'm Richa!, , I create flavorful plant based recipes that are inspired by my Indian upbringing, including many gluten-free, soy-free, and oil-free options., , , , more about me, , , , , , , , , , , Amazon, //, Barnes & Noble, //, BAM!, //, Chapter Indigo, //, International, , , Amazon, //, Barnes & Noble, //, BAM!, //, Chapter Indigo, //, International, , , Amazon, //, Barnes & Noble, //, BAM!, //, IndieBound, //, International, , , As Seen In, Back to top, Vegan Richa, , , , , Home, , Recipes, , Subscribe, , CookBooks, , Shop, , About, , ©2025 Vegan Richa. All rights reserved., , Privacy Policy, •, Terms, •, Copyright And Disclaimers, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , Instructions: firecracker (see, everyday kitchen book), , or some sriracha bbq., , I like making baked cauliflower in a thick ceramic or stoneware baking dish for even cooking. Baking trays work too, but tend to cook the bottoms and edges of the bites faster., , , , , , Vegan Nashville Hot Cauliflower Wings, , 4.97, from, 26, votes, , By:, Vegan Richa, , Prep:, 5, minutes, , mins, Cook:, 35, minutes, , mins, Total:, 40, minutes, , mins, , Servings:, 4, Course:, Appetizer, Cuisine:, American, Vegan, , , , , , Save, Saved, , , Pin, , Print, , , , Vegan Nashville Hot Cauliflower Bites. These Nashville Style Hot Cauliflower wings are flavorful, hot and Delicious! Serve with vegan ranch or other dips. Add to wraps or bowls. Vegan Nutfree Soyfree Recipe. Glutenfree option, , , , Save this recipe!, Get this sent to your inbox, plus get new recipes from us every week!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , Chop the cauliflower and set aside. Line a baking dish with parchment. Preheat the oven to 425 deg F ( 220 C).",
        "Air fried cauliflower buffalo bites": "Ingredients: , Cauliflower:, Separate a head of cauliflower into florets, or grab some pre-cut florets, about 5 cups., , For the buffalo sauce, , you’ll need butter, olive oil, and hot sauce., , If using the, crunchy breading, , you will need flour, seasoning salt, garlic powder, and dried parsley., , How To Make Air Fryer Buffalo Cauliflower, , Prep the cauliflower, . Start with cutting up a head of cauliflower into florets and put those in a large, mixing bowl, ., , Prepare the wing sauce, . Next, melt some butter and mix in a good dose of hot sauce into it. I use, Frank’s Red Hot Sauce, . Pour the hot sauce mixture over the cauliflower florets and mix them around., , Make the breading, . Whisk together all-purpose flour or almond flour with seasoning salt, garlic powder, and dried parsley., , Toss the florets with the breading, . Sprinkle the flour mixture over the cauliflower florets and gently stir them around so that all florets are coated., , Cook the cauliflower in the Air Fryer., Air Fry, half, of the cauliflower bites at 350˚F for 15 minutes, shaking the florets a couple of times during the cooking process. If you want them crispier, try cooking for 2 minutes longer., , Or, roast them in the oven., Place prepared cauliflower florets on a foil-lined pan in one single layer and bake them for 15 minutes at 450˚F. Gently stir the cauliflower halfway through cooking., , Serve, . Serve immediately with a side of celery sticks and a creamy dipping sauce like, ranch dressing, or bleu cheese dressing, and more hot sauce., , , Recipe Tips And Variations, , Size Matters:, When cutting your cauliflower into florets, try to keep them about the same size for even cooking., , Spice It Up:, You can easily adjust the spiciness of your buffalo sauce to match your preference. Feel free to add extra hot sauce, cayenne pepper, or even a touch of Sriracha. You could also add onion powder and paprika to the seasoning mix., , Toss, Don’t Drown:, When coating the cauliflower in sauce, make sure every piece gets a bit of flavor, but avoid drenching them. Too much sauce will make the florets mushy and soggy., , Prep Ahead:, You can prepare your cauliflower and sauce ahead of time. Store them separately in the fridge and toss them just before cooking to keep everything fresh. You will need to heat up the hot sauce and give it a good stir before using, , Avoid crowding:, Don’t cram the air fryer basket so to prevent your cauliflower bites from turning soggy. Cook in two batches to ensure adequate airflow around each piece., , Crunch:, If the crunch factor isn’t meeting your expectation, a quick 2-minute re-run in the air fryer should do the trick. Alternatively, a couple of minutes under the broiler works too., , , , Proper Storage, , While cauliflower bites taste best when served immediately, you can refrigerate leftovers in an airtight container for up to 2 days. For longer storage, freeze them for up to 3 months. To freeze, spread the cooled cauliflower florets on a baking sheet and flash freeze until solid, then transfer to a freezer-safe bag or airtight container. Leftovers can be reheated in the oven or air fryer for the best texture., , Frequently Asked Questions, , Do I need to soak the cauliflower in water before air frying?, , Soaking the cauliflower in water before air frying is not necessary., , , Can I use frozen cauliflower instead of fresh?, , Yes, you can use frozen cauliflower to make your air fryer cauliflower bites. For the best texture, thaw the frozen cauliflower first. You can do this by leaving it in the refrigerator overnight or using the defrost option on your microwave., , , , More Cauliflower Recipes, , Cauliflower Tots, , Lemon Paprika Roasted Cauliflower, , Instant Pot Loaded Mashed Cauliflower, , Cauliflower Cheese Soup, , Roasted Cauliflower Steaks, , Pin this now to find it later, Pin It, , , , , , Save, Saved, , Pin, , Print, , , , , 4.75, from, 54, votes, , Air Fryer Buffalo Cauliflower Bites, , by, Katerina | Diethood, , Experience the bold and zesty flavors of Air Fryer Buffalo Cauliflower Bites, a delightful vegetarian alternative to classic buffalo wings., , Prep Time:, 10, minutes, , minutes, Cook Time:, 15, minutes, , minutes, Total Time:, 30, minutes, , minutes, Servings:, 4, , Serves, , , , , 1x, 2x, 3x, ▢, 1, , head, , cauliflower, , , cut into florets (you'll need about 4 to 5 cups), ▢, 2, , tablespoons, , butter,, , , melted, ▢, 1, , tablespoon, , olive oil, ▢, ½, , cup, , Frank's Red Hot Sauce, ▢, ½, , cup, , all-purpose flour, , , or almond flour, ▢, 3, , tablespoons, , dried parsley, ▢, ½, , tablespoon, , garlic powder, ▢, 1, , teaspoon, , Lawry's Seasoning Salt, , Want to save this recipe?, Enter your email below and we’ll send the recipe straight to your inbox!, Please enable JavaScript in your browser to complete this form., Please enable JavaScript in your browser to complete this form., Email, *, Save Recipe, , , , , , , , , Did you make a recipe?, Leave a rating, , , , , , , , , , , , , , , , , , , , , , , 4.75 from 54 votes (, 16 ratings without comment, ), , , , Leave a comment, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating:, , , , Recipe Rating:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , , , Δ, , , 83 Comments, , , , , , Paul, , says:, , , , Apr 1, 2025 at 5:28 PM, , , , , , , , Made these tonight will definitely make them again. I’ll add a bit more buffalo sauce next time. I also did them for about 18 minutes. Tossing every for or five minutes. They came out so crispy and flavourful., , , Reply, , , , , , , , Marcia Brown, , says:, , , , Jun 20, 2024 at 7:54 AM, , , , , , , , I made these last night for dinner and they were so easy, qiuick and delicious!!, , , Reply, , , , Comment navigation, Older Comments, , , , Hi! I’m Katerina!, , I’m so happy you stopped by!, , For me, cooking and eating go beyond just having a meal—they’re treasured opportunities to connect and savor moments with loved ones. I was taught how to cook delicious meals from scratch using simple, , , Read more about me, , , , , , , , , , Reader Favorites, , Tender and Juicy Pork Loin Roast Recipe, Garlic Butter Oven Baked Tilapia, Oven Baked Bone-In Pork Chops, Crack Chicken, Juicy Stove Top Chicken Breasts Recipe, Moo Shu Chicken, As Seen In, Back to top, Diethood, , , , , Course, , , Breakfast, , Lunch, , Dinner, , Desserts, , ,  Instructions: , , Air Fryer, , Instant Pot, , Slow Cooker/Crock Pot, , , , Shop, , About, , Search, , , Home, , •, , Recipe Finder, , •, , Appetizers, Air Fryer Buffalo Cauliflower, by, Katerina, 4.75, from, 54, votes, Aug 28, 2019, Updated Jun 14, 2024, Pin Recipe, Jump to Recipe, Comments, This post may contain affiliate links. Please read our, disclosure policy, ., , , , , Experience the bold and zesty flavors of, Air Fryer Buffalo Cauliflower Bites, , a tasty vegetarian alternative to classic buffalo wings. These bites are not only delicious but also boast the perfect kick of spice. Plus, they’re incredibly easy to make, even in the oven., , , Spice up your kitchen with the vibrant flavors of buffalo cauliflower cooked in the trusty air fryer. If you’re wondering how to make air fryer buffalo cauliflower, you’re in for a treat! Thanks to their delicious similarity to traditional buffalo chicken wings, I’d like to introduce you to these buffalo cauliflower bites, often dubbed, buffalo cauliflower wings, ., , They’re a fantastic alternative to the beloved buffalo essence. Prepared with flour breading and a buttery wing sauce, these cauliflower bites are incredible! They make a great addition to salads or wraps!, , If you’re looking for some classics, though, click over to this creamy, stovetop buffalo chicken dip, . And while you’re here, grab this similar recipe for, sticky sesame cauliflower bites, – it’s a GOOD one., , Why You’ll Enjoy These Buffalo Cauliflower Bites, , Customizable:, Whether you’re catering to a vegan, vegetarian, or keto-friendly, this dish fits the bill. The fact that it can be prepared in the air fryer or baked in the oven only adds to the love., , Versatile:, Each bite offers a crispy, tangy flavor that can be enjoyed as a snack, appetizer, or side dish., , Place cauliflower florets in a large mixing bowl and set aside., Melt butter; stir in olive oil and hot sauce until thoroughly combined., Pour the hot sauce mixture over the cauliflower; mix around until all cauliflower florets are coated., In a separate bowl whisk together almond flour, dried parsley, garlic powder, and seasoning salt., Sprinkle about a handful at a time of almond flour mixture over the cauliflower; gently mix until everything is coated., Transfer half of the prepared cauliflower to the air fryer., Air fry at 350˚F for 15 minutes, shaking a couple times during the cooking process. Cauliflower is done when the florets are a bit browned, but not mushy., Remove cauliflower from the Air Fryer; set aside and keep covered., Repeat the same process with the remaining cauliflower florets., Serve with celery sticks and bleu cheese dressing., Toss the cauliflower florets in the hot sauce mixture and the breading. Arrange the cauliflower florets on a foil-lined pan and bake for 15 minutes at 450˚F. Gently stir the cauliflower halfway through cooking., , , Notes, Florets:, When cutting your cauliflower into florets, try to keep them about the same size for even cooking., , Spice:, You can adjust the seasonings and spices of your buffalo sauce. Feel free to add extra hot sauce, cayenne pepper, or even a touch of Sriracha., , Sauce:, When coating the cauliflower in sauce, make sure every piece gets a bit of flavor, but avoid drenching them. Too much sauce can make the florets soggy., , Prep Ahead:, You can prepare your cauliflower and sauce ahead of time. Store them separately in the fridge and toss them just before cooking to keep everything fresh., , Serving Ideas:, Buffalo cauliflower pairs perfectly with classic dipping sauces like ranch or blue cheese dressing. For a fun twist, try serving it with a yogurt-based dip or hummus., , Place prepared cauliflower florets on a foil-lined pan and bake for 15 minutes at 450˚F. Gently stir the cauliflower halfway through cooking., , Leftovers:, While these cauliflower bites taste best when served immediately, you can still refrigerate the leftovers in an airtight container for up to 2 days. Leftover buffalo cauliflower can be reheated in the oven or, air fryer, to bring back its crispness., , , , Nutrition, Calories:, 204, kcal, |, Carbohydrates:, 12, g, |, Protein:, 6, g, |, Fat:, 17, g, |, Saturated Fat:, 5, g, |, Cholesterol:, 15, mg, |, Sodium:, 1602, mg, |, Potassium:, 482, mg, |, Fiber:, 5, g, |, Sugar:, 3, g, |, Vitamin A:, 204, IU, |, Vitamin C:, 71, mg, |, Calcium:, 78, mg, |, Iron:, 2, mg, , , , Air Fryer, , Instant Pot, , Slow Cooker, , , , About, , , About Me, , Work With Me, , Shop, , , , Connect, , , Instagram, , Pinterest, , Facebook, , Twitter, , Tik Tok, , , , ©2025 Diethood. All rights reserved., , Privacy Policy, •, Accessibility Statement, • Powered by, CultivateWP, ., , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Rate This Recipe, , , , , , , , , Your vote:, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Name *, , , , , Email *, , , , , , Rate and Review Recipe, , , A rating is required, , A name is required, , An email is required, , , , , , , , , , , , , , , , Recipe Ratings without Comment, , , , , , , Something went wrong. Please try again., , , , , ,",
        "Vegan Spinach Balls": "Ingredients: , I came up with this simple recipe that is a delicious appetizer or snack. My Grandma usually makes these for Thanksgiving and Christmas but I think they are a great appetizer all year around. Spinach is in season in the winter and spring months making it especially great when you can buy fresh spinach locally. That being said, you can also makes these using frozen spinach (check notes on the recipe below for how to). However, I find that the spinach ball burst with more color and flavor when using fresh spinach as opposed to frozen., , I do have to mention one more thing about the color. For some reason it reminds me of \"How the Grinch stole Christmas\". I was so tempeted to call these, Grinch Balls, but realized that no person in their right mind would actually want to eat something called a grinch ball. Sadly, I stuck with boring Vegan Spinach Balls but be my guest to call these grinch balls at next year's, Christmas party :), , These spinach balls are really, easy to make, , , , , Once the mixture is nice and thick, scoop out tablespoon sized balls and bake in the oven until they are nice and brown on the bottom., , , , , , , , , , , , , 4.75, from, 4, votes, , Print, , , , Vegan Spinach Balls, , , Delicious and easy to make Vegan Spinach Balls! They're the perfect healthy appetizer for any party or even great as a snack!, , , , , , Course, , Appetizer, Gluten free, Vegan, , , , , , , Prep Time, , 5, , minutes, , , , , Cook Time, , 20, , minutes, , , , , Total Time, , 25, , minutes, , , , , , , Makes, , 20, , , , , , Author, , Vanessa @VeganFamilyRecipes.com, , , , , , , , , 3, , cups, , Spinach, , fresh, washed and dried, 3 ounces or 90g, , , , ½, , cup, , Cashews, , whole and raw, , , , 1, , cup, , Almonds, , whole and raw, , , , 3, , tablespoon, , Olive Oil, , , , ½, , teaspoon, , Salt, , , , 1, , Chia or Flax Egg, , , , , Scoop tablespoon sized balls of the spinach mixture out of the food processor or bowl and place on cookie sheet., , , , Bake in oven for 15-20 minutes until bottoms of the spinach balls have browned., , , , Remove from oven and allow to cool for a minute on a cookie rack. Serve warm., , , , , , , Recipe Notes, , 1) Prepare Flax or Chia eggs by mixing 1 tablespoon of ground Chia or Flax Seeds with 3 tablespoons of water. Allow to sit for 15 minutes until a thick gel forms. This is your egg replacement!2) Spinach balls can be eaten cold as well but taste best when warm and fresh out of the oven. If this is not an option pop them in the microwave for a few seconds to warm up before serving.3) You may use frozen spinach if needed. Allow the spinach to thaw completely and drain it of any excess water before using.4.) If your mixture is too wet to form balls, add more oats or almonds. If your mixture is too dry, add a bit more olive oil or a bit of water., , , , , Looking for another great vegan recipe that uses lots of spinach? Make this yummy, Kale Spinach Smoothie, !, , Otherwise, check out some of my other vegan sides and appetizer recipes!, , Cucumber Hummus, Jalapeno Cilantro Hummus, Creamy Mustard Hummus, Savory Pumpkin Tart, Fresh Tomato Basil Hummus, , More Vegan Appetizer & Sides Recipes, Turmeric Roasted Cauliflower - Quick n' Easy!, Baked Curry Fries - Perfectly Crispy!, Curry Hummus - Creamy & Oil-free, Baked Cajun Fries - Crispy & Spicy!, , , Recipes you might enjoy, , See More Recipes..., , Reader Interactions, Comments, , , , , , Jess, , says, , , December 31, 2014 at 7:28 pm, , , , , , , yum! My mother used to make spinach balls. Can't wait to try!, , , Reply, , , , , , , , Vanessa, , says, , , December 31, 2014 at 11:40 pm, , , , Thanks Jess, Your mother was a smart lady. Spinach balls are the best! Hope you like them!, , , Reply, , , , , , , , , , Karley, , says, , , December 31, 2014 at 11:37 pm, , , , Can I make this recipe without oats?, , , Reply, , , , , , , , Vanessa, , says, , , December 31, 2014 at 11:38 pm, , , , Hi Karley,, You can omit the oats by adding more almonds to dry up the spinach ball mass. I won't be able to tell you the exact amount though. Slowly add more almonds until it begins to thicken. Enjoy!, , , Reply, , , , , , , , , , Maria G., , says, , , January 01, 2015 at 4:10 am, , , , These actually look delicious, even though I have never had spinach balls. Are they kind of like falafels with spinach flavor?, (By the way, I think there is an error in note numer two: Pop them in refrigerator to warm up?), , , Reply, , , , , , , , Vanessa, , says, , , January 01, 2015 at 11:29 am, , , , Thanks Maria, , , Yes, my bad! Thanks for letting me know. Just fixed it. There a little bit like falafel but the flavor is a bit milder. The cashews give it a bit of a cheesy flavor too. I've even used these spinach balls as vegan \"meatballs\" on pasta., , , Reply, , , , , , , , , , Trinity Bourne, , says, , , January 04, 2015 at 1:57 am, , , , , , , What a fantastic idea! These sound really awesome., , , Reply, , , , , , , , Vanessa, , says, , , January 04, 2015 at 2:56 pm, , , , Thanks Trinity :) They are so good. The pictures don't do them justice!, , , Reply, , , , , , , , Trinity Bourne, , says, , , January 04, 2015 at 3:17 pm, , , , , , Reply, , , , , , , , , , , , Greg Murray, , says, , , January 11, 2015 at 5:55 pm, , , , Does the nuts need to be soaked first?, , , Reply, , , , , , , , Vanessa, , says, , , January 11, 2015 at 6:51 pm, , , , Hi Greg, There is no need to soak the nuts. If you think your food processor can't handle so many nuts at once then you can soak them or just make it in batches. Hope this helps and you like them :), , , Reply, , , , , , , , , , Jenny D, , says, , , August 10, 2015 at 2:50 am, , , , Do you know if these can be frozen, either before or after being baked? I would love to make a huge batch and save some for later. Thanks!, , , Reply, , , , , , , , Vanessa Croessmann, , says, , , August 10, 2015 at 12:18 pm, , , , Hi Jenny, I like freezing them before I bake them. Just roll them into balls and then put them in a ziploc bag. When you want to eat them, just let them thaw slighlty and then pop them in the oven. It will take a little bit longer. Just keep a good eye on them in the oven. I think mine took about 30min. Someone else wrote me though once saying they baked them first and the froze them and that that worked out well too. So I guess you can do it either way :), , , Reply, , , , , , , , Jenny D, , says, , , August 10, 2015 at 3:46 pm, , , , That is awesome news! Going to make a huge batch today - I have so much spinach in the garden!, , , Reply, , , , , , , , , , , , Paola, , says, , , September 09, 2015 at 2:06 pm, , , , , , , I'm going to try these - but I'll use home made toasted curried nuts - since  they are baked there is really no difference in using raw ., , , Reply, , , , , , , , Helen, , says, , , October 19, 2015 at 12:47 pm, , , , Hello, This recipe looks great - I was going to use them in a curry, like spinach koftas, have you tried this or do you think from the consistency it would work?, Helen, , , Reply, , , , , , , , Vanessa Croessmann, , says, , , October 22, 2015 at 2:13 pm, , , , Hi Helen, I haven't tried this. I usually just make these an appetizer but have actually put them on spaghetti as a vegan meatball substitute. Let me know if you try it. Would love to hear if they are good in a curry :), , , Reply, , , , , , , , , , Kierstin W, , says, , , December 08, 2015 at 11:29 pm, , , , Just made these as a quick way to use some of the boatload of spinach I didn't want to go to waste this week and WOW! These are soooo good (my only adjustment was adding a bit of nutritional yeast into the mix). They look and taste so fresh, and they're really getting me through studying for finals right now…might have to eat the whole batch myself. Thanks for the recipe!, , , Reply, , , , , , , , Vanessa Croessmann, , says, , , December 10, 2015 at 9:43 am, , , , Hi Kierstin, Adding nutritional yeast to these sounds delicious! These spinach balls are definitely addicting. Last time I made them, I tried hogging them but failed miserably. As soon as my boys know we have spinach balls in the house...they are gone. Good luck on your finals!, , , Reply, , , , , , , , , , Ali, , says, , , January 09, 2016 at 2:03 pm, , , , Just wanted to let you know these are amazing I make them all the time and even my husband loves them and asks me to make them!, , , Reply, , , , , , , , Katherine, , says, , , March 17, 2016 at 9:55 pm, , , , So I have made these twice now, first time I used breadcrumbs and blah did not work for my taste over seasoned. I am not very good at throughly following a recipe,all about experimenting., , Followed this but with just almonds, all we had on hand. But after baked was told needed more. Was bland, edible but bland. So to eat them we mixed sour cream and sambal, not vegan but neither were the family that were eating them. What could I add? because these can be a hit for everyone's lunch box for work here., , , Reply, , , , , , , , Vanessa Croessmann, , says, , , March 19, 2016 at 6:08 pm, , , , Hi Katherine, , , I like experimenting with recipes as well. It's all about the trial, error, and the occasional \"OMG that tastes amazing\" moments. I would definitely give a try with the cashews. They definitely gives these spinach balls more of cheesy and creamy taste. You could also add one or two garlic cloves to the mix and experiment with different seasonings (paprika, cumin, pepper, cayenne pepper, turmeric, etc.)., , , Reply, , , , , , , , David Aldred, , says, , , February 22, 2018 at 4:27 pm, , , , I've finished making some Grinch Balls (hee hee!)  Half of them are in the oven right now; the other half are headed for the freezer.  I've added garlic, dill and thyme to mine … oh, and black pepper.  I would've added nutritional yeast too, but I've already added it to a herby cauliflower and broccoli bake that I've just frozen, and I'll be serving it all for a meal for my mum at the weekend, with some butter beans in tomato sauce., , , Reply, , , , , , , , , , , , Alison, , says, , , May 04, 2016 at 7:08 pm, , , , , , , I made these yesterday to bring to a friend's family for a Shiva call and all I can say is that they were the talk of the Shiva!  Everyone loved them!  Will be making these again!  I made a double-batch and used chia \"eggs\" and left the nuts a little chunky for some crunch.  Yum!!!, , , Reply, , , , , , , , Vanessa Croessmann, , says, , , May 09, 2016 at 9:42 am, , , , Thank so much, Alison! I'm so happy everyone enjoyed them. I love these little vegan spinach balls. Always makes me happy to hear that others like them as much as I do ;), , , Reply, , , , , , , , , , Lucy, , says, , , September 09, 2016 at 7:27 pm, , , , These look delicious!  What can I substitute the cashews and almonds with?  I want to make this a school friendly snack., , , Reply, , , , , , , , Cas Rifkin, , says, , , February 11, 2017 at 4:06 am, , , , I am in the process of making these and made the assumption that oats means oatmeal, but I wonder if it is supposed to be instant oatmeal, steel cut oats, , , Reply, , , , , , , , Vanessa Croessmann, , says, , , February 11, 2017 at 2:38 pm, , , , Hi Cas, I've made these with both steel cut and whole oat and it works perfectly. I usually don't have instant oatmeal at home so I've never tried making it with that. Hope you liked the Spinach Balls :), , , Reply, , , , , , , , , , VeggieTater, , says, , , January 18, 2018 at 11:30 pm, , , , I try to go easy on the nuts  and never use oil since I tend to put on the pounds, so I used besan (chickpea flour) to replace most of the nuts and it still came out great, thanks!, , , Reply, , , , , , , , Vanessa Croessmann, , says, , , January 20, 2018 at 11:52 am, , , , That's great to know that chickpea flour works as a substitute. I'll try that out next time. Thanks so much!, , , Reply, , , , , , , , Leave a Reply, Cancel reply, Your email address will not be published., , Required fields are marked, *, , Recipe Rating, , , , Recipe Rating, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , Comment, *, , Name, *, , , Email, *, , , , Save my name, email, and website in this browser for the next time I comment., , , , , Δ, , , Primary Sidebar, , , , Hi, I'm Vanessa!, Mom of 3, , a financial planner, , recipe developer, photographer, & author of, Awesome Vegan Soups, . I'm here to share with you my take on family food and show you just how delicious plant-based cooking and baking can be., , More about me →, , , In Season, , Easy Roasted Butternut Squash Soup, Creamy Almond Soup, Vegan Mushroom Leek Soup (Healthy & Low Cal), Quick Red Lentil Chili (Protein-Packed!), Vegan Cauliflower Leek Casserole, Vegan Potato Leek Soup w/ Whole Wheat Croutons, Kale Spinach Smoothie, Moroccan Harira Soup, , Trending Recipes, , How to use plant-based milks in baking, Vegan Baking Tips, Benefits of a Vegan Diet, How to go Vegan - The Ulitmate Guide, , , Footer, , , ↑ back to top, , , , About, , , Privacy Policy, , Disclaimer, , Term, s & Conditions, , , Newsletter, , , Sign Up!, for emails and updates, , , , , Articles, , , How to go Vegan, , Benefits of a Vegan Die, t, , Vegan Baking Tips, , Vegan Shopping List, , Vegetarian vs. Vegan, , , , , Food & Recipes, , , Vegan Desserts Recipes, , Vegan Appetizers & Sides, , Vegan Dinner Recipes, , Vegan Breakfast Recipes, , Vegan Cheesecake Recipes, , Vegan Snacks Recipes, , , , , Contact, , , Contact, , VFR Copyright, , FAQ, , Financial Planning, , , Facebook, , Instagram, , Pinterest, , , , As an Amazon Associate, I earn from qualifying purchases., , , , , , Instructions: , , , 1, , small, , Red Onion, , quartered, , , , ½, , cup, , Oats, , , , , , , , , , , Preheat oven to 350F and line a cookie sheet with parchment paper., , , "
    }
}